{
    "title": "Ch1 - Doing the job without getting paid",
    "content": [
        "KEIGHTY:",
        "Hello, everyone! Please always check the pop-up notes for a better reading experience. For those who are new to it, pop-up notes can be seen by clicking the underlined words. Enjoy reading 3VIEWS ٩(๑❛▽❛๑)۶ ",
        "“Hey! Wake up! Stop sleeping!”",
        "An unfamiliar and impatient voice exploded in his ears like a sudden clap of thunder. A strong force shook Shen Kong’s arm roughly, waking him up.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Shen Kong frowned and opened his eyes.",
        "He soon realized that he was sitting in a car, traveling. ",
        "There was a smell of old leather inside the car, with an imperceptible smell of gunpowder smoke mixed in. Some kind of unstable element lingered in the air, as if danger lurked in the darkness, ready to cause trouble. His head rested on the car window, the ice-cold touch of the glass pressing up against his forehead. He felt a dull pain from rubbing against the shaking vehicle.\n\n",
        "At this moment, the rough voice sounded once again, grumbling and swearing mixed up with a strange accent:",
        "“How the hell can you still fall asleep at this time? If this happens again, you won’t get the share you wanted!”",
        "Shen Kong followed the owner’s voice, turned his head, and saw a tall, muscular man sitting in the driver’s seat, his thick knuckles tapping the steering wheel impatiently.\n\n ",
        "He stared out of the dim car window with a gloomy look, an air of bloody ruthlessness and tyranny etched between his brows and eyes.",
        "Shen Kong raised his hand to press his aching forehead. Before he could gather his scattered thoughts, without warning, an emotionless mechanical voice suddenly sounded in his ears:",
        "“Hello, we welcome you in becoming the Rectifying Studio’s 893rd Three Views Rectifier. System No. 032, at your service.”\n\n",
        "Shen Kong eyebrows furrowed: “…What?” ",
        "“The Three Views Rectifying Studio has been looking for qualified candidates to sign mandatory contracts in various low-dimensional worlds. As a Three Views Rectifier, you will enter a parallel world with a novel as the core and strive to change the world’s fate. You will be sent to several major turning points in the life of the task character and change the world’s fate by rectifying the villain’s three views. If the task fails, your temporary contract with the studio will be invalidated, and the studio will no longer provide temporary identities for the rectifier…”",
        "Shen Kong interrupted: “No longer provide temporary identities?”",
        "The system replied: “The rectifier’s mental body will lose its support. As the low-dimensional worlds call it, you will die.”",
        "“Yh.” ",
        "Shen Kong asked calmly:",
        "“Then what reward will I get?”",
        "The system obviously got stuck for a moment, and then answered in a dry mechanical voice:",
        "“You can return to the original world after the task is over.” ",
        "“So the answer is no.”",
        "“…”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The system fell silent.",
        "Shen Kong curled his lips indifferently and did not continue questioning aggressively. He merely leaned back on the back of the chair, closed his eyes, and said slowly: ",
        "“Continue.”",
        "The voice of the system sounded once again: “Our slogan is: to heal distortions with tolerance, melt ice with warmth, and redeem darkness with light. As your intellectual assistant, I will always be available at any time to put forward feasible suggestions for your tasks. If you need me, you can always call me in your mind.”",
        "Shen Kong sorted out the information and almost figured out his unfavorable situation.",
        "He was now kidnapped by some high-dimensional studio to work as a free laborer in a certain novel. If he succeeds, he can go back, but if he fails, he will die. ",
        "Shen Kong yawned sleepily and blinked away the physiological tears seeping out of the corners of his eyes.",
        "——He was a mercenary anyway.",
        "After all, he had been hired to complete tasks before. It was just that, this time, he would do the job without getting paid.",
        "At this moment, the car that was running smoothly suddenly jolted hard. The whole body of the car shook violently, and then it entered a continuous bump. The noise from the collision of the window and the car’s body was deafening. ",
        "The man in the driver’s seat muttered a few curses. Then, seemingly remembering something, he slightly tilted his head and asked loudly in a different language:",
        "“Hey, how’s that kid in the back?”",
        "Someone in the car behind replied in the same language: “At least he’s still skipping and jumping about now.”",
        "A few rude, low laughs rang out in the dim car. ",
        "The ground was uneven, and the car was shaking violently. Shen Kong raised his eyes and looked through the shaky rear-view mirror.",
        "The pale and faint moonlight shone in from the car window. He could vaguely see two tall men hidden in the half-clear shadow of the rear compartment. Between them, a child was lying half-curled up. On the seat, his body was tightly bound with a rope, and his mouth was sealed with black tape. He could only let out thin sobs intermittently.",
        "On that moist little face, a pair of large black and white eyes were filled with tears, looking ahead in horror.",
        "The two people’s gazes met in the shaking rear-view mirror. ",
        "Shen Kong’s eyes paused for a moment, then he calmly withdrew his gaze.",
        "At this moment, an indifferent mechanical voice came through his ears: “Di, the target character has been successfully detected: Han Li. The world’s trajectory is being transmitted——”",
        "Chrysanthemum Garden.",
        "As the voice ended, a sharp, stinging sensation came from his temple. A huge flow of information instantly poured into Shen Kong’s mind.",
        "The world in which this book was set was a very cliché entertainment circle danmei. The gong in the book was a rich young man from a wealthy and influential clan, while the shou was an illegitimate son from a humble background. After entering the entertainment circle in order to make money, he and the gong, who was the president of an entertainment company, unfolded a “you chase, I run” romantic love drama. ",
        "And Han Li, the target of Shen Kong’s task this time, was the absolute villain in this book.",
        "He was the eldest son of the Han family in Beijing. His mother died of illness when he was ten years old. The second wife of the Han family secretly schemed the kidnapping. Although he was eventually rescued, this premeditated accident also led to the deformity of Han Li’s lower body. Soon after, his mother’s family’s properties were embezzled and taken over by the Han family. Han Li, who lost his backing and legs, lost his position as heir and was sent to a remote place. During this period, he was assigned to the same class as the shou, the protagonist of this text. His tenderness and care became the only light in his darkest days.",
        "Ten years later, Han Li came back with great momentum, swiftly taking over the Han family with an absolute iron fist. He used extremely cruel methods as revenge on all of those who harmed him, and the gong’s clan was one of them. But the shou persistently begged for his leniency, and so, in the end, he stopped ruthlessly attacking the gong’s family.",
        "After the foul wind and rain of blood were purged, Han Li began to expand his power, eventually becoming the real leader across the black and white roads. The Han family leaped into becoming a first-class wealthy family, but after that, he began to move forward step by step, becoming extremely stubborn and distrustful. And yet, this ruthless and tyrannical monarch finally died of his own weakness—a betrayal that ended Han Li’s nearly ten years of rule in the underground world. The gong’s family also took this opportunity to wantonly annex and expand, becoming the second largest family after the Han family, with one hand covering the sky. ",
        "But the underworld was not so lucky. After the Han family fell apart, various forces were left uncontrolled. The entire underground world fell into endless chaos and crime. The crime rate remained high for the next ten years.",
        "The system, at this moment, spoke:",
        "“You have been delivered to Han Li’s first turning point in life. Your temporary identity for this task is: Kidnapper B.”"
    ],
    "previous": null,
    "next": "Ch2 - This kid still has some backbone"
}