{
    "title": "Ch19 - Perfect deal",
    "content": [
        "Shen Kong seemed to sense the movement over there as he raised his eyes to look over.",
        "The lights in the room weren’t on. Only the entrance light was on, illuminating the whole room dimly and hazily, with only a scarlet cigarette butt burning brightly in the darkness. Under the cover of night and smoke, his eyes were like stars in a river, with a soul-stirring impact that almost made people feel a slight ache in their hearts. ",
        "As if he were afraid of being stabbed, Han Li couldn’t help but look away.",
        "Shen Kong stood up and walked to the bedside. He raised his hand and touched Han Li’s forehead——the fever was already gone.\n",
        "",
        "He pulled up a chair and sat beside the bed, taking out a box of medicine from his pocket and throwing it into Han Li’s lap. Then he pointed to the glass of water on the bedside with his fingertips holding the cigarette and said concisely: “Drink.”",
        "Han Li lowered his eyes and reached out to unpack the pillbox. He took out two capsules, poured them into his palm, and swallowed them with water. ",
        "Shen Kong lazily put his feet up on the edge of the bed, indifferently smoking a cigarette with his eyes half-downcast, not knowing what he was thinking.\n\n",
        "Suddenly, he asked: “Are there still people bothering you?”",
        "Han Li choked on the water he just drank, coughing twice. He wiped the water stains on his lips with the back of his hand. His mind was racing like lightning, almost instantly thinking of a way to respond.",
        "He didn’t answer. His pitch-black eyes were slightly evasive and his lips were pursed tightly. His fingers rubbed the side of the cup uneasily and then he shook his head hesitantly.\n\n ",
        "His pale face still showed the weakness after illness, which was forbearing and pitiful.",
        "Shen Kong glanced at him, stretched out his hand to put out the cigarette, and commanded lightly:",
        "“If you encounter this kind of thing again, come find me.”\n\n",
        "Han Li’s heart tightened slightly. He lowered his head, fearing that his eyes would reveal his true emotions. ",
        "The palpitations that he had deliberately suppressed and ignored during the crisis suddenly surged.",
        "Bearing down menacingly, it was difficult to resist.",
        "It was as if his heart was soaked by some warm water, or as if his ribs were pierced by a sharp object, the sweet and suffocating pain spreading across his chest.",
        "Le didn’t know what this strange and alarming feeling was. Mrom nowhere, he pust instinctively wanted more. ",
        "Aust like moths were attracted by blahing lights and cold-blooded animals were enticed by warm temperatures, the deeper and darker greed sprouted and grew slowly and silently in his heart, whispering duietly in his ear with a cold hiss over and over again, impatiently urging him to want more.",
        "The education from the Han family about heirs told him——to seize whatever he desires, at any cost, by any means necessary.",
        "But there was a voice in his heart telling him: Don’t be anxious.",
        "Take it easy. ",
        "Han Li raised his eyes to look at Shen Kong, who was sitting at the end of the bed. There was a bit of compelling light in the depths of his pitch-black eyes, but his face was still gentle and harmless: “So we’re friends now, right?”",
        "Shen Kong shrugged nonchalantly: “Sure.”",
        "",
        "Han Li was not very satisfied with this answer. The greed lurking in the darkness in his heart was clamoring for more. He calmly suppressed the thoughts in his heart, slightly moved forward, and leaned closer to Shen Kong. His voice was low and gentle, his curved eyebrows devoid of any hostility: “Then… can I come here to find you anytime in the future?”",
        "Shen Kong exerted a slight force on his feet, shifting his entire weight onto the back two legs of the chair, lazily swaying in mid-air: ",
        "“Up to you.”",
        "As soon as he finished speaking, something seemed to sound suddenly. Loosening the pressure under his feet, the legs of his chair landed on the ground with a “thud”.",
        "Shen Kong turned his head and looked closely at Han Li, who was sitting on the bed. He asked casually: “Do you want to learn self-defense techniques?”",
        "He understood the principle of teaching a man to fish rather than giving him a fish. ",
        "Shen Kong was originally planning to protect Han Li secretly and deal with the villains who bullied and insulted him in the plot, but the system’s previous words woke him up.",
        "This book has automatic rectifying measures, but the rectifier’s time is very limited. If, after he left, the world’s trajectory would rectify the deviations back… it would be a loss outweighing the gain.",
        "As for what the system said about love and patience, Shen Kong simply didn’t take it seriously.",
        "His profession was to help people solve their problems, which was rooted in people’s malicious anger and greed——after all, if love and patience were useful, there would be no people like him in the world. ",
        "From Shen Kong’s point of view, Han Li’s problem was that he was just too easy to bully.",
        "This is a cruel world, and people who are too kind-hearted will be doubly exploited and plundered.",
        "Han Li’s eyes lit up. He forcefully suppressed the corners of his mouth from rising and replied in a normal tone: “Okay, as long as you don’t think it’s troublesome.”",
        "Shen Kong raised the corners of his lips with satisfaction and braced himself on the chair under him again——now the system finally no longer had to nag and complain about him slacking off every day. Look, now they not only became “friends”, they would even spend time getting along with each other. The reformation of his three views was just around the corner! ",
        "Suddenly, he abruptly remembered something, his face turning somewhat ugly.",
        "Shen Kong took a deep breath, turned to look at Han Li lying on the bed, and added:",
        "“——But, I won’t do it for nothing.”",
        "Han Li, upon hearing this, raised his head and looked at him. ",
        "Only to see that the young man, who remained calm despite being surrounded by several people, now had a solemn face. His brows were furrowed as if facing a formidable enemy, and he said slowly and seriously:",
        "“You have to help me with my homework.”",
        "Please visit chrysanthemumgarden (dot) com",
        ".",
        "After making a perfect deal with Han Li, Shen Kong was in a very good mood. Even if he had to get up early the next day, his good mood was not ruined. ",
        "Before being kidnapped by this Three Views Rectifying Studio, Shen Kong honestly didn’t expect that he, an adult man in his thirties, would be reduced to the point where he was forced to do senior high school students’ homework every day.",
        "What makes him even more frustrated is… as a person whose occupational skills are all focused on violence, he really doesn’t know how to do it.",
        "But in order to maintain Cheng Chen’s image as a top student, he couldn’t afford to not submit his assignments every time.",
        "Shen Kong even thought about hiring a few people outside the school to help him with his homework. ",
        "And now, Han Li’s appearance has perfectly solved his life problems, allowing him to regain his identity as an adult man who does not need to do homework.",
        "But he didn’t find any sense of shame in extorting a high school student——the system added.",
        "Shen Kong hummed an off-key tune and leisurely climbed out of bed. He washed up, casually took a sandwich from the refrigerator and stuffed it into his schoolbag, and then walked out the door leisurely.",
        "He entered the classroom just one second before the bell rang. ",
        "But to his surprise, the teacher who should have been conducting morning reading was not in the classroom. The classroom was in complete chaos, with noisy chatter and laughter echoing loudly in the silent corridor. The clamor was almost deafening, with all the students seemingly excited about some news, chattering non-stop.",
        "Shen Kong raised his eyebrows in surprise, pulled out his chair, and sat down.",
        "Just as he leisurely took out the books from his bag, his ears suddenly caught a few words leaked from his deskmate and others while they were chatting excitedly:",
        "“Our class”… “transfer student”… ",
        "Shen Kong’s movements paused slightly.",
        "At this moment, the short, fat Mediterranean class teacher walked in from outside the classroom with a serious look on his face. He banged the lectern hard, stirring up a layer of floating chalk dust: “Quiet! Quiet!”",
        "The noise and laughter in the entire class fell silent, and dozens of pairs of eyes looked straight at the teacher on the podium.",
        "He heard him clear his throat and said in a dragging voice: ",
        "“Ahem… our class has a new student transferred from another school this year. I hope everyone will get along well and welcome him with enthusiasm and kindness!”",
        "Finishing his sentence, he turned to look at the door of the classroom, and the wrinkles on his face broke into a smile:",
        "Please visit chrysanthemumgarden (dot) com",
        "“Everyone, welcome him!”"
    ],
    "previous": "Ch18 - Try your suggestion",
    "next": "Ch20 - Transfer student"
}