{
    "title": "Ch20 - Transfer student",
    "content": [
        "As the teacher’s voice fell, a beautiful young man walked in from the door.",
        "He was not tall; he was very thin, but he still had soft baby fat on his cheeks. His round cat-like eyes retained a hint of innocence, and his light pink lips naturally had a hint of a smile, which made people couldn’t help but have a good impression of him just by looking at him. ",
        "Shen Kong propped up his chin as he gazed at the young man standing on the podium with interest, asking in his mind:",
        "“Is this the protagonist of this book?”\n",
        "",
        "The system’s dull and dry mechanical voice sounded in his mind: “Yes, do you need a briefing on the protagonist-related plot?”",
        "He saw the young man giving a sunny smile to the students in the classroom. His curved eyes seemed to be filled with honey, and even his voice was soft and sweet: ",
        "“Hello, everyone, my name is Ye Jinghuan. I’m a new transfer student. I hope I can get along well with everyone.”\n\n",
        "Shen Kong narrowed his eyes and replied in his mind: “Tell me about it?”",
        "“Ye Jinghuan is the illegitimate son of the Ye family in City A. He moved to this city with his mother at the age of seventeen and transferred to the class where Han Li is. He melted Han Li’s icy heart, who was self-conscious and closed off due to his own disability, with his warmth and sunshine. However, six months later, due to his mother’s accidental death, Ye Jinghuan was taken back to the Ye family. However, due to his status as an illegitimate child, he was despised and ostracized, so he severed ties with the Ye family as soon as he became an adult and was admitted to the Chinese Department of F University. He worked hard to support himself through various part-time jobs. During this time, Ye Jinghuan was discovered by talent scouts due to his outstanding appearance and entered the entertainment industry.”",
        "Shen Kong commented approvingly: “It’s very inspiring.”\n\n ",
        "The Mediterranean teacher on the podium took the lead in applauding with a bright smile on his face. The entire class was also particularly excited due to the appearance of the good-looking transfer student. They applauded while whispering among themselves.",
        "The teacher arranged Ye Jinghuan’s seat in the second to last row by the window, which happened to be in front of Han Li’s desk.",
        "Shen Kong rested his cheek on his palm, turning his head to watch Ye Jinghuan briskly walk to his seat with his backpack and sit down. He narrowed his eyes slightly and asked in his mind: “By the way, do you still remember the tender healing method you told me?”\n\n",
        "The system suddenly became alert: “What bad idea are you up to again?” ",
        "“How can I?” Shen Kong blinked innocently and continued: “I just thought that he could help warm and heal the target character, so I don’t need to use any warmth to melt the ice anymore, right?”",
        "In this way, he can concentrate his energy on training the target character to deal with this cruel world.",
        "Division of labor and cooperation, perfect.",
        "The system endured again and again, but finally couldn’t help but say: “…And you still claim you weren’t slacking off??” ",
        "Te Ainghuan had already introduced himself and walked down from the podium.",
        "The big schoolbag on his back swayed along with his movements and accidentally knocked over the messily stacked books on Shen Kong’s table, causing a few books to fall to the ground with a clatter.",
        "He hastily turned around, apologizing in a low voice while hurriedly picking up the books that had fallen on the floor.",
        "Shen Kong bent down, took the book from his hand, and smiled: “It’s okay.” ",
        "Ye Jinghuan blushed and apologized a few more times in a small voice. Then he stood up, walked quickly to his seat, and sat down.",
        "Shen Kong rested his chin on his hand, his gaze following Ye Jinghuan’s steps, his slightly narrowed eyes inscrutable.",
        "",
        "This insignificant episode did not have the slightest effect on the wave of excitement caused by the transfer student in the class.",
        "Han Li, who was sitting in the last row, remained calm, seemingly unaffected by the noise around him. ",
        "His figure half-tilted to the side, and his slender fingers with clear joints were turning a pen slowly. The dazzling sunlight came in from outside the half-covered curtains, the deep shadows of his eyelashes cast on his pale profile, and his thin lips were pursed into an inhumane line of indifference.",
        "Han Li narrowed his eyes and stared at the slightly arched and thin back of the young man not far away, the slightly hooked corners of his lips, and his gaze fixed on the transfer student.",
        "“Clack.”",
        "The pen in his hand slipped out of his hands, rolled around on the table, and finally stopped between the gaps in the table. ",
        "Han Li lowered his eyes, looking at the pen that was stuck between the narrow gap of the table and the other table, a faint hint of hostility gathering in the depths of his deep and quiet eyes.",
        "The bell for the end of class rang.",
        "Han Li picked up a few exercise booklets that had been placed on his table and stood up. Before he could even take a few steps, he was stopped by a soft voice:",
        "“…Classmate, are you okay?” ",
        "He turned his head and looked in the direction where the sound came from, only to see the transfer student sitting in his seat, staring at him worriedly with a pair of round cat eyes. The sincerity in his eyes were undisguised, and his delicate and beautiful face seemed to glow in the sunlight, as if no matter how reckless his actions were, he could be easily forgiven.",
        "Han Li impatiently frowned and glanced at him coldly. He did not answer and just limped forward.",
        "Ye Jinghuan felt a little bit lost. He rarely experienced being directly ignored by others like this, and he couldn’t help but feel somewhat aggrieved.",
        "The deskmate sitting next to him noticed his strange mood, came over, and asked, “What’s wrong?” ",
        "Ye Jinghuan shook his head uneasily, raised his eyes to look at Han Li’s retreating figure, and subconsciously bit his lip: “Does he… not like me very much?”",
        "His female deskmate, overwhelmed by his expression, quickly shook her head: “No, no, no, how could it be? Han Li is just different. He basically treats everyone this way. He’s not intentionally targeting you, so don’t take it to heart.”",
        "Ye Jinghuan was dumbfounded for a moment: “…Different?”",
        "His deskmate pretended to be mysterious and lowered her voice, saying: “I actually heard what others said. He seems to have a very deep background. He doesn’t come to school often, but his academic performance has never been too bad. I’ve seen many people in the class, even including the teachers, seem a bit afraid of him. He’s quite handsome, and many girls have a crush on him, but not many of them really dare to confess to him. The only pity is his legs…” ",
        "“Legs?” Ye Jinghuan’s curiosity was piqued, prompting him to question closely.",
        "His deskmate shrugged her shoulders and said, “Yeah, he’s lame. I also don’t know the specific reason why. It seems that he has been like that since he was a child.”",
        "",
        "Ye Jinghuan frowned, feeling somewhat guilty.",
        "It turns out he poked someone’s sore spot just now, so… ",
        "It seems like he has to find time to apologize.",
        "——He secretly made up his mind.",
        "Shen Kong was drowsy in his seat. He propped his elbows on the table, stared at the books spread out on the table with half-lidded eyes, and yawned lazily.",
        "At this moment, several neat stacks of exercise booklets were gently pushed in front of his eyes. ",
        "Shen Kong lifted his eyelids and looked to his side.",
        "He saw Han Li standing next to his seat, looking down at him, his fingertips gently pressing on the exercise booklets, and smiling harmlessly:",
        "“Can you check it?”",
        "Shen Kong reached out and flipped through it casually, only to see that the previously blank pages of the exercise booklet had been densely written, even carefully imitating Cheng Chen’s handwriting. ",
        "Surprisingly well-done.",
        "“Can I go to your house to find you after class today?”",
        "Shen Kong yawned sleepily. He narrowed his eyes slightly, closed the exercise booklet, and replied briefly: “Okay.”",
        "Han Li turned around and was about to leave, but before he could take a step, he suddenly thought of something and abruptly stopped. ",
        "He hesitated for a long time and then asked after careful consideration: “By the way… what do you think of the new transfer student?”",
        "Shen Kong was dumbfounded for a moment. He looked up at Han Li, who was standing at his table, and noticed a hint of embarrassment in his expression as he turned away to avoid his gaze.",
        "He sighed emotionally to the system in his mind: “It turns out that the plot’s inertia is really so powerful. Even at first sight, they can attract each other’s attention. It’s amazing.”",
        "The system replied: “The world line indeed has self-restoring and self-correcting functions.” ",
        "Shen Kong thought about it carefully and decided to help the two of them: “He seems pretty good. He should have a good personality.”",
        "Han Li’s slightly tilted face suddenly became gloomy in an instant, then returned to normal before Shen Kong could look over.",
        "",
        "He smiled and lowered his eyes slightly to conceal the hostility and coldness in his eyes that could not be suppressed, replying softly:",
        "“Oh, I see. I understand.” "
    ],
    "previous": "Ch19 - Perfect deal",
    "next": "Ch21 - The same person__"
}