{
    "title": "Ch23 - Nightmare",
    "content": [
        "Han Li received good news shortly after returning home.",
        "There had been progress at the Chengdong Casino. ",
        "Since he hadn’t initially trusted the other party much, he had been cautious in every aspect. While the other side was planting moles in his organization, he was actually not idle either, gradually arranging his own people to infiltrate the casino. Although there wasn’t much room for action, they were able to gather quite a bit of crucial information.",
        "They wouldn’t leave such important things as clear and shadowy account books exposed, so Han Li didn’t hold much hope of finding them directly.\n",
        "",
        "He approached from another angle.",
        "Through his planted agents, he identified the tables that had been tampered with. He also arranged for experienced personnel to blend into the bustling crowds at the casino every day. By discreetly calculating the discrepancies in the tax returns reported annually by the Chengdong Casino, although specific numbers hadn’t been derived yet due to the short implementation time, they could already vaguely see astonishing contrasts. Gathering enough evidence was just a matter of time. ",
        "Han Li set down the thick file report in his hand and raised his hand to press down on the space between his eyebrows.\n\n",
        "A dull pain throbbed in the depths of his forehead, as if some ominous undercurrent was brewing.",
        "Han Li felt somewhat uneasy. He reached for the aspirin he had always prepared, peeled out two tablets, and put them in his mouth. The bitter pills slowly dissolved on his tongue, offering masochistic stimulation to his numbed senses.",
        "The door to the study was lightly knocked twice.\n\n ",
        "Han Li looked up at the door, only to see the door to the study being pushed open.",
        "Uncle Xu stood at the doorway holding a tray, his serious and upright face tinged with concern as he softly asked:",
        "“Young Master, is your head hurting again?”\n\n",
        "Han Li shook his head, tossing the aspirin into a drawer and closing it back: “It’s okay, there’s no need to worry.” ",
        "Uncle Xu stepped inside and placed the tray on the desk.",
        "With his temples graying, he was no longer young, but hadn’t reached the point of old age yet. His posture remained robust and straight.",
        "Uncle Xu was a domestic servant who followed Han Li’s mother into the Han family and remained faithfully by his side even after being expelled from the Han family’s residence. He had transcended the role of a mere housekeeper; to Han Li, he was even closer to a father figure than the Han family’s patriarch who had never fulfilled his obligations.",
        "He was one of the few people in the world who could persuade Han Li. ",
        "Uncle Xu frowned with concern, his deep voice carrying an unmistakable worry: “ You must pay attention to your health and not overexert.”",
        "Having watched Han Li grow up from childhood, and having witnessed with his own eyes how rapidly he matured after the accident, becoming reserved and thoughtful, Uncle Xu knew better than anyone the burden Han Li had borne. However, he understood his place and couldn’t intrude too much. He could only rack his brains and hope that Han Li could enjoy some happiness at this age:",
        "“I heard from the Lin family’s young master that you’ve made friends at school?”",
        "As Uncle Xu spoke, he placed the cups from the tray onto the desk. “If you’d like, you can invite him over at home sometime. After all, it’s rare for me to see you, the young master, with a friend of your own age.” ",
        "Thinking of Jheng Jhen, Lan Oi’s facial ezpression involuntarily softened a bit. Le subconsciously rubbed his palm.",
        "The skin, previously reddened by the cold beer, still seemed to be emitting a damp mist.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Le smiled slightly and looked up at Fncle Wu. “Alright, I’ll ask him when the opportunity arises.”",
        "Uncle Xu felt somewhat relieved as he collected the tray, giving a slight bow to Han Li before turning to leave. ",
        "The door to the study closed gently, leaving only Han Li in the room once again.",
        "He turned to look at the cups Uncle Xu had left on the desk and paused for a moment.",
        "In the transparent glass cup, a milky white liquid gently swayed, shimmering softly in the light and exuding a sweet fragrance of milk.",
        "Han Li squinted slightly. His dark eyes were fixed tightly on the milk on the desk, lost in thought for a moment. ",
        "He couldn’t help but recall the stranger who had saved his life and preserved his leg when he was eight years old—the kidnapper.",
        "—And the undeniable resemblance he shared with Cheng Chen to some extent.",
        "The way they smoked, the way they talked, their expressions, and their similar temperament and gaze.",
        "But on the night he had contact with Cheng Chen, he had his men thoroughly investigate his background. Cheng Chen had no real-life connection to that man. All those unusual traits he exhibited also seemed explainable until today. ",
        "Developed gambling skills from having a gambling addict father, and physical prowess honed from a tough life.",
        "But today, Han Li wasn’t so sure anymore.",
        "Although he wasn’t an expert, Cheng Chen’s displayed fighting skills and combat experience were indeed astonishing. If one were to say that he had human blood on his hands, Han Li wouldn’t be surprised.",
        "Despite the many contradictions and inexplicable aspects, there was absolutely no connection between these two individuals. ",
        "That man should still be in hiding and evading the authorities. Although Han Li had no means to revoke the warrant, over the years, he had arranged for people to secretly monitor any news in this regard. Yet, for eight years, there had been no trace.",
        "Both of them were shrouded in mystery.",
        "Furthermore, Han Li couldn’t even be certain if his memories were accurate after such a long time, or if they were merely some kind of illusion—after being rescued from the kidnapping, he would always see the shadow of that night in passing people or in the trees flashing by outside the window. Whether menacing, brutal, or lazy and dangerous, even though he knew most of those involved were in prison, he couldn’t prevent himself from experiencing such vivid and realistic sensations.",
        "He knew what it was. ",
        "PTSD, also known as post-traumatic stress disorder, was a psychological ailment left behind after people experience extreme and unfavorable situations.",
        "Even though Han Li concealed it well, these symptoms only slowly faded away over the years.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Precisely because he didn’t trust his memory very much, he was even more in a dilemma and hesitant.",
        "Han Li frowned, feeling a faint, nagging pain deep in his skull, the subtle prickling making it difficult for him to focus. ",
        "A feeling of exhaustion, just like a mountain’s roar and a tidal wave, washed over him. His entire body was throbbing with the ache of overexertion, while weariness seeped into his being from the depths of his soul.",
        "Perhaps he should have rested earlier tonight.",
        "He pinched the bridge of his nose, closed the files on the table, and left the study.",
        ". ",
        "After a short silence of just two days, the nightmare returned in a swirl of dust once again.",
        "Like an incurable ailment deeply rooted in Han Li’s mind, it persisted, ingrained and like the shadow following his body.",
        "Han Li knew he was dreaming, but he couldn’t wake up. He was forced to watch vivid scenes unfold before him.",
        "Like a firsthand witness, yet also like a detached observer. ",
        "He saw his young self sitting stiffly in a wheelchair. He was being pushed out of the main entrance of the Han family mansion while he overheard the servants’ hushed discussions:",
        "“…The Han family doesn’t allow a disabled person to be the heir…” “Then what will happen to him?” “He’ll probably be sent to some remote town for care, I heard.” “Poor thing, I heard his grandfather’s family this time…”",
        "“Shh, he’s looking over here.”",
        "The murmurs, soft and insidious, swirled around him. It enveloped him like tangible shadows, burying him deeply. Even if he closed his eyes and blocked his ears, he couldn’t escape those whispered words: ",
        "Poor thing.",
        "Disabled person.",
        "Mom died, the Han family didn’t want him, and his grandfather’s family went bankrupt.",
        "Poor thing, poor thing, poor thing… ",
        "The scenes in the dream intertwined with his real-life experiences, almost making it impossible for Han Li to distinguish between what was real and what was an illusion.",
        "He saw himself become reserved and withdrawn, refusing to mention his own background, immersing himself in loneliness, and rejecting everyone.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Han Li felt an overwhelming anger.",
        "So stupid, so weak, so ignorant. ",
        "He wished he could rush up to his younger, smaller self and give him a hard punch: Your mother’s death had hidden motives! Your kidnapping was orchestrated! Wake up, you self-pitying fool! What you should do now is make all those responsible pay the price, not wallow in self-pity and become a pathetic wretch!",
        "Han Li broke free from the shackles of his nightmare.",
        "Outside the window, the night was deep, and the room was shrouded in a hazy light between dusk and dawn.",
        "He panted heavily, his sweat-soaked pajamas clinging tightly to his back, bringing a strange sensation of cold stickiness. ",
        "Han Li buried his face in his hands, his chest heaving unevenly. He was still dominated by the anger he felt in his dream, making it difficult for him to calm down.",
        "A dull, needle-like burning pain throbbed in his head.",
        "After taking a deep breath, Han Li lifted the quilt and walked into the bathroom.",
        "As the warm water cascaded down from above, he suddenly realized—— ",
        "This dream was different from usual. This time, he didn’t repeatedly see the scene of himself being kidnapped and disabled, but instead saw… what happened next.",
        "Han Li turned off the shower and wiped the water from his face, his dark eyes matching the night outside.",
        "He had a feeling that these dreams he had, perhaps hinted at another possibility.",
        "About… ",
        "What his world would be like if that man from his childhood never appeared."
    ],
    "previous": "Ch22 - Training",
    "next": "Ch24 - Go in, lie down, and take off your clothes"
}