{
    "title": "Ch24 - Go in, lie down, and take off your clothes",
    "content": [
        "“…Han-ge, Han-ge?”",
        "Han Li suddenly came back to his senses. He turned his head to where the voice came from. “Huh?” ",
        "Zhao Yun repeated, “What do you think?”",
        "Han Li furrowed his brow. “What do I think about what?”\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The corner of Zhao Yun’s eye twitched, but he didn’t dare to raise any differing opinions. Instead, he reiterated the progress made in their recent work.",
        "It was regarding the progress at the casino. ",
        "The calculations were proceeding smoothly. Although they hadn’t yet obtained the account book, they had almost accurately estimated the difference between the casino’s profits and its reported income. With the addition of the casino’s informants who had infiltrated PUZZEL, they might not even need to resort to drastic measures to legally bring down this organization, which was inherently riddled with loopholes and greed.\n\n",
        "Han Li absentmindedly tapped the desktop with his fingers. Just as Zhao Yun was worried whether he needed to report again, Han Li suddenly asked:",
        "“What about the east side? Is there any movement?”",
        "Zhao Yun paused for a moment, carefully considering it, then replied, “Hmm… seems like nothing. And according to reports from Ziyu's side, it seems like things are tightening over there?”\n\n ",
        "Han Li frowned.",
        "He wasn’t too concerned about Wang Ruicheng’s side. That man had shortsightedness and was rather dull-witted. A little maneuvering would be enough to bring him down. However, his casino had stood tall in the local area for ten years, which clearly had little to do with Wang Ruicheng’s management skills but rather owed to his backers.",
        "But considering the extent of Han Li’s influence, it was difficult for them to reach beyond the province——\n\n",
        "Especially under the premise that Han Li had intentionally avoided the entire city A to steer clear of the Han family’s influence. ",
        "Ever since they acted recklessly at PUZZEL that day, they seemed to have gone silent and never showed up again.",
        "For some reason… Han Li always had a vague premonition in his heart.",
        "Zhao Yun tentatively called out to him, “Han-ge?”",
        "Han Li raised his eyes, the depths of his gaze flickering with a faint gleam, his voice deep, “Proceed according to plan and bring it down.” ",
        "He hoped that this relentless pressure would force the newly-entered players to reveal some flaws.",
        "Zhao Yun nodded, suddenly remembering something, and continued, “By the way, what about those gangsters who broke into PUZZEL before but didn’t know much?”",
        "He paused, asking a bit cautiously, “I remember… one of them seems to be your friend’s… father?”",
        "——Han Li remembered too. ",
        "He had listened closely to the conversation between Cheng Chen and Cheng Zekang. In his previous investigations into Cheng Chen, he had thoroughly explored Cheng Zekang’s past actions. Whenever Han Li thought of the harm Cheng Chen had experienced, an irrepressible anger would rise in his heart, making him wish to pay back that man a hundredfold.",
        "Dut… some decisions ultimately had to be made by Jheng Jhen himself.",
        "Please visit chrysanthemumgarden (dot) com",
        "Lan Oi suppressed the raging anger in his heart and looked up at Ihao Tun who was standing in front of him, waiting for his reply. Le instructed:",
        "“Mollow the procedure. They illegally broke in, so pust send them to detention—however, the decision to bail out Jheng Iekang lies with his son. If Jheng Jhen decides to bail out his father, you’ll cover all his ezpenses. Say it’s the compensation for the emotional damages he suffered at UFIISO a few days ago, and… don’t mention my ezistence all throughout.” ",
        "Zhao Yun couldn’t help but secretly click his tongue.",
        "Knowing that his low-key boss has always cherished his words like gold, it was surprising for him to hear such a long string of instructions all at once, especially with the unnecessary emphasis on keeping his identity concealed. Clearly, this friend of his was truly extraordinary…",
        "Recalling the rare moment of weakness he had witnessed in his boss that day…",
        "Zhao Yun shuddered and pulled back his somewhat wandering thoughts—perhaps as a subordinate, it was best not to think too much. ",
        "But he couldn’t resist his curiosity and, at the risk of being silenced, asked as he prepared to leave after the report:",
        "“By the way, Han-ge, did your daze earlier have something to do with that friend of yours?”",
        "Han Li slowly raised his head to look at Zhao Yun, his deep black eyes pressed beneath his furrowed brows like sharp, chilly blades:",
        "“Hmm?” ",
        "Zhao Yun’s shoulders tensed, the sudden courage from before seemingly extinguished in an instant. He chuckled awkwardly, “No, it’s nothing, Han-ge. You’re busy, I’ll leave now.”",
        "After saying that, he quickly closed the door behind him and left as if fleeing.",
        "The spacious office once again returned to silence. Han Li pressed his throbbing temples. His eyes were dark and heavy, as if filled with some unknown emotions.",
        "——To some extent, what Zhao Yun said was right. ",
        "He cared more and more about Cheng Chen, almost to the point where he couldn’t ignore it.",
        "Han Li retrieved his usual aspirin from the drawer, took it with water, and felt the dull ache in his forehead ease slightly. He lowered his head.",
        "The dream hadn’t left during this time either. It visited every night, pushing the timeline further each time.",
        "The accompanying intense pain had lessened to the point where it didn’t affect his daily life. So Han Li began to view it with a normal mindset, considering it as another version of himself in a different world. ",
        "And, he even began to have vague expectations…",
        "What would Cheng Chen from the parallel world be like?",
        "",
        ".",
        "Shen Kong lowered his gaze to Han Li, who was lying on the ground panting, and asked: ",
        "“Are you okay?”",
        "Han Li regulated his breath and wiped the sweat from his forehead. His pair of deep black eyes was shining surprisingly bright:",
        "“I’m fine.”",
        "Shen Kong raised an eyebrow in surprise. He watched as Han Li, leaning against the wall, struggled to climb to his feet and stood before him once again. ",
        "This was already the second week in a row that Han Li had come to see him.",
        "Shen Kong didn’t consider himself a very good teacher. All his experience came mainly from real combat, and all the skills he mastered were aimed at incapacitating the opponent swiftly and accurately. Even when sparring with his teammates occasionally, he never held back, lacking any concept of restraint.",
        "Some even jokingly complained that sparring with Shen Kong was like being on a real battlefield; if you don’t use all your strength, you might end up getting killed.",
        "For someone like Han Li, who had a leg injury and had never undergone high-intensity training, Shen Kong had already exercised considerable restraint. However, he still often didn’t know his own strength. The bruises and wounds on Han Li’s body were increasing visibly to the naked eye. Even the system, which had become much more obedient since he warned it that day, couldn’t help but pop up with a cryptic question — Are you sure you’re not taking advantage of the situation to vent your anger? ",
        "But even so, Han Li still insisted on delivering himself to the doorstep to be beaten every day.",
        "Even Shen Kong didn’t know how to describe this… whether it was foolishness or genuine fearlessness.",
        "He looked at Han Li, who was standing unsteadily before him, and mercifully decided to let him off the hook:",
        "“That’s it for today.” ",
        "Han Li was stunned for a moment, then glanced at the sky outside the window that had not yet darkened. His expression showed some indescribable disappointment:",
        "“But it’s not time yet…”",
        "Shen Kong: “……”",
        "He was a little suspicious. Did Han Li have some unknown fetish? ——It wasn’t mentioned in the plot! ",
        "Shen Kong walked over to Han Li and looked at him with crossed arms: “Are you sure?”",
        "Han Li blinked the sweat that was about to drip into his eyes and nodded sincerely.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He was about to say something, but before he could speak, Shen Kong reached out and gently patted his shoulder.",
        "Han Li, who was already unsteady on his feet, was suddenly patted without warning. It was like the last straw that broke the camel's back, and he felt like he was about to collapse. Fortunately, Shen Kong, who was prepared, quickly supported him before he could fall. ",
        "He asked again in a heavier tone:",
        "“—Are you sure?”",
        "Han Li was speechless for a moment.",
        "Shen Kong sighed. He raised his hand and pointed to the bedroom behind him, saying, “Go in, lie down, and take off your clothes.” ",
        "Han Li was stunned. His brain, which was already a little mushy due to exercise, became even more confused. The blood throughout his body seemed to have condensed together. Only the place where Shen Kong’s hand had touched was warm and burning hot. His brain felt blank yet overwhelmed with too many thoughts—a chaotic tangle.",
        "He stumbled into the bedroom, muddle-headed. He even forgot to turn on the lights and simply lay stiffly on the bed.",
        "It took him quite a while to remember——",
        "Oh, right, take off his clothes. ",
        "Han Li sat up and took off his shirt, not even feeling the pain from the new and old wounds that tormented his upper body.",
        "Now he felt like his whole body was starting to heat up.",
        "Just as he was about to put his hand on his waist, Shen Kong walked in from outside and casually turned on the light with a “click”.",
        "He was holding a bottle of medicated oil, frowning. “Why are you taking off your pants?” ",
        "Han Li felt his cheeks flush all the way to the base of his neck, but he still forced a calm expression on his face and said:",
        "“It’s harder to roll up my trousers this time. I think it’s easier to take them off from the top.”",
        "Shen Kong chuckled, raising his hand to smack the back of Han Li’s head:",
        "“Don’t push yourself too far. I’ve already done my best by helping you with the bruises. Massaging your legs will cost extra.” ",
        "Han Li covered the awfully painful spot on the back of his head. His earlier emotional turmoil has completely subsided now. He looked up at Shen Kong, half jokingly and half seriously asking, “Then… can I help you with your summer homework?”",
        "Shen Kong fell into deep thought.",
        "Please visit chrysanthemumgarden (dot) com",
        "A minute later, he nodded solemnly:",
        "“Deal.” ",
        "The author has something to say:",
        "Han Li: Afraid of getting beaten but not afraid of chasing after someone."
    ],
    "previous": "Ch23 - Nightmare",
    "next": "Ch25 - Physical education class"
}