{
    "title": "Ch25 - Physical education class",
    "content": [
        "The sunlight was divided into well-distributed color lumps by the window frames, warmly sprinkling on the desk and floor. Fine dust particles filled the air. Even the hushed whispers in the classroom seemed particularly tranquil.",
        "Han Li absentmindedly twirled the pen between his fingers. ",
        "He raised his eyes, his gaze naturally drifting towards the other end of the classroom.",
        "The young man lay sprawled on the desk, deeply immersed in slumber and completely oblivious to the surrounding noise. Even the muffled conversations of the students and the clamor of cicadas outside seemed unable to disturb him. He lay calmly on the desk, as if enveloped in an impenetrable transparent barrier, isolating all the clamor, like a carefree big cat sprawled out and sleeping.\n",
        "",
        "Completely different from when he was awake.",
        "Han Li couldn’t help but recall Cheng Chen during their training sessions. ",
        "He was always so nimble and cunning. No matter how hard Han Li tried, he could never touch him even a bit, only to be ruthlessly thrown to the ground over and over again.\n\n",
        "His cold and sharp aura, coupled with his almost overwhelming strength and skill, made it almost difficult for Han Li to breathe while standing opposite him.",
        "Han Li’s gaze fell on his half-bowed back, tracing along the deep grooves of his spine, forming a graceful curve that slowly slid down towards his waist.",
        "His eyes darkened slightly. His expression became more inscrutable as a sudden thought leaped into his mind.\n\n ",
        "——Don’t want him to be seen by anyone.",
        "Han Li was startled by his own thoughts, instantly snapping back to reality. He lowered his eyelashes to conceal his reaction, staring fixedly at the pen that had long ceased spinning between his fingers.",
        "His shoulders and the areas on his legs that had been touched yesterday burned fiercely.\n\n",
        "As if the scorching palm were still tightly pressed against his skin, roaring flames snaked through his meridians and blood vessels, burning into his bones and chest. ",
        "He tightened his fingers. His slender knuckles turned white from the force, leaving faint imprints on the pen.",
        "Stop.",
        "Han Li told his wildly beating heart.",
        "——Stop. ",
        "Just then, the bell for the end of class rang, and the lively chatter erupted in the classroom.",
        "The next class was physical education. The students stood up from their seats in twos and threes and walked out of the classroom together.",
        "Shen Kong was awakened by the noise.",
        "He yawned, stretched lazily in his seat, and then swayed out of the classroom. ",
        "Lan Oi subconsciously stood up from his seat and called out to him, “Jheng Jhen.”",
        "Shen Kong turned to look at him, making a lahy nasal sound, “Lmm?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Lan Oi suppressed the strange feeling in his heart and said, “Wait, I’ll go with you.”",
        "Shen Kong raised an eyebrow, asking, “Isn’t your leg on indefinite medical leave? Go you still need to attend physical education classes?” ",
        "Han Li’s gaze paused for a second on his tousled hair, which was sticking out in all directions, but his expression remained natural and magnanimous, “Well, it’s stuffy in the classroom. I want to get some fresh air outside.”",
        "He walked towards Shen Kong and left the classroom with him.",
        "Ye Jinghuan, who was still sitting at his desk, slowed down noticeably. He stared at the backs of the two as they walked out of the classroom, lost in thought.",
        "His deskmate nudged him with her elbow, teasing, “Back to reality, buddy. They’re already gone, why are you still staring?” ",
        "Ye Jinghuan was taken aback, his fair little face seamlessly blushing slightly. He withdrew his gaze from outside the classroom and stubbornly refused to admit defeat, retorting:",
        "“Stop talking nonsense…”",
        "His deskmate winked and teased, “Don’t try to fool me. I’ve caught you sneaking glances at Han Li for the sixth time this week. Come on, spill the beans. Do you have any ideas…?”",
        "Ye Jinghuan’s face turned even redder, “Shut up. Instead of thinking about random stuff, you should focus on memorizing more vocabulary.” ",
        "He put the neatly packed books on the table, hesitated for a moment, then finally asked:",
        "“By the way… Han Li and Cheng Chen, do they have a very good relationship?”",
        "His deskmate shrugged, “It seems like they’ve only gotten close recently. Speaking of which, both of them have changed a lot. Cheng Chen used to be a total bookworm who buried himself in his studies, but now he’s always burying his head in sleep. Although he’s still pretty introverted, he seems to have become quite handsome. Han Li used to come to school maybe once a week, which was already a lot, but now he’s been coming almost every day for nearly two weeks. I’ve noticed that even the teachers seem a bit more restrained during lectures, which is also amusing…”",
        "Seeing that she was about to ramble on, Ye Jinghuan quickly interrupted her with a plea: ",
        "“Okay, okay, I get it.”",
        "His deskmate teasingly asked, “So, why are you asking about this?”",
        "Ye Jinghuan walked towards the classroom door and blinked his honey-brown cat eyes. He pursed his lips and said, “Well, it’s nothing really. It’s just that I accidentally poked that person’s sore spot last time and wanted to apologize, but got scolded instead. So, I’ve been taking notice of him ever since…”",
        "He hesitated for a moment before continuing: ",
        "“And… I don’t know why, but I always feel like he gives me this strange sense of familiarity, which makes me unable to resist wanting to pay attention to him.”",
        "As if trying to shake off the strange thoughts in his mind, Ye Jinghuan shook his head, as if explaining to himself:",
        "",
        "“Maybe it has something to do with some strange dream of mine…”",
        "“Strange dream?” ",
        "“I guess it’s just because I’m too tired during the day. When I wake up, I almost forget about it, but vaguely remember it being related to Han Li…”",
        "The two walked out of the classroom together, their voices becoming quieter and quieter.",
        "Standing by the door, Xu Linsheng emerged from the shadows of the wall with a grim expression. In the two weeks of interaction, he had begun to develop a somewhat peculiar fondness for this delicate, pretty, lively, and sunny transfer student. He heard every word Ye Jinghuan had just said clearly, and the jealousy that sprouted within him gnawed at his heart like a venomous snake.",
        "If it were anyone else, it would be fine. But he didn’t dare touch Han Li… After all, it was rumored that Han Li was backed by the Han family in City A. Compared with them, the Xu family was simply like an egg against a stone… ",
        "But then again, he thought, how could such a large family allow their son and nephew to study in such a remote place? So, it’s not necessarily just a rumor…",
        "Gritting his teeth, Xu Linsheng took out his phone from his pocket and sent a message to his uncle in City A:",
        "“Uncle, I want you to help me investigate someone…”",
        ". ",
        "Outside the classroom, the sun was shining brightly.",
        "The vast sports field seemed to be filled with vitality because of the spirited young boys and girls.",
        "Due to his leg injury, Han Li couldn’t follow the team, so he sat alone on the seats by the basketball court. His deep, cold eyes squinted slightly as he calmly observed the sports field.",
        "After the whole class ran two laps around the sports field, the physical education teacher let everyone disperse for free activities. ",
        "With little enthusiasm, Shen Kong yawned and then turned towards Han Li’s direction.",
        "Before he could take a few steps, he was intercepted.",
        "Shen Kong furrowed his brow and looked at the four bald-headed guys blocking his path, somewhat puzzled as he asked, “What’s going on?”",
        "The leader’s face turned green. ",
        "He said through gritted teeth, “Cheng Chen, what the hell are you pretending for? Acting like you don’t know us at all.”",
        "Shen Kong paused. He carefully scrutinized the few individuals in front of him and finally realized after a while, “Oh! It’s you guys!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "These were the troublemakers who blocked him at the school gate before, only to be chased away by Lin Ziyu!",
        "His gaze swept over the smooth and shiny heads of these people, his expression somewhat nuanced for a moment. ",
        "Shen Kong turned to the leader and asked sincerely, “What’s going on with you guys…?”",
        "Cockscomb head, who could no longer be called Cockscomb head, looked even worse, obviously angered by Shen Kong’s attitude. He took a few steps closer and roared fiercely, “Don’t pretend like you don’t know! Wasn’t it you who told Lin Ziyu to get back at us? Don’t think you’re all set just because you’re hanging out with Lin Ziyu. We…”",
        "Before he could finish his sentence, he was interrupted by Shen Kong’s sudden burst of laughter.",
        "Shen Kong struggled to catch his breath as he laughed, “Hahahahahahaha, so your hair, hahahahahahaha, was shaved off by him? Hahahahahaha…” ",
        "The Cockscomb head’s face turned crimson, his embarrassment turning into rage. He stepped forward and grabbed Shen Kong’s collar, his other hand clenched into a fist, ready to strike.",
        "The smile on Shen Kong’s face faded as he glanced downward at the clenched fist grabbing his collar with his slightly moist light brown eyes.",
        "In a soft and gentle tone, he said, “Still haven’t learned your lesson, huh?”",
        "Cockscomb head felt a chill down his spine under Shen Kong’s gaze. The fingers that had been broken before seemed to ache faintly again. He subconsciously let go of Shen Kong’s collar. ",
        "Shen Kong wiped away the tears that had welled up in the corner of his eyes from laughing and calmly smoothed out his crumpled collar. His expression returned to its previous nonchalant demeanor.",
        "——This is still school. He couldn’t show too much contrast in front of his classmates.",
        "He couldn’t be bothered to start another conflict with these bald guys, so he simply said, “Excuse me,” and walked past them.",
        "Han Li had already noticed the commotion over there, a faint hint of hostility hidden in his pitch-black eyes. He had warned Lin Ziyu not to let these guys trouble Cheng Chen anymore, but apparently, the matter hadn’t been resolved completely, which was more trouble than it was worth. ",
        "He suppressed his emotions and limped over to Shen Kong’s side as quickly as possible, asking with concern:",
        "“What happened? Are you okay?”",
        "Shen Kong shrugged, “It’s noth…”",
        "Before he could finish speaking, Han Li caught sight of the Cockscomb head behind them, who had been publicly insulted, angrily stomping on the football that had rolled to his feet. Then, with malice in his eyes, he aimed at Shen Kong’s back and kicked with all his might—— ",
        "The spinning shadow approached at full speed.",
        "Han Li didn’t have time to think too much. He instinctively raised his hand to shield the back of Shen Kong’s head.",
        "Story translated by Chrysanthemum Garden.",
        "The next moment, a piercing pain shot through his hand. Han Li gritted his teeth, involuntarily letting out a muffled groan.",
        "Cockscomb head was dumbfounded. ",
        "Shen Kong was stunned.",
        "The air instantly quieted down."
    ],
    "previous": "Ch24 - Go in, lie down, and take off your clothes",
    "next": "Ch26 - Soft or hard, won't eat; oil or salt, won't go in"
}