{
    "title": "Ch27 - Life-saving straw",
    "content": [
        "Shen Kong finally went to bail Cheng Zekang out.",
        "PUZZEL paid the bail in the name of “compensation for emotional damages”, so Shen Kong was happy to have some leisure time. After a brief chat with Zhao Yun, he left with Cheng Zekang. ",
        "Shen Kong leisurely walked down the street with his hands in his pockets. Cheng Zekang, on the other hand, was following him timidly.",
        "After experiencing this ordeal in prison, Cheng Zekang seemed noticeably downcast. He had dark circles and puffy bags under his eyes, making his eyes appear even more lifeless.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Every now and then, he couldn’t help but steal glances at Cheng Chen walking ahead of him, then quickly averted his gaze as if afraid of being caught.",
        "Although he still has the same facial features, this son, who was once beaten and scolded, has become almost unrecognizable to him. Even… in a sense, it filled him with fear. ",
        "Especially that night…\n\n",
        "The image of the other person looking down on him flashed in Cheng Zekang’s mind. He couldn’t help but feel the same shiver creeping up his spine, causing him to shudder involuntarily.",
        "Just then, the young man walking in front of him suddenly stopped.",
        "Cheng Zekang abruptly halted his steps. His scattered thoughts instantly returned. He turned around and scrutinized the unfamiliar scenery. An ominous premonition surged in his heart.\n\n ",
        "Although he had never been to the rented house where Cheng Chen currently lived, he was one hundred percent sure that this wasn’t the way back.",
        "The sky was gradually darkening, but the street lamps had yet to light up. Dim daylight enveloped the deserted alleyway, with the undulating walls and house silhouettes nearby seeming to extend countless ghostly figures towards the place where they stopped.",
        "Cheng Zekang’s throat felt dry. His heart was also pounding rapidly. He swallowed hard and forced a stiff smile onto his face:\n\n",
        "“Xiao, Xiao Chen, are you lost?” ",
        "Shen Kong didn’t reply. Instead, he took out a cigarette and ignited a faint red flame under the dark and gloomy sky. It flickered on and off, resembling a blunt knife carving through Cheng Zekang’s heart. The air seemed to thicken, enveloping him like viscous fluid, making it almost difficult to breathe.",
        "Even through the heavy darkness, Cheng Zekang could still feel the other person’s gaze. The terrifying sensation, akin to being preyed upon, left him struggling for breath. Although less than two minutes had passed, his back was already drenched in cold sweat. He finally couldn’t stand the oppressive silence, so he toughened his scalp to speak:",
        "“That…”",
        "Before he could finish his words, he heard the sound of a school bag zipper being pulled not far away— ",
        "A thick folder was thrown at his feet.",
        "At that moment, the street lamps lit up.",
        "Jheng Iekang felt a foreboding sense of unease. Le reached down and picked up the folder with trembling hands, flipping through its contents in the light cast by the roadside.",
        "With each page turned, his complezion grew paler. ",
        "Over the past decade or so, everything he had done that offended Heaven and reason, breaking the law and violating discipline, was meticulously documented, with clear and complete evidence.",
        "Cheng Zekang’s whole body was shivering. His brain seemed to have solidified into a paste as well. He raised his eyes and looked at Shen Kong, speechless.",
        "Story translated by Chrysanthemum Garden.",
        "Cheng Zekang shivered and felt a chill running through his body. His brain seemed to turn into mush, leaving him speechless and tongue-tied as he looked up at Shen Kong.",
        "Shen Kong, with half-closed eyes, calmly remarked: ",
        "“The contents here are enough to put you in jail for thirty years.”",
        "During this period of time, apart from using the hundreds of thousands he earned in the casino to support his usual random purchases and spending according to his mood, the rest was basically used to collect powerful information about his cheap father. ——Shen Kong has a good attitude. He can’t take the money away anyway. He always spends money as he pleases, so this time, it’s considered as rent paid for borrowing this body.",
        "After all… witnessing such panic and fear on this wretched face was truly a delightful sight.",
        "Shen Kong walked out of the darkness. ",
        "He blew a smoke ring into the air, his eyes half-squinted. “Consider this a gift. I have plenty of backups, so whether or not I accidentally send them out… depends on my mood. If you bother me again, I won’t be so easy to deal with, understand?”",
        "With that, Shen Kong didn’t even spare a glance for Cheng Zekang who was paralyzed on the ground. He turned and walked out of the alley without looking back.",
        "He stopped a car and got off at his own house.",
        "As the night deepened, the narrow and secluded corridor fell into silence. ",
        "Shen Kong took out the key from his pocket and walked up the stairs, the motion-sensor lights illuminating with each step.",
        "His movements suddenly paused.",
        "He saw a dark figure hugging its knees and squatting at his doorstep, the pitch-black head buried in its knees, with only the top of its hair visible.",
        "Shen Kong frowned and tentatively spoke, “…Han Li?” ",
        "The figure stirred, lifting its head from its knees.",
        "Sure enough, it was Han Li.",
        "Shen Kong furrowed his brows. “Why are you sitting here? And aren’t you injured? Why did you come?”",
        "He said as he opened the door with the key. ",
        "Han Li stood up and patted the dirt off his pants. He pursed his lips without answering. His deep eyes, as black as the night, were tightly locked on Shen Kong’s figure. There was a complex and melancholic expression in his eyes, as if containing thousands and thousands of words.",
        "He followed Shen Kong into the door.",
        "Chrysanthemum Garden.",
        "Shen Kong took off his shoes and habitually flexed his wrists and ankles. He spoke, “Come whenever you’re ready.”",
        "As soon as he finished speaking, Han Li attacked. ",
        "Shen Kong reflexively dodged, but was inwardly surprised—Han Li seemed different today than usual.",
        "His attacks were faster and more aggressive than usual. They were solely on the offensive, with a demeanor of reckless abandon, as if secretly suppressing an overwhelming force that needed release, as if determined to catch him even if it meant risking a leg injury.",
        "Shen Kong’s eyebrows furrowed even tighter.",
        "He found an opening. He hooked and entangled one leg and threw Han Li to the ground. Then, using his own weight and tightened arms, he pinned down Han Li’s still-struggling body and subdued him firmly. ",
        "“What’s wrong with you?”",
        "He was obviously fine when he left school this afternoon, so why did he seem so crazy tonight?",
        "The rim of Han Li’s eyes were red as his chest irregularly rose and fell. His thin lips were tightly pursed, his Adam’s apple slightly bobbing.",
        "He forcefully closed his eyes and answered hoarsely, “…It’s nothing.” ",
        "…No matter how you look at it, it doesn’t look like nothing at all.",
        "The scorching heat from the body under his palm radiated through the clothing and onto Shen Kong’s body.",
        "He must be running a fever.",
        "Shen Kong released his restraints, intending to turn around and search for the remaining antipyretic medicine from last time. However, he was caught off guard as Han Li attacked him from behind, using the techniques he had previously taught him to subdue him instead——quite talented indeed. ",
        "Shen Kong raised an eyebrow and prepared to break free from Han Li’s grip on his arm, but his gaze inadvertently fell on the back of his hand wrapped in white gauze.",
        "Shen Kong couldn’t help but pause in his movements.",
        "In that moment of hesitation, Han Li buried his heavy and feverish forehead in the crook of Shen Kong’s shoulder.",
        "During this sudden fever, he saw more things. ",
        "He saw his own gloomy and withdrawn self wasting time year after year, from middle school to high school, from winter to summer; he saw the new transfer student, Ye Jinghuan, coming to their high school class; he saw them becoming friends, and he even felt a subtle fondness and affection towards him, and then… the situation took a turn for the worse.",
        "His true identity was exposed, and the accumulated malice burst forth like a raging torrent. Countless dark gazes and malice piled up into piercing blades, mercilessly dissecting him. What shocked him the most was… behind those ugly smiling faces, he saw a familiar figure: a person wearing washed-white old clothes, with a timid and gentle demeanor, looking at everyone with the same careful and pleasing expression, with similarly delicate facial features, but so mediocre and cloying.",
        "Chrysanthemum Garden.",
        "——The depths of those eyes also carried a dark malice within.",
        "Clear and overwhelming emotions swept through him, flooding his body with a mixture of terror, despair, loneliness, and pain. ",
        "In that moment, he could hardly distinguish whether he was the one who had his limb amputated and bullied, or the one who was disabled yet cunningly strategizing.",
        "Amidst the chaos, Han Li subconsciously arrived at Shen Kong’s doorstep, as if clutching a life-saving straw, tightly gripping onto him.",
        "Through the faint scent of green grass, Han Li closed his eyes, his body and mind finally sinking into a deep slumber."
    ],
    "previous": "Ch26 - Soft or hard, won't eat; oil or salt, won't go in",
    "next": "Ch28 - The answer from eight years ago"
}