{
    "title": "Ch3 - Money is not a problem",
    "content": [
        "Shen Kong quickly stepped forward and agilely cut the rope binding Han Li’s hands and feet with an old saber. Then he expertly tied the rope tightly to Han Li’s thigh to stop the bleeding.",
        "While treating Han Li’s wounds, he asked with gritted teeth: ",
        "“How did this happen?”",
        "There was still no emotion or fluctuation in the system’s voice:\n",
        "",
        "“It’s the original trajectory of the world that operates, and it will do its best to bring the character’s destiny back to the original route. As an intellectual assistant, I suggest that you, as much as possible, try not to resist it, but rather to comply with its premise and carry out ideological and moral guiding to change the villain by the means of persuasion……”",
        "“Why?” There was no happiness or anger in Shen Kong’s voice. ",
        "“First, it’s too difficult to change the fate of the characters. Even if the Three Views Rectifier make great efforts, it will be canceled out to the greatest extent, which is basically a waste of energy. Second, if you truly succeed in changing the trajectory of the world, it will also lead to subsequent changes. The subsequent plot is unpredictable, and the subsequent progress will also be disadvantageous to your task. The villain will not die before the plot begins, so I’m suggesting to you that simply stopping the bleeding is actually enough already. After he wakes up, you can then use these tenderness and care for him to set an example……”\n\n",
        "Shen Kong interrupted: “So… you’re suggesting that I shouldn’t do anything? To let him be disabled?”",
        "The system answered affirmatively: “Yes.”",
        "Shen Kong smiled instead of getting angry. He examined Han Li’s deathly pale face for a while, then put his hand through the crook of his leg and carried Han Li in his arms.\n\n ",
        "He asked: “Where’s the nearest hospital?”",
        "There was a very obvious doubt in the system’s mechanical voice: “I thought you wouldn’t mind?”",
        "Shen Kong sneered coldly, with a hint of sarcasm on the tip of his brows and the corner of his eyes: “I just hate your hypocrisy of wanting to change the fate of the characters, yet you’re being overcautious and indecisive.”\n\n",
        "The system fell silent for a while. Before Shen Kong could lose his patience, he heard the ding of the mobile phone he picked up. ",
        "He opened the screen and saw that the GPS updated an address.",
        "The system’s voice sounded again: “The nearest hospital is twenty kilometers away, but the village at the foot of the mountain happens to be the place where one of the gangs sells their stolen goods. There are many underground doctors with excellent skills. This is the address of the orthopedic surgeon.”",
        "——",
        "The dark night was quiet and heavy, as if it were woven from millions of dreams. ",
        "Dr. Chen was still sound asleep. Suddenly, he felt a chill running down his spine in his sleep, causing him to wake up in an instant——the cold, hard metal was pressing against his forehead, and the strong smell of blood lingered at the end of his nose.",
        "In the deep darkness, a low whisper came through his ears:",
        "“Follow me.”",
        "Le had been an underground doctor for a long time. Although this kind of thing was rare, it was not unheard of. Gr. Jhen calmed down duickly. Le got out of bed and followed the man, guiding him outward. ",
        "The night light turned on in the living room gave off a faint radiance, illuminating the deathly pale boy on the sofa.",
        "The muzzle of the gun pressed against his forehead came a little closer, and the man’s cold and threatening voice sounded:",
        "",
        "“Save him. Money is not a problem.”",
        "In the next ten minutes, Dr. Chen hurriedly woke up his assistant and pushed the unconscious Han Li into the underground operating room. ",
        "Shen Kong sat cross-legged in the doctor’s living room, bored, playing with the disposable phone in his palm uninterestingly.",
        "The system asked without warning: “You know you only have the forty-five yuan that you got from the kidnapper’s body, right?”",
        "Shen Kong nodded.",
        "System: “……Then didn’t you just say that money is not a problem?” ",
        "Shen Kong stretched out and sank into the soft sofa: “Yes, what’s the problem if you don’t have money?”",
        "System: “……”",
        "“Just kidding.” Shen Kong curled his eyes and brows.",
        "He stood up, then walked unsteadily to the desk, turned on the computer on the desk as if he were not an outsider, and then started typing on the keyboard skillfully. But after a few minutes, Shen Kong’s expression slowly became serious. He frowned and asked in his mind: ",
        "“I remember you saying that this kidnapping was planned by the Han family’s second wife, right?”",
        "The system quickly replied: “Yes.”",
        "Shen Kong, seemingly lost in his thoughts, knocked the table with his fingertips and said: “There’s a newly opened overseas account under that kidnapper’s fake identity. There are 8 million US dollars in the account. The balance should not be paid before Han Li is confirmed to be dead. Therefore, the amount inside should be just a deposit, and the Han family’s second wife’s family background is not outstanding. Even if she belongs to a rich and powerful family, it’s really not easy to come up with such a large sum of money at once without attracting attention. So I looked into the source of the funds…”",
        "He narrowed his eyes slightly: “Although they used multiple overseas accounts to confuse the public and that their techniques were very concealed and subtle, I still found the original fund transfer point.” ",
        "On the computer screen, a few pitch-black handwritten small characters were shocking:",
        "Han Family Holdings.",
        "——This money was remitted by a subsidiary company of the Han family, and it was still in the company’s turnover.",
        "This matter suddenly became not so simple, because this showed that behind the second wife’s treachery, it was most likely the tacit approval of the head of the Han family, and if you think about it in the plot, not long after Han Li’s accident, something bad also happened to his mother’s family. The Han family, which had been dormant for a long time, devoured them like a whale. Perhaps Han Li’s kidnapping was not an ordinary wealthy family’s fight for favor, but a conspiracy that involved many people and had been planned for a long time. ",
        "It was quiet on the system’s side.",
        "Shen Kong narrowed his eyes and did not continue to ask; rather, he quickly emptied the amount in the account in batches.",
        "Please visit chrysanthemumgarden (dot) com",
        "After erasing all the traces he left behind and confirming that he would not be tracked, he turned off the computer, yawned, returned to his previous casual and lazy look, and then leisurely sat back on the sofa.",
        "The waiting time seemed to be particularly endless. ",
        "Although Shen Kong knew that the surgical operation would take a long time, he did not expect that the operation would last a full nine hours and forty minutes.",
        "The midday sunlight had slowly climbed up to the windowsill, the light spots on the ground slowly turning into a deep, warm golden color. Only then did the thick iron door of the basement finally let out a harsh roar, breaking the almost false tranquility in the room.",
        "Dr. Chen took off the surgical mask on his face as he walked towards Shen Kong. There were still a few drops of solidified blood splashed on his glasses. He stood still in front of Shen Kong, his expression half solemn and half tired:",
        "“The situation is a bit complicated…… The location of the bullet is very tricky. I have tried my best to repair the damaged joints in his legs. It will likely leave a critical sequelae. As for the specific situation, it depends on follow-up observation……” ",
        "Shen Kong abruptly interrupted him: “Will he be disabled?”",
        "Dr. Chen was stunned by his question. He replied hesitantly: “Well, it depends on your definition of disability. If it is paralysis or amputation, then it probably won’t happen, but there’s nothing that can be done about his functional impairment and walking difficulty.”",
        "Shen Kong nodded. He reached into his pocket, took out the box of deflated cigarettes, took one out, and held it in his lips.",
        "This should be the best result. ",
        "After all, in the so-called “plot” transmitted to him by the system, Han Li’s legs were paralyzed, and he had to rely on a wheelchair for the latter half of his life. Now it was just a walking impairment, which was already a very big change from his original destiny. This almost confirmed Shen Kong’s conjecture that he deliberately tried to test——",
        "He slightly lowered his head and lit the cigarette on his lips with the lighter he had brought from the bedside table.",
        "A bit of red-orange light lit up, and the edges of the charred paper roll were licked by the flame, the light cyan smoke blurring his facial features.",
        "Shen Kong held the cigarette between his fingers, looked up at Dr. Chen, and asked, “Where is he?” ",
        "“Follow me.”",
        "Dr. Chen turned around and walked in the direction he came from. The two of them walked down the stairs one after another. The basement was much larger than Shen Kong had guessed. It not only had a fully equipped sterilization room and operating room, but there were also two relatively simple nursing wards, and Han Li was lying in one of them.",
        "His eyes were tightly closed, and the color of his face was practically lifeless. His face almost blended into the pale pillow, and his thin body was almost swallowed up by the sheets and quilt. The bulges of the quilt were difficult to distinguish with the naked eye. Only the “di di” sound of the machine beside the bed made it clear to them about the signs of his life.",
        "Shen Kong looked away, holding the cigarette in his mouth. With a calm expression, he lowered his head and pulled out a piece of paper. Like floating clouds and flowing water, he wrote down a series of numbers on it and then handed it to Dr. Chen: ",
        "“There are 2 million in the card, and I will pay you the other half when I leave.”",
        "Dr. Chen took the slip of paper in a hurry. While he was still dazed, Shen Kong continued:",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Does he need any special care next?”",
        "Dr. Chen was stunned for half a second before he stammered in reply: “Well…… all that’s left is to change dressings and avoid infection, as well as some routine daily care, and so on……” ",
        "“Then I suggest you leave behind your medicines, daily necessities, and operating guidebooks. After that, go out and stay somewhere for two more days.” Shen Kong smoothly pinched the cigarette butt, put it out, and smiled with his head tilted to the side: “This place may become a little……chaotic next.”",
        "Watching Dr. Chen leave in a hurry, the smile on Shen Kong’s lips melted away like ice and snow under the sun, leaving only a firm and cold look.",
        "The system finally couldn’t help but ask: “What on earth do you want to do?”",
        "Although they only got along with each other for one day, the system had already felt that he was indescribably troublesome. Among all the rectifiers it served, Shen Kong was the most elusive. He did not abide by the rules, nor did he follow the routines. As if he were just playing cards, he was sluggish and careless. He looked like he didn’t care about anything, but he seemed to have a clear understanding of the situation in the bottom of his heart, making it completely difficult for the system to figure out what he wanted to do next. ",
        "Shen Kong pulled up a chair and sat in front of the hospital bed. With his feet on the bed, he said lightly:",
        "“All the money in the account has been withdrawn, but I have not made any report on my task. According to the Han family’s power, they should be able to find out my current location soon. If my previous guess is correct, then they will quickly send someone to get the job done.”",
        "Shen Kong paused and comforted it kindly:",
        "“But that’s all right. I just need to wait until his grandpa's people get here.” ",
        "System: “???”",
        "Shen Kong raised his hand and shook the screen of his phone. On it was a message that had just been sent:",
        "【Bring 8 million in exchange for your grandson’s life. Address: xxx】",
        "System: “……” ",
        "This, doesn’t this look like a blackmail text message, ah?",
        "The author has something to say: The system, which was stunned by Kong-ge’s professional skills, slowly typed a “?”"
    ],
    "previous": "Ch2 - This kid still has some backbone",
    "next": "Ch4 - Breath"
}