{
    "title": "Ch30.1 - Exposure risk",
    "content": [
        "A man, standing on the roadside, stared at the chaotic intersection not far away, pressing down the peaked cap on his head. He sent a message to an unfamiliar number on his phone:",
        "“It’s been taken care of.” ",
        "In the dimly lit room with tightly closed curtains, the air was stale and stifling, permeated with an aura of decay and desolation from inside to outside.",
        "The phone, still casually thrown on the table, buzzed loudly. The screen that suddenly lit up seemed particularly clear and dazzling in the quiet room.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "A figure suddenly rushed over from nearby, hastily clearing the scattered trash on the table with trembling hands and grabbing the phone.",
        "It was Wang Ruicheng. ",
        "His once plump cheeks had sunken, his eyes were bloodshot, and the dark circles and bags under his eyes were as heavy as if he had been beaten. Unkempt stubble spread densely from his chin to his neck. His hair was also messy, looking depressed and on edge.\n\n",
        "Wang Ruicheng tightly squeezed the phone in his hand, reading the few words on the text message over and over again. Then he chuckled, a sense of joy over revenge filling his haggard face.",
        "He was originally a branch of the Wang family. He relied on his ability to curry favor with others and became familiar with them, finally landing this lucrative job at the casino. But, unexpectedly, he ended up capsized in the gutter of this small place. Not only was he tricked by that damn cripple, but he also happened to be caught by people sent by the main family—apparently to let a legitimate young master experience life—but unexpectedly ended up encountering this trouble. So now, the situation in City A has started attracting attention.",
        "Not only has the casino been shut down, but the status that he had worked so hard to earn has returned to zero overnight. He’s even been targeted by the police for an investigation.\n\n ",
        "In order to prevent his scandal from affecting the family’s development, the main family has basically kept him in cold storage.",
        "Now, his position has been revoked. Even his assets and previously held stocks have been frozen. Now, he only has a few properties left in his name, and all those hangers-on who used to gather around him dispersed.",
        "Wang Ruicheng slowly slid to the ground. He nervously bit his nails, muttering to himself:\n\n",
        "“…Fuck. You brat, you actually dared to go against Laozi, even making me suffer so miserably. Go to hell and repent…” ",
        "He laughed again.",
        "Han Li hurriedly rushed to the hospital.",
        "His complexion was icy, his face as pale as paper. His eyes, as black as midnight, were full of frost.",
        "Le appeared very calm as he limped down the long corridor, but his palm hanging by his side trembled slightly. ",
        "A doctor walked over from the other end of the corridor. When he saw Lan Oi, he subconsciously slowed down his pace and said cautiously:",
        "“Fm, Zr. Lan…”",
        "Lan Oi’s eyes moved slightly, looking at him ezpressionlessly.",
        "His whole person seemed to be enveloped in some kind of suppressed and unstable emotion, like the gloomy sea surface before a storm. With terrifying and cold undercurrents lurking beneath the calm surface, it was ready to surge forth at any moment. ",
        "The doctor felt a shiver run down his spine as he was looked at. He swallowed his saliva and continued: “Um… Thankfully, the steering wheel was turned in time, and the car’s protective functions were good enough. Mr. Xu and Mr. Cheng are not seriously injured. Mr. Xu only has some minor scratches and should be discharged today. But Mr. Cheng’s is more severe. He has fractured ribs, some internal bleeding, and has also suffered a head injury. He’s still under observation for now…”",
        "Upon hearing the words “not seriously injured,” Han Li’s chest heaved suddenly. As if trying to suppress his surging emotions, he forcefully closed his eyes.",
        "",
        "After a while, he finally raised his eyes and looked at the doctor, his voice a little hoarse:",
        "“Where are they?” ",
        "The doctor stepped aside to give way and pointed towards the deeper end of the corridor:",
        "“Mr. Xu went upstairs for a comprehensive physical examination. Mr. Cheng is still in the intensive care unit…”",
        "Before the doctor could finish his sentence, Han Li quickened his pace and brushed past him, walking in the direction he had pointed.",
        "Through the thick glass, one could see the simple layout in the ward. ",
        "The fluorescent lights above shone as brightly as daylight, casting a pale glow over the spacious ward. A human-shaped lump bulged out on the central hospital bed. The steady and monotonous beeping sound of the machine connected to the bed could be vaguely heard.",
        "Han Li’s face was faintly reflected on the glass. He then looked into the room through his blurred reflection.",
        "He rested his palm on the glass and exhaled slowly, leaving a layer of faint white mist on the glass. Even his eyes reflected on the glass were shrouded in a heavy fog.",
        "From the moment he heard the news of the car accident, Han Li felt as if he had fallen into a state of near-nothingness. ",
        "Like a drowning man who couldn’t lift his head out of the water, there was an abyss beneath his feet and a boundless sky above his head. The endless despair and powerlessness twisted into an irresistible rope, dragging him into the dark abyss.",
        "Only now did Han Li feel a slight sense of relief.",
        "After a simple examination, it was found that Uncle Xu’s body didn’t suffer any major damages and was sent home to rest.",
        "But Han Li still stayed in the hospital, keeping watch. ",
        "Two hours later, Cheng Chen was moved out of the intensive care unit.",
        "Han Li pushed open the door of the ward and walked in, slowly approaching the bed.",
        "The person lying there was unconscious, with a slight furrow in their brow, seemingly uneasy.",
        "Severe wounds on his arms and legs had been treated and tightly bandaged, but many small abrasions were still exposed to the air, with coagulated blood and dark red scars scattered all over the young man’s body. It made him look extremely fragile. ",
        "His light brown hair spread messily on the pillow. His pale cheeks appeared somewhat haggard under the light as well. His long eyelashes were quietly lowered, casting deep shadows on his face.",
        "Han Li stood by the bed and stared at him. His slightly lowered eyes were as dark as ink, seemingly suppressing some kind of deep emotion in his eyes.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "After a long time, he restrainedly stretched out his hand and gently touched the young man’s cheek with his knuckles.",
        "The skin under his touch was cold and smooth, causing Han Li to quickly retract his hand as if it had burned. ",
        "At this moment, the eyelids of the young man lying on the hospital bed moved slightly, slowly opening his eyes——",
        "Cheng Chen blinked in confusion. He moved his neck slightly and then let out a muffled groan due to the sudden surge of pain.",
        "Han Li’s heart pounded violently. He quickly bent down and looked at him nervously. Half-surprised and half-concerned, he asked:",
        "“Are you awake? How do you feel?” ",
        "Cheng Chen’s unfocused eyes took a long while to settle on Han Li. He seemed startled. He just stared blankly, then stammered and asked in a hoarse voice:",
        "“I… where am I? You… you are…”",
        "Han Li hesitated for a moment, as if realizing something, and asked, “Do you still remember who I am?”",
        "Cheng Chen, somewhat timidly, stole a glance at him and nodded hesitantly: ",
        "“You… you’re my classmate Han Li, right?”",
        "His face was filled with deep confusion: “Is this… is this a hospital?”",
        "Cheng Chen turned his head to look at his surroundings but was overwhelmed by the sudden pain as soon as he moved. He couldn’t help but cry out in pain:",
        "“Oh, why does my body hurt so much…!” ",
        "Han Li’s sharp features gradually turned cold. His slightly pursed thin lips were like blades, and the depths of his dark eyes seemed to brew a storm.",
        "He quickly turned around and walked out.",
        "The long corridor was quiet and deserted. The floor reflected a cold sheen under the harsh white light, permeated with the sharp scent of disinfectant.",
        "Han Li stood alone in the corridor. His solitary figure extended from his feet into the darkness, blending into the blurred edges. ",
        "He lowered his eyes. His sharp-featured face was divided by the lights above his head. Half of it was in the light, half of it was in the shadow, half of it was handsome, and half of it was shaded.",
        "Han Li opened his palm and looked over with lowered eyes.",
        "",
        "At some point, four crescent-shaped bloodstains were forcibly squeezed out of his fair and clean palm. Crimson blood slowly oozed out, soon forming a small puddle of blood in his palm.",
        "But Han Li seemed to feel no pain. His expression was so calm that it was almost scary. ",
        "Using his unwounded hand, he took out the cigarette from his pocket. He scrutinized it under the light for a long time before finally lowering his head and pressing a kiss on it.",
        "——Next time, I will definitely catch you."
    ],
    "previous": "Ch29.2 - “You're not him”",
    "next": "Ch30.2 - Exposure risk"
}