{
    "title": "Ch32.1 - White moonlight and cinnabar mole",
    "content": [
        "Shen Kong returned to his rental apartment.",
        "He stepped over the trash and dirty clothes still piled on the floor and walked straight to the sofa. He sat down, then took out his phone. ",
        "The moment he saw the photo of Ye Jinghuan in that private room, Shen Kong started searching his mind for feasible countermeasures. Unfortunately, the conditions at that time were quite limited, and the methods he could apply to reality were pitifully few, so he had to choose the most direct and simple way — discreetly hiding the recording phone in the vase beside him.",
        "Shen Kong was actually just trying his luck, as he wasn’t sure if he could record anything or if what he recorded would be useful.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He pressed the play button.",
        "In the cramped and quiet apartment, the sound from the phone instantly filled the space. ",
        "Chaotic footsteps and the sound of the door hinge opening and closing could be heard — this should be when they left the private room.\n\n",
        "The click of the door locking sounded, and the audio returned to silence, with only the continuous rustling of white noise in the background.",
        "Shen Kong lowered his eyes to watch the progress bar slowly move across the phone screen, waiting quietly.",
        "Just when he had almost given up hope, suddenly, that voice began to speak:\n\n ",
        "“…Hello? Hello.”",
        "Although the sound was somewhat distorted through the microphone, it was still recognizable as the middle-aged man who had interviewed him. Shen Kong’s spirits lifted, and he continued to listen attentively.",
        "“…Yes… Right, right…”\n\n",
        "It was unclear what the person on the other end of the line was saying, but the middle-aged man kept responding in agreement: ",
        "“…Tes, we’ve found him, and his background has been checked.”",
        "Then there was the sound of pages rustling, and the man continued, “We have a good candidate. Lis appearance meets the reduirements, and there’s no sign of plastic surgery. Tes, there are no indications of him deliberately aligning with the other party. Lis background is very simple, and his financial situation isn’t very good. According to our investigation, his personality is also relatively easy to manipulate.”",
        "Shen Kong realized that the man seemed to be talking about him.",
        "The middle-aged man paused, seemingly waiting for a response from the other end of the line. He then asked somewhat hesitantly: ",
        "“…But, are you sure that he likes…”",
        "Before he could finish, his words were interrupted by the person on the other end. After a long silence, his voice resumed:",
        "“Mhm, yes, you’re right… No problem… Okay… Goodbye, Young Master Han.”",
        "Young Master Han? ",
        "Shen Kong furrowed his brows slightly, a deep, dark expression in his eyes.",
        "If it was Young Master Han, then there were only two possibilities. One was his task target, Han Li, and the other was the beneficiary after Han Li’s leg was broken — the second young master of the Han family who replaced Han Li as the heir after he was exiled outside the city. This person was also the biological son of Han Li’s stepmother.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Shen Kong pinched the bridge of his nose and took a slow, deep breath, his face showing unmistakable fatigue.",
        "Before he had time to think further, his phone suddenly rang. It was a call from his manager named Chai Zhi. ",
        "Shen Kong answered the call. Before he could even put the phone to his ear, he heard an excited voice on the other end: “Mingxuan, I received a notification. They said you did pretty well and want you to go back tomorrow. I knew trusting you wouldn’t be an issue. You truly are my most promising artist…”",
        "This was followed by a series of statements that were half threats and half inducements, intended to tell him that as long as he worked hard under the condition of confidentiality, he would gain fame and fortune. However, if he messed up, he would offend important people. Not only would he miss out on rewards and opportunities, but even his own safety could not be guaranteed.",
        "Shen Kong responded perfunctorily.",
        "Just before the other party, satisfied, hung up the phone, Shen Kong suddenly remembered something and said: ",
        "“By the way, Chai-ge, can you send me my schedule again? I can’t find the previous one because my phone was sent for repairs…”",
        "At that moment, since he was in a good mood, he naturally didn’t refuse Shen Kong’s small request:",
        "“Okay, okay, no problem. But next time, be careful not to lose it again. After all, you can’t always trouble others.”",
        "Not long after hanging up, Shen Kong received the schedule from Chai Zhi. He glanced through it and felt slightly relieved. ",
        "Fortunately, Meng Mingxuan was an 18th-tier star with no endorsements or events. The only web drama he participated in had a role with few scenes, so his schedule wasn’t full. He only needed to go to the set three times a week.",
        "Shen Kong had not yet fully mastered Meng Mingxuan’s mannerisms and expressions, let alone playing other roles in this state.",
        "This relaxed schedule suited him perfectly.",
        "And… during this time, he could also prepare some things he might need later. After all, he had taken a big risk at the nightclub before, but he couldn’t rely on luck every time, could he? ",
        "Shen Kong tidied up the apartment a bit and took the trash bag downstairs.",
        "Although the rental apartment was still somewhat messy, it looked much brighter than before, and the stuffy mildew smell in the room had dissipated considerably.",
        "Shen Kong slowly exhaled, throwing himself onto the bed in the room. His body, tense for most of the day, finally relaxed. He could almost hear the sound of his muscles and bones stretching.",
        "Suddenly, he thought of something. ",
        "After hesitating for a moment, Shen Kong took out his phone from his pocket, typed “Han Li” on the screen, and pressed the search button.",
        "The next second, countless web pages popped up, making him momentarily dazzled.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Shen Kong randomly clicked on one of them.",
        "The bold black font on the narrow phone screen was striking, like an exclamation mark magnified and emphasized: ",
        "“The mysterious new business tycoon who recently returned to China appeared at a charity gala. What will the young new millionaire do next?”",
        "Shen Kong skimmed through the article quickly. The entire piece was written in an extremely exaggerated style, using a sensational tone to detail the bold moves and almost reckless investments of this new business tycoon in the three months since his return to the country. It praised him as a business genius unparalleled on earth and heaven, and described his entanglements with several major families in City A with a mix of gossip and speculation.",
        "However, gradually, the focus of the article shifted in a strange direction…",
        "The writer began to lavishly praise this young businessman’s appearance with grandiose words, and then went on to seriously introduce all the romantic scandals he had stirred up since his return. ",
        "Shen Kong frowned and slid his finger down the screen.",
        "A picture appeared on the screen.",
        "The photo was low-resolution, seemingly taken secretly by paparazzi.",
        "The lens captured, through lush and dense foliage, a tall young man standing sideways on a luxurious terrace. His well-tailored suit outlined his tall and strong figure. His side profile was bathed in hazy moonlight, holding a wine glass as if in deep thought. Although the photo was very blurry, Shen Kong recognized him at a glance. ",
        "It was indeed Han Li.",
        "Shen Kong took a deep breath and closed his eyes."
    ],
    "previous": "Ch31.2 - An inexplicable sense of familiarity",
    "next": "Ch32.2 - White moonlight and cinnabar mole"
}