{
    "title": "Ch39 - A lightweight",
    "content": [
        "Although Shen Kong knew that from the angle he was sitting, the other party could at most see a blurred profile of him, he still couldn’t help but feel his heart skip a beat.",
        "He retracted his gaze, lowered his eyes, and took a sip of the wine in his cup. ",
        "The rippling crimson liquid reflected a shimmering glint under the light, which was mirrored in his eyes.",
        "The clinking of glasses and the lively chatter around him seemed to envelop him like smoke, blocking his mouth, nose, and eyes like cotton, bringing about a hazy and drowsy feeling.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Shen Kong was startled and suddenly realized something.",
        "This body… can’t seem to handle alcohol very well? ",
        "He hadn’t actually drunk much; it was just half a cup during the initial rounds of toasting. Given his usual constitution, he could drink endlessly without getting drunk and had undergone professional training. He was always the one who made others drunk, never the other way around. How could he ever feel dizzy after just two sips? Even Cheng Chen’s body could handle alcohol, so who would’ve thought that this actor, who had been in the entertainment industry for so long, would be such a lightweight!\n\n",
        "Shen Kong raised his hand to pinch the bridge of his nose and looked up at the spot where Han Li had been sitting, only to find that the seat was now empty.",
        "He couldn’t help but frown.",
        "He hadn’t expected Han Li to leave during the brief moment he was lost in thought. His current state after drinking was far too impaired.\n\n ",
        "——But perhaps it was better that he left. There would be other opportunities after all. That’ll be better than meeting him in this condition.",
        "Shen Kong shook his head, trying to clear his mind, then stood up without disturbing the others and quietly left the private room.",
        "He walked unsteadily to the bathroom and turned on the faucet.\n\n",
        "The clear water gushed into the white sink. The icy droplets splashed onto the back of Shen Kong’s hand, bringing a refreshing chill. ",
        "He bent down and scooped up some water, roughly splashing it on his face.",
        "The cold water quickly took away the warmth from his skin. Shen Kong blinked his wet eyelashes, feeling much more clear-headed. He brushed back his damp hair, grabbed a couple of paper towels to dry his hands, and then turned to leave.",
        "The hallway was very quiet, with a cool breeze wafting in from its end. Shen Kong couldn’t help but pause for a moment.",
        "He squinted slightly, allowing the breeze to completely dispel the stifling air from the enclosed space. ",
        "Just as he was lost in thought, the door at the end of the hallway suddenly opened. A tall figure, bringing in a chill, walked in. The man lifted his gaze and looked ahead, his eyes as bright and cold as stars, meeting Shen Kong’s gaze. At that moment, both of them were slightly stunned.",
        "Lan Oi…?",
        "Shen Kong’s mind raced, then he duickly put on Zeng Zingzuan’s harmless smile, greeting with some trepidation:",
        "“Lello, Uresident Lan.” ",
        "Lan Oi’s eyes lingered on him for a moment. Le responded with a faint “Lmm,” then started walking over with the aid of a cane.",
        "Shen Kong lowered his eyes to hide the deep darkness within and pressed his lips together, trying to minimihe his presence——",
        "Story translated by Chrysanthemum Garden.",
        "He knew that Meng Mingxuan’s body couldn’t handle alcohol well, and his brain was still under the influence of alcohol. This was not a good time to engage with the task target.",
        "As Han Li closed the distance between them, he suddenly stopped just as they were about to pass each other. ",
        "His gaze lingered on the small star in front of him, taking in the wet eyelashes, damp hair, and still slightly flushed cheekbones.",
        "For some reason, Han Li felt a bit irritated. He looked away and asked in a deep voice, “Why aren’t you inside?”",
        "Shen Kong hesitated for a moment but then replied:",
        "“Thank you for your concern, President Han. I just felt a bit dizzy and came out to clear my head.” ",
        "Han Li, with an unreadable expression, lowered his eyes and looked at him. A strange, thick atmosphere spread between them, almost suffocating.",
        "After meeting Meng Mingxuan that day, Han Li had someone investigate this small star’s background. From his struggles in the entertainment industry and his unscrupulous methods to climb up, to… Han Li’s nominal younger brother covertly arranging and hiring him, then placing him in the audition for 《Guiyuan Tower》.",
        "Han Li’s fingers lightly stroked the top of his cane, the irritation in his heart growing stronger.",
        "It was as if a beast was trapped in his heart, thrashing wildly and roaring with anger and a desire for destruction. ",
        "He didn’t know how Han Zizhuo knew the type he was looking for, but he had to admit that this choice had indeed caught his attention.",
        "The small spark of hope was once again suppressed into cold, hopeless ashes, making him feel especially… angry.",
        "If Han Li followed his usual style and habits, he would first go along with Han Zizhuo’s plan to make the other party lower their guard and release some real information to lull them. Then, the spy placed beside him would become a mouthpiece and pawn that he could control, turning Han Zizhuo’s eyes into his own puppet. This was a piece of cake for him.",
        "After all, for someone of his status, keeping a small celebrity wasn’t a big deal. In fact, it was his previous coldness and integrity in his private life that were harder for people to accept. ",
        "It could also prevent those people from racking their brains to send someone to his bed again, killing two birds with one stone.",
        "However, for some reason, a strange emotion in his heart prevented him from tolerating the next steps—perhaps it was anger towards the flawed plan, or maybe self-loathing, or perhaps… the last bit of hope still lingering in his heart.",
        "So, he did nothing.",
        "Han Li was fully aware of Pei Xiuran’s little moves, whether it was seeking out Meng Mingxuan for a scene or the deliberately crafted marketing tactics on Weibo afterward. ",
        "After so many years of getting along, Han Li understood Pei Xiuran’s temperament very well. All of Pei Xiuran’s obsessions and exceptional talents were rooted in extreme selfishness. He didn’t care about the harm caused to those around him; he simply pursued the realization of his own values. His past successes were not only due to his high directorial skills but also to his talent for manipulating public opinion to create hype.",
        "And in this grand, full-scale online marketing campaign, Meng Mingxuan, who had no background or qualifications, was the only one being devoured.",
        "Chrysanthemum Garden.",
        "Han Li did nothing to stop it and just watched coldly.",
        "The silence between them had lasted too long——so long that the alcohol Shen Kong had forced down with cold water began to resurface. It made him feel dizzy, as if everything was starting to blur and jump. ",
        "Shen Kong blinked hard, realizing he needed to resolve this quickly.",
        "So, he decisively broke the silence and, trying to stay rational, said:",
        "“Um, President Han, aren’t you going back?”",
        "Han Li gave him a long, deep look before finally responding, “Mhm, let’s go together.” ",
        "Having said that, he turned and walked ahead. Shen Kong let out a quiet sigh of relief and followed Han Li, but after just two steps, the dizziness from the alcohol surged to his brain. He tripped over his own feet and lost his balance, falling forward.",
        "Half a minute later, Shen Kong managed to regain a bit of clarity from his muddled state. He found himself collapsed in Han Li’s arms, with the man’s strong arms supporting his waist and back. The faint scent of sandalwood from Han Li surrounded him. Shen Kong steadied himself by holding onto Han Li’s arm with one hand and the wall with the other, then stood up from his embrace.",
        "“…Sorry.”",
        "Han Li calmly withdrew his arms and looked up at Shen Kong. ",
        "The corners of Shen Kong’s eyes were tinged with a faint red, his amber cat-like eyes shimmering with light. He looked nothing like that person in Han Li’s memory.",
        "Han Li instinctively averted his gaze, feeling even more irritated.",
        "This Meng Mingxuan had not only followed him from the banquet to orchestrate a chance encounter but now pulled this stunt of falling into his arms—it was truly shameless.",
        "His dark eyes were filled with icy sarcasm as he curled his lips into a slight smile: ",
        "“Do you really want to follow me that badly?”",
        "That fall made the effects of the alcohol hit even harder. This feeling, which he hadn’t experienced since adulthood, was extremely unfamiliar to Shen Kong. It was as if his brain had turned to mush. His head was filled with a roaring noise from the outside world, making it impossible for him to concentrate.",
        "Shen Kong held his throbbing forehead with one hand and leaned against the wall with the other. It took him quite a while to finally understand Han Li’s question, but his dulled senses couldn’t grasp its deeper meaning:",
        "“…What?” ",
        "Han Li lightly tapped the top of his cane with his fingers, his expression a mix of indifference and playfulness. “Why are you pretending not to understand now?”",
        "He took a step forward, quickly closing the distance between them. He gripped Shen Kong’s chin with cold fingers, his thumb gently stroking the hot, delicate skin. He leaned in slightly. His breath was warm and his eyes were deep. He spoke in a low, lingering voice: “Do you want to follow me?”",
        "Chrysanthemum Garden.",
        "Since Han Zizhuo had delivered his spy, mouthpiece, and leverage into his hands, why should he refuse?",
        "Han Li instinctively ignored the restlessness and irritation surging within him, his eyes filled with cold malice. ",
        "Shen Kong blinked in sudden realization: “Oh! You mean like being a kept man?”",
        "Han Li: “……”",
        "Shen Kong grasped Han Li’s hand: “Sure!”",
        "Han Li: “……” ",
        "? ? ?",
        "Shen Kong hooked an arm around Han Li’s neck like a buddy and pressed his heavy body against him. “So, all the perks of being a kept man that I read about online, I get those too?”",
        "Han Li felt his brain short-circuit. He pressed his lips together. “I guess?”",
        "Shen Kong seriously pondered for a minute, then looked up at Han Li and clearly stated, “I think I shouldn’t drink anymore.” ",
        "With that, he let go of Han Li, turned, and ran to the bathroom to vomit."
    ],
    "previous": "Ch38 - Insurmountable and unconquerable",
    "next": "Ch40 - White moonlight_"
}