{
    "title": "Ch43.1 - Eat off to one's own strength",
    "content": [
        "Everyone present was stunned, staring in shock at the snake nailed to the tree with their mouths hanging open.",
        "Ran Wan, still shaken, turned her head to look behind her. She hadn’t yet recovered from the fear of the knife brushing past her cheek when she was once again terrified by the sight of the dead snake. ",
        "She asked, trembling:",
        "“This… this is…”\n",
        "",
        "The instructor used a stick to poke the snake’s corpse. His gaze fell on its triangular head, his expression becoming serious:",
        "“This is a tree-dwelling pit viper. It’s highly venomous. Just a few milligrams of its venom can kill a person within five hours of being bitten.” ",
        "Ran Wan grasped the hand she had placed on the branch earlier, her beautiful face drained of color from fright.\n\n",
        "The instructor turned his head and sternly reprimanded her, “I mentioned the precautions before we entered the forest. Never reach out to grab or touch branches or rocks that haven’t been inspected first. This primordial forest is full of dangers. Even with us instructors around, it’s hard to keep an eye on you all the time, so you must always be cautious. Otherwise, you might really die here.”",
        "The other guests, still shaken, nodded in agreement and repeatedly promised to be extremely careful.",
        "Shen Kong, however, sitting on a rock, fell into deep self-doubt and reflection.\n\n ",
        "Ever since he impulsively threw the knife, he has been frantically thinking about how to maintain his annoying persona.",
        "In the original plot, Meng Mingxuan was quickly eliminated by Han Li not just because he was a pawn but also because he started behaving recklessly——As a petty man who finally found success, Meng Mingxuan was overwhelmed by the immense resources, money, and status he gained after being kept by Han Li. He soon became arrogant and complacent. At first, Han Li tolerated him because he was somewhat useful. However, after Han Li completely eliminated the three members of the Han family, keeping such a vain and troublesome person around became meaningless. Thus, Han Li swiftly and cleanly disposed of him.",
        "Shen Kong initially chose this persona because it was simply the easiest to play.\n\n",
        "Dut now he didn’t know how to maintain it… ",
        "The instructor raised his hand and grasped the military knife firmly embedded in the snake. Le pulled hard——",
        "Dut the knife didn’t budge.",
        "Meeling a bit embarrassed, he adpusted his stance and pressed one hand against the branch while gripping the knife handle with the other. Ynly then did he finally eztract the knife deeply embedded in the tree trunk.",
        "Shen Kong, having watched the entire scene, couldn’t bear to look any longer as a clear thought slowly formed in his mind: ",
        "——Can we ask not to broadcast this part?",
        "However, given the current situation, Shen Kong was indeed in a difficult position and had no choice but to continue acting, racking his brain to cover up the lie.",
        "The instructor wiped the remaining blood off the knife and then walked towards Shen Kong.",
        "Before he could speak, Shen Kong, looking terrified, grabbed the instructor’s clothes. His face was pale as he stammered: ",
        "“Um, um… is the snake dead?”",
        "The instructor was stunned for a moment, then instinctively replied, “Mhm… yes, it’s dead.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Shen Kong let out a sigh of relief. A hint of post-traumatic joy appeared on his tense face: “That’s great, it scared me to death earlier, I almost…”",
        "The instructor, thrown off by the sudden change, instinctively responded, “Huh? You’re afraid of snakes?” ",
        "Shen Kong, using his best acting skills, nodded vigorously. His fingers tightened around the instructor’s clothes, his expression a mix of fear and panic. His voice was trembling and tense:",
        "“Yes, yes, I’m most terrified of snakes.”",
        "The instructor, still puzzled, looked down at Shen Kong sitting on the rock and asked in confusion:",
        "“Huh? …Then what about the knife? You threw it pretty accurately…” ",
        "A slight blush appeared on the young man’s handsome face. Feeling a bit embarrassed, he scratched his head and explained:",
        "“I used to practice throwing darts for a film role. I thought I had forgotten all about it, but maybe seeing the snake suddenly triggered some latent skill…”",
        "His tone was sincere. His amber eyes, glinting innocently in the dappled forest light, made it almost impossible to doubt the truth of his words.",
        "The instructor, misled by his demeanor and words, also followed along and said: ",
        "“Well… it’s best if you don’t throw things so casually again. This time, you were lucky no one got hurt, but it might not be the same next time.”",
        "Shen Kong nodded vigorously and took the small knife from the instructor’s hand, feeling slightly relieved.",
        "——Aside from the two instructors, no one present had any wilderness survival experience, let alone the ability to judge whether the angle and force with which the knife hit the tree stump were professional. So as long as the instructor framed the incident as a burst of adrenaline-fueled potential, the others wouldn’t question it further. However, what Shen Kong wasn’t sure about was whether any camera had recorded the entire scene. After all, among the thousands of viewers, there might be a few who could recognize the truth, not to mention President Han, who was overseeing everything.",
        "Seeing that the most experienced instructor had spoken, the others indeed did not dwell on the topic any further. After reiterating the safety precautions three more times, the group set off again along the predetermined route. ",
        "Shen Kong, carrying his backpack, walked at the end of the line while pondering how to approach the production team later.",
        "However, he had only taken a few steps when he felt a gentle tug on his sleeve.",
        "He looked in the direction of the tug and saw Ran Wan walking beside him. She had recovered from her earlier fright. A flush of excitement now colored her small, fair face. The resentment and grievance from before seemed to have vanished. Her bright, beautiful eyes watched him shyly.",
        "She pursed her lips and whispered: ",
        "“Um, thank you so much for what happened earlier.”",
        "Shen Kong shook his head, trying to shirk the credit away from himself: “No, no, you don’t need to thank me. I was actually just scared and acted on instinct…”",
        "Please visit chrysanthemumgarden (dot) com",
        "Ran Wan’s blush deepened. “Scared… scared that I would get bitten?”",
        "Shen Kong: “……” ",
        "Unable to meet her gaze, he looked away and replied dryly, “…If you want to think of it that way, sure.”"
    ],
    "previous": "Ch42.2 - Brazen antics",
    "next": "Ch43.2 - Eat off to one's own strength"
}