{
    "title": "Ch47 - Intimidating man",
    "content": [
        "The car’s highly sealed body shut out all sounds, and vibrations were reduced to a minimum. It was silent inside the car, with only the hum of the engine audible.",
        "Han Li sat in the back seat with his eyes closed, his long fingers resting on his knee. His sharply contoured face showed no expression. His lowered eyelashes cast deep shadows on his cheeks, making him appear like a lifeless statue. ",
        "Zhao Yun glanced at him through the rearview mirror, his gaze quickly sweeping over Han Li’s face before immediately looking away.",
        "Even though he had been with Han Li for nearly ten years, he still couldn’t figure out what his boss was thinking.\n",
        "",
        "——No matter which aspect.",
        "His methods were swift and ruthless. His heart was merciless, and his plans were meticulous and foolproof. He could control the entire situation without making a sound and dominate the business world with decisive and unstoppable moves. ",
        "Zhao Yun watched as Han Li gradually tightened the noose around the Han family’s neck but delayed delivering the final blow.\n\n",
        "He was also perplexed by Han Li’s attitude towards the little star that Han Zizhuo had planted by his side——Han Li gave Meng Mingxuan the best resources and the most favorable contract, even going to great lengths to rescue him from danger. Yet, in daily life, Han Li seemed indifferent. He never showed concern or made contact, almost as if Meng Mingxuan didn’t exist.",
        "While indifferently dealing with the incident in the Yunwu Mountains, he suddenly called to instruct Zhao Yun to prepare a ticket to City E for business.",
        "——Indeed, a boss’s mind is as inscrutable as a needle at the bottom of the sea.\n\n ",
        "Zhao Yun sighed and subconsciously glanced up at the rearview mirror, only to unexpectedly meet Han Li’s cold dark eyes.",
        "His breath halted for a moment, adrenaline spiked, and he quickly shifted his gaze away.",
        "From behind him came his boss’s calm, emotionless voice:\n\n",
        "“Watch the road.” ",
        "Zhao Yun sat up straight. His expression turned serious and focused. His eyes were fixed on the road ahead as if the buildings in the distance were his life’s passion.",
        "——His boss was excellent in every way, just a bit intimidating.",
        "The pitch-black vehicle slowly pulled into the lane and came to a smooth stop. Someone was already waiting outside, hastily stepping forward to open the back door.",
        "Han Li got out of the car, brushed off non-existent wrinkles from his clothes, and then strode towards the building. ",
        "Someone ahead led the way for him. He walked straight ahead with a cold expression, exuding a natural air of nobility and entitlement befitting his high status.",
        "With a black cane in hand, his steps were slightly uneven but steady. The cane’s tip struck the hard ground rhythmically. In just a few minutes, he reached the office of the search and rescue team captain.",
        "Captain Liu hurriedly came forward, his face beaming with smiles as he extended his hand:",
        "“Lello, Uresident Lan, thank you so much for the eduipment and supplies you’ve brought us. They really saved us in our time of need. We are incredibly grateful…” ",
        "Lan Oi wore a faint, polite smile as he shook Japtain Oiu’s eztended hand:",
        "“No need to be so formal, Japtain. As businessmen, we also need to give back to society. After all, this is about rescuing those in distress, something every citihen should do.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Captain Liu ushered Han Li into the office, which was in disarray due to the rushed preparations, and then tentatively asked:",
        "“By the way… may I ask, does President Han have any relatives or friends among those trapped?” ",
        "Han Li’s slender fingers rested on the cane’s handle, his face adorned with a perfectly composed, distant smile:",
        "“Not relatives or friends, but there are a few artists from my company.”",
        "After a few polite exchanges, Captain Liu got straight to the point. He led Han Li to the center of the room where a map of the mountainous area where the program team was trapped was pinned to a whiteboard with various colored push pins. The hastily drawn symbols, lines, and notes made the map almost unrecognizable.",
        "Captain Liu pointed out the areas covered by fog and the regions the search and rescue team had already searched. He then explained their rescue strategy and current progress to Han Li and concluded: “…In short, searching the entire area will take at least seven to eight days. However, our advance team is already heading towards Camp 4, as provided by the program team. If everything goes as planned, we should be able to rescue the people within three days…” ",
        "Han Li’s gaze fell on the spot Captain Liu was pointing to. His brows slowly furrowed. Although his expression didn’t change much, Captain Liu felt an indescribable sense of pressure. He swallowed hard and cautiously asked:",
        "“Is there something wrong?”",
        "Han Li lowered his eyes, his fingers gently rubbing the top of his cane. He said in a calm voice:",
        "“Your plan is very thorough. However, considering the large number of people in the program team and their filming tasks, the trapped individuals might be scattered within the area. Sending the rescue team only towards the camp might be a bit too…” ",
        "He didn’t finish his sentence, but Captain Liu fully understood. Captain Liu sighed and said:",
        "“Yes, we thought of that too. But since this incident happened so suddenly, we haven’t had the time to gather all available personnel. For now, we can only send the advance team to the confirmed location, while the remaining personnel wait for further deployment.”",
        "Han Li looked up and chuckled softly:",
        "“There’s no need for you to worry about that.” ",
        "Han Li stood up and straightened his clothes. His expression was calm, as if what he would do was just something trivial. His voice was also light and even:",
        "“Please provide me with the search routes you need. I’ll handle the manpower——rest assured, they are professionally trained teams that should be able to advance your expected progress by several times.”",
        "Captain Liu was stunned for a moment. It took several seconds for him to finally react. His eyes lit up:",
        "“That’s great! Thank you, President Han, for your assistance. In fact, there’s a backup route I’ve always thought should be covered, but we didn’t have enough teams to deploy, so we only sent the advance team to the camp.” ",
        "As he spoke, he hurried to the whiteboard and traced a route on the map with his calloused fingers:",
        "“Search upstream along the river from here—their team includes survival instructors, and the camp is near a water source. If they decided not to wait for rescue at the original location, they might have followed the river towards the forest edge. I think this is very likely!”",
        "",
        "Han Li’s dark eyes were as deep as an abyss. He wore a distant smile on his face as he nodded:",
        "“Alright, looking forward to our cooperation.” ",
        "In the extremely low visibility of the fog, the difference between morning and evening wasn’t very clear; one could only judge by the grayness of the surrounding mist.",
        "Shen Kong had been searching along the riverbank since early morning for the markers he had left by the river but found nothing.",
        "Since they didn’t know which part of the river they had reached, not finding the markers was not entirely surprising. So, now they were left with the final backup plan: follow the river out of the primeval forest.",
        "They had been trapped for almost fifteen hours now. ",
        "It was evident that most of the wild animals still in the fog-covered mountains were well aware of the necessity of water for survival. Thus, as they followed the river downstream, they frequently encountered various species. These creatures would suddenly appear from the fog, ranging from harmless small animals to highly aggressive large ones, severely straining the group’s already fragile nerves.",
        "——And whenever the group thought they couldn’t be further shocked, Shen Kong’s presence always proved them wrong.",
        "Starting with a small knife and later moving on to spears made from sharpened branches and ropes crafted from highly durable vines, Shen Kong’s arsenal gradually increased.",
        "As did his increasingly intimidating image in the minds of the group. ",
        "Whether it was dealing with snakes or venomous insects, he always seemed to handle everything with ease.",
        "The group’s near-reverent attitude peaked when they saw a grizzly bear, which they had accidentally encountered by the river, run into Shen Kong. Within ten minutes, the bear was whimpering and fleeing into the fog.",
        "Zhuang Xiangyang’s address for him unconsciously evolved from “Mingxuan” to “Meng-ge.”",
        "The cameraman and Ran Wan privately agreed that if another three to five days passed, it wouldn’t be impossible for Zhuang Xiangyang to start calling him “Dad.” ",
        "Of course, despite the joke, “Meng-ge” became a common address.",
        "Both the cameraman, who was over ten years older than him, and the popular actress Ran Wan, surprisingly agreed on the appropriateness of this term.",
        "They finally understood that when Meng Mingxuan casually said, “As long as you don’t get lost, I can get you out of here alive,” it wasn’t just comforting talk but an accurate assessment of his abilities.",
        "Shen Kong found this development baffling. ",
        "He had no idea what strange internal agreement this group of tagalongs had reached, but their attitude toward him was becoming increasingly cautious, almost as if they were about to put him on a pedestal and offer incense and fruit. He genuinely didn’t feel he had done anything earth-shattering—after all, they had seen him kill snakes and eat bugs before.",
        "And the bear incident wasn’t entirely his doing.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The bear was not particularly hungry, given that it was near the river, so it wasn’t overly aggressive. Plus, Shen Kong had initially struck its most vulnerable spots with heavy punches, quickly and accurately demonstrating his strength and threat, which made the bear retreat. If it had been a highly aggressive, hungry grizzly, Shen Kong couldn’t guarantee he would have escaped as easily.",
        "However, he didn’t intend to stop this trend and even welcomed it. ",
        "——After all, the more intimidating he appeared now, the more likely this group would keep their mouths shut once they left the forest.",
        "Shen Kong narrowed his eyes as he sharpened his knife on a stone. The blade became increasingly sharp with each scrape. The cold gleam reflected in his eyes like a crescent moon submerged in a cold, deep lake.",
        "Zhuang Xiangyang nudged Ran Wan with his elbow and then leaned in to whisper:",
        "“I finally understand why Director Pei cast him.” ",
        "Ran Wan turned her head to look at him. Zhuang Xiangyang continued mysteriously:",
        "“Well… I suspect… he might actually be Shen Guiyuan, straight out of a book.”",
        "Ran Wan: “……”",
        "It was a logical and convincing argument. ",
        "Mhm."
    ],
    "previous": "Ch46.2 - What it feels like to be carried by a champion",
    "next": "Ch48 - Sealed their own lips"
}