{
    "title": "Ch49 - Care",
    "content": [
        "The lead rescue team member was evidently stunned for a moment, seemingly not expecting to directly encounter the trapped individuals in need of rescue. After a few seconds, they finally reacted. They belatedly rushed forward, wrapped them in clean blankets that had been prepared in advance, and then hurriedly escorted them down the mountain.",
        "The mountains were already damp and cold. The heavy fog and dew had long since soaked their clothes, leaving them cold and sticky. Now, finally wrapped in clean, warm blankets and with hot ginger tea in their hands, they almost felt an unreal sense of happiness. ",
        "One of the rescue team members tightened the blanket around Shen Kong and said gently:",
        "“The temporary medical station is just at the foot of the mountain. We will take you there now. Your other members have already been rescued, so don’t worry.”\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The handsome young man in front of him showed a look of gratitude. His thin shoulders trembled slightly under the blanket due to the cold:",
        "“Th–Thank you all so much. If it weren’t for your timely arrival, we wouldn’t have known what to do. We were really about to despair. Thank you so much.” ",
        "Under that sincere gaze, the rescue team member felt his vanity greatly satisfied.\n\n",
        "He coughed lightly, shook his head, and said:",
        "“Not at all. It’s also thanks to your correct decision to follow the river downstream that we were able to find you so quickly. According to our original rescue plan, it would have taken over a week.” He spoke with a look of amazement on his face, “Actually, we’re already very close to the foot of the mountain. I really didn’t expect you to make it all the way here.”",
        "Meng Mingxuan showed a surprised expression:\n\n ",
        "“We actually walked that far? Oh my god!”",
        "He instinctively shrank his shoulders, still somewhat fearful: “Luckily, Xiangyang suggested we go to the riverside to complete the task. So when the fog set in, we were already close to the river. Even when we couldn’t see anything, we could still find the river by following the sound of the water. At that time, when the cameraman uncle suggested we follow the river downstream, I disagreed… Thankfully, everyone persuaded me. Otherwise, I would have wanted to stay put and wait for rescue.”",
        "The rescue team member patted his shoulder reassuringly:\n\n",
        "“You’ve been through a lot. Rest well once we reach the foot of the mountain.” ",
        "As he spoke, he naturally looked up and suddenly met the indescribable gaze of the other trapped individuals.",
        "Such complex and shocked looks were so intensely focused on him that the rescue team member felt a chill down his back and began to stutter:",
        "“W–What’s wrong?”",
        "Everyone’s eyes instinctively glanced at Shen Kong, who was sitting nearby. His delicate and pale face still showed the vulnerability from earlier. His light-colored eyes swept over indifferently, making everyone’s scalps tingle. They rushed to respond: ",
        "“Nothing, nothing! Everything’s fine!”",
        "“We’re just too excited to be rescued suddenly!”",
        "“Yes, yes, yes.”",
        "“The situation is exactly as Meng-ge… Mingxuan said. It’s completely true!” ",
        "The rescue team member, a bit puhhled, withdrew his gahe, momentarily suspecting that these celebrities had been trapped in the mountains for so long that they were a bit out of their minds.",
        "At that moment, another person walked over directly to Shen Kong’s side and asked kindly:",
        "",
        "“Are you Zr. Zeng?”",
        "When Shen Kong first encountered the rescue team, he noticed that this team was different. Although they were all wearing the same uniforms, it was obvious they were made up of two distinct groups. The group led by the previous rescue team member consisted of ordinary people with varying physiques and conditions. In contrast, the other group was completely different. They maintained a standard operational formation even while advancing through the fog, their gazes alert and well-trained. The difference between the two groups was stark. ",
        "Shen Kong pulled the blanket tighter around his shoulders, a puzzled expression on his face:",
        "“…I am.”",
        "The person nodded to him: “Alright, since you’re safe, we’re relieved.”",
        "After saying that, he was about to turn and leave when Shen Kong called out to him: ",
        "“Sir, wait. What do you mean…?” Shen Kong furrowed his brows slightly, paused, and then continued, “Did someone ask you to ensure my safety?”",
        "The man paused, somewhat surprised, and said:",
        "“Yes, we are a private organization commissioned by President Han. The primary objective of this mission is to ensure your personal safety. You should be able to meet him once you get down the mountain.”",
        "Han Li…? ",
        "Shen Kong watched the man’s departing figure, the furrow between his brows deepening. His expression was inscrutable.",
        "Moreover… According to what he said, Han Li not only hired a professional team to search for him but even came to City E himself?",
        "Why?",
        "He admitted that in the previous timeline, he had underestimated this target by thinking he was too harmless. Based on his current understanding of Han Li and his character traits in the original storyline, Shen Kong didn’t think Han Li would be the type to care so much about a minor celebrity he had only met twice at an audition and a launch party. Even if it was to mislead Han Zizhuo, it didn’t seem necessary to go to such great lengths and personally come to City E to oversee the rescue process. ",
        "Such excessive concern would only seem overdone, potentially arousing suspicion from Han Zizhuo’s side.",
        "Furthermore, the previous conversation with Tang-ge had almost entirely ruled out the possibility of a substitute white moonlight. Even in the original storyline, Han Li never cared about “Meng Mingxuan,” let alone going to such trouble for him.",
        "Then there is only one possibility…",
        "Han Li has likely begun to suspect his identity. ",
        "And since the system’s warning hasn’t sounded, nor has it immediately transported him away, it means Han Li’s suspicion remains at the level of mere thought without any substantial evidence.",
        "Shen Kong lowered his eyes, his long lashes casting shadows on his paper-white face. His calm gaze fell on the thermos cup he was holding. The dark brown ginger tea inside rippled slightly, reflecting his eyes.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He felt that although he wasn’t particularly skilled in disguises, he was good enough to fool ordinary people. Even those who had known the original host never sensed anything amiss. Yet Han Li, having met him only twice, had already started to suspect him. It was truly unimaginable.",
        "Shen Kong didn’t know when he had slipped up. ",
        "But he knew that his target was wise and cunning enough to see through the flaws in his disguise and had enough resources and means to get whatever he wanted.",
        "In this situation, Shen Kong not only needs to ensure that Han Li doesn’t obtain any substantial evidence but also must complete those two life-or-death main tasks.",
        "It’s very tricky.",
        "However… while feeling troubled, another question lingered in Shen Kong’s mind, baffling him. ",
        "Why does Han Li care so much?",
        "Is it simply because he suspects that Shen Kong, Cheng Chen, and that kidnapper are the same person, that it’s worth sending someone to find him and personally supervising the operation?",
        "Shen Kong didn’t consider himself a good person. His previous attitude towards Han Li also might have been… less than attentive.",
        "But after all, he did save Han Li’s leg and the old housekeeper’s life. They shouldn’t have any deep-seated hatred worth remembering for eight years, right? Why go to such lengths to capture him alive? ",
        "Shen Kong’s expression suddenly became peculiar.",
        "Could it be that he likes me?",
        "Impossible. Their total time together didn’t even add up to three months. Even if it was a fleeting crush in youth, it shouldn’t last eight years!",
        "Besides, hatred is often more enduring and intense than love. This possibility seems less plausible than the deep-seated hatred idea. ",
        "After careful analysis, Shen Kong dismissed this guess from his mind.",
        "He smiled somewhat self-deprecatingly and took a sip of his ginger tea.",
        "——It must be Tang-ge’s white moonlight theory and the romantic plots in the original story that have made his way of thinking strange.",
        "The sky gradually darkened. ",
        "A faint light shone through the gaps of the temporary rescue tents at the foot of the mountain. The shadows of people moving inside could be vaguely seen through the fabric from outside.",
        "The inside of the tent was somewhat cluttered, with a large map of the mountain area pinned to one side. On the table in the middle of the tent, countless documents and drawings were scattered messily. All the coordination and planning of the rescue routes were done on this table.",
        "Chrysanthemum Garden.",
        "Han Li, with his eyes lowered, had his gaze fixed for a long time on the somewhat chaotic drawings. Captain Liu continuously explained the current rescue progress in his ear.",
        "He responded occasionally, either by asking questions or making suggestions. ",
        "As time went on, Captain Liu couldn’t help but feel a bit surprised.",
        "He originally thought he would have to explain many terms and the geography of the Yunwu Mountains to this important figure in front of him, but to his surprise, the other party could seamlessly follow his line of thought and even offer many constructive suggestions, as if his understanding of the area was no less than his own.",
        "Captain Liu quietly glanced at Han Li on the other side of the table.",
        "Han Li’s expression was calm and composed. His dark eyes were tranquil, seemingly not very worried. Yet he had specifically come to the command tent to understand the situation and bring supplies to support the rescue team. ",
        "Captain Liu finally couldn’t hold back and asked again:",
        "“Um… among the people trapped in the mountains, are there really none of your relatives or friends?”",
        "Otherwise, he couldn’t believe that such a matter would concern such a busy and important person so much.",
        "Han Li looked up at Captain Liu. But before he could speak, the tent was lifted. Someone, exuding cold air, came in. It was the captain of the support team brought by Han Li. ",
        "“Report, the second batch of trapped individuals has been found.”",
        "Han Li stood up abruptly, a crack seeming to appear on his indifferent and composed face, revealing a trace of unstable emotion:",
        "“Rescued?”",
        "“Yes, including Mr. Meng, all unharmed.” ",
        "Before Captain Liu could say anything, Han Li, supporting himself with a cane, strode out of the tent and disappeared within seconds.",
        "Captain Liu: “……”",
        "Although Han Li didn’t answer, Captain Liu felt that his previous question had just been answered."
    ],
    "previous": "Ch48 - Sealed their own lips",
    "next": "Ch50 - Leg injury"
}