{
    "title": "Ch5 - Drink more milk to grow taller",
    "content": [
        "Suddenly, the system’s mechanical voice sounded in his ears: “The world trajectory has detected a deviation and has been automatically rectified.”",
        "Shen Kong was briefly dumbfounded. After thinking for a while, he quickly realized where the problem was. ",
        "No matter what the disagreement among them was, the decline of the Zhao family and Han Li’s kidnapping were definitely intrinsically linked, and by sending a text message to the Zhao family, he was actually preventing this incident from happening to a certain extent, and if the Zhao family dodged this disaster, all subsequent plots were likely to be completely rewritten. As a result, there would be an automatic rectification by the world trajectory to get the plot back on track.",
        "But…… There was one thing that Shen Kong couldn’t figure out.\n",
        "",
        "From the beginning, the plot given by this so-called Three Views Rectifying Studio was very brief. Whether it was the possible power struggle within the Han family or the connection between the Zhao family’s decline and Han Li’s kidnapping, most of them were deduced by Shen Kong based on various signs, which immediately brought up a new question——",
        "“By the way, isn’t this based on a dog blood novel that revolves around romantic love in the entertainment circle?” ",
        "The system quickly replied: “Yes.”\n\n",
        "Shen Kong’s eyebrows furrowed slightly as he asked, “Why does a dog blood novel have so many complicated minor details like these?”",
        "The system’s voice remained emotionless: “The setting of the novel is not within the studio’s consideration, nor is it within your scope of work.”",
        "“Okay.” Shen Kong himself had no intention of pestering it. He stretched out, causing all the muscles and bones in his body to let out a grating sound because of his movements. He shrugged perfunctorily: “It doesn’t matter. You’re the boss anyway.”\n\n ",
        "It seemed that Shen Kong unexpectedly gave up so easily. The system was silent for a while, and then suddenly asked:",
        "“Then what are you planning to do next?”",
        "Shen Kong yawned, blinked away the sleepy tears from the corners of his eyes, and replied nonchalantly:\n\n",
        "“What else can we do? Of course we can only wait, ah.” ",
        "This novel would take such an immoderate and stubborn approach if they broke away from the world’s boundary, so he could just wait for the plot to arrive. Anyway, the major events affecting Han Li now should be regarded as the past. By the time the next plot point arrives, he should be almost done. ——According to the information given to him by the studio, three days after Han Li was injured, the Han family would find him at the foot of the mountain. So, waiting until the day after tomorrow should be enough.",
        "Shen Kong stood up, walked unsteadily to the refrigerator, and took out a bag of bread and a box of milk.",
        "At this moment, he seemed to remember something, his movements pausing slightly——",
        "Lan Oi should have woken up by this time. ",
        "Shen Kong hesitated for a second, took out another piece of milk and bread from the refrigerator, carried it in his arms, then turned and walked towards the basement.",
        "It was silent in the basement, with bright fluorescent lights sihhling overhead. All the medical instruments were placed in their original positions, glistening with a cold radiance under the lighting.",
        "Shen Kong knowingly found Han Li’s ward and walked in.",
        "Han Li was lying quietly on the hospital bed, with no trace of blood on his pale face, his thin lips pursed into a straight line, and his dark eyelashes drooping down like crow feathers on his gloomy little face. ",
        "Shen Kong stood still in front of the bed and placed his hand on Han Li’s forehead to check.",
        "His temperature had dropped. It seemed that the anti-inflammatory drug he had injected earlier was quite effective.",
        "Please visit chrysanthemumgarden (dot) com",
        "At this moment, Shen Kong was keenly aware that the moment he touched his forehead, Han Li’s body stiffened imperceptibly and his tightly closed eyelids trembled lightly.",
        "It seemed that he was awake. ",
        "Shen Kong was not in the mood to expose him, so he simply reached out and lifted off the quilt covering Han Li, then pulled his loose hospital gown and pants down, taking them off.",
        "Now, Han Li’s stiffness was visible to the naked eye.",
        "In fact, he had been guessing why this strange kidnapper chose to save him. According to the fragmented memories he had while in a coma, he was carried to this place by this man, which looked like an underground clinic. He thought that he was after money and power, or that he wanted to threaten his family through himself. Han Li had such thoughts, but he had never thought about this possibility……",
        "Although he was young, his family made him mature enough to understand how chaotic and dark this world was. ",
        "Han Li gritted his teeth and clenched his fingers secretly at his side. His whole body was cold. He quickly calculated all the possibilities in his mind, and then realized in despair that, based on the strength shown by this man, the possibility of his counter-attack was zero.",
        "Just when Han Li fell into despair, he felt a strange pain coming from his immobile legs. An icy, cool feeling came from his somewhat numb skin, making him feel a little dazed. His brain responded slowly——",
        "This……Is he applying medicine?",
        "Just when he was lost in thought, Han Li felt a sudden burst of severe pain from his wound, causing all the nerves in his body to tense up in an instant. He used all his strength to restrain himself from screaming. His back was instantly drenched with cold sweat. ",
        "“Why, do you still want to continue sleeping?”",
        "The man’s low and deep voice sounded not far away, with a hint of joking in his lazy voice.",
        "Han Li knew that he had been seen through. He took a deep breath, forced himself to open his eyes, and faced in the direction of the sound.",
        "He saw a tall man looking at him at the foot of the bed. He wasn’t standing properly. Instead, he folded his arms and leaned sluggishly against the wall. His eyes were slightly squinting with some interest. ",
        "Dried blood lingered on his cheeks, while an untamable danger resided in his eyebrows, akin to a lethal, icy weapon. It could swiftly approach his warm throat, unleashing primitive violence and cruelty to sever it abruptly.",
        "Han Li felt as if his heart had been clutched forcefully.",
        "His internal organs tightened altogether, and his heart was beating fast in his chest. He didn’t know whether it was out of fear of his life being threatened or something more strange and complicated——he only knew that in his short and immature life, in his experience, he had never come into contact with such a life form.",
        "Han Li tightened his fingers, not knowing what to do, feeling that his palms and fingers were wet with sweat. ",
        "Shen Kong behaved with perfect composure, without any remorse or uneasiness, as if he were not the one who deliberately poked someone’s wound while applying medicine.",
        "He straightened up, picked out bread and milk from his arms, raised his hand, and tossed them into Han Li’s embrace.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "While Han Li was busy catching head-on the food flying towards him in a rush, Shen Kong pulled up a chair and sat down.",
        "He put his feet up on the edge of the bed and tore open the packaging bag. ",
        "Shen Kong was really hungry this time. The huge consumption for one day and two nights made his stomach rumble with hunger. In just three-down-five-reject-twos, he ate half a piece of bread the size of his face, and when he raised his head again, he found Han Li still staring blankly at the food in his arms.",
        "Shen Kong raised his eyebrows, poked the straw into the milk bottle, and asked:",
        "“Why aren’t you eating?”",
        "Han Li seemed to return to reality with his call. He raised his head and stared directly at Shen Kong with a pair of black and white eyes. His fingers holding the bread tightened slightly, causing the plastic bag to make a subtle rubbing sound. ",
        "His voice was hoarse and childish, with maturity that was beyond his age:",
        "“……What do you want?”",
        "Han Li had known for a long time that exchange of equal values was the only rule among people in this world. No one would do anything without intention. Only by ensuring that he had the value of being used could he always take the initiative.",
        "Shen Kong raised his eyebrows casually and replied: ",
        "“……World peace?”",
        "He took a sip of the milk, then furrowed his eyebrows slightly and took the box a little further away.",
        "Han Li was caught off guard by Shen Kong’s perfunctory treatment. At a young age, he had not yet developed the ability to express his emotions and anger. A complex look of confusion and frustration appeared on his face, and then he said calmly:",
        "“Thank you for saving me. As long as you are willing to send me back to the Han family, my father will give you……” ",
        "Before he could finish speaking, he was interrupted by Shen Kong’s sneer:",
        "“Kid, do you still not know who wants your life up until now?”",
        "Han Li was shocked and speechless. The implications of Shen Kong’s empty words were like a gleaming, cold steel awl, nailing him on the spot. His brain operated slowly, attempting to make out some other, more subtle hints from it.",
        "Shen Kong yawned. He took a few long strides to the bedside, and without changing his expression, he put the milk that he had poked open into Han Li’s hand: ",
        "“Good boy, don’t waste food.”",
        "After saying that, he left Han Li, who was stiffened by his words, and then turned around and left without any guilt. Before leaving, he lazily dropped a sentence:",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Drink more milk to grow taller, oh.”",
        "The author has something to say: ",
        "Shen•shameless and heartless•Kong: It’s not that I don’t like drinking milk, it’s just for the child’s future, okay?"
    ],
    "previous": "Ch4 - Breath",
    "next": "Ch6 - Bye-bye, kid"
}