{
    "title": "Ch53 - Reward",
    "content": [
        "The moment he recognized that cane, Shen Kong couldn’t help but feel a chill in his heart.",
        "Apart from that photo of him returning at the airport, Shen Kong had never seen Han Li carry it with him, whether during their interactions or through media interviews and candid photos. ",
        "…Did something happen?",
        "There had been no major fluctuations in market trends or public opinion during this period. Han Li and the Han family enterprises had no significant movements either. Everything appeared calm. However, given his current extremely marginal position, it was incredibly difficult to truly understand the internal situation. This left Shen Kong in a very passive position.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "It seemed like he had to do something.",
        "Shen Kong turned and quickly walked toward Han Li, who was standing under the corridor pillar. His wide cloak, which he hadn’t yet changed out of, billowed with his steps like rolling clouds caught in a strong wind. ",
        "As the distance between them shortened, Han Li’s face, hidden in the shadows, gradually became clear.\n\n",
        "He looked calm, his eyes deep and black. His slender fingers held a lit cigarette as he steadily watched Shen Kong approach.",
        "Shen Kong wore a surprised smile on his face:",
        "“…President Han? Why have you suddenly come to the set? Are you here to see Director Pei?”\n\n ",
        "Han Li did not correct Shen Kong’s form of address. He simply took a slow step forward, revealing his sharply defined face under the bright light. It made him appear even more strikingly handsome. The deep pupils of his eyes held a faint, sinister menace, though it was somewhat softened by the faint smile on his lips, which instead added a touch of mysterious allure.",
        "“I’m here for you.”",
        "The young man before him had bright eyes. His thin lips curled into a slight smile.\n\n",
        "“For me?” ",
        "Han Li lowered his gaze, his long eyelashes covering his dark eyes. His focused pupils reflected Shen Kong’s face, appearing half sincere and half indifferent:",
        "“Of course, I’m here to collect my reward.”",
        "——There’s a chance.",
        "Shen Kong’s spirits lifted. Although he didn’t know why Han Li suddenly changed his attitude, things were now moving in his favor. He had to seize this opportunity. As long as that mechanical voice hadn’t sounded, it meant that Han Li’s suspicions hadn’t been fully confirmed yet. There was still a chance. As long as he maintained his character without any collapse in the core narrative, and didn’t let the other party find any substantial evidence, he could even improvise a bit in non-critical areas… ",
        "After all, Shen Kong might not know how to please a sugar daddy as a kept little star.",
        "However, when it came to flirting, he was quite experienced.",
        "Shen Kong leaned slightly toward Han Li and quickly closed the distance between them to an intimate level. He raised his hand and lightly brushed away the ash from Han Li’s sleeve, his warm fingertips just barely grazing Han Li’s cold hand. His clear voice, slightly husky with a hint of grainy texture, carried a subtle implication:",
        "“Then… I wonder what kind of reward President Han likes?” ",
        "The thin skin over the young man’s gracefully contoured cheekbones blushed faintly under the light. Lis amber eyes gahed directly at Lan Oi without any evasion. Lis makeup was still on, with long, smooth eyeliner drawn upward. There was a faint, ambiguous smile on his lips. Lis gahe was as bright and intense as lava, carrying a casual teasing.",
        "There was nothing bewitching and seductive about it, yet Han Li’s heart couldn’t help but skip a beat.",
        "Chrysanthemum Garden.",
        "He discreetly leaned back slightly, as if to avoid the thick, ambiguous atmosphere in the air.",
        "Han Li shifted his gaze away from Shen Kong’s face, his voice remaining steady and calm: ",
        "“When does your part of the shoot end?”",
        "Shen Kong lowered his head and flipped through the script he had just received, somewhat surprised: “The first part of my scenes should be finished today. After that, I’ll wait for my next appearance…”",
        "He flipped through the pages, skimming the contents, and finally stopped after about ten pages:",
        "“…It’ll be next week.” ",
        "It looked like he could finally have a little break.",
        "Han Li nodded. “Alright, go change your clothes. I’ll pick you up at the entrance.”",
        "Shen Kong pretended to frown with difficulty and said hesitantly, “Even though I don’t have any scenes until next week, Director Pei… has scheduled a lot of classes for me… What do you think…?”",
        "Han Li clearly understood the hint in Shen Kong’s words. He gently stroked the tip of his cane: ",
        "“I’ll talk to him.”",
        "——Leaving the crew: mission accomplished.",
        "Shen Kong distanced himself from Han Li and showed an obedient smile. “Okay, I’ll go change my clothes and be right back.”",
        "He turned and quickly walked towards the assistant waiting not far away. The wide hem and sleeves of his robe fluttered with his steps like a bird about to take flight. ",
        "Han Li watched his departing figure steadily, then looked down at the cigarette burning between his fingers. Its tip glowed red intermittently.",
        "Just before it burned his fingers, Han Li extinguished it against the wall beside him, leaving only some gray ash falling softly from the short cigarette butt.",
        "Han Li’s words still carried a lot of weight.",
        "Before Shen Kong had even come out of the dressing room after changing his clothes, his manager sent a message informing him that all his classes for the next week had been canceled and that he should rest well. ",
        "Just as Shen Kong was about to put his phone back in his pocket, it suddenly started buzzing. He paused and looked down, his gaze fixed on the unknown caller displayed on the screen.",
        "His eyes darkened slightly as he answered the call.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Sure enough, Tang-ge’s familiar voice came from the other end of the line.",
        "Ever since Shen Kong came down from the Yunwu Mountains, Han Zizhuo’s people haven’t contacted him. This was the only call he had received in months. ",
        "Tang-ge’s instructions this time were very simple. They needed specific information about a plan that Han Li’s company was about to implement. Since other channels and resources couldn’t access such high-level information, they had to rely on Meng Mingxuan, who was placed in Han Li’s personal life as a chess piece and was quite favored.",
        "When Shen Kong tentatively refused, using the excuse that he hadn’t yet gained Han Li’s trust, the tone on the other end of the line immediately turned cold:",
        "“Don’t forget who your current resources and status come from. The only reason you have your current living conditions is because you are still useful to us—so you need to prove that you have this value, understand? Know who you can afford to offend and who you cannot.”",
        "After this almost threatening speech, Tang-ge’s tone softened again: ",
        "“Xiao Meng, don’t be fooled by President Han’s face and affection. What he really likes is your face that resembles his beloved’s. You need to understand your status and position, okay? Do you really think Han Li is exactly as he appears? If your affiliation with us is ever exposed, do you really think this ruthless President Han will let you off?”",
        "After these meaningful words, the call was disconnected.",
        "A few minutes later, Shen Kong’s phone buzzed twice. Several messages from anonymous senders arrived. When he opened them, they turned out to be several news reports, all about Han Li’s competitors who had tragically died in accidents. The blurred news images and the cold numbers and words all pointed to the same message——",
        "In all these “accidents,” Han Li’s company was the only beneficiary. ",
        "The methods used were all insanely ruthless and merciless.",
        "Shen Kong squinted slightly, his light-colored eyes reflecting an inorganic glimmer under the light. He subconsciously recalled the cane Han Li had with him today.",
        "If his eyesight hadn’t deteriorated over time, the cane in the airport photo from that shoot didn’t contain a weapon, but the one Han Li carried this time clearly concealed a lethal device.",
        "For self-protection? ",
        "The cane and the series of events mentioned in the news were evidently connected in some intrinsic way and likely had a subtle link to the document Tang-ge sent him to steal. Regardless of the reasons, beneath the calm surface of the current situation, there were turbulent undercurrents swirling and churning, stirring deep-seated tides and countercurrents. Something drastic must have happened during the time he was trapped with the crew, pulling the worldline closer to the original plot like gravity.",
        "Shen Kong remembered this scenario.",
        "On that starless, moonless night, the bullet that shouldn’t have appeared pierced through the car door’s metal and cunningly shot into Han Li’s knee.",
        "Shen Kong lowered his gaze, his long eyelashes veiling the complexity in his eyes. ",
        "He stuffed his phone into his pocket, bent down to tighten his shoelaces, then grabbed his backpack and walked out.",
        "Even Shen Kong himself didn’t realize that after receiving those news reports, he never once doubted that Han Li might truly be the mastermind behind it all.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Perhaps it was due to years of experience, or his keen intuition, or maybe he still subconsciously believed that Han Li was still that boy who sat on the stairs outside waiting for him to come home, pressing his burning forehead into the crook of his neck.",
        "This time, Han Li drove himself. ",
        "Shen Kong got into the passenger seat and closed the door, plunging the car into an almost eerie silence.",
        "Noticing Shen Kong’s slight frown, Han Li asked, “What’s wrong?”",
        "His voice was rich and deep, sounding especially magnetic in the quiet car.",
        "Shen Kong shook his head, his face already skillfully adopting Meng Mingxuan’s obedient and harmless expression. “Nothing, I just feel… you seem to really like these tightly sealed cars?” ",
        "Han Li withdrew his gaze and pressed a button with his long, distinct fingers. The sunroof slowly opened.",
        "The wind outside, carrying faint sounds, poured in.",
        "He started the car and, as the engine roared to life, said:",
        "“A habit from childhood.” ",
        "——Because of a lack of security?",
        "Shen Kong hadn’t had time to think further when he felt his phone in his pocket suddenly vibrate several times, as if someone was continuously sending him messages.",
        "He frowned and took out his phone.",
        "The screen displayed the most recent message from his manager: ",
        "Check the trending topics.",
        "A bit curious, Shen Kong opened Weibo and immediately saw the top trending topic:",
        "#Seven Days in the Wilderness Challenge Premieres Tonight#"
    ],
    "previous": "Ch52 - …Han Li_",
    "next": "Ch54 - Official launch"
}