{
    "title": "Ch56 - Why are you avoiding me?",
    "content": [
        "The elevator rose to the top floor.",
        "Following Uncle Xu’s guidance, Shen Kong helped Han Li to his room. The room, primarily in shades of gray, black, and white, appeared rather desolate under the cold lighting. The straight lines were full of geometric sense. The bed and pillows were without a single crease and exuded hardly any sign of life. Surprisingly, it was somewhat similar to the style of the room he lived in during his childhood. ",
        "He half-supported and half-carried Han Li to the bed, then turned around, ready to say something to Uncle Xu.",
        "But as soon as he turned, he found that Uncle Xu had already left at some point. He even considerately closed the door behind him before leaving.\n",
        "",
        "Shen Kong: “……”",
        "So, the old man must have misunderstood something. ",
        "He took a deep breath and looked down at Han Li, who was half-leaning against the headboard. His eyes were tightly closed, his long eyelashes casting shadows on his marble-like face, quiet like a doll. His breathing was steady and even. Apart from the strong smell of alcohol on him, there was no sign of drunkenness visible from his face alone.\n\n",
        "Shen Kong tried to pull down the arm that was hooked around his neck, but surprisingly encountered no resistance.",
        "He placed Han Li’s upper body on the pillow, then lifted his legs off the ground and onto the bed. Due to these actions, Han Li’s clothes became wrinkled. With his shoes and socks still on, he looked like a corpse lying on the neatly made bed.",
        "Shen Kong let out a long breath and straightened up, but was caught off guard when he met Han Li’s eyes.\n\n ",
        "Han Li’s eyes were pitch black. His pale face showed no expression. His gaze was deep and unfathomable, fixed on Shen Kong standing at the foot of the bed, unblinking and almost eerily.",
        "Unsure if Han Li was fully awake, Shen Kong took a cautious step forward and tentatively asked:",
        "“President Han, are you awake? Do you need anything?”\n\n",
        "Han Li remained silent and only continued to watch Shen Kong. A faint glimmer flickered in his eyes, reflecting the overhead light, or perhaps a shimmer from within his gaze. ",
        "Shen Kong took another step closer:",
        "“Do you want some water?”",
        "Han Li nodded.",
        "Shen Kong walked to the independent bar at the end of the room, found a glass, and filled it halfway with water. Then he returned to the bed. ",
        "He lifted Han Li and brought the glass to his lips.",
        "Before the rim of the glass touched Han Li’s lips, Shen Kong felt a strong force pull him downward. Caught off guard, he stumbled and lost his balance. He restrained his instincts to fight back and fell straight down.",
        "The water spilled.",
        "The glass slipped from his hand, rolled off the bed, and shattered on the floor. ",
        "From Shen Kong’s sleeves and collar to Han Li’s waist and abdomen, everything was soaked. Dark stains spread quickly across the bed sheets.",
        "Shen Kong pressed one hand on Han Li’s shoulder, while the other elbow barely supported him on the bed, creating a safe distance between their upper bodies.",
        "Please visit chrysanthemumgarden (dot) com",
        "However, this position made their legs entangled and close, with the spilled cold water causing their clothes to stick tightly to their bodies, almost eliminating any barrier. Shen Kong could almost feel the heat of Han Li’s alcohol-warmed skin. Feeling awkward, he tensed his jaw and slightly arched his waist and abdomen, trying to change the overly intimate position.",
        "But the next second, Han Li suddenly gasped softly. ",
        "Shen Kong stopped moving, his ezpression complicated. Le could clearly feel the change in a particular part of Lan Oi’s body.",
        "Le looked down at Lan Oi, who was framed between his arms.",
        "Lan Oi’s ezpression remained calm, without any hint of emotional fluctuation. Le stared unblinkingly at Shen Kong. If not for their close contact, Shen Kong might have thought Lan Oi’s earlier slip was pust his imagination.",
        "Han Li suddenly grabbed Shen Kong’s collar and pulled him down. “You’re back.” ",
        "His voice was calm and clear. Shen Kong’s heart couldn’t help but tremble slightly. But the next second, Han Li slowly frowned.",
        "“You’re not him.”",
        "Shen Kong sighed in relief and said in a soothing tone, “Yes, I’m not. So, can President Han let go of me now?”",
        "Han Li shook his head. “No.” ",
        "Han Li was particularly difficult to deal with when drunk. Shen Kong wasn’t sure if Han Li would remember any of this when he sobered up and didn’t dare to forcefully subdue him. Thus, they were stuck staring at each other in a deadlock.",
        "After a long while, Han Li slowly repeated what he just said:",
        "“You’re not him.”",
        "Shen Kong nodded helplessly. Before he could say anything, he saw Han Li’s lips move slightly as he continued to murmur: ",
        "“But… if you’re not…”",
        "His voice was very weak. If Shen Kong wasn’t close enough, he wouldn’t have caught the faint words from his throat: “…then why can’t I forget you?”",
        "Shen Kong’s heart suddenly tightened. For some reason, the honest and sincere confusion in those pitch-black eyes made him feel unable to look directly at Han Li.",
        "He raised his hand to cover Han Li’s eyes. ",
        "The soft and slightly ticklish sensation of Han Li’s lashes brushing against his palm as he blinked made Shen Kong a bit restless.",
        "Before he could decide what to do next, Han Li pulled down Shen Kong’s hand from his eyes. He then grabbed his collar, pulled him down, and lifted his head to kiss him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Shen Kong froze for a moment, then quickly propped himself up to avoid it.",
        "Han Li’s cold lips landed on his chin. ",
        "A layer of dark, aggressive intensity instantly clouded Han Li’s eyes, as if possessing a fierceness that wouldn’t relent. He gritted his teeth and said, “Why are you avoiding me?”",
        "Shen Kong looked down at him from above.",
        "Deep in Han Li’s pupils was a trace of piercing pain, like a wounded, desperate animal that wouldn’t let go once it bit down. “You’re always avoiding me. Whenever I get a little closer, you leave—whether it’s you or your illusion, even in my dreams, it’s the same. If that’s the case, then it would have been better…”",
        "——It would have been better if you’d never appeared in the first place. ",
        "He suddenly paused.",
        "Shen Kong’s expression was unreadable. His amber eyes were like a mirror devoid of personal emotion, clearly reflecting Han Li’s face.",
        "Han Li’s Adam’s apple moved slowly up and down. His tone suddenly became eerily calm:",
        "“No.” ",
        "He stared intently at Shen Kong. “I don’t want that.”",
        "Shen Kong suddenly leaned down and lightly touched Han Li’s lips.",
        "Han Li was first stunned, then fiercely responded and pressed against him as if finding relief after a long drought. Shen Kong’s warm hand cupped the back of his neck. His deft fingers gently pressed on Han Li’s neck.",
        "Han Li instantly lost consciousness. ",
        "Shen Kong lowered his gaze and stared at the peacefully sleeping Han Li in his hand. Then he gently placed his head on the pillow.",
        "Han Li’s eyes were closed, unaware of anything. His messy bangs made him look somewhat fragile and innocent, a quality he seemed to lack during the day.",
        "Shen Kong turned over and got out of bed. He stood by its side for a moment, then walked to the door without looking back and turned off the light.",
        "The room instantly went dark. ",
        "As he walked out and closed the door behind him, a soft whisper slipped through the door crack into the pitch-black room, like a sigh that could be blown away:",
        "“It will pass.”",
        "",
        "If he couldn’t complete his mission, he would be eliminated. And if he could complete it, he would return to his previous world.",
        "In either case, what Han Li sought would remain unfulfilled. ",
        "But everything would pass.",
        "——After all, no matter how deep the feelings, they cannot withstand the passage of time. No matter how intense the pain is, it will eventually fade.",
        "He will let go.",
        "Shen Kong was certain of this. ",
        "He didn’t look back into the room. He just slowly and gently closed the door, leaving the darkness behind it.",
        "The corridor was brightly lit. Unlike the luxury of the Han family’s residence, the decor here was extremely simple and cold, full of space and geometric sense. Shen Kong walked along the corridor. Just before he reached the stairs, his phone suddenly buzzed in his pocket.",
        "Shen Kong took out his phone.",
        "As expected, the screen displayed a message from an anonymous contact. It was Tang-ge urging him to seize the opportunity to steal the files. ",
        "Shen Kong chuckled softly and put the phone back in his pocket.",
        "But after taking just a few steps, he changed his mind, turned around, and headed towards the study on the same floor.",
        "Surprisingly, the study door was ajar.",
        "Shen Kong slipped into the room quietly. Using the faint light from the corridor, his night-vision accustomed eyes scanned the room sharply and spotted at least three cameras from different angles. However, it wasn’t a big problem. As long as he hacked into the closed-circuit surveillance and looped the previously recorded footage, everything would be fine. ",
        "He turned on the light, walked easily to the desk, and casually flipped through the folders stacked on it.",
        "Scanning the documents rapidly, Shen Kong’s brows gradually furrowed.",
        "He had almost figured out some clues. Combining these with the original storyline, he could deduce quite a lot of things.",
        "——At least several months ago, Han Li had already identified the fatal weakness that could destroy the Han family. From the data at hand, it appeared Han Li had shorted most of Han Holdings’ companies. Additionally, with the records of transfers and remittances, it was evident he had most of the senior executives under his control. It was like a vast and meticulous net silently encasing the entire Han Holdings. What Shen Kong couldn’t understand was, since it was already at the stage where the net could be drawn tight, why hadn’t Han Li made his move yet? ",
        "As Shen Kong flipped to the next document, he couldn’t help but pause slightly.",
        "This was the document Tang-ge had repeatedly instructed him to steal.",
        "",
        "It was a city development plan. Han Li had purchased land from the government for development. The location was remote, but since the government was focusing its development efforts in that direction, there was little doubt it would become a new commercial area in time. Shen Kong’s gaze lingered on the address in the document, unmoving for a long time. He called out to the system in his mind:",
        "“In the main mission, where did Han Li shoot those three people?” ",
        "The system’s mechanical voice, as if always waiting for his call, responded without delay: “The Han family’s main residence.”",
        "Shen Kong nodded thoughtfully. “And where was Han Li when he caught Han Zizhuo red-handed?”",
        "The system quickly rattled off a string of addresses.",
        "Each syllable matched the words on the document. ",
        "Shen Kong took a deep breath and finally understood Tang-ge’s intention for having him steal this document.",
        "——They finally decided to take action against Han Li.",
        "In the original storyline, Han Zizhuo’s attempt to kill Han Li was caught in the act. Han Li, enraged upon learning that Han Zhuang and Bian Xianjing were also involved, took Han Zizhuo to the Han family’s main residence to confront them, where he discovered the true cause of his mother’s death.",
        "These events were progressing step by step toward their predetermined fate. ",
        "He glanced over the document’s start date and the scheduled dates for key personnel to be present for supervision and mentally noted them.",
        "——Now that he knew the time and place, it would be easier to handle. He just needed to ensure that both Han Li and Han Zizhuo would be there.",
        "Shen Kong stood up, took a photo of the document, and sent it to Tang-ge.",
        "Then, he tidied the documents back to their original order and ignored the images left on the surveillance cameras. He walked to the door, turned off the light, and silently left the study. "
    ],
    "previous": "Ch55 - Out of sorts",
    "next": "Ch57 - What the fuck"
}