{
    "title": "Ch57 - What the fuck",
    "content": [
        "Since that day, Han Li never came to seek out Shen Kong again.",
        "Shen Kong was also quite happy about this. ",
        "After all, to prevent an unreciprocated infatuation from developing further, maintaining distance was a necessary measure.",
        "Now that he knew the critical time and place of the event, all he had to do was wait quietly.\n",
        "",
        "As for what to do when the time came?",
        "Shen Kong casually flipped through the script on his lap, a purely cold, metallic glint flashing in his downcast eyes. ",
        "——Of course, he would strike before Han Li had the chance.\n\n",
        "Since the main task was to prevent Han Li from personally shooting those three people, why not take action himself?",
        "After all, a few more lives wouldn’t make much difference to him.",
        "The sun overhead was getting hotter. Even the studio couldn’t keep out the scorching heat. The shooting on set was in full swing. Pei Xiuran was forcefully smashing the script. All the staff on set were on edge, fearing they might be the next to be caught up in the chaos. Unlike the others, Shen Kong leisurely sat on a deck chair at the edge of the set, under a sunshade, with iced watermelon by his side, slowly and leisurely flipping through the upcoming script.\n\n ",
        "It was because since that day, after 87 consecutive NGs, he had become Pei Xiuran’s new favorite.",
        "Almost every shot was passed in one take. During filming, even when there were occasional retakes, it was because Pei Xiuran had new ideas during shooting and required new shots or a change in camera angles.",
        "Shen Kong also became the savior of the entire set.\n\n",
        "Because as long as he had scenes to shoot, Pei Xiuran’s mood would visibly improve. Even when Shen Kong didn’t have scenes, just his presence could brighten Pei Xiuran’s perpetually angry face a bit and alleviate the tense atmosphere on set. Shen Kong, acting like a soothing balm, officially became the savior of the entire crew. ",
        "As long as he graciously went to Pei Xiuran and said a few words, everyone’s day on set would be much better.",
        "The previous rampant rumors were quickly dispelled by everyone’s desire to be rescued from the enormous workload. Their attitude towards Shen Kong took a 180-degree turn. He suddenly became the second-most untouchable person after Pei Xiuran. Qi Yi, who had been intimidated by Shen Kong’s glare that day, now avoided him entirely, like a mouse avoiding a cat.",
        "Shen Kong’s life on the crew has been quite pleasant lately.",
        "Just as he picked up a cold drink from the table and took a sip, his young assistant hurriedly rushed over, unable to hide the joy on his face: ",
        "“Meng-ge, Meng-ge! You’re trending again!”",
        "Shen Kong put the cold drink back on the table and lahily said, “What’s so special about that? Wasn’t I trending every day a while ago?”",
        "After leaving Lan Oi’s house, he took a tazi back and was secretly photographed. This caused him to trend online. There was a lot of wild speculation, with most netihens guessing he was finally dumped by his sugar daddy. They almost wrote millions of words of soap opera-level drama purely from their imagination. Lowever, because this matter involved higher social circles, it was duickly suppressed, and the buhh died down. Netihens then speculated that he reconciled with his sugar daddy, who used resources to remove the trending topic.",
        "Shen Kong had initially been interested, but once the novelty wore off, he couldn’t even be bothered to look at it. ",
        "The young assistant shook his head vigorously. His eyes shone as he looked at Shen Kong. He almost couldn’t speak coherently:",
        "“No, no, no, Meng-ge. This time, it’s different!”",
        "",
        "Shen Kong raised an eyebrow, a bit intrigued. He reached out to take the phone from the assistant.",
        "His name was prominently displayed at the top of the trending list. ",
        "Shen Kong was stunned for a moment, then suddenly remembered that today was Thursday——The second episode of “Seven Days in the Wilderness Challenge” had been released yesterday.",
        "As the latest hit variety show, “Seven Days in the Wilderness Challenge” was already highly popular online and closely watched. Last week, Meng Mingxuan was photographed leaving a mansion late at night by taxi, which pushed the anticipation for the second episode to its peak. Countless people were eagerly waiting to bash Meng Mingxuan after this episode. Even before the episode finished airing, the barrage was already filled with curses. After all, when Ran Wan never complained of being tired, Meng Mingxuan started whining about a sprained ankle. The delicate girl insisted she could endure, yet Meng Mingxuan, a grown man, claimed his foot hurt. It was seen as both pretentious and weak, causing the streaming platform to crash from the sudden influx of viewers and need urgent repairs.",
        "Unable to vent their anger in the barrage, the viewers took the battle to Weibo, where the topic of Meng Mingxuan’s pretentiousness trended once again.",
        "Just as everyone was fervently cursing, Ran Wan unexpectedly spoke up in support of Meng Mingxuan. ",
        "Not only did she post on Weibo to clarify and stand up for Meng Mingxuan, but she also actively responded to haters in the comments, sharply and righteously defending him. In the previous flame war, Ran Wan’s fans were the most vocal. They were also the quickest to get slapped in the face. Even some of Ran Wan’s more laid-back fans couldn’t help but worry about her and urged her not to stir up these troubled waters.",
        "As the drama intensified, the heated public discourse suddenly paused.",
        "Because the platform repairs were completed, the second half of “Seven Days in the Wilderness Challenge” began to air——",
        "Everyone watched as the gleaming blade flew across the screen, followed by Ran Wan’s blood-curdling scream. ",
        "Wait, what??",
        "What just happened???",
        "The thoughtful production team switched to a different camera angle and replayed the scene in slow motion, finally providing a close-up shot:",
        "The shiny, sharp blade was firmly embedded in the snake’s vital spot and deeply lodged into the tree trunk. The handle was still slightly trembling from the residual force, emitting a buzzing sound. ",
        "​…What the fuck?",
        "There were no other words that could fully and clearly express the complex feelings in everyone’s hearts.",
        "These words, seemingly embodying the essence of the Chinese language, flooded the minds of all viewers witnessing this scene. As a result, countless “What the fuck” began to flood Weibo. Even people who had never paid attention to variety shows were shocked by this sudden twist and asked everywhere what exactly had happened. However… Even those who watched the entire show couldn’t answer because, although they saw everything, they still didn’t understand what had happened!!",
        "Only three words could perfectly capture the feelings of everyone in front of their screens: ",
        "What the fuck!!",
        "Due to this scene being extraordinarily shocking, the subsequent content of “Seven Days in the Wilderness Challenge” failed to garner much attention. Those few seconds sparked an incredible buzz online. Both marketing accounts and personal blogs frantically discussed this unbelievable footage and analyzed it frame by frame.",
        "Please visit chrysanthemumgarden (dot) com",
        "However, since no camera angle had perfectly captured the moment the blade was thrown, many people believed the production team deliberately edited the footage to whitewash Meng Mingxuan. After all, he had connections. Releasing this video while his reputation was tarnished seemed blatantly purposeful. Such actions were deemed condemnable. After all, how could a pretentious and delicate star like Meng Mingxuan, who even brought sunscreen and lotion to the wilderness, possibly do something straight out of a movie?",
        "As a result, the official Weibo of “Seven Days in the Wilderness Challenge” responded very quickly and declared that the footage had not been maliciously edited in any way. They even released the unedited original video. Ran Wan and Zhuang Xiangyang were the first to repost it. ",
        "Ran Wanwanwan v: Everyone, please be careful when going into the wilderness and don’t touch tree branches randomly. Thank you, Meng-ge, for saving my life 【crying】【cute】",
        "igure-Zhuang Xiangyang v: I was there. It’s real, not edited 【kneeling】【kneeling】",
        "Following this, other guests also reposted and spoke out in support of Meng Mingxuan and the production team.",
        "Some haters were left speechless, while others continued: “Even if the video wasn’t edited, so what? Meng Mingxuan just stabbed a venomous snake with a knife. I could do that too!” People began posting about extraordinary feats they had performed under extreme fear and argued that Meng Mingxuan’s action was nothing special. ",
        "Next, a well-known survival blogger shared the video and analyzed it from several professional angles, including the insertion angle of the blade, the position where the snake was cut, and the depth of the blade in the tree. He concluded: “I don’t know if fear can make someone this precise, but I certainly couldn’t do it.”",
        "However, this couldn’t stop the persistent public outcry. Many of Meng Mingxuan’s haters accused the blogger of being bribed, causing a massive uproar online. Meanwhile, some facecons secretly became converts and quietly joined Meng Mingxuan’s fan base. In the previously hate-filled super topic, new fans began to post some strange comments amidst the chaos:",
        "“So, don’t you think Meng Mingxuan’s looks are exceptional? Even without makeup, his skin is so bright and fair. I’m so jealous.” ",
        "“Even when he’s throwing a tantrum and acting like a megastar, he looks amazing! dbq as a facecon, his face makes it impossible for me to be mad at him!”",
        "“And when he threw the knife, he looked so cool! He’s beautiful, handsome, salty, sweet, and skilled. Wuwuwuwu, I’m becoming a fan now.”",
        "At the same time, some comments veered in an even stranger direction:",
        "“Meng Mingxuan and Wanwan look so good together…” ",
        "“And he only mentioned his foot pain when Wanwan’s face showed something was wrong, but he wasn’t actually hurt! Oh my god, this is such a perfect cold-on-the-outside, warm-on-the-inside, tsundere character! And then he saved Wanwan’s life, and she was the first celebrity to defend him… This is too sweet, I’m swooning!”",
        "“Wait, could this actually be the truth?”",
        "Haters insisting that Meng Mingxuan was just whitewashing his image, and some new fans captivated by his looks and potential romantic CP, started a heated online battle. Meng Mingxuan and “Seven Days in the Wilderness Challenge” remained high on the trending list. At this moment, Pei Xiuran’s personal Weibo suddenly posted a picture without any caption. It was a solitary photo prominently displayed on his homepage.",
        "Five minutes later, the official Weibo of 《Guiyuan Tower》 reposted it. ",
        "All the character photos had been released months ago, except for Shen Guiyuan’s. Instead, there was only a concept image—a bloodstained black iron broken sword slanted into a pitch-black abyss, wrapped in a scarlet, tattered ribbon. When this image was released, it sparked unprecedented heated discussions. Many believed that the production team dared not reveal the actual photo.",
        "——But this time, the picture Pei Xiuran posted left everyone speechless.",
        "",
        "It was the long-awaited, never-before-released character photo of Shen Guiyuan.",
        "In the image, a half-damaged mask covered half of his face, hidden in shadows. Thick, bright red blood dripped from the mask, slowly blending into the black and dark red robes he wore, as if the scent of rust permeated through the screen. ",
        "The other half of his face was exposed to light, with nearly beautiful features sharply defined, thin lips like paper, and a calm, distant expression.",
        "Only his slightly narrowed eyes glared at the camera. They were an almost inhuman light color, resembling the eyes of a beast in bright light. They exuded a pure, wild fierceness and an overwhelming killing intent that could make one’s whole body tremble.",
        "This raw and fierce vitality, like a deadly beast baring its fresh and sharp fangs, seemed almost capable of slashing through the viewer’s eyes.",
        "——It was as if Shen Guiyuan walked straight out of the book and stood vividly before the camera. "
    ],
    "previous": "Ch56 - Why are you avoiding me_",
    "next": "Ch58 - Hunter and prey"
}