{
    "title": "Ch6 - Bye-bye, kid",
    "content": [
        "Shen Kong bent down, took out a pack of cigarettes from the pocket of the wailing man, and then kicked him out with a neat and precise kick. The room instantly returned to silence.",
        "He took out a cigarette, held it to his lips, and lit the lighter. His fingers, which were stained dark brown by blood, were trembling due to exhaustion. ",
        "Cyan smoke rose up. The bitter smell of tobacco poured from his throat down to his chest, stimulating the still-tense nerves.",
        "Shen Kong sighed with satisfaction, fell back into the chair next to him, and narrowed his eyes slightly.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "——It was a good smoke. It seemed that this person still knew how to enjoy life.",
        "Using his other foot, he kicked hard on the edge of the table lying beside him, causing the whole chair to rotate along with his movement. The rising smoke curling upwards obscured his sight, but it could not hide the entire room’s disorderly appearance. The tables and chairs were all overturned carelessly, and the chaotic room was full of traces of fights. Several dried blood stains were spread on the floor and walls. Bullet holes were deeply embedded in the partitions, like glaring eyeballs—baring its fangs and brandishing its claws. ",
        "Shen Kong held on to the rotating chair, but because of this, he accidentally tore his wound, causing him to frown suddenly.\n\n",
        "He lowered his head to examine his thigh. Blood was gurgling out of the area grazed by the bullet, dyeing his pants a wet, dark red.",
        "After all, this was not his own body. It couldn’t bring out his actual strength in many situations.",
        "Fortunately, the Han family was quite cautious and paid great attention to concealment when making the move. They did not recklessly dispatch large numbers of manpower and weapons with high lethality but mainly used a small team, which allowed Shen Kong to attack. With the advantage of occupying the terrain, he could be strictly on guard against them while also defending himself to death for such a long time.\n\n ",
        "However, this body has basically reached its limit now. If he continued to be trapped in the same place, he was afraid that things would develop in an unpredictable direction.",
        "Shen Kong stood up, skillfully tied up the unconscious man on the ground, then dragged his legs towards the house, opened the door of the partitioned-off area, and threw him in to accompany those who were subdued by him. He had many little companions there.",
        "After he transferred the balance of 2 million to Dr. Chen’s account, he checked the door lock one last time, then grabbed the car key he found from the man’s body, turned around, and walked towards the basement.\n\n",
        "Han Li sat quietly on the hospital bed, staring at his fixed injured leg. He didn’t know what he was thinking. His pale young face had no expression, and his pitch-black eyes were dark and a little cold, making one's flesh creep. ",
        "Perhaps it was just Shen Kong’s illusion, but he felt that Han Li seemed to have matured a lot overnight.",
        "——As if he had figured something out.",
        "When he heard the footsteps coming from the door, he looked in the direction of the sound, with a bit of vitality on his face.",
        "Shen Kong walked quickly to the hospital bed, pulled out the infusion needle from the back of Han Li’s hand with agile movements, and expertly wrapped his injured leg with a bandage. After that, he picked Han Li up easily and then walked out in large strides. There was no explanation or pause. The whole process flowed like floating clouds and flowing water, as if all his actions were in line with the principles of heaven and earth and as a matter of course. ",
        "Han Li subconsciously clenched Shen Kong’s clothes. His whole body was tense, wanting to resist, but he controlled himself not to struggle.",
        "Le raised his eyes and stared at Shen Kong’s clean-cut chin. Lis young and tender voice was hoarse like gravel:",
        "“What happened to my legs?”",
        "The system’s prompt sounded in his ears: “Rectifier, please pay attention! This is the best time to help the target character accept and correctly deal with his disability! Please seize this opportunity to establish a healthy and rectified three views for the villain!” ",
        "Shen Kong lowered his eyes, glanced at Lan Oi lightly, and then said casually:",
        "“It’s broken.”",
        "Please visit chrysanthemumgarden (dot) com",
        "System: “……”",
        "Lan Oi’s eyelashes hang down. Le tightened his fingers on Shen Kong’s clothes a little more and pursed his lips tightly, as if he were restraining something. ",
        "Shen Kong added unsympathetically:",
        "“If you think about it, although you won’t be able to walk in the future, your leg will not be amputated anyway, right?”",
        "System: “…………”",
        "Perhaps this task wouldn’t succeed at all. ",
        "It finally couldn’t help but ask Shen Kong, “Why?”",
        "Behind that one word were countless questions that it had kept since entering this world——Why can’t this current rectifier follow the routine he should have? Why did things run wildly in a direction that it didn’t expect at all?",
        "Shen Kong replied heartlessly:",
        "“Wouldn’t he be very happy when he finds out that the condition of his leg is not as serious as I said?” ",
        "The system fell silent——although I know what you’re saying is unreasonable, why does it still sound like there’s some reliable truth to it……?",
        "Shen Kong opened the car door, bent over, and then placed Han Li in the back seat.",
        "Han Li’s lowered palm accidentally brushed Shen Kong’s outer thigh. He instantly felt that his palm was warm and wet. He was dumbfounded. Taking advantage of the dim light in the car, he noticed that his palm was covered with scarlet and sticky blood, dyeing into a dark red. Han Li’s face finally gained some spirit.",
        "He raised his head and looked at Shen Kong, his pitch-black pupils flashing with a compelling light. He asked in a low voice: ",
        "“Are you hurt?”",
        "Shen Kong didn’t even raise his eyebrows. He replied without changing his expression:",
        "“Don’t worry, it’s not broken.”",
        "Han Li seemed oblivious to Shen Kong’s deliberate act of rubbing salt into his wounds. He only lowered his head again, stared at the dazzling bright red color in his palms, and pursed his lips tightly. ",
        "Shen Kong didn’t bother to guess the child’s thoughts. He closed the back seat door, raised his legs, and sat in the driver’s seat.",
        "While lighting the fire, he asked in his mind: “By the way, where’s the place where Han Li was picked up after he rolled down the cliff?”",
        "Please visit chrysanthemumgarden (dot) com",
        "As soon as he finished speaking, the disposable phone in his pocket vibrated slightly. Shen Kong turned on the screen and, to his surprise, saw that the location had already been sent by the system. From the map, it was not too far away from here—no more than 20 minutes away. The only thing that was not perfect was that the roads nearby were basically blocked, and…… if Shen Kong’s guess was correct, and the person behind the scenes who attacked Han Li had a normal IQ, the only way to pass in and out was the road that should have been controlled and monitored by people sent by the Han family a long time ago.",
        "Before Shen Kong could say anything, the system thoughtfully marked a new route for him on the map. ",
        "This route happened to avoid the main road that might be under surveillance, while also avoiding the dangerous and steep terrain.",
        "Shen Kong raised his eyebrows in surprise: “Oh, not bad.”",
        "He started the vehicle and headed towards the destination along the route marked on the map.",
        "The uneven terrain caused the car’s body to shake and jolt. Han Li, who was sitting in the back seat, wrinkled his eyebrows, his pale little face becoming more and more bloodless. But he gritted his teeth and remained silent. His pair of dark eyes stared at Shen Kong through the rearview mirror, implying some kind of strange, probing meaning. ",
        "Shen Kong noticed his gaze and raised his eyes to look back, but Han Li turned his head away at the same time.",
        "…… It’s really hard to understand a child’s mind.",
        "Shen Kong withdrew his gaze and looked back at the clouds of dust flying up on the road ahead, but at the moment when he was distracted, two black cars suddenly sprang out of the dirt road extending downward in front of him, blocking the road ahead.",
        "He was slightly startled. He hurriedly turned the steering wheel in an attempt to break free, but the rear tire seemed to be stuck in the ditch holes on the undulating road, resulting in a futile buzzing roar. Shen Kong’s expression turned cold. His palms slid down calmly to press on the handle of the gun. His muscles tensed all over, and his body was poised like an unsheathed blade, ready to seize the best opportunity in the next moment. ",
        "A tall, thin man got out of the back seat of the car in front. The strong wind in the mountains stopped at this moment.",
        "The dust gradually fell to the ground.",
        "Shen Kong narrowed his eyes slightly and gently stroked the uneven pattern on the gun handle with his thumb——",
        "At this moment, he heard Han Li in the back seat exclaim in confusion: ",
        "“……Third uncle?”",
        "Shen Kong was stunned for a moment. The movements of his hands paused——Third uncle? Han Li’s maternal family member?",
        "It was as if his mind received an electric shock, causing it to spin. He quickly remembered how the system had proactively provided him with a route just now. The whole truth seemed to come out. Shen Kong leaned back and asked in his mind: “So, that man in front is sent by the Zhao family to pick up Han Li?”",
        "The system replied: “Yes.” ",
        "Shen Kong’s eyebrows furrowed: “Since you’re so powerful, why didn’t you tell me earlier?”",
        "The system’s mechanical voice was still cold and indifferent: “The longer the rectifier spends time with the target character, the higher the success rate of rectifying their three views. Prolonging the treatment time will help complete the task.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Shen Kong even had the spare time to take out a cigarette and hold it between his lips: “Then why isn’t it prolonged now?”",
        "“According to interrelated calculations, it is found that prolonging the time together does not increase the probability of completing the task.” ",
        "——There might even be negative effects.",
        "For some reason, Shen Kong heard a hint of resentment in the system’s emotionless voice.",
        "It continued: “Rectifier, please choose to leave. The studio transmission system will take you to the next major turning point in the target character’s life. The countdown begins: 30, 29……”",
        "——It seems that there’s not enough time to smoke the last cigarette. ",
        "Shen Kong took the cigarette from his lips with some regret and put it aside.",
        "Then he turned his head to look at Han Li in the back seat, raising the corners of his mouth slightly, revealing a frivolous and playful smile:",
        "“Bye-bye, kid.”",
        "After saying that, Shen Kong opened the car door and skillfully jumped into the dense forest. Before Han Li could react, the lush sea of trees instantly swallowed up his figure, leaving only the driver’s seat with the car door wide open. "
    ],
    "previous": "Ch5 - Drink more milk to grow taller",
    "next": "Ch7 - One's own body"
}