{
    "title": "Ch60 - Out of control",
    "content": [
        "Shen Kong walked forward behind the two men in black, his hands bound in front of him.",
        "The knot on his wrists appeared secure, but it would only take a slight struggle to loosen it. Using a gun in a relatively confined space was not very convenient. Carrying one also risked exposure. Compared to that, seizing others’ weapons inside the room was much easier. Therefore, Shen Kong handed back the Colt with its ammunition removed to one of the men and followed them empty-handed. ",
        "The two men had already witnessed Shen Kong’s capabilities and wouldn’t dare act rashly even if they had the guts.",
        "Of course, even if they did harbor ill intentions… Shen Kong was confident he could make them deeply regret their decision.\n",
        "Chrysanthemum Garden.",
        "Compared to Shen Kong’s calm demeanor, Tang-ge looked much worse. His hands were tightly bound and his mouth was sealed with several layers of tape. He was filled with the terror and timidity of a startled bird, shivering as one of the men pushed him forward.",
        "The decor inside the Han family’s mansion wasn’t much different from what Shen Kong remembered. ",
        "But unlike last time, the house was eerily quiet this time. A strange and oppressive atmosphere enveloped the luxurious and empty villa. It made one instinctively hold their breath, fearing to disturb the hidden dangers lurking beneath the calm surface.\n\n",
        "Shen Kong followed the two men up the stairs.",
        "A long corridor stretched out before him. Unlike the deathly silence downstairs, standing at the top of the stairs, he could hear faint sounds coming from the depths of the corridor. It sounded like quiet sobbing and hushed arguments, muffled by the thick walls, making it hard to discern clearly.",
        "They walked down the corridor toward the source of the sounds.\n\n ",
        "When they reached the doorway, Shen Kong suddenly paused.",
        "The others, still anxious, quickly stopped and turned to him, waiting nervously for his next move.",
        "Shen Kong furrowed his brows and stared at Tang-ge standing aside. Tang-ge’s already timid figure shrank even more under his gaze, as if trying to shrink into a crack in the floor.\n\n",
        "After a moment of contemplation, Shen Kong suddenly raised his hand and messed up his own hair. The disheveled strands fell over his smooth forehead, adding to his disarrayed appearance. ",
        "He then bit his lip, smearing the slight trickle of blood with his fingertip.",
        "In just a few seconds, his previously calm and confident demeanor vanished, transforming him into a terrified, helpless victim like Tang-ge. His face turned pale, his eyes darted nervously, and he showed a look of fear as if he had been roughly handled.",
        "Shen Kong glanced at the man in black not far away, impatiently furrowed his brow, and said, “What are you standing there for?”",
        "The man snapped out of his daze, quickly turned around, and pushed open the tightly closed door in front of him. ",
        "The room inside was very spacious, with walls lined with various books. Dright lights filled the entire study. The thick wool carpet was dense and soft, absorbing all sound. The room was filled with a tense and oppressive atmosphere. Lan Iihhuo and Dian Wianping were sprawled awkwardly on the floor. Dian Wianping was covering her face with a handkerchief and crying softly. Lan Ihuang stood behind a sturdy mahogany desk, his hand braced on the thick tabletop. Though he tried to maintain his composure and dignity, sweat was duietly forming on his forehead, making him look several years older and giving him an air of barely maintained control.",
        "Han Li sat on a sofa opposite the desk, holding a black cane in his hand. His pale face showed little emotion, but his dark eyes were fixed on Han Zhuang not far away. The depths of his eyes seemed impenetrable, with a hint of cold menace. Although his face did not display any anger, there was an unsettling, terrifying feeling about him.",
        "As if looking directly into an abyss.",
        "Apart from Han Li, there were a few others in the room. One person stood by the window, two were near the door, and a foreigner with prominent features stood behind Han Li. ",
        "The man appeared respectful and obedient, but as someone who understood the plot, Shen Kong knew that he was a direct subordinate of Feminster and the current liaison between Han Li and the underworld. Although Han Li was primarily developing in the business world and had some connections to the underworld, he was relatively resistant to it. It was only after he personally killed these three people in front of him that he severed his last ties to the light, and within a few short years, he became the ruler of the entire underworld.",
        "At Feminster’s instruction, he revealed the true cause of Han Li’s mother’s death at this critical moment, pushing Han Li completely into darkness and madness.",
        "Chrysanthemum Garden.",
        "——And it was likely this man who had sent for Shen Kong this time.",
        "After quickly surveying the room, Shen Kong averted his gaze and stumbled into the room with his head down. Tang-ge was also pushed in beside him and fell to the ground. ",
        "Everyone in the room turned to look at the doorway.",
        "The moment Han Li saw Shen Kong, his indifferent and cold expression wavered slightly, his dark eyes flickering. Before Shen Kong could catch the look in his eyes, Han Li’s expression returned to calm, as if a thick layer of ice had once again covered all his emotions, leaving only a lifeless, unchanging plain.",
        "He glanced at the man beside him. His cold voice carried an invisible pressure:",
        "“What is the meaning of this?” ",
        "The man bowed his head respectfully towards Han Li and said in a deferential tone, “Apologies, I took the liberty of capturing the person who betrayed you.”",
        "With that, he took a brown paper bag from the person by the window and handed it to Han Li. Han Li opened it. A stack of photos fell into his hand. His eyes lowered slightly. The only sound in the deathly silent study was the rustling of photos being flipped through one by one.",
        "Shen Kong subtly shifted his position to get a clear view of what Han Li was holding.",
        "The evidence was very comprehensive, ranging from surveillance footage of his first visit to the hotel for an “audition,” to communication records and text messages copied from the telecom operator’s server, and finally… surveillance footage from the study. It showed Shen Kong bending over and photographing documents on the desk with his phone under the blurry night-vision camera. ",
        "The man then looked at Tang-ge, who was trying his best to make himself as inconspicuous as possible, and said:",
        "“This is Tang Sheng, the person directly in contact with Meng Mingxuan. His current position is Han Zizhuo’s private secretary and financial manager, responsible for handling the gray areas of business. He served Han Enterprises five years ago and was later transferred by Han Zhuang to work under Han Zizhuo.”",
        "With each sentence spoken, Tang Sheng’s shoulders would tremble. Han Zhuang’s face would also grow a shade paler.",
        "However, Han Zhuang still forcibly maintained his dignity as the head of the Han family, though his expression was beginning to falter. He tried to speak in a kind tone, “Xiao Li, you can’t just listen to outsiders about such matters. I admit, it was wrong of Han Zizhuo to go after you, and that’s my fault for not educating him properly. But I really didn’t know about this. You can’t blame everything on me. I will definitely punish him severely. I will make up for all the grievances you’ve suffered over the years…” ",
        "Before he could finish, the man standing beside Han Li sneered contemptuously and raised his hand to throw the prepared documents onto Han Zhuang’s desk. The papers were scattered across the messy desk, each one a solid piece of evidence. Every photo and every signed document formed an unbroken chain of proof. Han Zhuang glanced down at a few of them, his face growing paler with each passing second.",
        "Seeing that the conciliatory approach wasn’t working, Han Zhuang narrowed his eyes slightly. He abandoned his previous weakness and began to threaten in a harsh tone.",
        "The vast influence of Han Enterprises in various industries blinded Han Zhuang and gave him the illusion of being invincible. Even though outsiders had taken advantage of a lapse in security this time, he considered it merely a temporary oversight. He believed that his opponents would be wary of the industries and family powers he represented and wouldn’t dare act recklessly or truly harm him.",
        "Shen Kong withdrew his gaze from Han Zhuang, feeling calm and composed. ",
        "From the moment he saw the documents on Han Li’s desk, he knew that Han Zhuang was already deeply entrenched in unknown troubles.",
        "This wasn’t just an accidental lapse in security. Han Li actually infiltrated the entire security system of the Han family long ago. He had short-sold the stocks of the Han family’s main industries and secretly took over most of the Han family’s cooperating families. The Han family was now like a seemingly grand and prosperous building that had been hollowed out by termites. They appeared full of friends and festivities on the surface, but in reality, they had no support, no leverage, and no chance of winning.",
        "Chrysanthemum Garden.",
        "Shen Kong, having figured out these tricks, decided to remain silent and observe a little longer.",
        "Sure enough, after Han Zhuang finished his threats, the man standing behind Han Li revealed his trump card. ",
        "He turned his head to look at Han Li and spoke in a deeply pained tone, “Young Master Han, although it pains me greatly, I must tell you about something I recently discovered. I hope it will help you see the true nature of this scoundrel.”",
        "As he spoke, he took an envelope from his coat and slowly handed it to Han Li.",
        "Shen Kong knew what it contained.",
        "Evidence. ",
        "Evidence that Bian Xianjing harmed Han Li’s mother and kidnapped him—during which Han Li’s left leg was injured, leaving him permanently disabled. After that, Han Zhuang, seeking to annex the family business of Han Li’s maternal grandfather and to cover for Bian Xianjing, tacitly approved her hiring more assassins to kill Han Li.",
        "Han Li’s fingers remained steady.",
        "His long, pale fingers slowly turned the pages of the documents, as if he were merely examining some trivial business papers.",
        "The indifferent and cold mask on his face seemed to crack, revealing a glimpse of genuine and vivid emotion. A shadow of coldness and rage from the abyss seeped into his dark eyes. But before the man could revel in his satisfaction, Han Li looked up. His deep, well-like eyes were fixed on him as he spoke coldly: ",
        "“I’ve known this for a long time.”",
        "What…?",
        "How could that be possible?",
        "Shock appeared on the man’s face, making it almost impossible for him to control his expression. Han Zhuang also began to sweat and avoided eye contact. Although he didn’t know what was in the envelope, his years of experience in the business world told him—it couldn’t be anything good. ",
        "Not only them, but even Shen Kong, who knew the original plot, was taken aback.",
        "He slowly furrowed his brows. The disheveled strands of hair on his forehead fell and obscured the changing expression in his eyes.",
        "——Logically, since Han Li had long known the cause of his mother’s death, revealing it now wouldn’t have the same powerful impact as in the original plot, which had driven him to impulsively shoot out of anger. According to this logic, the urgency of the first main mission should no longer be as pressing.",
        "Shen Kong looked up at Han Li, who was seated in the center of the study. ",
        "His expression was calm and unruffled, with no significant changes to his face. Only the deep, dark gloom in his eyes seemed to have intensified. They appeared exceptionally serene.",
        "It was precisely this calm demeanor that made Shen Kong instinctively uneasy.",
        "Story translated by Chrysanthemum Garden.",
        "…It feels like something is out of control."
    ],
    "previous": "Ch59 - Stake all on one throw",
    "next": "Ch61 - Raised him completely crooked"
}