{
    "title": "Ch62 - Name",
    "content": [
        "The entire room was shrouded in dead silence. No one anticipated such a startling turn of events. They were all stunned in place.",
        "Lin Ziyu was the first to react. He gave a signal to his subordinates behind him. Several tall, burly men charged toward Shen Kong, who was standing not far away, trying to stop this stranger who suddenly appeared to stir up trouble. ",
        "Han Li’s expression hardened:",
        "“Wait…”\n",
        "Chrysanthemum Garden.",
        "He tried to stop them, but before he could finish speaking, Shen Kong let out a cold sneer, sidestepped all the attacks like a fish swimming, and then swiftly dislocated the joints of the men. His moves were ruthless and precise. The clear sound of bones and flesh colliding echoed eerily in the silent room. Lin Ziyu’s face grew solemn. Just as he was about to do something else, Han Li’s voice rang out again, completing his earlier sentence:",
        "“Wait.” ",
        "His voice was calm and deep, but as someone who had been his subordinate and friend for many years, Lin Ziyu keenly sensed a certain instability hidden in Han Li’s tone, like a torrent deeply suppressed beneath a calm surface. This torrent was stretched so tight that one could almost hear the subtle tremor underlying the restrained facade.\n\n",
        "For so many years, this was the first time Lin Ziyu had seen such clear and overt emotions from Han Li.",
        "He couldn’t help but be taken aback. He raised his hand to stop his subordinates, who were ready to rush forward.",
        "The room returned to silence once more.\n\n ",
        "Shen Kong, looking composed, stepped over the men lying on the ground and walked toward Han Li, who was standing in the center of the study. His steps were steady and rhythmic, with the thick carpet absorbing all the sound of his footsteps. Yet, it felt as if each step was synced with the rhythm of a heartbeat, creating an overwhelming sense of pressure that made it hard to breathe.",
        "Han Li remained motionless, his dark eyes fixed steadily on the young man approaching him. His thin lips were pressed tightly into a fine line. A storm seemed to be brewing in his gloomy eyes. His emotions appeared to be forcibly restrained by reason, held at a critical point, ready to burst forth and wreak havoc at any moment with astonishing destructive force.",
        "But his knuckles, gripping the gun, were slightly pale, as if suppressing something.\n\n",
        "Shen Kong, however, seemed completely oblivious to the latent danger emanating from Han Li. He stood calmly in front of him and chuckled lightly, “Although I can say I watched you grow up, I must admit, your abilities have surpassed my expectations.” He paused, then added uncertainly: ",
        "“…Perhaps that’s my doing?”",
        "Han Li didn’t respond and only continued to stare intently at Shen Kong.",
        "His gaze was silent and focused, as if trying to engrave every detail of the other’s appearance deeply into his mind, stroke by stroke.",
        "Shen Kong casually raised his hand and gently pressed down on Han Li’s hand that was holding the gun: ",
        "“But I can’t let you do this.”",
        "Han Li allowed Shen Kong’s movement. His cold and steady hand trembled slightly from the warmth of Shen Kong’s palm, yet his fingers remained tightly gripping the gun.",
        "He suddenly spoke:",
        "“Why?” ",
        "Han Li’s eyes were locked onto Shen Kong’s face, not missing the slightest hint of emotion.",
        "It seemed as though he was duestioning Shen Kong’s earlier conclusion, yet perhaps he wasn’t.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This duestion seemed to encapsulate the past twenty years, with every second filled with complez and profound emotions, making each word deeply moving.",
        "Shen Kong’s lips were tightly pressed together. Le slightly tightened his grip on Lan Oi’s hand. The icy coldness from Lan Oi’s hand transferred through their touching skin, almost making Shen Kong feel chilled. Lis eyes were filled with deep gloom, as if containing a thousand turbulent waves. Dut the surging emotions duickly vanished, making it hard for even the close Lan Oi to easily capture. ",
        "His voice was as soft as a sigh:",
        "“Because I’ve already done that.”",
        "Han Li was slightly taken aback.",
        "Shen Kong’s expression was very calm, so indifferent it seemed it could be smoothed out by a breeze, and so distant it felt unreachable. He lowered his gaze to Han Li, his palm still covering Han Li’s hand: “Guess who the first person I killed was.” ",
        "The answer was self-evident.",
        "Shen Kong’s warm fingers brushed across Han Li’s hand and slid past the edge of his palm. His voice was as flat as if he were telling someone else’s story:",
        "“Taking someone’s life with your own hands is different from all your previous life experiences——The blood doesn’t matter much. For me, the most memorable part was watching the light symbolizing life slowly fade from his eyes, the gradually dilating pupils becoming empty and lifeless. You see human rationality peeling away from their body——Actually, contrary to many people’s impressions, life doesn’t drift away from the body. It’s more like it sinks into the depths of consciousness, like a shipwreck sinking to the dark ocean floor.”",
        "He seemed to be reminiscing, yet it also felt as if he had long detached himself from his past. Now, he was merely indifferently looking down at the objective facts of what had once happened: ",
        "“Taking a life for the first time is the easiest because you might be acting on a momentary impulse, or maybe you’ve rehearsed it in your mind countless times, and the subsequent actions have become subconscious muscle memory. But the following period is the hardest. Those lifeless eyes will frequently appear in your mind, and you’ll need more killing and stimulation to forget them.”",
        "Shen Kong paused, thoughtfully furrowing his brows. After a few seconds, he continued:",
        "“I only started to get used to this feeling after the eleventh time.”",
        "His voice was calm and casual, as if it were as trivial as eating or drinking. This offhand manner made it all the more chilling in the dead silent room. ",
        "Shen Kong lowered his gaze and looked seriously into Han Li’s eyes:",
        "“Personally killing someone is a clear boundary—one side is reason, the other is madness. Once you cross it, there’s no going back——No one knows this better than I do.”",
        "At this moment, he suddenly let out a low laugh: “I’m not trying to persuade you not to kill. I don’t have that right, considering the blood on my hands far exceeds yours.”",
        "Shen Kong’s fingertips slipped between Han Li’s palm and the cold gun. ",
        "With just a little force, that heavy piece of metal would fall into his grasp.",
        "His voice was deliberately lowered, carrying a gentle and careless temptation, like a strange flower blooming under a blood moon, with a terrifying and deadly seduction, softly whispering:",
        "Chrysanthemum Garden.",
        "“So… let me help you.”",
        "At some point, the distance between them had closed to almost nothing. They could almost feel each other’s subtle breaths. ",
        "Han Li’s fingers loosened.",
        "The heavy gun fell into Shen Kong’s hand. But before he could relax, he felt the other’s cold palm turn, gripping his wrist tightly and pulling him forcefully toward himself. Shen Kong staggered unexpectedly, then felt the other’s breath crash against him as Han Li fiercely bit his lip.",
        "Shen Kong raised his hand to clamp down on the other’s throat, trying to push Han Li away.",
        "But Han Li kissed him even deeper, almost biting his lower lip to the point of drawing blood. ",
        "The pain on his lips aroused Shen Kong’s ferocity. He pressed his hand against the back of Han Li’s neck and retaliated even more fiercely.",
        "The gun fell from between them and silently sank into the soft fibers of the carpet.",
        "Their kiss was like a fight, resembling fierce beasts battling for territory with intense biting and struggling. Blood was quickly drawn. The thick taste of iron filled their mouths. Ultimately, Han Li was less experienced and soon found himself defeated by Shen Kong.",
        "A few minutes later, they separated, panting heavily. Both had blood on their lips. ",
        "Shen Kong lifted his thumb to wipe his injured lower lip, hissing as he inhaled sharply.",
        "He frowned, “Are you a dog?”",
        "Han Li didn’t answer. Instead, he approached again. His fingers spasmodically gripped Shen Kong’s collar, his knuckles turning faintly white from the force.",
        "His eyes were red. His dark pupils were fixed intensely on Shen Kong’s face. His breath was still uneven as he said fiercely, “Fine! If you don’t want me to kill, I won’t kill.” ",
        "Shen Kong was silent for a moment, frowning as he looked at Han Li inquisitively.",
        "Han Li stared back deeply, his voice low and hoarse, “What else do you want?”",
        "Shen Kong frowned as he looked back at Han Li, seemingly trying to discern something from his dark eyes, but he could only see his own puzzled face reflected in them.",
        "“What if I said I want you to be a good person from now on, and not get involved with the underworld?” ",
        "“Okay.”",
        "Han Li responded crisply.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He gazed at Shen Kong’s face. The weight of his stubbornness in his eyes was impossible to ignore, a deep emotion bordering on obsession, with a determination that would never turn back: “If you want, I can draft a contract right now, divide the company’s visible and hidden affairs, and from today, clean everything up and withdraw from all gray areas.”",
        "From a distance came Lin Ziyu’s astonished voice: “…Han-ge?” ",
        "But Han Li didn’t look in the direction of the voice. He continued to stare fixedly at Shen Kong, as if his eyes could hold only his figure and no other scene: “So… you must not leave this time.”",
        "His gaze was so intense that Shen Kong had to look away. He felt that if he stared any longer, he would be overwhelmed by this unfamiliar and terrifying emotion. His thoughts were complicated, and he didn’t know how to respond for a moment:",
        "“You…”",
        "At that moment, a cold mechanical voice sounded in his ear: “The ten minutes are about to end. The rectifier will be transported to the studio headquarters for points evaluation. Countdown: one minute: 60, 59…” ",
        "Shen Kong had to harden his heart:",
        "“I’m sorry, I still have to leave… Maybe next time…”",
        "But there would be no next time.",
        "Shen Kong knew it well. ",
        "He traded the next two time points for this ten-minute extension. Regardless of whether Han Li kept his vow to “be a good person,” Shen Kong’s work in this world was finished. The only difference was that if Han Li was eventually pulled back into his fate as a villain by the world line, Shen Kong’s points would reset to zero. Shen Kong knew that if he told Han Li that he might die, this stubborn man, who had been searching for him for ten years, might indeed stick to the righteous path.",
        "But now he didn’t really want to.",
        "Han Li seemed to realize something. He gripped Shen Kong’s collar tighter, the usually composed and strategic exterior cracking. He gritted his teeth and said, somewhat flustered:",
        "“At least, tell me your name——” ",
        "Shen Kong raised his hand and gently touched Han Li’s cheek. His burning fingertips branded the higher temperature onto Han Li’s cold face, making him involuntarily shiver. Then, the young man standing before him suddenly leaned in close to Han Li’s ear. The light and bitter scent of grass once again enveloped Han Li. The other’s warm breath brushed his earlobe and delivered a few hoarse words to his ear: “Remember, my name is Shen Kong.”",
        "The mechanical voice in his ear grew louder and more piercing. It was cold and pure, devoid of any emotional fluctuation: “It has been detected that the rectifier’s opportunities to complete the task are exhausted. Transmitting the rectifier to the Three Views Rectifying Studio headquarters. Countdown begins: ten, nine, eight…”",
        "Shen Kong sighed, lowered his head, and lightly brushed his lips against Han Li’s:",
        "“Goodbye.” ",
        "“…Two, one.”",
        "——Never to see you again.",
        ""
    ],
    "previous": "Ch61 - Raised him completely crooked",
    "next": "Ch63 - Points evaluation begins"
}