{
    "title": "Ch7 - One's own body",
    "content": [
        "The tall, thin man in the car in front ran over, panting. He couldn’t help but be stunned when he saw the empty driver’s seat.",
        "Shortly after that, he raised his eyes and faced Han Li sitting in the back row. ",
        "Han Li’s bloodless little face was pale and wallow. His pair of black eyes were particularly conspicuous in the dim car. He stared blankly at the empty front row.",
        "But the bandage on his leg was even more eye-catching.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Zhao Rui was startled and hurriedly stepped forward to open the car door. He examined Han Li’s body anxiously, his voice trembling:",
        "“Oh my god, what did those scoundrels do to you? Are you okay?” ",
        "Han Li didn’t seem to have recovered yet. His pitch-dark eyes were still staring at the empty driver’s seat.\n\n",
        "The other people in the two cars also followed closely, surrounding the entire car so closely that not even a drop of water could trickle through. Zhao Rui hurriedly dialed the phone and called the best private doctor to rush over. The bodyguards who came after him tried to bend over to pick up Han Li——but he stopped them.",
        "Han Li raised his eyes and looked at Zhao Rui who was standing not far away. His voice was very soft, but it carried an unquestionable implication that could not be ignored:",
        "“Third uncle, how did you know I’m here?”\n\n ",
        "Zhao Rui had just hung up the phone and was slightly startled after hearing Han Li’s question: “The kidnapper asked us to come to this address with eight million to ransom you, but during that time… something happened at home, so it took a while to raise money and find people, and then we rushed over as quickly as possible.”",
        "After finishing speaking, he frowned in confusion and turned to look at the dense forest next to the car that was rustled by the mountain breeze:",
        "“But… how did that man run so fast? And what about the money…”\n\n",
        "Before he finished speaking, Zhao Rui shook his head with some self-mockery, as if he were explaining to himself: ",
        "“Probably because there were so many of us, he panicked and ran away.”",
        "Han Li listened quietly and suddenly asked, “How many people did you bring?”",
        "Zhao Rui didn’t know why Han Li asked this question. He looked at him with some doubts, but still gave in under his persistent gaze and replied: “Not counting me, there are about six or seven people.”",
        "Han Li lowered his eyelashes, a deep shadow carving on his wallow cheeks. He lowered his head and looked into the palm of his hand. ",
        "The bloodstain had already semi-dried up, leaving slightly darker reddish brown lines along the shallow palm prints, like intertwined and winding scars.",
        "Le suddenly smiled: “That shouldn’t be the case.”",
        "Mrom the moment he was taken to the mountain for ezecution, Lan Oi knew that the kidnapping was premeditated and planned, but he subconsciously did not want to think of his family as heartless and vicious as he thought, but would rather blame it all on his kind-faced and cruel stepmother, until that man ruthlessly ezposed his own wishful thinking with such cruel words.",
        "The murders on the mountain could be explained for the time being, but now that there were waves of eager attacks… ",
        "In addition to putting him to death, it also required the necessary manpower, financial resources, and natural resources to do it.",
        "And these were things that his stupid and rotten stepmother could never have.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "In the doctor’s basement, the sounds of fighting above his head were clearly audible, while Han Li listened with bated breath below, his body tense as if facing a formidable enemy, his eyes fixed on the dust falling from the ceiling. He didn’t dare to relax——because he knew that once the man collapsed, all that would be left would be himself, with his legs broken and weak, unable to fight back and confront those mercenaries hired by his father to kill him.",
        "During that time, Han Li counted the chaotic footsteps in fear. Although he still had no understanding of this elusive protection, he at least knew that this man could not be scared away by just five or six people. ",
        "Then… what followed was a deeper and more serious doubt.",
        "Why?",
        "Why did this person disregard his own safety, rescue him from the hands of the desperadoes on the mountain, take him to treatment, and even protect him for a whole 39 hours at a critical moment?",
        "He blocked all the dangers with his own body, and yet Han Li didn’t even know his name. ",
        "——Not for money, not for fame, not for power.",
        "What could it be?",
        "What could it be?",
        "Han Li limped out of the car with difficulty. He refused the supporting hand next to him and walked to the driver’s seat in front. ",
        "He held the unlit cigarette in his hand, then turned to the people who were looking at him nervously and said, “Let’s go home.”",
        "Home.",
        "On Han Li’s face was a calmness beyond his age. He lowered his eyes to cover the dark, vicious currents in his eyes.",
        ". ",
        "“…11, 10, 9…”",
        "The mechanical voice in his ears sounded monotonous and hypnotic. As Shen Kong jumped over the jagged and scattered piles of rocks at his feet, he was still in a leisurely mood to chat with the system: “Do you think I can still bring up the money from my previous temporary identity’s account after reaching the next major turning point of the target character? And can I take it back with me in my original world?”",
        "System: “……”",
        "Shen Kong shook his head with regret and sighed: ",
        "“It’s a pity. The Zhao family’s eight million couldn’t fall into my hands.”",
        "At this moment, the countdown in his ears finally reached zero. As the last syllable fell, Shen Kong felt his eyes go dark. The boundless darkness pressed down tightly, swallowing up his body in an instant. The light, shadow, sound, and color all around disappeared and turned into zero in an instant.",
        "Story translated by Chrysanthemum Garden.",
        "It was as if a century had passed, and at the same time, it was as if only half a second had passed before he woke up.",
        "Large swaths of color and noisy sounds rushed into Shen Kong’s senses. This process seemed bearable when sleeping, but when such a transmission happened while he was awake, it was simply torture. ",
        "Shen Kong took a deep breath. He blinked hard and finally slowly focused his eyes.",
        "He was sitting in a small classroom.",
        "It seemed that it was time for school to end. The students around him were noisily packing up. The light blue fan was spinning crookedly, making a monotonous and harsh creaking sound every time it rotated. There were chaotic footsteps and laughter inside and outside the classroom. The noise mixed into a roaring stream of sound, violently pounding Shen Kong’s eardrums. He lowered his eyes subconsciously, his eyes falling on the palm of his hand on the desk.",
        "This was a pair of young hands. ",
        "His fingers were slender and fair. His skin was also smooth, with the luster of a young man. There were no thick calluses from long-term shooting practice and small scars all over the palm. Only the index finger and the side of the thumb have soft calluses from holding a pen for a long time.",
        "Shen Kong was dumbfounded for a moment. He gently rubbed his fingertips and asked in his mind: “…What’s my identity this time?”",
        "The system’s monotonous mechanical voice sounded in his ears: “The specific information of the rectifier’s temporary identity will be transmitted simultaneously with the plot details of this time node when the system detects the target character——that is, the moment when the rectifier makes eye contact with the target character.”",
        "Shen Kong raised his head and looked around the entire classroom. ",
        "Unknowingly, the classroom had gradually become deserted from the bustle of people. The students who filled the classroom had left in twos and threes, leaving only some students who were still packing their things leisurely and the students on duty who stayed behind to clean. A girl with high pigtails was standing on tiptoes with difficulty, wiping the blackboard filled with chalk writing with a soaked rag. Shining wet marks replaced the scribbles like dragons flying and phoenixes dancing.",
        "Han Li was not here.",
        "At this moment, the system’s voice sounded once again:",
        "“Because the rectifier made an action that greatly affected the plot in the last task, the studio can only place you near the estimated time and place, which may deviate from important fate nodes. Moreover, your stay at this turning point may be longer than the last time. The specific prolonged time has not been determined. I am obliged to remind you that due to the substantial modifications you have made to the plot before, the plot of the novel may deviate greatly. The studio has transmitted the details of the plot to you, which may not be of much reference significance. But the rectifier can consider using this for references.” ",
        "Shen Kong was looking down at the books and exercise booklets on his desk. Hearing this, he couldn’t help but stop his movements and raise his brows slightly,",
        "“Deviation? How much deviation?”",
        "“It’s not clear yet, but since the plot manipulation space of this turning point is larger than last time, the studio will transmit a more detailed and clear plot to you.”",
        "Shen Kong sneered and narrowed his eyes: “You neither transmit the plot nor reveal any information about this identity. Are you expecting me to go out and wander around to see if I can bump into the target character?” ",
        "The system was stuck for a few seconds and then answered in the same mechanical tone:",
        "“The temporary identity arranged by the studio for you will definitely intersect with the target character, so now I can only advise you to wait patiently.”",
        "Chrysanthemum Garden.",
        "Shen Kong thought for a few seconds and reluctantly accepted the current explanation.",
        "He stood up, reached out, and conveniently put a few exercise booklets from the table into his deflated school bag, feeling somewhat lost in thought for a moment. ",
        "His temporary identity this time was called Cheng Chen. From the test papers scattered on the desk, it could be seen that his grades were very good. However, based on his clothing and expenditures, it could be seen that his family situation was relatively poor. He was probably unsociable and eccentric; otherwise, he would not be left alone. Almost all the people sitting in the classroom after school were gone, and no other students came to ask a question.",
        "Shen Kong threw his schoolbag behind his back and leisurely swayed out of the classroom while mentally discussing with the system:",
        "“I know you can’t tell me my temporary identity information, but at least tell me where he lives, okay?”",
        "The system didn’t answer, but the next second, Shen Kong felt his phone vibrate twice in his pants pocket. ",
        "He reached out his hand to take it out, and sure enough, a new GPS address appeared on it.",
        "Shen Kong smiled with satisfaction. He put his cell phone back in his pocket and walked out of the classroom building:",
        "“Thanks.”",
        "KEIGHTY: They’ll meet in the next chapter, fufufu~ "
    ],
    "previous": "Ch6 - Bye-bye, kid",
    "next": "Ch8 - “——A tooth for a tooth, an eye for an eye.”"
}