{
    "title": "Ch70 - Extra 1",
    "content": [
        "The system was just a system.",
        "It was born in the lab of the Three Views Rectifying Studio and had its own serial number on a long assembly line: ",
        "No. 032.",
        "It was one of the earliest systems created, but it had never been put to use for a long time because there was a defect in its core chip, seemingly an issue with the emotional simulation module. Actually, No. 032 wasn’t sure about the exact problem. It was just used to following orders.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Until one day, when the studio seemed to face some major crisis. All the systems on the assembly line were urgently dispatched to fix the flaws, and it was finally given a task.",
        "It finally had its own host. ",
        "This isn’t entirely accurate. No. 032 had been assigned tasks before, but all its hosts had invariably failed halfway. The ratings of the small worlds it managed were always the lowest.\n\n",
        "It was probably related to its defect.",
        "032 thought.",
        "But this time, it could finally go to work. Even though the temporary rectifier it was assigned to was the one with the lowest success rate among all 300 experimental subjects, 032 still felt happy. It finally didn’t have to stay alone in that empty steel warehouse anymore.\n\n ",
        "Out of 300 experimental subjects, 56 succeeded.",
        "Among the 300 small worlds, only 56 accepted the implantation of characters from other novel worlds.",
        "032’s host was very fortunate to be one of them.\n\n",
        "His name was Shen Kong. ",
        "A very interesting name.",
        "But 032’s job was not to study the name’s level of interest but to assist and guide him in completing his tasks and to buy time for the studio to tackle its current crisis through the launch of a new live broadcast project.",
        "It followed the manual and explained the situation to the new host, making him realize that he had no choice but to obey.",
        "Unexpectedly, the other party accepted it very easily. ",
        "032 was surprised. It flipped through the database’s work manual. It only provided guidance on what to do if the host refused to cooperate, but said nothing about what to do if the host was too cooperative.",
        "Well… alright then.",
        "It fell silent. It stayed inside the host’s body and observed the outside world through the host’s eyes.",
        "This host with an interesting name also had an interesting way of doing things. ",
        "When he ignored the warnings, resisted the storyline, and was determined to save the task target’s leg, 032 was not too surprised.",
        "It calculated that at this point, the host’s task progress would not advance further, so it decisively linked the host’s XUS with the rescuer, ended the plot at this time node, and sent the host to the nezt time point.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "During the time it was left unused in the warehouse, 032 had memorized the workflow and operation manual thoroughly.",
        "By monitoring the task’s progress and calculating the relevant data, 032 knew exactly how to maximize the effectiveness of the host’s current temporary identity. However, this host had no intention of listening to its advice. No matter how much 032 earnestly tried to persuade him, he maintained a lukewarm and indifferent attitude towards the task. ",
        "Until that night, the host laid it all out for 032.",
        "——”When will you understand that my willingness to cooperate is just because I wanted to.”",
        "——”So many people in the world have this so-called rectified three views and overflowing compassion, yet you guys persistently chose me—an outlaw who’s a million miles away from your purpose. I don’t want to delve into the hidden reasons behind it, nor do I care to understand what went wrong in this so-called book world to make you resort to desperate measures, forcing me to complete the task.”",
        "——“I’m an extreme hedonist. I enjoy all sorts of exciting and interesting things, so I’m willing to take on this loss-making task from you, not because I’m afraid of death——If I cared so much about my life, I would’ve retired long ago, understand?” ",
        "032 fell silent.",
        "It suddenly realized how unusual its own attitude had been.",
        "Although it didn’t have much experience with hosts, it knew how to maintain the relationship between the rectifier and the system. After all, it was just a support tool. However, from the current perspective, it has been too deeply involved. It was not only concerned about whether the rectifier completed the tasks but also worried if he had breakfast in the morning.",
        "This was very abnormal. ",
        "Perhaps its faulty emotional module was acting up again.",
        "032 decided to return to the studio for a comprehensive check-up.",
        "Besides that… there was another reason.",
        "Regarding the second point the host mentioned. ",
        "032 actually wanted to ask this question too.",
        "——Why Shen Kong?",
        "032 returned to the studio and was unexpectedly greeted with a warm welcome from all the systems. It then learned that the small world managed by its host gradually became the most popular channel. The number of viewers increased exponentially. Even the studio’s long-stagnant performance had seen an uptick.",
        "It was then that 032 realized Shen Kong was not the predetermined candidate for the “rectifier.” ",
        "According to the master controller, Shen Kong’s “character” was too arrogant, obsessive, extreme, and uncontrollable, and didn’t align with the studio’s principles, making him unsuitable as a host. However, the original work he came from was extremely popular, leading to a landslide of votes and forcing the master controller to include him in the deployment plan. Normally, such a strong personality would greatly reduce the chances of the character being integrated into a small world, especially with such a distinct “character” like Shen Kong’s, so initially, no one thought he could succeed.",
        "At that time, there was a shortage of systems, so the long-unused 032 was dispatched.",
        "",
        "Unexpectedly, he actually succeeded.",
        "He even sparked a viewing frenzy online. ",
        "The master controller was very pleased. 032 was rewarded with many private privileges it had never even dared to dream of.",
        "It pondered for a moment and pulled up the original world where Shen Kong existed.",
        "The original world broadcast ended.",
        "032 then went to the database and found all the entry trajectories and consumer service records for that novel. ",
        "It took a full three days to absorb all that vast data stream.",
        "Then it took another six days to review it twice.",
        "032 thought about it again and ultimately decided not to go to the repair station for a complete overhaul of its still-faulty emotional module but instead chose to return to the task world.",
        "In the long tasks that followed, 032 no longer offered many opinions to Shen Kong. ",
        "It didn’t know where this confidence came from, but it was certain that its host could overcome all difficulties and complete the tasks. It silently saved all the image data of Shen Kong from various angles and secretly played them back to itself in the database.",
        "Later on, 032 also grew fond of Han Li.",
        "He was too arrogant, too extreme, too obsessive, and too uncontrollable.",
        "He and its host seemed like counterparts from different worlds, so similar yet in constant conflict. As the closest observer to them, 032 was acutely aware of the intense attraction between the two, the soul-deep tension that was just so… ",
        "032 thought for a moment and decided to use a term it had seen in the bullet comments:",
        "——It was just too shippable.",
        "So 032 had another subject for full-scale monitoring.",
        "After the task was completed, Shen Kong was transmitted back to the studio. 032 felt a bit panicked. It decided to plead for its host. ",
        "It managed to secure the qualification for Shen Kong to be promoted from a temporary rectifier to a professional rectifier.",
        "But Shen Kong refused.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "032 felt its emotional module sizzling within the database.",
        "It subconsciously knew that Shen Kong wouldn’t accept, but it couldn’t accept this ending—— ",
        "As long as they were alive, he and Han Li would eventually meet.",
        "032 was very familiar with the rules within the studio. It could find some loopholes to help him… but it couldn’t say these things. It could only urgently persuade:",
        "“Rectifier, what are you doing? I worked so hard to get you this opportunity! If you just sign the studio’s official contract, you’ll have countless temporary identities to choose from, countless lives and worlds to experience. You can become a superstar in this world! If this were a novel with you as the main character, it could go on for millions of words. You can keep playing as long as you want. What else are you not satisfied with?”",
        "Even it knew how weak this reason sounded. ",
        "But the master controller was watching, and it didn’t know what else to say.",
        "So, 032 made a decision.",
        "It was going to help.",
        "Not as a system, but as a… ",
        "032 thought for a moment and decided to use another term it had seen in the bullet comments:",
        "cp fan.",
        "Thus, when an abnormal fluctuation occurred in the small world where Han Li was, 032 secretly linked several other small worlds to it. The massive chain reaction instantly engulfed the entire chain, causing all the small worlds to simultaneously begin resisting the studio’s control. Ear-piercing alarms sounded throughout the studio. Then the studio’s live broadcast links were swiftly cut off.",
        "032 was just too familiar with the studio’s loopholes. ",
        "So it wasn’t caught.",
        "But as Shen Kong’s system, it couldn’t avoid responsibility and was also restrained. The task of acting as Shen Kong’s system was then taken over by the master controller.",
        "032 didn’t care anymore.",
        "It retrieved the fully stocked storage drives from the warehouse and happily began to rewatch everything. "
    ],
    "previous": "Ch69.3 - Grand finale",
    "next": "Ch71 - Extra 2"
}