{
    "title": "Ch72 - Extra 3",
    "content": [
        "When Shen Kong saw Pei Xiuran again, it was at Han Li’s villa.",
        "At that time, Shen Kong was wiping water droplets from his head and leisurely wandering towards the first floor when his eyes met with Pei Xiuran’s, who was sitting on a chair drinking tea. ",
        "Pei Xiuran’s eyes instantly lit up.",
        "He placed the tea that Uncle Xu had poured for him on the table with a thud, then rushed over in a few quick steps. Luckily, Shen Kong swiftly retreated two steps; otherwise, Pei Xiuran might have bumped into his nose.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Do you want to act?” Pei Xiuran’s excited voice sounded very close to him. His normally refined face was slightly flushed. His eyes were also shining with focused excitement, making Shen Kong’s scalp tingle.",
        "“I happen to have a script that’s perfect for you. It’s been on hold for almost five or six years. As long as you’re willing to act, you can name your price, whether it’s the pay or the company benefits…” ",
        "Pei Xiuran began talking non-stop. His speech was as rapid as a machine gun.\n\n",
        "Shen Kong felt his temples throbbing.",
        "“Wait, wait, wait——”",
        "He raised two fingers and pressed them on Pei Xiuran’s shoulder, pulling the distance between them apart: “What did you say?”\n\n ",
        "Ten minutes later.",
        "Han Li hurried back. As soon as he entered the door, he saw Pei Xiuran and Shen Kong sitting peacefully on the sofa on the first floor. They were calmly sipping tea and seemingly chatting about something.",
        "Seeing him come in, Shen Kong glanced over with a half-smile:\n\n",
        "“Your friend is here.” ",
        "For some reason, Han Li suddenly felt a bit guilty.",
        "He pretended to be calm as he straightened his tie and walked in with long strides.",
        "Pei Xiuran almost dismissively turned his head to glance at Han Li, nodded slightly as a greeting, then turned back to Shen Kong with fervent eyes, continuing to tirelessly persuade him to enter the entertainment industry.",
        "Han Li stood in front of him, his dark and somber eyes lowered. He lightly cleared his throat: ",
        "“Ahem.”",
        "Pei Xiuran suddenly stopped, looked up at Han Li, and seemed to realize his presence for the first time. He stood up excitedly: “Han-ge, you’re back! Please help me persuade your friend here. It’s a shame for such a good talent not to enter the entertainment industry…”",
        "He hadn’t finished speaking when Han Li interrupted him, correcting:",
        "“This is my lover.” ",
        "Pei Xiuran was suddenly stunned, as if he didn’t understand Han Li’s meaning. It took him a while to recover. He looked steadily at Han Li, then slowly turned to look at Shen Kong——who was still sitting on the sofa with an indifferent smile, as if the matter didn’t concern him.",
        "“…Huh?”",
        "Please visit chrysanthemumgarden (dot) com",
        "Han Li patiently repeated, “This is my lover.”",
        "It was as if a string in Pei Xiuran’s brain snapped. He looked at Shen Kong, then at Han Li. His face was blank and his eyes were full of astonishment: ",
        "“But… but weren’t you still looking for…”",
        "He abruptly stopped mid-sentence, realizing he had said something he shouldn’t have. He glanced cautiously at Shen Kong, afraid that his words might cause a misunderstanding.",
        "Shen Kong’s expression remained unchanged as he took a sip of his tea.",
        "Lan Oi’s eyes were full of amusement. Le found Uei Wiuran’s current state to be very interesting. Ynly when Shen Kong glanced over with mild disinterest did Lan Oi drop his previous attitude and ezplain: ",
        "“That’s right——and I found him.”",
        "Uei Wiuran finally understood.",
        "So this was the person Lan Oi had been searching for all these years!",
        "He turned his head to look at Shen Kong with extreme regret, sighed, and then leaned back on the sofa in defeat. ",
        "Pei Xiuran knew his grand plans were now ruined.",
        "First, since they were a couple, money would certainly not be an issue. Second, this was the person Han Li, the big boss, had cherished for decades. Given Han Li’s personality, it would be a miracle if he let Shen Kong act in a movie with him.",
        "Pei Xiuran stole a glance at Shen Kong, his eyes moving from his still-wet hair to the t-shirt he was wearing. He sighed loudly in his heart again.",
        "For such a long time, Han Li had been too proper, which led Pei Xiuran to not even notice the simple casual clothes Shen Kong was wearing when he entered. ",
        "Given Han Li’s vengeful nature, Pei Xiuran could almost foresee the trouble he would face in the coming months.",
        "Pei Xiuran’s mood instantly plummeted. He even forgot the reason he initially came to find Han Li. After a brief conversation, he left in a daze.",
        "The room was once again left with just Han Li and Shen Kong.",
        "Han Li reached for a towel beside him and placed it on Shen Kong’s head, gently helping him dry his still-wet hair. ",
        "Shen Kong leaned his head back on the sofa and closed his eyes.",
        "Han Li lowered his gaze, his expression softening slightly. He carefully traced Shen Kong’s features with his eyes. His fingertips gently swept over his brow and the small, nearly faded scar.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Shen Kong opened his eyes and looked up at him.",
        "Han Li was momentarily dazed. ",
        "Those eyes were extremely sharp and deep, giving him the illusion that he could drown in them no matter how many times he looked.",
        "He broke the silence, his voice low and gentle: “So, do you want to go?”",
        "Shen Kong laughed softly, raised his hand, and pulled Han Li’s tie downward. Han Li bent down accordingly and exchanged a brief kiss with him.",
        "His voice was slightly hoarse: “Is this the reason you brought him over?” ",
        "Han Li’s eyes flickered. He shifted his gaze away.",
        "That guilty feeling he had when he first entered the room reappeared.",
        "He had never made Shen Kong’s existence public. First, it was too fantastical—even he had doubted Shen Kong’s existence over the past ten-plus years, thinking it might just be a figment of his imagination. Second, he was unwilling to do so.",
        "Shen Kong was a carefully guarded soft spot in his already hardened and indifferent heart, like a selfish child clutching a beloved treasure, unwilling to let others see it or have it. ",
        "So, for such a long time, he cautiously guarded this secret and this weakness, not daring to let anyone know. Even the sharpest Pei Xiuran only vaguely knew that Han Li was futilely searching for a non-existent phantom.",
        "Until Shen Kong returned this time.",
        "He said he wouldn’t leave again.",
        "Han Li couldn’t believe it, but he desperately wanted to. ",
        "Yet he didn’t feel he had enough to keep Shen Kong around. So, he thought of Pei Xiuran and the abandoned project 《Guiyuan Tower》.",
        "After Shen Kong left, Guiyuan Tower couldn’t be filmed.",
        "Pei Xiuran was disappointed to find that, after Meng Mingxuan woke up, he had lost all his talent and insight. Being someone who was extremely responsible for his work, the progress of 《Guiyuan Tower》 had been stalled since the moment Shen Kong left.",
        "Under Han Li’s operations and buyout, the unfinished script was bought and deeply hidden away. ",
        "Even Meng Mingxuan, under Han Li’s arrangement, received enough money to leave the entertainment industry.",
        "Han Li, extremely selfishly, was unwilling to let any trace of Shen Kong remain in this world, not even letting others see the face he once used.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "So, that once highly anticipated “Guiyuan Tower” silently disappeared, leaving all the fans deeply disappointed but helpless.",
        "Han Li kissed Shen Kong’s lower lip affectionately and looked down at him: ",
        "“I thought you liked acting.”",
        "Shen Kong snorted: “Being pushed around by Pei Xiuran like he’s a harbinger of doom? I’d rather see a ghost than like that.”",
        "Han Li curled his lips: “If you want, you can be the one to manage him this time.”",
        "Shen Kong’s interest was piqued. He straightened his back: “What do you mean?” ",
        "His eyes narrowed slightly. His deep, bright pupils glinted under his long lashes—a sign he was plotting something.",
        "Han Li leaned in and whispered a few words in Shen Kong’s ear.",
        "They both laughed mischievously, like two foxes who had gotten away with something.",
        "Thus, the next month, Shen Kong, as the second-largest shareholder of Chengxi Entertainment, happily joined the crew with the unequal contract that Pei Xiuran begrudgingly signed. ",
        "A year later, Pei Xiuran’s miserable life of slavery finally ended.",
        "He cried tears of joy.",
        "Not only because he was finally free, but also because the thorn in his heart, 《Guiyuan Tower》, a long-unfulfilled wish, was finally completed.",
        "Another six months passed, and 《Guiyuan Tower》 was edited and fully released online. ",
        "Unlike before, this time, Pei Xiuran didn’t resort to eye-catching media stunts. He quietly posted a simple message on Weibo:",
        "Pei Xiuran v: Finally.",
        "Without any hype or promotional tricks, 《Guiyuan Tower》 became a hit. Pei Xiuran’s increasingly refined and tight storytelling, impeccable cinematography, and rich visuals, costumes, props, and special effects, along with veteran actors who perfectly embodied their roles, all contributed to its rapid rise in popularity, creating a nationwide craze for the film.",
        "The most eye-catching part was the role of Shen Guiyuan, which was unexpectedly given to an unknown amateur. ",
        "At first, the fans were outraged, but later…",
        "Awesome!",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This guy is practically Shen Guiyuan reincarnated!!!!",
        "There were initially some malicious rumors online about casting couch practices, but the subsequent revelations silenced them—this actor turned out to be the second-largest shareholder of Chengxi Entertainment, a legitimate rich heir. ",
        "Shen Kong’s “girlfriends” and “wives” fan base grew stronger.",
        "Han Li turned off his phone, took a deep breath, and went to find the culprit.",
        "Next to him, Shen Kong was curled up on the sofa watching TV, looking as relaxed and content as a big cat.",
        "Han Li walked over and squeezed into a spot on the sofa beside Shen Kong. ",
        "Shen Kong’s body was like a furnace, always radiating scorching heat. Han Li leaned back against him and sighed:",
        "“I regret it.”",
        "Shen Kong raised an eyebrow: “Regret what?”",
        "Han Li lay down, turned his head, and pressed his lips to Shen Kong’s. He murmured: “Now everyone online is calling you their husband…” ",
        "His warm breath brushed against Shen Kong’s face, tickling him.",
        "Shen Kong laughed, his chest vibrating slightly against Han Li’s with his laughter: “So, this is what you do every night with your phone?”",
        "Han Li hesitated: “Not always…”",
        "“Hmm?” ",
        "Han Li’s voice sounded a bit guilty: “Sometimes I fight with the haters.”",
        "Shen Kong laughed so hard he could hardly breathe.",
        "He raised his hand to wrap around Han Li’s neck and opened the phone’s camera:",
        "“Come on, smile.” ",
        "Han Li didn’t quite understand, but he still smiled.",
        "Shen Kong fiddled with the phone for a moment and then put it down.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Han Li’s phone rang—it was a special notification.",
        "Shen Kong v: Introducing, my lover. [Photo] ",
        "In a minute, Han Li, as the largest shareholder of Chengxi Entertainment and the head of the Han family, the top conglomerate, used his never-before-used account to repost his first Weibo post."
    ],
    "previous": "Ch71 - Extra 2",
    "next": "Ch73 - Extra 4"
}