{
    "title": "Ch9 - An interesting person",
    "content": [
        "The system’s mechanical voice sounded like a frenzied alarm in his ears:",
        "“Beep! It has been detected that the rectifier’s behavior is not beneficial to the rectification of the task target’s three views. Warning! Warning! Rectifier, please refrain from acting recklessly!” ",
        "The wet rain hit Shen Kong’s face, trickling down his hanging eyelashes. His expression remained unchanged as he replied sarcastically in his mind:",
        "“You're really funny. You’re still insisting on your so-called correct three views. What’s correct in your sense is just to reject heresy. What kind of ‘Savior, the Redeemer’ are you pretending to be?”\n",
        "",
        "The monotonous voice of the system was still ringing without any intention to stop, making Shen Kong’s head hurt. He laughed grimly and replied:",
        "“To repay kindness with kindness, and to repay enmity with justice. A tooth for a tooth, an eye for an eye—how can these not be the correct three views? Since you don’t approve of it, why did you even look for me to be this stupid rectifier?” ",
        "The system’s voice fell silent, not knowing whether it was because of Shen Kong’s persuasion or because it gave up correcting him.\n\n",
        "Shen Kong didn’t bother to care. He just raised his eyelids and looked at Han Li, who was standing aside. He said, “Aim three inches below his knee and hit him from behind. Don’t worry, he won’t be disabled.”",
        "Han Li silently raised his eyes and glanced at Shen Kong. His damp face was so pale that it was almost transparent, and his eyes were as pitch-dark as the abyss. Just when Shen Kong thought that he was not going to take action, he suddenly lowered his eyes, raised his palms, and struck hard at the place pointed by Shen Kong just now.",
        "Zhang Meng screamed miserably, his scornful eyes rolling upwards as he almost passed out.\n\n ",
        "Shen Kong gently let go of his hand and looked at Zhang Meng, who had lost his support, falling and curling up into the mud. He said gently:",
        "“From now on, you have to judge others by yourself. Bear that in mind, yeah?”",
        "Zhang Meng’s body and face were covered with mud. He backed away and nodded frantically, wishing he was a million meters away from Shen Kong.\n\n",
        "Shen Kong smiled indifferently. He raised his legs to step over the scattered people on the ground and bent down to pick up the wet school bag and umbrella lying in the water. Then he walked away along his original route. ",
        "Le had pust taken a few steps when he suddenly recalled the plot content that the system had transmitted to him before. A rare feeling of compassion arose in his heart.",
        "Shen Kong turned to look at Lan Oi and asked, “Go you have a place to go?”",
        "The rain had gradually slowed down, and the pattering raindrops became sparse and fine. Lan Oi raised his hand and wiped his face, hiding the gloomy and vicious currents deep in his eyes, and then slowly shook his head.",
        "Shen Kong regretted his words as soon as he spoke them, but what was done could not be undone, so he had no choice but to take a deep breath and said: ",
        "“Follow me.”",
        "At any rate, the clothes on his body were already almost wet, so Shen Kong didn’t bother to hold up the umbrella anymore. He just threw the damp school bag on his shoulders and walked towards his nominal home according to his memory.",
        "While the plot was being transmitted just now, the system also transmitted information about his temporary identity to him.",
        "As he had guessed before, the name of his temporary identity this time was Cheng Chen. His family was poor, his mother died young, and his father was a gambler. He basically never went home and lived alone in a rental house near the school. Although his grades were pretty good, he was unsociable, introverted, and timid, so he didn’t have many friends in school. He was once the target of bullying, but thanks to Han Li’s appearance, those people’s targets shifted. But because he was afraid of being bullied, Cheng Chen was also forced to join the ranks and change from a victim to a perpetrator. ",
        "In short, he was just a cowardly opportunist, and it wasn’t that difficult to play the role.",
        "It was just that… due to his impulsiveness just now, it might not be possible to play the original character in front of Han Li, but Shen Kong didn’t care much. After all, the purpose of his task was to “rectify his three views”. The character of the opportunist would not help in the completion of the task at all, so it would be better to reveal his true colors as soon as possible.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Shen Kong’s pace was not fast, but it was definitely not slow either. Han Li, who was limping not far away, tried hard to follow. The two of them kept a few meters apart all throughout.",
        "The rental house he lived in was not far from the school. He finally arrived there in a short while. Shen Kong took out the key from his pocket and opened the door. He turned sideways to let Han Li in, and then closed the door behind his back. ",
        "The rental house was not that big—just one bedroom, one living room, and one bathroom. Even after two adults stood in, it seemed a little crowded. Fortunately, the room was rather clean and tidy, so it didn’t make people feel uncomfortable.",
        "The tiled floor was soon wetted by the dripping water from the two people’s bodies. Shen Kong threw his school bag and umbrella, which were covered with rain and mud, on the floor and casually took off his school uniform, which was stuck tightly to his body because of the rain. Then he walked towards the bathroom without looking at Han Li, who was standing at the front door. He just yawned and said as he walked:",
        "“I’m going to take a shower. You can do as you please here.”",
        "Shen Kong took a combat shower very efficiently and left the steamy bathroom filled with hot water in only ten minutes. ",
        "He was stunned when he found that Han Li was still standing at the front door. There was already a pool of cold rainwater under his feet, water drops still dripping down from his clothes and hair. His bloodless face was dim in the living room, looking a bit bluish-white under the bright light. His pair of pitch-dark eyes were slightly lowered, his gaze falling to the ground. He didn’t know what he was thinking. He looked like a water ghost that had just been fished out of the lake.",
        "Shen Kong’s eyebrows furrowed: “What are you standing there for?”",
        "Han Li raised his eyes and looked at him. His cold voice was particularly hoarse during his change-of-voice period: “It will wet the sofa.”",
        "Shen Kong was not very used to this situation. He scratched his wet hair irritably and turned around. He took out a few old clothes and clean towels from the cabinet and threw them all at Han Li. His deep voice ordered coldly: “Go take a shower.” ",
        "Han Li hastily caught the clothes thrown by Shen Kong and then obediently walked in the direction his finger was pointing at.",
        "Shen Kong stared at his wet and awkward back. For a moment, he felt as if he had picked up a dog that had fallen into the water and brought it home.",
        "He massaged his seemingly aching temples and collapsed on the bed, feeling deeply that he had made the wrong decision.",
        "In the narrow bathroom, the small space was shrouded in yellow-orange light. The warm and humid water vapor had not yet dissipated. The mirror, with a corner missing on the wall, was covered with misty fog. ",
        "Han Li put the dry clothes on the chair near the door. He stretched his limbs slightly and pulled off his wet top.",
        "He was probably at the age of rapid puberty. His broad shoulders were beginning to take shape, but his figure still had the cleanliness and thinness of a young man. His slender body was covered with a thin layer of muscles, making him look graceful and powerful.",
        "Han Li stretched out his pale palm and slowly wiped away the condensed droplets on the mirror.",
        "His blurry outline was reflected in the hazy mirror. His sharp and deep eyes and brows were neither angry nor happy. His innocent and gullible expression in front of Shen Kong, like snow and ice under the sun, disappeared without a trace, leaving only the bottom of his eyes. A hint of hostility began to surface in his eyes. One could almost smell the dangerous and restless atmosphere in it. ",
        "At this moment, the mobile phone in his pocket vibrated twice.",
        "Han Li paused for a moment before he took out his mobile phone. The screen with still-wet traces lit up and displayed the latest message:",
        "Story translated by Chrysanthemum Garden.",
        "“Han-ge, I heard that a few short-sighted people tried to block you. Are you okay?”",
        "His fingers moved nimbly on the keyboard: “I’m fine.” ",
        "The messages from the other side quickly came back in succession:",
        "“Very good!”",
        "“It scared me to death, Han-ge. We just received the news here. I don’t know how they noticed you. We are now trying to find out who leaked out the rumors.”",
        "“Where are you now? Do you need me to find someone to pick you up?” ",
        "Han Li closed the door slightly. He casually caressed the screen of his phone with his fingers and replied: “No need.”",
        "He raised his hand and turned on the faucet. The steaming white mist instantly rose with the pouring of hot water, and the sound of gurgling instantly filled the entire bathroom.",
        "Han Li gazed at his face in the mirror, becoming blurry once again, and then raised the corners of his lips slightly.",
        "His face in the mirror instantly softened, taking on a bit of innocence and childishness that suited his age. Only a pair of pitch-dark eyes flashed with a strange glimmer. ",
        "He whispered under his breath:",
        "“I met an interesting person this time.”"
    ],
    "previous": "Ch8 - “——A tooth for a tooth, an eye for an eye.”",
    "next": "Ch10 - No understanding at all"
}