{
    "title": "Chapter 3",
    "content": [
        "Outside the window, where green trees cast their shade, the warm sun falls, scattering broken, delicate light. A clean black tie hangs on the clothesline beyond the balcony, swaying slightly in the wind.",
        "Lu Yiman, wearing silver-rimmed, radiation-proof glasses, sent out a document. There were faint, reddish marks on his wrist at the cuff, and as he stopped typing, those marks quickly disappeared into his sleeve. ",
        "Peng Duoduo, with a profile picture of Princess Elsa, was sending a flood of messages, one image after another, asking him which one to choose.",
        "Looking at the various angles and colors of the familiar Lexus, he chuckled.\n",
        "",
        "—Why are you asking me?",
        "—Aren’t you a designer? Help me see which one suits my vibe! (Cat winking.jpg) ",
        "A smile spread across his face, and his rounded fingertips pressed down on the keyboard.\n\n",
        "—I’m a fashion designer, I don’t know anything about cars.",
        "After sending that message, he closed the chat window and opened another application.",
        "A round-headed cartoon character with pitch-black beady eyes, dressed in a formal suit and tie, hung with a tiny black tie over its small body.\n\n ",
        "It was an unfinished chibi-style comic.",
        "The reason Lu Yiman became interested in this novel in the first place was that the “Lu Yiman” in the book resembled him too much, so much so that it felt like a parallel-world version of himself.",
        "They were both in the design profession, only designing women’s clothing, taking orders solely online, having their own independent brand, without selling their talents to any company. Though sustaining themselves wasn’t difficult, they weren’t exactly famous either.\n\n",
        "However, a slight difference was that the “Lu Yiman” in the book had an additional hobby: sketching. He loved looking at mountains and rivers, taking a sketchpad and disappearing into the wilderness for long periods. ",
        "It’s no wonder that after he fell off a hillside, no one came looking for him for a month.",
        "As for Lu Yiman himself, he preferred drawing comics. He had an independent account on a public platform, filled with his little comics, which, due to their warm and cute style, attracted many fans.",
        "He was a free agent, not tied to any company, drawing purely for fun. Occasionally, he would stream, showing only his hands, but even that drove many fans wild.",
        "He enjoyed sharing those adorable little stories with others. ",
        "In terms of personality, though, he was not much like the “Lu Yiman” in the book.",
        "Since arriving here, he had carefully stored away all of “Lu Yiman’s” sketchbooks, even the half-used pencils, locking them all in a box.",
        "He himself restarted his comic account.",
        "The stern-faced little character stared back at him with those pitch-black beady eyes, but the neatly tied tie was now gone, and the tight-lipped mouth curled slightly upward, forming a sneer on the round, short face. ",
        "Satisfied, he finished the last stroke when his phone suddenly vibrated on the desk.",
        "The caller: Ms. Song.",
        "Please visit chrysanthemumgarden (dot) com",
        "“Hello.”",
        "“Timan, come over for dinner today.” The woman’s voice carried a hint of barely noticeable hesitation, cautiousness even. ",
        "As if afraid he would refuse, the woman hurriedly added, “It’s your sister’s birthday today. We didn’t invite anyone else, pust the family, so I wanted to ask you to poin us for a meal…”",
        "Her voice trailed off toward the end, becoming almost inaudible.",
        "He glanced at the screen, where the little character with the beady eyes was giving him a cold, disdainful sneer. His thin lips parted.",
        "“Okay.” ",
        "The woman on the other end of the line let out a sigh of relief, her tone noticeably more cheerful.",
        "“Then I’ll have the driver pick you up, and after dinner, we’ll cut the cake together…”",
        "As she rambled on, his mind began to wander.",
        "… ",
        "Most people can’t retain memories from before they were three years old, but he remembered, and he remembered clearly.",
        "In the winter of his third year, his father passed away unexpectedly. The compensation didn’t come through, and his mother was a delicate, pretty woman who had never faced hardship. Just arranging the funeral exhausted all her energy.",
        "The company didn’t want to take responsibility, sending people to negotiate daily, using both sweet words and threats. After running out of kind words, they stationed someone at their doorstep every day.",
        "A woman who had always been pampered by her husband couldn’t bear the sudden burden of life. Rent, the judging eyes of others, the company’s threats, and the needs of a three-year-old child overwhelmed her. ",
        "Unable to handle the sudden onslaught of problems, she chose to escape.",
        "After crying all night, she packed up Lu Yiman’s things and, on a snowy winter’s evening, sent him to an orphanage.",
        "She herself fled the city.",
        "Lu Yiman knew he had been abandoned. A three-year-old can’t yet learn the art of self-deception. ",
        "Panic swept over him, and all those terrifying problems weighed heavily on his small body.",
        "It took him three years to blend into that dilapidated orphanage, to accept those “companions,” and eventually, through constant exposure, he became one of the best among them. Adoption was the only way out.",
        "",
        "That opportunity came when he was six.",
        "As an orphan, even though he technically had a mother, it was too much to hope for a mother’s love. Three years in the orphanage had made him like all the other orphans—just having a home would be enough. ",
        "He was a well-mannered child with rosy cheeks and white teeth, so naturally, he was chosen. Amid the envious gazes of his “companions,” he was taken away.",
        "This left him bewildered and nervous, filled with anticipation yet inevitably a bit afraid.",
        "Even though he had accepted that he was an orphan, the fact that he was about to become someone else’s child still felt unreal.",
        "When the adopting couple asked if he would mind changing his last name, he was startled and suddenly burst into tears. The sadness and fear that had been bottled up inside him, unable to be released, finally came pouring out. ",
        "He didn’t change his name.",
        "At that moment, he felt he wasn’t truly an “orphan.”",
        "The couple treated him fairly well. Unable to have children of their own, they really did raise him as their own. After the initial nervousness and awkwardness, he gradually relaxed and accepted his new life.",
        "But life’s hardships do not end so easily. ",
        "A year later, the couple suddenly became pregnant.",
        "The cold returned to the air, day by day, night by night, turning into the yellowing trees outside the window, the dim sky, and those whispered conversations they didn’t want him to hear, though he pretended not to notice.",
        "A child with memories from the age of three understands a lot.",
        "He was sent back to the orphanage, under the apologetic gaze of the couple. He left empty-handed and returned empty-handed, just as he had come—once again, with nothing. ",
        "After that, he became a true orphan of the orphanage.",
        "Because as he grew older, the chances of any family wanting him grew slimmer.",
        "Throughout the passage of time, he never let go of his childhood memories, but they didn’t hold him back either. After all, life goes on and won’t stop just because of the pain he endured.",
        "With the help of social welfare, he worked hard in school and grew up safely. Thanks to his excellent academic performance, he went to a school in the city during high school. ",
        "He was outstanding enough, brilliant enough, but also silent enough.",
        "The tall, slender teenager always seemed to be carrying something heavy on his shoulders.",
        "",
        "At seventeen, he participated in a provincial competition and went up to receive an award. Alongside him stood other equally brilliant and dazzling young people, and below the stage were their proud and excited parents.",
        "And that’s when he saw his mother. ",
        "It was strange. After all these years, he recognized her instantly.",
        "But she wasn’t there for him—she was there for her child.",
        "In her shocked, trembling eyes, in her panicked gaze, he saw a confident, lively girl in the elementary school group.",
        "Ten years old, seven years younger than him. ",
        "When his adoptive family returned him to the orphanage, she had just been born.",
        "He looked again at his mother—still elegant, still glamorous. She must have lived well.",
        "Of course. His mother had always been a woman who couldn’t handle hardship.",
        "That day, under the sunlight and amidst the lively cheers around him, he stood on the stage, looking at her from a distance, both unfamiliar and familiar. ",
        "He didn’t sort out his feelings, but her panicked expression already told him everything.",
        "In the end, she secretly handed him ten thousand yuan in cash. Words hesitated on her lips, unable to come out, while her eyes shifted with a complex and evasive look.",
        "“Daddy!”",
        "The crisp, sweet voice broke through the stagnant air, and the sunlight that fell upon him brought an unexpected chill. ",
        "The car door opened, and a refined, tall man caught the little girl who flew into his arms like a bird.",
        "In her panicked gaze, he sighed and turned away without hesitation.",
        "Step by step, what had begun as difficult soon became smoother. The chill dissipated, and the warmth of the sunlight once again covered his skin.",
        "He smiled, not knowing exactly why, but the weight on his shoulders disappeared in that instant. ",
        "…",
        "Gazing out at the bustling traffic, his eyes flickered with the vibrant neon lights, while the driver in the front seat glanced at him cautiously from the corner of his eye.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This young master, who bore a different surname, seemed different from before.",
        "In the past, whenever he was picked up, he remained silent, almost hiding himself in the dim back seat. ",
        "The driver understood why. The young master was not the biological son of the gentleman, yet he had been brought back into the Chen family, making his position rather awkward.",
        "But Mr. Chen was a good man, and Mrs. Chen was kind as well. Ever since they acknowledged him at seventeen, they had always treated him as the eldest son. Mr. and Mrs. Chen had only one daughter, so it was inevitable that a portion of the family inheritance would go to him.",
        "This is why the driver couldn’t quite understand. If the young master was willing to be taken back, why did he always seem so gloomy?",
        "It had been over a month since anyone had heard from him, but now, upon seeing him again, the driver felt that something had changed. ",
        "If anything had changed, it was that the young master’s eyes seemed much brighter.",
        "“Xiao Wang, why isn’t there a banquet this time?”",
        "The driver was momentarily stunned, quickly retracting his gaze and sitting up straight, holding the steering wheel firmly.",
        "“Sir said Miss Chen is too young, and throwing such grand birthday parties every year isn’t ideal. A family dinner would be simpler and more peaceful.” ",
        "Lu Yiman turned his head to look at the moon, obscured by tall buildings outside the window, and quietly said, “I see.”",
        "His eyes held reflections of the water, the moon, and the stars, but there were no ripples of emotion.",
        ""
    ],
    "previous": "Chapter 2",
    "next": "Chapter 4"
}