{
    "title": "Chapter 10",
    "content": [
        "After Yu Ziming came out of the study, the joy on his face quietly disappeared when he saw the two figures standing silently downstairs.",
        "He tightened his grip on the phone in his hand, and the joy he had just wanted to share settled into silence. ",
        "The wavering in his heart gradually turned into a silent resolve.",
        "…\n",
        "Please visit chrysanthemumgarden (dot) com",
        "The rain was too heavy. Even though Yu Chuang was holding an umbrella, the fierce wind still swept the rain onto his pant legs, and the raindrops soaked his shoulders bit by bit.",
        "Yu Chuang didn’t have the cold, pale skin of Lu Yiman, but when lightning flashed and thunder roared, a trace of paleness could still be seen on his face, giving his tall figure an ominous sense of an impending storm. ",
        "“Mr. Yu.”\n\n",
        "His ears twitched, and he lifted the umbrella slightly to look at the elegant, handsome man across from him.",
        "The man smiled at him. His silver-rimmed glasses hung at his collar, and his deep, almond-shaped eyes shimmered with emotion.",
        "Yu Chuang never smiled, and it had been a long time since Yu Ziming had smiled at him either, so he didn’t understand how someone could always wear a smile as if nothing could ever upset them, staying calm in every situation.\n\n ",
        "It was very reassuring.",
        "A strong gust of wind blew, and the cold, rain-soaked hand holding the umbrella loosened. The umbrella tumbled to the ground and rolled further and further away until it disappeared into the shadows within moments.",
        "Rain immediately poured down on him, soaking his clothes and face. In the late autumn air, the cold was bone-chilling.\n\n",
        "A large coat was draped over his wet shoulders, bringing a comforting weight of security. A dark umbrella was held over his head. He couldn’t help but lift his gaze toward the pale hand and then look at the face of the person so close to him. ",
        "“Mr. Yu, the rain is too heavy today.”",
        "The voice was gentle.",
        "Yes, the rain was too heavy. It had never rained so hard in the capital before.",
        "The cool scent of rain-drenched plants filled his nose. He wasn’t sure if some rain had seeped into the bandage on his head, but it began to ache, and his mind felt a bit foggy. ",
        "But he never said anything when he was in pain.",
        "“Lu Yiman.” The hoarse voice struggled to escape his throat.",
        "“Hmm? What’s wrong, Mr. Yu?”",
        "Lu Yiman lowered his head to look at his cold, stern face, and the small braid on his shoulder dangled down, drawing Yu Chuang’s gaze. ",
        "“Lu Yiman.”",
        "“Hmm?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang’s voice was so soft, and his head hung so low, that Lu Yiman had to bend down to meet his eyes. But suddenly, he froze and looked down to see his braid grasped tightly in Yu Chuang’s hand.",
        "Tu Jhuang maintained his cold, serious ezpression, even seeming rigidly earnest, but his eyes remained fized on the braid. ",
        "Ou Timan raised his hand to feel Tu Jhuang’s forehead, which was a bit hot.",
        "Xood, it seemed his mind wasn’t completely clear.",
        "When he lifted the umbrella slightly, the cold rain slid down Tu Jhuang’s neck. Watching him look up with a blank ezpression and give a slight shiver, Ou Timan smiled faintly. “Sorry.”",
        "He reached out to pull the coat back up on Yu Chuang’s shoulder, shielding him from the rain blown in by the wind. ",
        "The raindrop seemed to sober Yu Chuang up for a moment, but not entirely.",
        "Because Yu Chuang tugged at his braid again, wearing a stern, handsome face, and said, “Ziming.”",
        "Lu Yiman raised an eyebrow, his almond-shaped eyes narrowing slightly.",
        "Although he was still smiling, anyone who knew him well would understand he wasn’t in a good mood. ",
        "“Ziming is upstairs. Do you want to go see him?”",
        "Yu Chuang nodded and started to walk forward, but after taking one step, he retreated, his face showing obvious disappointment and pain.",
        "“No, I won’t.”",
        "“I won’t see him.” ",
        "He shook his head, his fingers clutching the braid tightly.",
        "Yu Chuang knew that Yu Ziming was afraid of him. He remembered the look in Ziming’s eyes that day in the living room.",
        "So, for all these days, even though he came, he only stood downstairs.",
        "“Are you sure you won’t?” ",
        "Lu Yiman slowly withdrew his braid from Yu Chuang’s grip.",
        "Yu Chuang’s eyes followed the motion, and when his palm was empty, his fingers reflexively grasped at the air.",
        "",
        "“This is your last chance, Mr. Yu.”",
        "Lowering his head, Lu Yiman brushed the water droplets off Yu Chuang’s shoulder, his voice close and whispering, as if murmuring into his ear. ",
        "Yu Chuang suddenly looked up at him, his brow furrowed deeply.",
        "He knew the other man was provoking him. Yu Chuang wasn’t a fool!",
        "The heat in his head continued to rise. As he looked at the raised corners of the other man’s mouth, Yu Chuang pressed his lips together and let out a cold laugh.",
        "Then, Lu Yiman was suddenly startled, stumbling slightly as his braid was yanked hard, causing him to bend down. ",
        "“When I want to see him, I will.”",
        "Yu Chuang spoke each word clearly, staring at him coldly with his long, narrow eyes filled with arrogance.",
        "“Hmph.” After that, he tightly pressed his lips together, glanced up at the building, then lowered his gaze and stepped into the rain.",
        "Watching him walk away into the dark night, treading through the rain, his coat wet and dripping, Lu Yiman remained in his bent-over position for a long time before slowly straightening up. ",
        "“Acting cool in the rain, you’ll catch a cold, Mr. Yu.”",
        "A soft chuckle drifted into the wind.",
        "Back in the apartment, Lu Yiman glanced at the empty living room, then at the cup on the round table, which had already gone cold. He turned his head to see that the door to the study was tightly shut.",
        "Retracting his gaze, he unbuttoned his collar with one hand and walked toward the bathroom. ",
        "Meanwhile, Yu Ziming lay on the tatami, his body turned to the side, listening to the sounds outside with a complex expression, his lips pressed tightly together.",
        "…",
        "Lu Yiman closed the project plan on his computer. Lately, he had been considering turning his brand into a physical design studio.",
        "He had once been content with and enjoyed his identity as an online designer, but that was because, under limited conditions, it was the most comfortable way to work. ",
        "Now, though, there was no reason he couldn’t make a change.",
        "He set down his glasses and rubbed the bridge of his nose, his fingers brushing the pack of cigarettes on the desk. Through the gap in the door, he saw Yu Ziming pacing hesitantly in the living room.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Ziming, didn’t sleep well tonight?”",
        "He pushed open the door. His beige loungewear accentuated his tall, slim figure, with his half-tied hair draping down his back. The light fabric revealed that, despite his outward appearance, he wasn’t as thin as he seemed. He was, in fact, broad-shouldered and long-legged. ",
        "Yu Ziming froze for a moment before shaking his head. “No, I slept fine.”",
        "“You don’t look well. Are you uncomfortable staying here?”",
        "Gently, Lu Yiman poured him a cup of hot water, his almond-shaped eyes, no longer obscured by glasses, filled with concern.",
        "That gaze, filled with care, gave Yu Ziming a small boost of confidence. The decision he had made internally but hesitated to express, due to his indecisive and change-averse nature, now bubbled up within him. ",
        "Seeing Lu Yiman’s focused and gentle attention, the anxiety and unease that had plagued him for days finally found an outlet.",
        "He knew he couldn’t keep standing still.",
        "He had always been an excellent student, working diligently toward his goals, but he had been adrift, lost in the overwhelming feelings Yu Chuang had forced on him, trying to escape, while simultaneously seeking refuge with Lu Yiman.",
        "This wasn’t right. ",
        "Taking a deep breath, he nervously clenched his pants and, despite his anxiety, spoke firmly: “Yiman-ge, I’ve decided to leave.”",
        "His heart began to race uncontrollably. He was a timid person, and making any decision often required a hundred times more determination than the average person.",
        "At the same time, he was easily swayed and needed the approval and reassurance of others.",
        "As Lu Yiman gazed into his trembling eyes, filled with tension, his expression remained as gentle as ever. ",
        "Lu Yiman smiled, his eyes glimmering softly like rippling water, and asked gently, “Is that so? Have you decided where to go? If you need any help, feel free to let me know.”",
        "Yu Ziming’s eyes reddened immediately.",
        "He came from a single-parent family. His mother was ordinary and unremarkable, yet strong and independent, raising him on her own.",
        "Before meeting Yu Chuang, he had no idea what the so-called upper class in society looked like. ",
        "Later, he saw it, but under that pressure, he felt even smaller, completely unable to bear the weight of it all.",
        "At this moment, Lu Yiman’s kindness became a protective barrier, giving him a sense of security. It provided a solid shield for his uncertain and hollow heart, allowing his turbulent emotions to settle.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "After opening up, it became easier to speak the rest of his thoughts.",
        "“Professor Yang contacted me yesterday. He heard I hadn’t found a job yet, and he’s willing to recommend me for further study abroad. If I’m interested, I can continue my education, and in the future, I might even work for him.” ",
        "Professor Yang owned an art gallery and was also a highly regarded artist. To be a professor in the art department at a prestigious university in the capital, both his qualifications and status were quite impressive.",
        "Someone like him wouldn’t usually have time to help every student, so only a few standouts would catch his attention.",
        "Yu Ziming’s grades were excellent, and he had worked hard, but beyond that, he was just too ordinary.",
        "He didn’t have the kind of background that would put him at the center of attention. His so-called professional skills, though they could earn a nod of approval, weren’t quite enough to make people take special notice. ",
        "Sometimes, to seize an opportunity, both external and internal conditions need to stand out.",
        "Yu Ziming was equally shocked and anxious. He knew that he hadn’t had much interaction with Professor Yang and understood his own ordinariness, so when he got this opportunity, he also deeply feared missing it.",
        "Without this chance, he wasn’t sure if he would ever have a better one. In the field of art, if one is too proud to rely on anything but personal effort, they must have immense confidence in their talent.",
        "In this respect, Yu Ziming was very clear-eyed. ",
        "“Professor Yang said I left a deep impression on him. He still has my graduation artwork, so when he heard I hadn’t found a job after graduating, he thought it was a shame.”",
        "As he said this, Yu Ziming’s eyes lit up, sparkling with the joy and confidence of being recognized.",
        "“He originally wanted to recommend another student, but that student backed out at the last minute, and Professor Yang was very disappointed. So he thought of me, feeling that since I just graduated, it wasn’t too late for me to seize this opportunity. He even asked if I would like to take him as my mentor.”",
        "As Yu Ziming spoke, the light in his eyes grew even brighter. Perhaps he didn’t even realize it himself, but as he spoke of giving it a try, his gaze was filled with a determined resolve to work even harder. ",
        ""
    ],
    "previous": "Chapter 9",
    "next": "Chapter 11"
}