{
    "title": "Chapter 15",
    "content": [
        "In the following days, Lu Yiman began preparing for the matters concerning his studio.",
        "The harsh words Yu Chuang had thrown at him during the banquet never materialized. Not only did Yu Chuang not come looking for trouble, but he hadn’t even shown his face since. ",
        "Lu Yiman wasn’t in a rush, maintaining his usual unhurried demeanor. What he was truly thinking, only he knew.",
        "As he tapped on the keyboard, he zoomed in on the design for his studio, carefully inspecting if there were any areas that still needed modification.\n",
        "",
        "After the banquet, he had received a few commissions. Of course, his physical brand hadn’t been fully established yet, and for now, he was a one-man operation, so the jobs he took were fairly personal.",
        "Pushing up the glasses on his nose, he was about to make a small adjustment when his phone, sitting to the side, rang. Without turning his head, he pressed the speaker button. ",
        "“Hello?”\n\n",
        "——“Yiman, did you slip some kind of charm to my sister? She’s been talking about you non-stop these past few days. My mom even thinks she’s finally settling down and looking for an honest guy to marry.”",
        "Hearing Peng Duoduo’s complaint, Lu Yiman couldn’t help but chuckle softly, saying, “You should make sure to clarify that.”",
        "——“Clarify what?”\n\n ",
        "“I’m not exactly an honest man.”",
        "Hearing his laughter, Peng Duoduo fell silent on the other end.",
        "He felt that something had changed about Lu Yiman, that he’d become more lively—far more so than before.\n\n",
        "Peng Duoduo had heard that Yu Ziming had recently gone abroad, and he’d been worried that Lu Yiman might be secretly heartbroken, retreating to the mountains for over a month to cope. ",
        "Later, when he heard that Lu Yiman was going to attend a banquet and wanted to borrow his sister as a date, Peng Duoduo didn’t hesitate to offer her up, only to be scolded as an ungrateful wretch by his sister, the so-called “demon queen.”",
        "His sister, after all, was no ordinary person. As the future head of the Peng family, accompanying another man as a date was practically charity work!",
        "Who would’ve thought that after the banquet, she’d be talking about Lu Yiman all the time, her attitude shifting faster than anyone else’s.",
        "Caught up in his thoughts, Peng Duoduo coughed and said, “I heard you’re setting up a studio and looking for a place. My family happens to have a property that recently became vacant after a project was halted. How about you…” ",
        "“I’ll wait a bit longer, I’m still looking.”",
        "Lu Yiman cut him off, not outright refusing, but neither was he polite about it.",
        "——“Alright, but don’t be shy with me. My sister already said she’s going to invest in your studio when the time comes, but the shares will go to me. If you need anything, just let me know, and I’ll open a back door for you!”",
        "Hearing Peng Duoduo’s generous tone, Lu Yiman’s eyes softened as he retracted his hand from the keyboard and glanced down at his phone. ",
        "“Then I’ll thank you in advance.”",
        "Peng Duoduo laughed heartily. “We’re like family, no need for thanks.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ou Timan’s smile deepened.",
        "In fact, Ueng Guoduo’s friendship with “Ou Timan” stemmed entirely from liking his vibe. ",
        "When “Ou Timan” had first been brought back to the Jhen family, it wasn’t done with much fanfare, but still, duite a few people got wind of it. Sspecially among the younger second-generation circle, they were all well aware of whose illegitimate child belonged to whom, and which son wasn’t really biologically related.",
        "So back then, many people approached him with various intentions.",
        "Eventually, when they found out he was just an adopted son without the Chen family name, with only a nominal connection to them, most of them lost interest.",
        "Only Peng Duoduo, this naïve, sweet guy, kept cheerfully inviting him out, even if he just sat there in silence. Peng Duoduo never grew tired of it. ",
        "To raise someone like Peng Duoduo, it was a testament to his family’s good upbringing. The Peng family not only had solid foundations but also an exceptionally open-minded atmosphere.",
        "The Pengs had three children. Peng Duoduo had an older sister, Peng Haohao, and an eldest brother. The eldest brother, however, was fully devoted to his career in entertainment, joining the industry right after graduating from university.",
        "Initially, the Peng family thought he was passionate about acting and didn’t want to stand in the way of his dreams, so they let him pursue it.",
        "Later, when they realized he was acting, singing, modeling, and doing anything to be in the limelight, they understood—he simply enjoyed the attention and being adored. ",
        "His second sister, Peng Haohao, on the other hand, was interested in the family’s money. In high school, she started dabbling in stock trading using her brother’s fame. By the time she graduated, she had made tens of thousands.",
        "But unsatisfied with herself, she waved it off and donated it all.",
        "As she got older, her interests turned toward men, though perhaps a bit excessively.",
        "During her first year of university, she made it onto the school’s “famous people” list after using her wealth to “sponsor” an older male student. ",
        "Reportedly, this male student had to compete against others for the spot, and those who didn’t make the cut were left bitterly disappointed. Many seniors were waiting for her to kick him to the curb, hoping they’d get their chance next.",
        "This became an unstoppable trend. Over the years, the men around Peng Haohao changed as frequently as she changed her clothes. As for that “first love” she once sponsored, who knows which obscure corner he ended up in.",
        "Father Peng and Mother Peng had tried to persuade her to settle down, but when they saw how well-managed her company was, the surging stock market, and the countless profits…",
        "They had no choice but to accept their daughter’s open-minded approach to relationships. ",
        "So, by the time it came to the youngest, Peng Duoduo, neither his parents nor his older siblings had any expectations for him.",
        "As long as he didn’t break the law, they were fine with him being a carefree playboy.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The so-called “carefree playboy” now hesitated a little as he asked, “Yiman, are you doing okay lately?”",
        "He was still a bit worried that Lu Yiman might be heartbroken. ",
        "“I’m fine. Why do you ask?”",
        "Hearing his usual calm tone, Peng Duoduo still couldn’t completely relax.",
        "So, in his loud voice, he said, “Since you’re fine, how about we go out for a drink tonight? After all, I’m now technically one of your studio’s shareholders. We need to discuss our future business, right?”",
        "Lu Yiman didn’t call him out on it, smiling as he replied, “Sure.” ",
        "Peng Duoduo perked up, “Great! Where should we go? You pick!”",
        "Leaning back in his chair, crossing his legs, Lu Yiman said, “Let’s go to West Street.”",
        "On the other end, Peng Duoduo froze for a moment, then hesitantly asked, “How about we go somewhere else?”",
        "“Hmm? Is there a problem?” ",
        "“…”",
        "Gritting his teeth, Peng Duoduo finally said loudly, “Forget it, I’ll head over first and wait for you. Take your time!”",
        "He figured he needed to check if Yu Chuang was still hanging around there, as he’d been frequenting that place recently.",
        "After hanging up, Lu Yiman rested his chin on his hand, his eyelashes fluttering slightly as he stared at his reflection on the computer screen. After a long while, he smiled. ",
        "…",
        "Under the heat of many gazes, he walked past the lively dance floor, dodging several people who tried to get close to him. As soon as he stopped, his tall and striking figure immediately caught Peng Duoduo’s attention.",
        "“Yiman, over here!”",
        "Peng Duoduo waved to him from the upstairs area. Following the sound, Lu Yiman glanced over and smiled at him with curved eyes, causing Peng Duoduo to curse under his breath. ",
        "When Lu Yiman finally walked up the stairs and stood in front of him, Peng Duoduo looked him up and down with a complicated expression, struggling to say, “Why are you dressed so…”",
        "But the rest of his words never came out.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "You couldn’t blame him for reacting that way—today’s Lu Yiman looked entirely different from his usual self.",
        "Normally, while Lu Yiman didn’t wrap himself up like a priest, he always carried a refined, restrained air. ",
        "But today…",
        "He was wearing a long, thin, gauzy shirt that almost reached his calves, with slits on both sides, draping neatly. His black trousers were slightly wide, creating a clear black-and-white contrast.",
        "Around his waist was a loosely hanging chain belt with pale gold edging, swaying gently as he walked. The narrowness of his waist and the shape of his hips were unmistakably eye-catching.",
        "The silky cuffs were rolled up to his forearms, revealing a section of cool, pale skin. His pronounced wrist bones made his hands appear both beautiful and slender. On his wrist was a watch with a brown leather strap, further emphasizing his striking style. ",
        "Peng Duoduo glanced at his braid and asked, “Why do you always like wearing your braid in front these days?”",
        "In the past, “Lu Yiman” also tied his hair in a braid, but it was always neatly hanging down his back. Now, however, it often rested on one shoulder. It wasn’t that it didn’t look good—it just had a subtle allure to it.",
        "When looking at him as a whole, he still exuded that handsome, refined, and slightly restrained air. But this blend of two contrasting vibes made people feel an irresistible itch.",
        "And then, upon closer inspection, Peng exclaimed, “Yiman, since when did you have ear piercings?!” ",
        "Seeing his shocked expression, Lu Yiman touched the earring on his ear and smiled, “I got it when I was young and reckless.”",
        "Peng Duoduo covered his face and groaned, “Great, today I’ll just be a scarecrow standing next to you.”",
        "A scarecrow without feelings or any presence!",
        "Lu Yiman chuckled without saying a word, stepping past him. Peng Duoduo, still muttering under his breath, followed behind, unaware that Lu Yiman had glanced casually at the number of a private room as they passed. ",
        "Not long after they walked by, a man in a black shirt and tie ascended the stairs.",
        "Behind him were two bodyguards, standing like walls, shielding him from the prying eyes of others.",
        "The man didn’t seem to be here for pleasure. He would come occasionally, but his face never looked happy. He wouldn’t call anyone over or drink any alcohol. He’d stay exactly one hour, then leave precisely on time.",
        "Lately, though, he’d been coming more frequently. ",
        "***",
        "Inside the private room, the flashing lights reflected brightly, and Peng Duoduo suddenly let out another “Whoa!”",
        "",
        "“Yiman! Why aren’t you wearing any clothes?!”",
        "“I am,” he raised an eyebrow, turning to look at him. ",
        "Peng Duoduo opened his mouth, then fell silent. Right, he was technically wearing something, but who wears just an undershirt under a sheer top?",
        "At least he had something on.",
        "Yes, at least he had something on.",
        "Peng Duoduo took a sip of water, trying to calm down. ",
        "He figured he was just being too conservative. After all, Lu Yiman was a designer, and his usual attire wasn’t exactly traditional either. There was always a touch of artistic flair to his outfits.",
        "But today, it was just a bit too eye-catching.",
        "He took another sip of water, trying to stay grounded in his unwavering straight-man mindset, feeling like Lu Yiman had changed a lot. What he didn’t realize was that this version of Lu Yiman wasn’t just attractive to women."
    ],
    "previous": "Chapter 14",
    "next": "Chapter 16"
}