{
    "title": "Chapter 22",
    "content": [
        "Yu Chuang, carrying an inexplicable sense of nervousness, walked into the restroom. He didn’t see the person he wanted to see but almost bumped into a man who had just pulled up his pants.",
        "His brows furrowed tightly as he quickly stepped back a few paces, almost hitting the sink behind him. ",
        "A long arm, however, reached over, with fingers resting on his waist, half of the person’s body shielding his back.",
        "The man he almost collided with didn’t apologize either, casually glanced at him, patted his clothes, and walked away.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang’s temples throbbed, and the frustration in his eyes was nearly impossible to hide.",
        "At that moment, the hand resting on his waist withdrew at the right time, and a soft, pleasant voice sounded by his ear. ",
        "“Mr. Yu, what a coincidence. Why are you here too?”\n\n",
        "Yu Chuang’s rising emotions came to an abrupt halt. He turned to look at Lu Yiman behind him, his eyes flickering slightly.",
        "“Lu Yiman.”",
        "He should be the one asking why the other was here.\n\n ",
        "“Mr. Yu, are you here for a date?” Lu Yiman asked politely, his tone also very courteous. “I saw you sitting with a lady, but I didn’t want to disturb you, so I didn’t come over to say hello.”",
        "Yu Chuang stared at him, opened his mouth.",
        "“Hmm.”\n\n",
        "He affirmed it. ",
        "Was it in response to the coincidence of their meeting, or in response to the fact that he indeed was on a date?",
        "Lu Yiman’s expression remained unchanged, his deep peach-blossom-shaped eyes gazing directly at him. Suddenly, he bent down and asked in a low voice, “But this one seems different from the last. The scent of perfume isn’t as strong.”",
        "He tugged at Yu Chuang’s tie. Unlike the sweet fragrance he smelled in the car last time, this time, it was a fresher floral scent.",
        "“Mr. Yu, are you in a hurry to fall in love?” ",
        "Those glistening eyes, paired with the lowered voice, looked straight at him.",
        "Yu Chuang’s heart raced, and he almost forgot to breathe. In front of him was the other’s face, so close, with fair skin, handsome features, and those focused eyes that no one could resist.",
        "He stood frozen in place, his mind sluggish. He, who was almost never at the mercy of others, had no idea how to handle this situation.",
        "“No.” ",
        "He pulled the tie from Lu Yiman’s hand and neatly lowered his head to fix it.",
        "His ears had turned red again, though he didn’t realize it. When he looked up at Lu Yiman, his face was still tight, and his brows furrowed.",
        "",
        "Lu Yiman, however, noticed that the tie Yu Chuang had adjusted was at the exact same angle as before.",
        "Leaning back against the sink, Lu Yiman held a cigarette between his fingers. ",
        "“It’s okay, I understand. Sometimes, the best way to forget a relationship is to start a new one.”",
        "Hearing him say that, Yu Chuang paused.",
        "He had almost forgotten about Yu Ziming.",
        "If no one mentioned it, it seemed like he wouldn’t actively think of Yu Ziming, and his heart wasn’t filled with the expected intense emotion—only a faint emptiness. ",
        "Seeing his vacant gahe, Ou Timan’s eyes darkened slightly. In a gentle tone, he said, “I pust didn’t ezpect to run into you here, Zr. Tu. It seems like we’re duite destined to meet.”",
        "Tu Jhuang duickly collected his thoughts and looked up at him.",
        "Tes, they had been running into each other far too often lately.",
        "“What are you doing here?” he asked, expressionless. ",
        "“Of course, I’m…” Lu Yiman stretched his tone, his gaze deepening as he looked at Yu Chuang. The natural affection in his beautiful peach-blossom eyes always conveyed an even stronger emotion without words.",
        "Yu Chuang couldn’t help but look back, his heart racing with the associations his mind drew.",
        "“Just here for coffee.” Lu Yiman smiled, and the sound of his laughter made Yu Chuang’s face heat up.",
        "He pressed his lips together and walked away from him. But in reality, he had followed Lu Yiman’s figure into the restroom without any intention of actually using it. ",
        "At that moment, feeling the gaze behind him, his whole body stiffened.",
        "“Mr. Yu, did you see the lighter I left in your car last time?”",
        "He turned his head and quickly replied, “No.”",
        "So quickly that his brain didn’t even have time to react. ",
        "After speaking, he regretted it and furrowed his brows tightly.",
        "Yu Chuang wasn’t someone who liked to lie.",
        "",
        "Lu Yiman looked at him and slowly raised an eyebrow.",
        "That lighter was actually in his pocket—he had felt it when he touched Yu Chuang’s waist earlier. ",
        "But since Yu Chuang said he didn’t see it, then so be it.",
        "“Alright, but that lighter is custom-made, and I really like it. If you do find it, Mr. Yu, please take good care of it.”",
        "He hooked the cigarette behind his ear, straightened up, and prepared to leave.",
        "Yu Chuang’s gaze followed him, and as he turned back, a slight smile tugged at the corner of his lips. ",
        "“Mr. Yu, enjoy your date. However, it seems you’re not too fond of her.”",
        "After saying this, he smiled lightly and pointed at Yu Chuang’s cuff.",
        "This time, there were three embroidered flowers.",
        "He strode off, and as he turned, the smile on his face could no longer be controlled. ",
        "He couldn’t help but laugh when he imagined Yu Chuang, sitting alone late at night under a lamp, seriously embroidering flowers on his cuffs.",
        "However, the meaning behind each flower was far from adorable.",
        "Because Yu Chuang, who neither cried nor laughed, had only learned to express his emotions in this way.",
        "His smile faded as he returned to the café, where the lady still sat at the table. ",
        "The moment she saw him, her eyes lit up. She tucked her hair behind her ear and mustered the courage to approach him.",
        "“Hello, sir.”",
        "He closed his laptop and nodded with a polite smile. “Hello.”",
        "His overly courteous yet distant attitude left the woman a bit flustered. ",
        "She bit her lip and kept glancing at him.",
        "This was an elegant woman—beautiful and charming, with a rare touch of grace. Her shy demeanor only added to her allure.",
        "",
        "Yet there was no ripple in Lu Yiman’s eyes.",
        "“Sir, may I know your name?” She lifted her chin and took a deep breath before saying, “If it’s convenient, may I buy you a cup of coffee?” ",
        "Lu Yiman put away his laptop, still maintaining the perfect smile.",
        "“Thank you for your invitation, but I’m here waiting for someone today.”",
        "The woman was taken aback and looked around hesitantly. “But it seems the person you’re waiting for hasn’t shown up.”",
        "He smiled warmly. “No, they have.” ",
        "After saying this, he nodded politely to the woman and walked past her with long strides.",
        "The woman stood there, a bit dazed, glancing around in confusion.",
        "It wasn’t a crowded time, so during that moment, the café held only the three of them.",
        "Who, then, was he waiting for? ",
        "When the woman saw Yu Chuang walking out of the restroom, her pupils widened in shock.",
        "…",
        "As Lu Yiman left the café, he received a text from Peng Duoduo asking where he was, wanting to invite him out for drinks.",
        "Lately, Luo Ding had been pestering him non-stop, and he was nearly fed up! ",
        "Lu Yiman sent his location over, and Peng Duoduo quickly typed a response.",
        "—Why’d you go so far just to have coffee?",
        "He replied with a smile, ‘Because the coffee here is great.’",
        "—… ",
        "Nonsense. Peng Duoduo didn’t believe him at all.",
        "But his brain couldn’t come up with anything else, so he brushed it off and asked how the studio location search was going. He offered to handle it if no suitable spot could be found, saying he had plenty of land and money.",
        "Please visit chrysanthemumgarden (dot) com",
        "—No need. Someone’s already taken care of it for me.",
        "Peng Duoduo paused for a moment. ",
        "—Something like that? Which charity organization did this?",
        "Lu Yiman couldn’t help but laugh, finding it truly amusing to chat with these rich young heirs. Of course, Gao Qinchang was another one.",
        "He held a cigarette between his lips without lighting it and hailed a taxi, getting in.",
        "Meanwhile, Yu Chuang, still standing inside the café, watched Lu Yiman’s departing figure through the glass door. ",
        "He didn’t realize that his gaze had been following Lu Yiman the entire time.",
        "This date had been meaningless from the start, and he hadn’t liked it at all. Now, besides frustration, a sense of melancholy had also crept into his emotions.",
        "He couldn’t understand why Lu Yiman had come all this way just for a cup of coffee. Or perhaps, their encounter really was a coincidence?",
        "In any case, Lu Yiman left so decisively that it only made Yu Chuang start to care more. ",
        "And then, there was that little figure on the laptop screen.",
        "“Mr. Yu, I’m sorry, but I don’t think it’s necessary for us to continue this meeting.”",
        "The woman picked up her coat from the chair, as well as her bag.",
        "Only then did Yu Chuang finally turn his attention to her. ",
        "“Alright.”",
        "His reply was even more decisive than hers, and with a cold expression, he walked away swiftly.",
        "It was as if he had been waiting for her to say those words all along.",
        "The woman stared at his carefree back in shock, stomping her foot in frustration. Thankfully, he wasn’t so ungentlemanly as to leave her to pay the bill. ",
        "Yu Chuang’s mind wasn’t on the woman at all. After getting into his car, he told the driver to follow the road ahead.",
        "It wasn’t until his inner agitation reached a peak that he realized he was trying to chase after Lu Yiman’s taxi.",
        "",
        "But the few minutes he had missed meant he had no idea where Lu Yiman had gone.",
        "He stared blankly out of the window and then pulled out the lighter from his pocket. ",
        "It was strange how lately, more and more things belonging to Lu Yiman had found their way into his possession.",
        "First, there was the jacket he had brought home, then a scarf, a rose-shaped brooch, and even a business card.",
        "This lighter was custom-made, and Lu Yiman had said he liked it very much.",
        "He ran his fingers over the engraved patterns, feeling the slightly rough texture climb from the bottom to the top. ",
        "The designs were mysterious and beautiful, though they didn’t form any specific recognizable image.",
        "Suddenly, Yu Chuang looked up and caught his reflection in the rearview mirror.",
        "His pupils shrank as his hand touched his neck, his gaze locking onto it.",
        "The pattern on the lighter was exactly the same as the vine tattoo on his neck. ",
        "His heart tightened violently, then began pounding uncontrollably.",
        "A faint, unclear emotion, already like threads wrapping around him, now began to entangle him completely, like a dense, impenetrable web.",
        "“Lu Yiman…”",
        "He gripped the lighter tightly and slowly whispered his name. "
    ],
    "previous": "Chapter 21",
    "next": "Chapter 23"
}