{
    "title": "Chapter 17",
    "content": [
        "The light was dazzling and bright, all converging on the person in the center of the stage.",
        "He was tall and thin, with cold pale skin that seemed to glow under the light. ",
        "His almond-shaped eyes curved slightly, creating ripples of shimmering spring waves.",
        "Suddenly, those eyes turned toward him, landing so precisely and clearly on Yu Chuang.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "He froze abruptly, as if drawn in, standing still as the other’s slender fingers plucked the strings of the instrument, and his heart beat wildly in sync with the intense and exuberant screams from the dance floor.",
        "Lu Yiman always smiled gently, with both grace and elegance. ",
        "But at this moment, he was strumming the guitar amidst the loud, passionate music, and even a small smile as he bowed his head made hearts race like mad.\n\n",
        "The dark green bass guitar complemented his pale fingers, and the small braid by his shoulder shimmered with a soft glow.",
        "Lu Yiman like this was outrageously sexy.",
        "The screams from the dance floor were deafening, and the cries seemed to surge toward the stage, as if they were going to devour Lu Yiman.\n\n ",
        "The sheer, translucent shirt he wore revealed everything under the lights—his collarbones, his strong arms. For someone who appeared so lean, the body beneath his clothes was surprisingly tight and full.",
        "It made people want to strip him of his clothes!",
        "Those in the dance floor were eager to do so, their gazes toward Lu Yiman as fiery as a blaze.\n\n",
        "“Young Master…” ",
        "The bodyguard was somewhat confused as to why Yu Chuang suddenly stopped moving. Normally, at this time, Yu Chuang would be heading home; he was always strict about his schedule.",
        "Besides, if it got too late, Yu Chuan would ask about it.",
        "Yu Chuang raised his hand, stopping the bodyguard from continuing.",
        "He stood tall, facing the stage, his coat draped over his arm, his fingers gently rubbing the rose earring no larger than a fingernail. ",
        "Lu Yiman like this was impossible to ignore.",
        "Even for Yu Chuang.",
        "“Holy crap, that’s your friend!” Luo Ding’s eyes were practically bulging out of their sockets, as if he wished he could glue his gaze to Lu Yiman.",
        "“Of course!” ",
        "Peng Duoduo was also startled by this version of Lu Yiman, but seeing Luo Ding’s reaction, he couldn’t help feeling a bit smug.",
        "“Damn, he’s too handsome! I agree, give me his contact info right now!”",
        "Please visit chrysanthemumgarden (dot) com",
        "Now Luo Ding was starting to panic, but Peng Duoduo remained calm.",
        "“Didn’t you just say he wouldn’t be interested in you? If that’s the case, there’s no need to get to know him.” ",
        "Luo Ding grabbed his shoulders and shook him. “I’ve changed my mind! I’m into him now, okay? Just give me his number and stop rambling!”",
        "Peng Duoduo clicked his tongue impatiently. “Can you stop putting ‘damn’ in every sentence? My mom won’t let me hang out with people who curse a lot.”",
        "“My damn mom won’t let me hang out with people with low IQs!”",
        "“Who the hell are you calling low IQ?” ",
        "“You, damn it!”",
        "“Gamn you!”",
        "“Gamn you!”",
        "“Gamn you!” ",
        "The two of them ezchanged rounds of “damn you” until Ueng Guoduo suddenly felt a chill on the back of his neck. Le turned around to find Tu Jhuang standing in front of two bodyguards, staring at him ezpressionlessly.",
        "Ueng Guoduo’s throat tightened, and he couldn’t manage to get out another “damn you.”",
        "“Are you going to give it or not?” Luo Ding was still pestering him.",
        "“Nope, you’re not worthy!” Peng Duoduo finally snapped, getting irritated by the whole situation. ",
        "He was starting to feel uneasy around Yu Chuang. Mainly because Yu Chuang was on the same level as his sister, maybe even higher, and there was a natural sense of intimidation in that.",
        "Plus, he knew about the whole situation between Yu Chuang and Yu Ziming, and with Lu Yiman here today, it only made him more uncomfortable.",
        "“If you won’t give it, I’ll just go after him myself.”",
        "Seeing Luo Ding’s confident expression, Peng Duoduo sneered and looked him up and down. “You?” ",
        "“What’s wrong? I’m young and good-looking, am I not good enough for him?”",
        "“You’re not.” Peng Duoduo shook his head honestly.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "It was hard to say before, but now, even Peng Duoduo found it difficult to fully understand Lu Yiman. However, he definitely felt that pairing the current Lu Yiman with Luo Ding would be somewhat of a waste.",
        "“Then what kind of person is worthy?” Luo Ding asked, getting a bit frustrated. ",
        "Peng Duoduo’s eyes darted around, and unexpectedly, he found himself locking eyes with Yu Chuang. Without thinking, he pointed his finger in a moment of heat.",
        "“Someone like him!”",
        "As soon as the words left his mouth, the air around him seemed to freeze.",
        "But once spoken, there was no way to take them back. ",
        "Swallowing hard, he forced himself to continue, “Someone like him—can you manage that?”",
        "Luo Ding glanced at Yu Chuang, whose entire aura was completely different, and gave up with a resigned shrug. “Fine, you win.”",
        "Peng Duoduo, on the other hand, didn’t even dare to lift his head, completely avoiding looking at Yu Chuang.",
        "Setting aside some of Yu Chuang’s… background, appearance, and demeanor—there wasn’t a single thing that wasn’t excellent. ",
        "Feeling a mix of anxiety and apprehension, Peng Duoduo dared to steal a glance and found Yu Chuang, as if oblivious to what had just happened, gazing steadily at the stage. In his dark eyes, a small light seemed to gather.",
        "…",
        "Even in such intense music, Lu Yiman remained composed.",
        "Only the slight sway of his hair and that touch of a bold smile hinted at the contrast and sensuality hidden beneath his refined exterior. ",
        "His bass playing was exceptional. After being captivated by his appearance, one could still appreciate the depth of his music.",
        "Thus, he appeared so radiant, his whole body emanating a blinding glow. His slightly raised chin and sharp brows were enough to drive anyone mad with desire.",
        "It was like a preacher, typically aloof, suddenly unveiling his hidden desires, making it impossible for people to resist, leaving them entranced.",
        "—”He’s looking over here!” ",
        "—”Ahhh! He’s looking at me! He’s looking at me!”",
        "—”He smiled! He’s smiling at me! Ahhh!”",
        "Please visit chrysanthemumgarden (dot) com",
        "Only Yu Chuang, who hadn’t taken his eyes off him for a moment, knew that Lu Yiman was looking at him and smiling at him.",
        "Across the crowd, in the midst of such a fiery, electric atmosphere, the gaze of someone focused solely on him was enough to stir anyone’s heart. ",
        "No one could resist Lu Yiman at this moment.",
        "Without realizing it, Yu Chuang gripped the small rose earring tightly in his hand. His lips pressed into a thin line, his ears turning red, though he convinced himself that his wildly beating heart was just a reaction to the piercing screams around him.",
        "Yet, he felt an inexplicable sense of unease.",
        "Why was he looking at him? ",
        "Why was he smiling at him?",
        "Out of all these people, why was he focusing on him?",
        "In the boiling heat of the moment, even the air around seemed to ferment.",
        "In an almost childish move, Yu Chuang shifted his feet and tried to hide himself. ",
        "Now, he thought, he shouldn’t be able to see me anymore.",
        "But as he glanced back, he saw Lu Yiman smiling again, with a look that was all too familiar.",
        "It was the same smile from every time Yu Chuang had resisted, gotten angry, or shown displeasure. The smile that was both gentle and uncontrollable, as though Yu Chuang’s outbursts were nothing more than a child’s tantrum in his eyes.",
        "Suddenly, Yu Chuang felt even more uneasy, as if his attempt to hide had only served to attract even more attention. ",
        "Peng Duoduo sensed something different about Yu Chuang now compared to before. Although he was still impeccably dressed in his suit, expressionless and out of place in the lively bar, the cold, sharp aura that had once surrounded him was gone.",
        "Instead, it had been replaced by… something Peng Duoduo couldn’t quite put into words.",
        "He glanced back at the stage where Lu Yiman stood, and suddenly, it all clicked—Yu Chuang’s strange behavior made sense.",
        "They were making eye contact! ",
        "As this realization dawned on him, Peng Duoduo froze, his stiff neck slowly turning toward Yu Chuang’s flashing eyes and then to Lu Yiman, whose smile on stage was becoming even more alluring.",
        "“…”",
        "",
        "“What’s wrong with you?” Luo Ding asked, noticing how Peng Duoduo had suddenly gone stiff.",
        "“Nothing, just got goosebumps,” he muttered, feeling a chill run down his spine as his mind wandered. ",
        "Before this moment, he’d never entertained such a terrifying thought.",
        "He didn’t even realize when the music stopped, and everyone around was still caught in a daze when the bass player walked off the stage and toward the front.",
        "“Mr. Yu, long time no see.”",
        "A thin layer of sweat shimmered on Lu Yiman’s forehead, but his smile remained bright and warm. ",
        "Yu Chuang looked up at him. The person who had just been lighting up the stage was now standing right in front of him, within arm’s reach. It was a feeling difficult to describe.",
        "“Long time no see.”",
        "Upon hearing Yu Chuang’s response, Lu Yiman’s smile deepened.",
        "He brushed a strand of hair behind his ear, and as he did, Yu Chuang’s gaze caught sight of the empty hole in his ear. ",
        "His heart fluttered, and he tightened his grip on the rose earring in his hand.",
        "A sudden rush of urgency and the pounding of his heart seemed to grip him.",
        "The stifling air made it hard to breathe. Unable to speak, Yu Chuang swallowed and slowly extended his hand, palm open.",
        "“It’s mine! I thought I’d lost it. Thank you, Mr. Yu.” ",
        "Lu Yiman’s eyes curved into a delighted smile.",
        "His gratitude was sincere, and when his soft fingertips brushed against Yu Chuang’s palm, it made his hand itch.",
        "The rose earring stood out even more against Lu Yiman’s pale skin, and as he tilted his head slightly, he fastened the vibrant rose to his ear. Under the flickering lights, the rose glowed radiantly.",
        "At that moment, Lu Yiman seemed complete, exuding a mesmerizing charm. ",
        "Peng Duoduo was left speechless. No wonder Lu Yiman had seemed a bit off earlier on stage—the most dazzling rose earring had been missing.",
        "As Yu Chuang’s hand emptied, he pulled it back, unable to stop himself from clenching his fist.",
        "",
        "He said nothing, his expression not particularly soft or friendly.",
        "Yet Lu Yiman noticed the way Yu Chuang stood tall, the subtle tension in his body, and the nervous, fidgety movements. ",
        "Yu Chuang had never been someone who could be easily manipulated. In fact, in many ways, he was cold and indifferent.",
        "But when it came to emotions and feelings, he was undeniably a fool.",
        "“Mr. Yu, I wonder how your injury from last time is. Has it healed?” Lu Yiman asked, his eyes bright with warmth.",
        "Oh, that small cut. There wasn’t even a scar left now. ",
        "If Lu Yiman hadn’t mentioned it, Yu Chuang would’ve nearly forgotten about the incident at Pearl Coast.",
        "They weren’t exactly on friendly terms, after all.",
        "As this thought crossed his mind, a sleek, finely textured business card slipped into his hand.",
        "“Thank you for not holding a grudge this time, Mr. Yu. I thought you might still be mad at me. When I saw you earlier, I thought you were leaving because you didn’t want to see me.” ",
        "Lu Yiman bowed slightly, smiling politely. His loose hair fell, obscuring his expressive, affectionate almond-shaped eyes.",
        "His soft, elegant voice made it impossible to refuse him.",
        "Yu Chuang clutched the business card, staring straight at him, his throat tightening as he opened his mouth to speak.",
        "“The bass… sounded really good.” ",
        "Lu Yiman looked up at him, meeting his deep, dark eyes. The corners of his mouth lifted, and he smiled. ",
        "\n[Kerry: …Hmm, it’s more like he wants him to belong to him?]"
    ],
    "previous": "Chapter 16",
    "next": "Chapter 18"
}