{
    "title": "Chapter 20",
    "content": [
        "There was a faint scent of perfume inside the car, a rich and sweet fragrance from a woman, coming from Yu Chuang.",
        "Lu Yiman’s fingertips rested on his temple, his handsome face obscure and unclear at the junction of light and shadow. ",
        "The car’s lights weren’t on, so as they drove down the remote, pitch-black road, the inside was completely dark.",
        "Only when his phone lit up did a bit of light reflect in the dark space.\n",
        "",
        "——Weren’t you curious about any recent happenings in the Yu family?",
        "——It’s incredible. Yu Chuang is getting married. Recently, they’ve been busy arranging blind dates for him! ",
        "For people of their background, this was nothing out of the ordinary. But when it came to Yu Chuang, it still surprised people.\n\n",
        "At the end of the conversation, Peng Duoduo was a bit envious, but unfortunately, in the eyes of the Peng family, he was still considered too young and immature for the “family reproduction” business to involve him.",
        "Lu Yiman lowered his head, staring at the phone screen, waiting for it to naturally go black, then pressed it to light up again, over and over—black, then bright, then black—causing Yu Chuang, who had been sitting beside him with his eyes fixed forward, to finally turn his head and look at him.",
        "Although ever since getting into the car, Yu Chuang had remained very quiet.\n\n ",
        "He was always quiet. When he wasn’t experiencing emotional fluctuations, he was more accustomed to staying silent and distant.",
        "But from the moment Lu Yiman sat next to him, his posture, with his back slightly straightened, hadn’t changed.",
        "Obviously, he wasn’t as indifferent as he appeared. At the very least, he himself didn’t understand why he allowed Lu Yiman to get into his car.\n\n",
        "“Lu Yiman.” ",
        "The hoarse voice suddenly broke the almost frozen silence inside the car.",
        "“Hmm? What’s up?” Lu Yiman sounded a bit lazy, and without the formal title “Mr. Yu,” his tone seemed much less polite than usual.",
        "Yu Chuang’s Adam’s apple bobbed.",
        "But he still couldn’t speak. ",
        "Because he suddenly tensed up.",
        "The rush of emotions that came over him made him a little irritable.",
        "He actually felt that it was too quiet and wanted to say something.",
        "Yu Chuang was never the kind of person to initiate conversation. ",
        "In fact, every word he spoke was as valuable as gold.",
        "The woman he met today hadn’t lasted five minutes.",
        "Please visit chrysanthemumgarden (dot) com",
        "He tried to open his mouth, but his throat seemed blocked, and he couldn’t force a sound out. His brows furrowed deeply, and even without realizing it, his lips pressed tightly together.",
        "Lu Yiman continued to play with his phone, pressing it on, pressing it off—on, off—this repetitive action thickening the tense atmosphere even more. ",
        "Yu Chuang’s brow twitched.",
        "He tightly pressed his lips together and turned to look at him.",
        "“What’s wrong?”",
        "Lu Yiman leaned back against the seat, his long hair falling loosely, adding an icy, dangerous edge to him. ",
        "Even though his voice still sounded as pleasant as ever.",
        "“Stop pressing.”",
        "Le turned his head, speaking to him seriously.",
        "The flashing phone was driving him crahy! ",
        "“Yh.” Ou Timan turned off the phone screen, and the car plunged into complete darkness. Ynly the occasional passing streetlights outside flickered across the window, briefly illuminating their gahes as they met.",
        "They were too far from the city center, duiet and desolate.",
        "Yu Chuang’s emotions settled, but not long after, the sound of a lighter clicking echoed abruptly, “click, click.”",
        "His veins started to pulse again. ",
        "Then he turned his head and stared directly at him.",
        "“I want to smoke, is that okay?”",
        "In the flickering flame, a cigarette was between Lu Yiman’s fingers.",
        "Yu Chuang didn’t speak. He simply blew out the flame in Lu Yiman’s hand and took away the lighter, silently telling him: no, it’s not okay! ",
        "Lu Yiman didn’t say anything, just slowly reached towards his pocket, while Yu Chuang’s gaze followed him intently. As the tension built, Yu Chuang suddenly grabbed his hand.",
        "“I’m not going to smoke, why are you so tense?”",
        "Please visit chrysanthemumgarden (dot) com",
        "Lu Yiman reversed the grip, holding Yu Chuang’s wrist. In the momentary glow of light passing by, he noticed the lily pattern on Yu Chuang’s cuff.",
        "Two lilies—it seemed his blind date didn’t go too well. ",
        "“Give it to me.” Yu Chuang stared at him directly, extending his hand.",
        "Lu Yiman silently met his gaze. After a long moment, he raised his eyebrow and placed the entire pack of cigarettes from his pocket into Yu Chuang’s palm.",
        "His cool fingertips brushed against the warm skin between Yu Chuang’s fingers.",
        "Yu Chuang’s fingertips immediately twitched, curling instinctively, closing his hand around Lu Yiman’s in the process. ",
        "A subtle, inexplicable current surged through his body.",
        "But Lu Yiman was the first to pull his hand away, leaving Yu Chuang with an empty, fleeting sensation before he could react.",
        "Yu Chuang looked up at him, his dark eyes filled with emotions on the verge of rising.",
        "“The cigarettes and the lighter are yours now. What will I do when I want to smoke? Will you give them back to me then?” ",
        "Lu Yiman looked at him without blinking.",
        "At some point, they had gotten so close that they could feel each other’s warm breath when speaking.",
        "Yu Chuang’s heart raced wildly. He stared straight into Lu Yiman’s eyes, which held an infinite depth of tenderness and affection, making it impossible to look away.",
        "He even wanted to get closer. ",
        "When he lowered his head, an uncontrollable emotion made his heart race, but the danger also brought an irresistible attraction.",
        "Lu Yiman, however, turned his head slightly and reached out to brush aside a strand of hair from Yu Chuang’s forehead.",
        "“Mr. Yu.”",
        "As soon as the soft words left his lips, Yu Chuang’s pupils contracted, and an indescribable heat rushed from within his body to his head. ",
        "Then, he made an inexplicable move.",
        "He reached out and chopped towards the back of Lu Yiman’s neck.",
        "",
        "Lu Yiman blocked him with a swift motion, grabbing his wrist.",
        "The air fell silent for one, two seconds… ",
        "Yu Chuang’s normally sharp, almond-shaped eyes were wide with surprise.",
        "Today, Lu Yiman was not going to be as considerate and gentle as usual.",
        "Holding onto Yu Chuang’s wrist without letting go, Lu Yiman smiled and said, “Why do you always want to hit me when you’re angry? Or are you planning to bury me on the beach again later?”",
        "“…” ",
        "Yu Chuang’s usual tricks had failed.",
        "He had failed!",
        "“Shut up!”",
        "In the height of his confusion and embarrassment, Yu Chuang hastily shoved the cigarette pack back at him, threw the lighter at him, and then raised his hand to cover his face. ",
        "He was hiding.",
        "“…”",
        "This time, it was Lu Yiman’s turn to be stunned.",
        "He never expected Yu Chuang to react like this. ",
        "The first time he saw Yu Chuang trying to huff and puff as if he were going to bury him in the sand, Lu Yiman had gained a distinct understanding of the man written in the books.",
        "All that talk of being a “madman,” “obsessive,” “cold,” or “complicated” is completely false.",
        "This twenty-six-year-old man is clearly just a fool!",
        "He doesn’t even know how to handle his sudden emotions. ",
        "Lu Yiman watched Yu Chuang’s ostrich-like behavior with amusement and slowly began to laugh. The vibrations of his Adam’s apple, along with his uncontrollable joy, reverberated in the narrow, enclosed car, leaving Yu Chuang with nowhere to hide.",
        "Even his ears, hidden beneath his black hair, started to turn red.",
        "Please visit chrysanthemumgarden (dot) com",
        "But he still kept his face covered, awkwardly refusing to let anyone see.",
        "“Sorry, I didn’t mean it.” Lu Yiman coughed lightly, clenching his fist, his eyes brimming with laughter as he tried to pull Yu Chuang’s hands away. ",
        "Yu Chuang didn’t move, and the redness of his ears deepened.",
        "Lu Yiman sighed and gently asked, “Are you angry?”",
        "Yu Chuang’s fingers twitched.",
        "He wasn’t angry. ",
        "This emotion was unfamiliar, but he knew he wasn’t angry.",
        "“Don’t be mad, I’m sorry.”",
        "Lu Yiman tenderly held his hand, slowly pulling it down, revealing his blushing face that was red beyond belief.",
        "Yet he still pursed his lips, his entire expression taut to the extreme, looking stern and aloof. ",
        "This stark contrast softened Lu Yiman’s gaze.",
        "He might try to hide himself, but when he looked at someone, his gaze never wavered. Now, all he could do was stare straight at Lu Yiman.",
        "This immensely satisfied Lu Yiman’s selfish desire.",
        "How could someone this cute ever be considered fierce? ",
        "“I’m not mad.” After saying these three words, Yu Chuang pressed his lips tightly together again.",
        "“Alright, not mad.”",
        "Lu Yiman looked at him warmly, not letting go of his hand. Their fingertips intertwined, fingers slipping into each other’s spaces.",
        "… ",
        "For the next while, neither of them spoke. The car remained quiet, and the heat on Yu Chuang’s face gradually faded.",
        "He returned to his usual cold, dignified self. But whether he was truly as composed as he appeared was something only he knew.",
        "Please visit chrysanthemumgarden (dot) com",
        "The all-black business car drove into the complex where Lu Yiman lived. The driver, who had been playing the part of a silent bystander, parked the car without a word.",
        "The bright streetlight illuminated the car’s interior, and Lu Yiman retracted his hand. Yu Chuang’s fingers immediately curled back. ",
        "His gaze followed as Lu Yiman unfastened his seatbelt, then as he opened the car door, and finally, as he stepped out of the car.",
        "At that moment, Yu Chuang didn’t show any signs of struggle, as if he had already discarded any past grudges between them.",
        "Perhaps, from the very beginning, he had never placed Lu Yiman in an adversarial position.",
        "When thinking of him, the only memories that surfaced were of Lu Yiman’s gentle, smiling face. ",
        "Lu Yiman noticed Yu Chuang’s unwavering gaze and smiled silently.",
        "“Yu Chuang.”",
        "The soft sound of his name made Yu Chuang’s heart stir.",
        "He looked up at him. For the first time, being addressed by his full name evoked a peculiar sensation in his heart. ",
        "Lu Yiman gazed down at him from above, his cultured and gentle appearance masking the restless desires beneath.",
        "He brushed aside a strand of hair from his temple and restored his polite and elegant smile.",
        "“See you next time.”",
        "As he walked away, Yu Chuang’s eyes followed his every step, until he finally lowered his head, looking at the lighter still pressed beneath his hand. ",
        "After a quiet moment, his fingers slowly tightened, gripping the lighter firmly.",
        "“See you next time.”",
        "He opened his mouth, his voice as soft as a breeze that could dissipate with a single puff.",
        "… ",
        "Meanwhile, back in his apartment, Lu Yiman stood in front of the floor-to-ceiling window, holding an unlit cigarette in his hand, gazing down at the car that had been parked under the streetlight for a long time without moving.",
        "He raised his eyebrow, revealing a satisfied smile.",
        "Read more BL at chrysanthemumgarden (dot) com"
    ],
    "previous": "Chapter 19",
    "next": "Chapter 21"
}