{
    "title": "Chapter 16",
    "content": [
        "Lu Yiman only noticed there was another person in the private room when he walked to the center.",
        "The other person was dressed in a black leather jacket, slumped on the sofa like a shadow, almost blending into the entire room. You wouldn’t even realize there was someone there. ",
        "“Luo Ding.”",
        "Peng Duoduo awkwardly glanced at the person sprawled on the sofa, then shouted angrily, “Luo Ding!”\n",
        "",
        "The person, who was spread out in all directions, immediately sat up, crossing his legs, propping his chin with one hand, showing off the sharp outline of his side profile, and in a sultry voice said, “Man, wanna play with fire?”",
        "“……” ",
        "“……”\n\n",
        "Peng Duoduo was utterly embarrassed.",
        "But Lu Yiman couldn’t help but laugh. This definitely seemed like the kind of friend Peng Duoduo would have — quite amusing.",
        "The person, still drowsy despite striking a pose, only fully woke up when he heard Lu Yiman’s laughter.\n\n ",
        "He instinctively wiped his mouth, looked around, and finally noticed Peng Duoduo’s furious expression, like he was about to assassinate him.",
        "“Damn, you told me to be here at 8, and I’ve been waiting for two hours.”",
        "Peng Duoduo gritted his teeth, “It was 20:00, not 18:00.”\n\n",
        "“Isn’t 18:00 eight o’clock?” ",
        "“That’s six o’clock!”",
        "“Who the hell messed with my watch again!”",
        "Seeing the person hopping mad, Peng Duoduo had completely lost hope.",
        "At first, Lu Yiman didn’t understand, but when the man stood up and revealed his face in the light, he got the gist of what Peng Duoduo meant. ",
        "It was nothing more than that this person somewhat resembled Yu Ziming.",
        "Not in looks, but in appearance — both had that delicate, fair-skinned, boyish charm.",
        "This didn’t have much to do with age; even in their twenties, they still exuded a pure, youthful energy, like they were stuck in their teenage years.",
        "However, this guy named Luo Ding was much wilder than Yu Ziming. ",
        "Lu Yiman’s gaze drifted from his leather jacket and pants to his studded boots, before politely looking away.",
        "“Didn’t I ask you to dress a little more presentable? Why are you dressed like this again?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Peng Duoduo was nearly exasperated. He didn’t have many gay friends, and it had been hard enough to bring this one along, but this guy just wasn’t cooperating!",
        "“What’s wrong? This is cool.” He was so annoyed by the nagging. ",
        "Luo Ding didn’t say the last sentence out loud, fearing that Peng Duoduo really would turn around and kill him.",
        "And for this “blind date,” he hadn’t even put on his smoky eye makeup, which was already giving face.",
        "“Tou…” Ueng Guoduo took a deep breath, afraid he might pass out, but when he turned to see the clean and handsome Ou Timan, his eyes were immediately soothed.",
        "“Timan, this is my friend, Ouo Ging.” ",
        "Seeing Peng Duoduo’s embarrassed look, it was clear this was probably the first time the young master had played matchmaker… uh, no… tried to set someone up.",
        "Lu Yiman was well aware of what was going on. He maintained a polite smile, nodded, and said, “Hello, Mr. Luo.”",
        "The “Mr. Luo” made Luo Ding lift his head to look at him.",
        "Luo Ding had met Peng Duoduo abroad. He was a bit older than Peng Duoduo but had a baby face that made him look younger, always like a fresh high school graduate. ",
        "“Hello, Lu Yiman.”",
        "He had to admit, the guy in front of him was quite captivating, and it wasn’t just his face. It was also that eye-catching aura that radiated from him.",
        "Lu Yiman smiled, unfazed that Luo Ding had called him by his name on their first meeting.",
        "He glanced down at the watch on his wrist and politely said, “Sorry, I’ll excuse myself for now. Since you brought a friend, today’s bill is on me.” ",
        "The last sentence was directed at Peng Duoduo. After saying it, he smiled and walked out of the room, swift and efficient.",
        "Peng Duoduo was momentarily stunned, “Hey… wait…”",
        "But Lu Yiman had already left, and the door to the private room opened and closed again.",
        "He felt that Lu Yiman seemed a bit unhappy, even though he didn’t say anything and remained polite the entire time. ",
        "Yes, polite!",
        "“This is all your fault! How can you be so rude?” Peng Duoduo complained, elbowing him.",
        "Please visit chrysanthemumgarden (dot) com",
        "Luo Ding was getting really annoyed, but he still answered patiently, “Then how should I say it? ‘Dear Mr. Lu, it’s a pleasure to meet you. I think you look good. Would you like to sleep with me?’”",
        "He rolled his eyes as he finished. ",
        "As if! Besides, it was clear the guy wasn’t interested in him.",
        "“Can’t you be a little more tactful, a bit more polite?”",
        "Peng Duoduo was grinding his teeth, so angry his hair practically stood on end.",
        "“How can I be tactful? I don’t know how to date, but he really does look like someone who makes you want to sleep with him.” ",
        "Seeing Peng Duoduo about to explode, Luo Ding waved his hand dramatically, lounging back on the sofa and saying casually, “Stop worrying about it. He’s not interested in me, but he’s polite enough. If you try this again next time, he might not be so nice and could flip out.”",
        "Luo Ding, grinning mischievously, glanced at Peng Duoduo’s face and, sure enough, saw him looking toward the door with a troubled expression.",
        "Was he angry? Well, Luo Ding figured he had at least tried his best…",
        "… ",
        "Lu Yiman walked out from the direction of the restroom and stopped as he passed by another private room.",
        "Even amidst the loud music on the first floor, the sound of breaking glass from inside the room was unmistakably clear — one crash after another, accompanied by a palpable, suppressed fury.",
        "His eyes flickered, and he turned his head slightly to look over. The bodyguards standing by the door noticed him and, at the same time, tightened their guard, blocking the entrance completely.",
        "Lu Yiman touched his ear, then casually slipped his hands into his pockets and strolled past. ",
        "Seeing that he didn’t make any other moves, the bodyguards relaxed slightly, glancing at the tightly closed door, and as the sound of breaking glass continued, they exchanged glances before lowering their heads again.",
        "Inside the private room, Yu Chuang was only wearing a black shirt, his tie messily pulled loose with one hand, hanging slack around his neck.",
        "He was breathing heavily, his sleeves rolled up haphazardly, his well-groomed hair now falling over his forehead. His narrow, phoenix-shaped eyes were filled with gloom and chaos as he stared at the shattered glass on the floor.",
        "This was the sixteenth bottle of alcohol he had smashed today. ",
        "A mere few hundred thousand, nothing he cared much about.",
        "His legs stumbled as he took a step back, collapsing onto the sofa. He raised his hand to cover his eyes, leaning his head back, his Adam’s apple bobbing up and down continuously, but no sound came out.",
        "",
        "He knew that since the Yu family had so few capable people, that’s why there were him and Yu Chuan.",
        "But as they grew older, both he and Yu Chuan had become less controllable. ",
        "This wasn’t something Old Master Yu could tolerate. So, whether it was deliberately assigning a project for Yu Ci to waste his time on, or now pushing for him to get married, it was all a warning.",
        "They bore the Yu family name. They were still part of the Yu family. They were still under Old Master Yu’s control. Anything the old man had given them could be taken back at any time.",
        "Marriage.",
        "He, of all people, being forced to marry. ",
        "Who would that even be hurting?",
        "Yu Chuang couldn’t let Yu Chuan see him like this at home, so he came here instead.",
        "Slowly, he reached for his neck. He couldn’t feel the tattoo, but he could feel the scar over his throat — ugly and hideous.",
        "But now flowers had bloomed over the vines. ",
        "Getting such a large tattoo over the scar at the age of eight had been excruciating, almost to the point of death.",
        "But even when he was in pain, he never said it hurt.",
        "He stared straight up at the ceiling. In the dimly lit private room, the ceiling seemed as dark as an open mouth, ready to swallow him whole.",
        "The key resting against his chest, once cold metal, had warmed to his body temperature. Slowly, he pulled the cord, taking the key out and staring at it quietly for a long time. ",
        "Finally, he gave a hard tug, and the cord dug into his neck, leaving a red mark. The key lay quietly in the palm of his hand.",
        "In just that brief moment, the key had lost all its warmth, turning cold once more.",
        "He loosened his grip, watching expressionlessly as the key fell into the glass of alcohol. The fleeting bubbles that rose became the dissipating air of everything that had been.",
        "… ",
        "When the door to the private room opened, Yu Chuang had once again become the impeccably dressed, cold, and dignified figure he usually was, with no trace of the earlier outburst.",
        "With his jacket draped over his arm, he stepped out of the room, taking five minutes longer than usual.",
        "",
        "But he was still on time.",
        "Even with that slight delay, he was precisely five minutes late. ",
        "As he stepped out of the private room, his shoe crushed something on the floor. He looked down and noticed a striking red spot against the carpet.",
        "Expressionless, he stared at it for a moment before bending down to pick it up.",
        "It was a delicate rose-shaped earring.",
        "Very beautiful. ",
        "Just then, with a creak, Peng Duoduo came out of the private room next door. Seeing Yu Chuang, he jumped in surprise.",
        "When he noticed the chaos inside Yu Chuang’s room as the man bent down, Peng Duoduo quickly averted his eyes, not daring to look any further.",
        "Lu Yiman had been gone for too long, and Peng Duoduo feared that he might actually be upset. He had intended to go find him but ended up running into Yu Chuang instead.",
        "Meeting Yu Chuang’s cold, dark eyes, Peng Duoduo felt a chill run down the back of his neck. He silently stepped back to give the man space to pass. ",
        "Yu Chuang cast a frosty glance at him before clenching the rose earring in his hand and walking straight past him. The bodyguards in black suits immediately followed behind him.",
        "The atmosphere he carried wasn’t that of someone who had come to a bar, but more like someone headed to a tense, high-stakes negotiation table.",
        "Of course, Yu Chuang never personally engaged in such negotiations.",
        "“Why are you so scared?” Luo Ding slapped him on the shoulder from behind, almost making Peng Duoduo jump. ",
        "“If you’re not scared, why don’t you try patting him on the shoulder like you did to me?” Peng Duoduo retorted angrily, shaking Luo Ding’s hand off.",
        "“Forget it, you can tell just by looking that he’s not someone to mess with.”",
        "Rich kids like them should keep their distance from people who were involved in serious matters.",
        "“Even though I know he’s been hanging around here these past few days, I didn’t run into him when I came here the other day. How come it’s so coincidental today?” ",
        "Peng Duoduo muttered to himself in confusion.",
        "Luo Ding had already sauntered ahead. Peng Duoduo cursed under his breath and quickly followed him down the stairs.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "At the same time, as Yu Chuang reached the first floor, a distinctly different bass line suddenly played.",
        "The crowd in the dance floor began screaming. ",
        "Yu Chuang turned his head slightly, looking toward the spotlight that now illuminated the center of the stage."
    ],
    "previous": "Chapter 15",
    "next": "Chapter 17"
}