{
    "title": "Chapter 31.2",
    "content": [
        "After everyone had left, the assistant turned to the seemingly unaffected secretary and exclaimed, “Aren’t you curious at all?!”",
        "The secretary coldly adjusted his glasses and glanced at him indifferently. ",
        "“The boss doesn’t need his subordinates to be curious about him.”",
        "The assistant was taken aback and silently looked away.\n",
        "",
        "What he said made sense, but he was still very curious!",
        "Yu Chuang carefully returned to his seat with a cup of hot water. Lu Yiman was lying on his side, wrapped in a blanket, looking rather listless. ",
        "Hearing his approach, Lu Yiman opened his eyes, glanced back, and smiled, “Why do you look so serious?”\n\n",
        "Yu Chuang lifted his eyelids.",
        "Because the assistant had wasted time that shouldn’t have been wasted.",
        "“Fever medicine.”\n\n ",
        "He opened his hand, still holding the hot water, and his direct gaze at Lu Yiman made it clear he didn’t intend for him to take the medicine on his own.",
        "Lu Yiman glanced at him and silently chuckled.",
        "“Okay.”\n\n",
        "He lowered his head, took the medicine into his mouth, his warm lips and moist tongue brushing lightly against Yu Chuang’s palm. ",
        "Yu Chuang’s breath hitched, suppressing a certain impulse, and quickly hid his hand behind his back. He then blew on the hot water and brought it to Lu Yiman’s lips.",
        "Lu Yiman cooperated and drank, his hands remaining wrapped in the blanket the whole time.",
        "“I want to sleep for a bit,” he said, leaning against Yu Chuang’s shoulder.",
        "Yu Chuang stiffened for a moment but quickly relaxed, straightening his back to make Lu Yiman more comfortable. ",
        "Before long, Lu Yiman was silent, his eyes closed, long lashes covering his eyelids. The usual elegance and composure gave way to an unexpected fragility.",
        "After all, Lu Yiman was two years younger than him.",
        "Looking at him like this, a flush crept across Yu Chuang’s face.",
        "He tightly gripped the fabric of his pants, his eyes shining brightly. ",
        "He really liked how he felt right now.",
        "What feeling?",
        "Please visit chrysanthemumgarden (dot) com",
        "The feeling that he needed Lu Yiman, and that Lu Yiman needed him too.",
        "*** ",
        "Lu Yiman hadn’t been this sick in a long time, but this fever left him feeling unusually heavy and uncomfortable.",
        "His mind was clouded, making it hard to even think, and his body felt weak and sluggish.",
        "Sven so, he still chose to entrust himself to Tu Jhuang, without any resentment or impatience toward his immature actions.",
        "Uerhaps it was the discomfort of being sick, but he woke up soon after, only to find Tu Jhuang sitting tensely, his paw clenched, and his fingertips gripping his phone so tightly they had turned white. ",
        "With an inadvertent glance, he saw the message on the phone.",
        "— Grandfather wants you to visit him after you return to the country. He plans for you to marry into the Gao family.",
        "Just a few words had sealed Yu Chuang’s fate.",
        "He didn’t need to go on any more blind dates, nor did he have the luxury of taking his time to choose. Old Master Yu had already issued his command, casually deciding his future. ",
        "Just like before, placing the weight of lofty expectations on him, only to easily cast him aside later.",
        "He pressed his lips together tightly, and a wave of nausea surged within him, draining the color from his face.",
        "It felt unbearable, deeply unbearable.",
        "— Recently, Yu You and Yu Yuan have returned. Grandfather has placed them in the Yu Group, working right by Yu Chuan’s side. ",
        "If the previous project was a minor warning to remind the two brothers to behave and not attempt to break free from the old man’s control, now it was a full-blown threat.",
        "Did being away from the Yu family mean they weren’t part of it anymore?",
        "From the moment their surnames were changed when they were children, the mark of the Yu family had been branded on them.",
        "Yu Chuang’s head began to ache. He stared at the two messages, his clenched fists bulging with veins. ",
        "Anyone looking at Yu Chuang at this moment would understand that his emotions had reached a dangerously critical point.",
        "Yet he was holding something back, even though his tense body was starting to tremble, he showed no outward signs of losing control.",
        "",
        "The messages had said enough—there was no need for further explanation.",
        "This situation wasn’t sudden, nor was it new. But when they had spoken on the phone two days ago, Yu Chuang’s brother had merely asked how he was doing in Germany, mentioning that the rainy weather meant he should be careful not to catch a cold. ",
        "The old Yu Chuan would never have said something like that.",
        "He would’ve just asked for a hug, telling his brother to hold him close.",
        "Yu Chuang had long grown accustomed to his brother’s expressed and unspoken demands.",
        "The mix of anger and suppressed frustration churned within him, threatening to break through the dam of his rationality. ",
        "The tattoo on his neck began to throb with an unnatural intensity.",
        "Though he hadn’t mentioned it, the pain from the tattooing had been worse than when his neck was sliced by glass—pain that felt like it would kill him.",
        "His gaze turned vacant as he stared at the phone, the fragile device emitting faint creaks in his tightening grip.",
        "Suddenly, a burning hand covered the back of his own, and the weight resting on his shoulder brought him back to his senses. ",
        "Lu Yiman was sick.",
        "This fact sent a strange, soft warmth fluttering through his chest amidst the throbbing pain.",
        "“Yu Chuang, I want some water.”",
        "Lu Yiman’s hoarse voice snapped Yu Chuang out of the emotional depths he had buried himself in. ",
        "He hurriedly grabbed the cup of water from the small table and carefully brought it to Lu Yiman’s lips.",
        "Lu Yiman took a sip of water and smiled at him. “Thank you, Yu Chuang. Without you, I don’t know what I would have done. You’ve taken such good care of me.”",
        "There was a gentle strength in his eyes, and the affirmation he gave brought a deep sense of calm to Yu Chuang’s heart.",
        "Yu Chuang’s gaze slowly cooled, becoming more composed. ",
        "Lu Yiman gently took hold of Yu Chuang’s hand, prying open his fingers one by one, and then pressed his own palm against Yu Chuang’s, interlocking their fingers.",
        "“If you’re feeling overwhelmed, don’t push yourself too hard.”",
        "",
        "He lowered his gaze, their fingers still intertwined.",
        "“It’s not overwhelming.” ",
        "Taking care of Lu Yiman could never feel like a burden.",
        "The warmth from Lu Yiman’s hand flowed into Yu Chuang, driving away the coldness that had settled in him.",
        "“Alright, just don’t push yourself.” Lu Yiman smiled softly and rested his head on Yu Chuang’s shoulder once more.",
        "Yu Chuang pressed his lips together, gazing at Lu Yiman with a look full of longing. ",
        "He really, truly wanted Lu Yiman.",
        "He wanted him so much, wanted to hide him away, wanted him to stay by his side forever.",
        "The sharp corner of the phone pressed into his palm like a thorn.",
        "But, he couldn’t give up on Yu Chuan. ",
        "Feeling the slight tremble in Yu Chuang’s fingertips, Lu Yiman’s gentle smile faded. After a long pause, he closed his eyes and sighed.",
        "There was a hint of coldness in that sigh.",
        "***",
        "After the plane landed, Yu Chuang needed to return to the Yu family, while Peng Duoduo, who had received the news, was already waiting at the airport to pick up Lu Yiman. ",
        "It was unclear if Peng Duoduo had some inherent luck, but in just a few days, despite his reckless spending and hasty decisions, he had managed to get his studio up and running.",
        "Just the day before, he had landed a project with a major film event, involving many popular actresses who would become the studio’s key promotions.",
        "Although they were actresses from his brother’s company, if the studio weren’t temporarily focused on women’s fashion, Peng’s older brother would have gladly modeled himself to support his younger brother’s business.",
        "Peng Duoduo, wearing sunglasses and dressed extravagantly, didn’t look like he was there to pick someone up—he looked more like he was about to walk a runway. ",
        "When he saw the pale-faced Lu Yiman disembark, he immediately pulled down his sunglasses and rushed over in a panic. “What happened? Were you pushing yourself too hard?”",
        "Peng Duoduo felt guilty. Here was Lu Yiman working hard and exhausting himself for their business, while all he’d done was throw money around without contributing anything substantial!",
        "",
        "“I’m fine. The weather changed too quickly, so I caught a cold.”",
        "Even Lu Yiman’s voice was hoarse, making Peng Duoduo feel even guiltier. ",
        "Suddenly, the large orders he’d placed worth hundreds of thousands didn’t seem so impressive anymore.",
        "***",
        "Yu Chuang couldn’t leave with Lu Yiman, and he couldn’t take him with him either.",
        "Even though he strongly wished to bring Lu Yiman with him right now, the messages on his phone weighed down his heart once again. ",
        "While Peng Duoduo was still reflecting on his shortcomings, he suddenly felt a chill at the back of his neck. He looked up and saw Yu Chuang staring at him with an expressionless face.",
        "“…”",
        "They stared at each other in silence, and the pressure in Yu Chuang’s gaze grew stronger and stronger.",
        "Peng couldn’t help but swallow nervously, wondering if this big brother had something to say to him. ",
        "But Yu Chuang simply stared at him for a long time, his icy gaze nearly freezing Peng Duoduo in place. In the end, Yu Chuang didn’t say anything.",
        "He just handed the fever medicine to Peng Duoduo, leaving a simple instruction: “Take good care of him,” before walking away without looking back.",
        "The secretary and assistant flanked him on either side, and several men in suits followed closely behind, creating a dark, imposing atmosphere that lingered until they disappeared at the airport’s exit.",
        "Only then did Peng Duoduo snap out of his daze. Looking at the fever medicine in his hand, he exclaimed, “You have a fever, not just a cold! Fever and cold aren’t the same thing!” ",
        "He quickly draped his coat over Lu Yiman’s shoulders and hurriedly pulled him toward the exit.",
        "“Hurry up! It’s freezing cold in Beijing right now. If I hadn’t checked the calendar, I’d think winter had already arrived.”",
        "Peng Duoduo, who hated the cold, couldn’t bear any discomfort. He immediately wanted to get back to the car and turn on the heat.",
        "“Is it really that bad?” Lu Yiman didn’t let Peng Duoduo pull him and returned the coat. If it weren’t for his pale complexion and obvious fatigue, he would look no different from his usual self. ",
        "In fact, he walked with such steady strides that he seemed more composed than Peng Duoduo.",
        "“Am I exaggerating?” Peng Duoduo muttered in confusion, watching his friend’s retreating figure. When he’d touched Lu Yiman earlier, his body had definitely felt feverishly hot.",
        "",
        "Still feeling uneasy, Peng hurried after him.",
        "“Yiman, let’s stop by the hospital first!” ",
        "As Lu Yiman stepped into the chilly wind outside the airport, he sent a message with an expressionless face.",
        "— President Yu, are you a featherless bird?",
        "Such a provocative and cutting remark caused Yu Chuan, who was in the middle of a meeting, to darken his expression. His cold, piercing gaze silenced everyone in the room, leaving no one daring to breathe."
    ],
    "previous": "Chapter 31.1",
    "next": "Chapter 32.1"
}