{
    "title": "Chapter 23",
    "content": [
        "Rich and powerful people are indeed different. Gao Qinchang’s efficiency was very high, and within a few days, he had helped him settle everything about the studio.",
        "He specially bought a fruit basket and had someone deliver it, hearing that this young master had been sick for several days and was still staying home. ",
        "After finishing the last formal dress, he put down the ruler in his hand and walked barefoot out of the guest room, which had already been filled with clutter.",
        "His phone kept buzzing with messages, all from ladies who had contacted him through his business card at Pearl Coast.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "There were quite a few who wanted to invite him out for “coffee,” using the opportunity to promote his work.",
        "He immediately passed this account over to Peng Duoduo. ",
        "— ???\n\n",
        "Peng Duoduo had recently changed his profile picture, from Princess Elsa to Gargamel, implying he was about to “go dark.”",
        "He didn’t have the energy to care why Peng Duoduo was going dark; after all, for someone like Peng, whose biggest worry was whether to drive a Ferrari or a Rolls-Royce today, if he asked, he felt he himself might be the one going dark in the end.",
        "“I’m going abroad for a bit, so you’ll have to handle the work account for me.”\n\n ",
        "Peng Duoduo had already logged in by then, and it was filled with messages from beautiful ladies. Few of them mentioned work, but there were plenty asking if he was free and if he wanted to visit their homes in the evening.",
        "Some even said their husbands wouldn’t be home that night, asking him to come over to make clothes, and whether it was better to measure them in a robe or without one.",
        "This was more exciting than the adult novels Peng Duoduo had been reading.\n\n",
        "— Are you sure you’re really working as a designer? ",
        "Peng Duoduo had serious doubts.",
        "—Of course. You can’t dismiss the artistry just because someone occasionally invites me to work in the evening.",
        "— …",
        "Art, my foot! ",
        "Peng Duoduo was almost dying of jealousy. This lewd man!",
        "No one ever invited him to make clothes in the evening. They would just hand him a candy, smiling as they said, “Hurry home now, or your sister will worry. I’ve got things to do, so I won’t keep you.”",
        "— Why are you going abroad?",
        "—You don’t know? ",
        "— ???",
        "—Your sister gave me an invitation. There’s going to be an international designer exchange competition in five days, and designers from all over can bring their works to participate.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "What! Why didn’t he know anything about this!",
        "Peng Duoduo started to get nervous. ",
        "— My sister isn’t really interested in you, is she?!",
        "That’s terrifying! His best friend was going to become his brother-in-law!",
        "Lu Yiman couldn’t help but laugh.\n—Why would you think that? Don’t forget, all the money your sister invested turned into your shares. I’m only going to the competition to increase the studio’s reputation.",
        "In the end, he was working for Peng Duoduo. ",
        "Peng Duoduo didn’t believe it; he couldn’t wrap his head around it.",
        "Dut then he suddenly thought of Ou Timan’s interest in Tu Jhuang, and he felt relieved.",
        "In fact, compared to becoming his brother-in-law, being with Tu Jhuang seemed like a much brighter future!",
        "— Alright, go then! ",
        "Le would keep a close eye on Jhuang!",
        "As for the studio…",
        "Le could pust hire people to do the work!",
        "By the time Lu Yiman returned, the studio might have grown significantly! ",
        "One had to admit that although Peng Duoduo was a bit naive, the blood of a capitalist still flowed through his veins.",
        "…",
        "Yu Chuang looked down at the winding streets and the never-ending stream of traffic below the tall building.",
        "From up here, anyone could easily overlook this bustling city beneath their feet. ",
        "“Brother?”",
        "Yu Chuan looked at him with some confusion as he stood by the floor-to-ceiling window.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Recently, the other person had been distracted, looking lost in thought, and he didn’t know who he was thinking about.",
        "Yu Chuang paused for a moment, turning back to look at him, his eyes cold and indifferent, lofty. Only when his gaze focused on his face did it soften slightly. ",
        "Standing in the Yu Corporation building, Yu Chuang appeared even more aloof and noble than usual.",
        "He was still on medication, but his emotions had stabilized considerably. Occasionally, when Yu Chuan looked at him, that calm indifference exuding from Yu Chuang would cause him to momentarily lose focus. It seemed as if this was how Yu Chuang was supposed to be—not hysterical, anxious, or irritable, struggling with his own emotions.",
        "Indeed, it was better that Yu Ziming had disappeared.",
        "Yu Chuan concealed the darkness in his eyes and approached him with a smile on his face. ",
        "“Brother, what are you thinking about? You seem distracted lately.”",
        "Yu Chuang’s hand, hanging by his side, tensed slightly. He pressed his lips together without answering, turning to look at the floor-to-ceiling window instead.",
        "He was thinking about the person who had kept appearing in his dreams over the past few days.",
        "“Brother, the company’s Sun series is opening a new counter in Germany soon. But you know I have to stay in the country to keep those restless parasites in check. Could you help me with this collaboration?” ",
        "Yu Chuan looked up at Yu Chuang with hopeful eyes.",
        "Yu Chuang never refused him on such minor matters.",
        "“Alright.”",
        "As expected, Yu Chuang agreed. ",
        "Yu Chuan immediately smiled and affectionately said, “If you enjoy your time abroad, you can treat it like a vacation and stay a bit longer. After all, I’ve got everything under control here.”",
        "Seeing the smile on his face, Yu Chuang raised a hand to touch his hair.",
        "He knew Yu Chuan was also under a lot of pressure.",
        "So as his older brother, he was always willing to be more lenient with him. ",
        "Yu Chuan lowered his head, smiling as he leaned into Yu Chuang’s palm, but in his eyes was a cold, insane darkness.",
        "That old fool dared to think he could control his brother by arranging a marriage behind his back.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Surely, that person didn’t still believe that the Yu Corporation belonged to him?",
        "Yu Chuan let out a sinister smile, closed his eyes briefly, and leaned his head on Yu Chuang’s shoulder. ",
        "Just wait.",
        "Yu Chuang looked down at his beautifully striking face before raising his gaze to the horizon.",
        "…",
        "Lu Yiman only brought a small amount of luggage. He had no intention of staying in Germany for long. ",
        "Looking at his boarding pass, he made his way toward the business class section, where a man was already sitting by the aisle, reading a magazine.",
        "The magazine covered most of the man’s face, and Lu Yiman, focusing on his seat number, didn’t glance too long, avoiding any unintentional awkwardness.",
        "Standing in front of his seat, he stretched out his arm to place his carry-on luggage in the overhead compartment. Just then, someone jostled him from behind in the crowded aisle.",
        "He stumbled forward, his leg brushing against the man’s. ",
        "“Sorry.”",
        "He quickly apologized, but the man’s hand holding the magazine tightened slightly without saying a word.",
        "Concerned that he had caused discomfort, Lu Yiman apologized once again.",
        "The man remained silent, which made Lu Yiman curious, though he didn’t think too much of it. He stepped forward, long legs striding past the man, who suddenly tensed up all over. ",
        "The change was so noticeable that Lu Yiman’s movement came to a halt.",
        "He had never experienced such discomfort from someone because of a simple physical touch.",
        "“Sir, are you alright?”",
        "He hesitated, asking softly. ",
        "After all, the man’s grip on the magazine was so tight it looked like he might tear it apart.",
        "And being that close—was he really able to see clearly?",
        "",
        "Or was this man’s nearsightedness so severe that it had come to this?",
        "Lu Yiman raised an eyebrow, waiting for the man’s response. ",
        "After all, it wasn’t exactly polite of him to be halfway leaning over the seat with one leg still awkwardly extended in front of the man.",
        "After a long pause, the man slowly moved his legs aside to give him room.",
        "Yet Lu Yiman’s gaze lingered on the man’s briefly visible, flushed red ears.",
        "“Mr. Yu.” After a brief silence, he gently called out. ",
        "The man in front of him visibly flinched.",
        "He lifted his long, pale fingers and placed them on the magazine that had been covering the man’s face, applying a little pressure, gradually pushing it down.",
        "From the sharp, high-arched brows to those long, narrow phoenix eyes, followed by the high-bridged nose, and finally to the tightly pressed lips.",
        "Despite the serious expression, the man’s face had already turned completely red. ",
        "Lu Yiman chuckled, leaning on the backrest as he looked down at him.",
        "“What a coincidence, Mr. Yu.”",
        "It was indeed a coincidence. From the moment Lu Yiman boarded the plane, Yu Chuang had already noticed him. His tall, elegant figure and refined, handsome appearance naturally drew attention.",
        "Sitting in his seat, Yu Chuang had watched as the other man politely passed by passengers, even helping a young girl stow her luggage. The girl’s face flushed at his warm smile, and even after he walked away, she kept looking back at him. ",
        "Then, unease crept into Yu Chuang. He realized the man was getting closer and closer, his path clearly headed in his direction. His heart rose in sync with the decreasing distance between them.",
        "When the man’s gaze swept toward his seat, Yu Chuang had no time to react. He had already grabbed the magazine from his seat and held it up in front of his face.",
        "And after that, he found it too awkward to lower it…",
        "“Long time no see.” ",
        "Yu Chuang looked up at Lu Yiman, a faint light flickering in his eyes.",
        "Lu Yiman gazed down at him, and as their eyes met, his own softened.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Long time no see.”",
        "This time, their meeting was purely coincidental. ",
        "Had destiny quietly changed the moment the story altered its course?",
        "Lu Yiman’s smile widened, his joy impossible to conceal.",
        "Yu Chuang didn’t quite understand why he was smiling so brightly.",
        "All the doubts he had about their repeated coincidental meetings melted away in the warmth of the other man’s smile, replaced by a sense of calm. ",
        "They had met again.",
        "On this plane, on their way to another country.",
        "The slight loneliness of traveling alone had now transformed into a kind of inexpressible contentment.",
        "He touched his sleeve and suddenly thought that the lily he wore didn’t belong in this moment. ",
        "Because he wasn’t unhappy at all.",
        "“Ah, excuse me, sir.”",
        "Suddenly, a young man’s voice sounded from the aisle. Both Yu Chuang and Lu Yiman turned their heads.",
        "The young assistant, holding his boarding pass, looked at them and their perfectly matched atmosphere, unsure whether or not to continue speaking. ",
        "“Sir, this… um… seat… I made a mistake! My apologies!”",
        "Under Yu Chuang’s cold gaze, the clever assistant immediately changed his words with tact.",
        "Lu Yiman smiled politely and effortlessly swapped his boarding pass with the other man’s, saying with a smile, “It’s no problem.”",
        "He glanced down at Yu Chuang, who had already quietly raised the magazine back up. ",
        "The amusement in his eyes deepened, and his heart felt lighter than ever.",
        "Yes, fate’s harmless little joke.",
        "Please visit chrysanthemumgarden (dot) com",
        "He was starting to look forward to this trip to Germany."
    ],
    "previous": "Chapter 22",
    "next": "Chapter 24.1"
}