{
    "title": "Chapter 24.1",
    "content": [
        "Not sure if it’s because of some recent exhaustion, but Lu Yiman fell into a light sleep not long after boarding the plane.",
        "Yu Chuang turned his head to look at Lu Yiman, who was leaning against the seatback. His skin was very pale, making the shadows under his eyes particularly noticeable. ",
        "A few strands of loose hair hung loosely in front of his forehead, covering half of his eye. His high nose bridge was exquisite and attractive. His lower lip was thicker than the upper one, and his mouth naturally had a slight curve, as if he was smiling even when he spoke.",
        "Now, with his lips slightly closed, they appeared full, making them look especially soft.\n",
        "",
        "Because of Lu Yiman’s calm and elegant demeanor, people sometimes overlooked the fact that he was only 24 years old, two years younger than Yu Chuang.",
        "His overly striking presence often attracted attention before his face did, but in truth, he was quite beautiful. ",
        "When his almond-shaped eyes were open, they resembled a deep pool with ripples of spring water. Now that they were closed, his long eyelashes, thick like brushes, made it even harder for people to look away.\n\n",
        "This was the first time Yu Chuang had carefully observed him like this.",
        "Suddenly, the plane shook — a normal turbulence bump.",
        "Some of the passengers who were resting were startled awake but quickly relaxed.\n\n ",
        "Only now did Yu Chuang realize that he had been staring blankly at Lu Yiman’s face.",
        "Yet, Lu Yiman only furrowed his brows slightly and did not wake up. He seemed genuinely exhausted.",
        "He pressed his lips together, his Adam’s apple moving slightly. His drooping eyelids flickered, and then he slowly extended his hand, gently guiding Lu Yiman’s head to rest on his shoulder.\n\n",
        "Lu Yiman’s braid swayed, brushing lightly against Yu Chuang’s fingers, causing a slight ticklish sensation. ",
        "Yu Chuang lowered his head, watching Lu Yiman’s furrowed brows gradually relax, feeling a profound but steady surge of emotion spreading through his chest.",
        "Holding back the heat rising to his ears, he turned to look at the clouds passing by the window, straightened his back, and supported the slight weight resting on his shoulder.",
        "On the other side of the aisle, Mr. Assistant sneaked a glance at his usually aloof and distant boss, feeling conflicted as he pulled the blanket over himself.",
        "Should he report this to the young boss? ",
        "The big boss had encountered a handsome man on the plane!",
        "……",
        "Yu Chuan stepped on the fallen leaves as he walked into the old Yu family residence.",
        "The buildings here looked very old, as if they had been frozen in a distant time through the passage of years. ",
        "Whether it was the tall trees in the yard or the gravel path leading inside, the silent stillness turned Yu Chuan into the child he once was.",
        "Dut the fact was, he had already grown up, and the innocent and fragile child had forever been sealed away in the black-and-white past.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lowever, even so, this grand and ezpansive Tu family estate was not a place pust anyone could enter.",
        "“Second Toung Zaster.” ",
        "The old butler looked at him with surprise and delight, hurrying forward to greet him. After seeing him, the butler also glanced ezpectantly behind him, as if looking for someone.",
        "“My brother didn’t come back. It’s just me.”",
        "Seeing the disappointment on the butler’s face, Yu Chuan remembered how, in his childhood, Yu Chuang was the most beloved child here, second only to Old Master Yu.",
        "Since Yu Chuang was the older brother, the other children who had grown up here alongside him had both respected and feared him, and even under his dominance, they were still protected by him. ",
        "But as these children grew up, only Yu Ci, the most incompetent and arrogant one, remained by Old Master Yu’s side in the old mansion.",
        "The ones who had been most highly regarded, Yu Chuang and Yu Chuan, were the first to leave this place.",
        "Crossing through the front hall and turning into the more expansive and elegant backyard, Yu Ci, who was pouring tea, was visibly startled when he saw him. His hand shook, spilling most of the tea.",
        "“Still so impatient.” ",
        "Old Master Yu, holding a fishing rod, gave it a small shake. Yu Ci immediately lowered his head, not daring to speak, and poured half a cup of tea again.",
        "Yu Chuan glanced at it, his face cold as he strode over. Ignoring Yu Ci’s warning and dissatisfied look, he picked up the tea Yu Ci had poured and flung it into the fish pond.",
        "“The weather is dry, just drink plain water.”",
        "His impolite tone made Yu Ci’s face change immediately, and he carefully glanced at Old Master Yu, who was sitting on the lounge chair. ",
        "“Alright, such resentment in the middle of the day, you’ve scared the fish away.”",
        "Old Master Yu waved his hand, and Yu Ci set down the teapot and stood aside.",
        "Reeling in the line, not a single fish had been caught.",
        "Though Yu Chuan never understood the point of pretending to fish for fish they had raised themselves. ",
        "“Why do you look like you’re about to commit murder and robbery? Are you standing up for your brother?”",
        "Old Master Yu turned his head, looking at him with a half-smile.",
        "Please visit chrysanthemumgarden (dot) com",
        "Facing this expression, Yu Ci didn’t even dare to breathe heavily. Yu Chuan, however, stared coldly at him and suppressed his frustration as he said, “You know what kind of situation he’s in. Why do you insist on ignoring his will and forcing him to marry someone?”",
        "“Precisely because I know his situation, I’m doing this for his own good. What, are you going to take care of him for the rest of his life?” ",
        "Old Master Yu’s eyes flashed with coldness, tinged with mockery.",
        "Even though he was quite old now, one could still glimpse the glory of his youth.",
        "Apart from those cold, dark eyes, the rest of his features looked almost identical to Yu Chuan’s. His silver-white hair gave his stunning face a slightly aged indifference, but it couldn’t conceal the sharpness underneath.",
        "“He’s an adult with his own will and ability to act independently. He doesn’t need you to treat him with such extreme measures!” ",
        "Yu Chuan refused to back down, his eyes sharp like a wolf with ambitious hunger.",
        "When facing Old Master Yu, he never saw him as one of the few remaining family members, but as an enemy standing in his way.",
        "Old Master Yu’s expression flickered briefly before he quickly averted his gaze.",
        "Yu Chuan resembled him too much, almost a mirror image of himself in his younger years. ",
        "As for Yu Chuang, who he had abandoned, he didn’t want that person affecting Yu Chuan’s ambitions.",
        "“Don’t think I don’t know about your brother’s affairs. If that university student hadn’t gone abroad, what do you think he would have done next? Report it to the police? Let the world know that someone from the Yu family is a lunatic who imprisons others when they can’t get what they want?”",
        "Yu Chuan was deeply irritated that he would bring up Yu Ziming at a time like this.",
        "“That’s because that person wasn’t right for him!” ",
        "He knew it better than anyone, but he didn’t want to make Yu Chuang unhappy. So even though he knew Yu Ziming couldn’t give Yu Chuang the emotional support he needed, he had only given Yu Ziming multiple chances to leave and had never directly interfered with Yu Chuang.",
        "In his eyes, Yu Ziming was nothing more than a toy accompanying Yu Chuang.",
        "“And who is right for him? Someone who doesn’t cry or laugh, who couldn’t speak until he was eight, who can only express emotions through fits of madness? Do you think anyone other than you could tolerate him?”",
        "“Shut up! He’s better now! If it weren’t for you, he’d be living a much better life!” ",
        "The veins in Yu Chuan’s neck bulged with fury, and his extreme anger made Yu Ci, standing nearby, straighten up in fear of a conflict erupting between him and Old Master Yu.",
        "Yet Old Master Yu’s face remained emotionless, with a cold indifference that chilled anyone who saw it.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Even though Yu Chuang had never expressed his feelings about his tattoo, Yu Chuan loathed that indelible mark. In his eyes, that tattoo was even uglier than the scar on Yu Chuang’s neck.",
        "And all of this was given to him by the old man sitting before him— that tattoo, which bound Yu Chuang and abandoned him, was like a chain etched into his flesh and bones, rooted deep within him, never to be removed. ",
        "“You shouldn’t let him cloud your judgment. Just like when I handed you power, it wasn’t so you could sacrifice everything for a failure…”",
        "“Don’t say those two words.”",
        "Yu Chuan’s eyes locked onto Old Master Yu with a sinister gaze that sent chills down anyone’s spine.",
        "“I’ve always thought I underestimated you— and him,” Old Master Yu responded, staring back coldly. The malice in his eyes was bone-chilling. ",
        "The bloodline of the Yu family carried certain cold and insane traits.",
        "Whether it was his mother or him now, both had it in their veins.",
        "And yet, Yu Chuang, born with his own defects, was the one who grew toward the light.",
        "But how could someone as selfish and dark as Old Master Yu ever understand? ",
        "“I will never give up on him. He is my only family. Anyone who stands in his way, I will destroy.”",
        "His cold gaze bore into Old Master Yu, his obsession and stubbornness forming a menacing blade in his eyes.",
        "Old Master Yu stared back unblinkingly, his gaze piercing through, and his voice, both eerie and cold, cut through the air: “Then why does he never resist me? Because what you want is with me. The real thing holding him back is you.”",
        "In that moment, even the air around them seemed to freeze. Yu Chuan’s pupils contracted, and his entire presence became deeply oppressive. ",
        "He knew exactly what the old man was talking about, and precisely because he understood, the overwhelming impact hit him so hard that he found it difficult to bear.",
        "Because Yu Chuang was the older brother, even if only by a minute, he was still the elder. From a young age, Yu Chuang had fulfilled the role of an older brother perfectly.",
        "From childhood to adulthood, Yu Chuan had grown up almost entirely under Yu Chuang’s protection. Even when their parents were still around, his awareness of their presence was vague at best.",
        "Because Yu Chuang was always there—Yu Chuang would protect him. ",
        "To him, Yu Chuang was the emotional pillar that had supported his entire childhood.",
        "He couldn’t live without Yu Chuang, and he wanted to give Yu Chuang everything he desired.",
        "Please visit chrysanthemumgarden (dot) com",
        "It felt as though holding onto Yu Chuang tightly could somehow make up for the lost time in his childhood, could alleviate the guilt he carried in his heart.",
        "That’s why he clung to Yu Chuang with fear, anxiety, and a sense of aggression, all of which turned into the hand that refused to let go of his brother. ",
        "He couldn’t give up power, nor could he abandon everything that the Yu family had gained.",
        "Instinctively, he believed he was the one giving, but in truth, he was still demanding from Yu Chuang."
    ],
    "previous": "Chapter 23",
    "next": "Chapter 24.2"
}