{
    "title": "Chapter 31.1",
    "content": [
        "Lu Yiman had a fever.",
        "Under the intoxication of alcohol, his face grew redder, his breathing hotter, and his mind more clouded. ",
        "Not knowing what kind of emotions he was feeling, Yu Chuang almost hurriedly brought him back to the hotel.",
        "By the time they got out of the car, Lu Yiman could no longer open his eyes.\n",
        "",
        "Yu Chuang’s breathing was heavy. He stared intently at Lu Yiman’s flushed face and bent down to carry him.",
        "Perhaps there was some concern, but more than that, there was another hidden emotion. ",
        "He carried Lu Yiman back to the room, completely ignoring the sofa in the living room, and directly stuffed him into the bed, then stared at him without blinking.\n\n",
        "“Lu Yiman.”",
        "The other person didn’t respond.",
        "Of course, he had a high fever and had drunk so much.\n\n ",
        "Yu Chuang started undressing him piece by piece. When he undid his belt, Lu Yiman stirred, his slender hand grabbing him.",
        "He looked up, and Lu Yiman opened his dazed eyes, struggling to maintain the last bit of consciousness.",
        "“Taking off your clothes, go to sleep.” He explained, then continued to undress him.\n\n",
        "Lu Yiman was too exhausted, overwhelmed by a tidal wave of fatigue that threatened to swallow him whole. ",
        "Yu Chuang successfully stripped him, though in the end, he left some clothes on, because no matter how hard he tried, Lu Yiman clung tightly to him.",
        "Such strong defensiveness.",
        "Yu Chuang busied himself folding the discarded clothes neatly and then wrapped Lu Yiman tightly in the blanket from head to toe.",
        "Watching him lie in bed, unaware of anything, Yu Chuang squatted by the bedside, staring intently at him. ",
        "“Lu Yiman.”",
        "“Lu Yiman.”",
        "“Lu Yiman.”",
        "His slightly hoarse voice called Lu Yiman’s name over and over. ",
        "Lu Yiman raised his hand to cover his eyes, hiding his furrowed brow as well.",
        "But Yu Chuang pulled his hand down, tucking it seriously under the blanket, and carefully wrapped him up entirely.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "His fingertips trembled slightly, for he was a bit excited now.",
        "Wrapped in the blanket, Lu Yiman seemed to have lost his limbs, as if bound by Yu Chuang. ",
        "His eyes were dark and bright.",
        "Lu Yiman’s furrowed brows relaxed slightly, but his discomfort was still evident on his face.",
        "Only then did Yu Chuang notice the dark circles under his eyes and the deep exhaustion that had surfaced now that his defenses were down.",
        "Of course, he’s been really tired lately. ",
        "But he never said anything, never showed it. He always maintained that calm and composed demeanor, even when others were nervous and panicking, as if nothing could ever faze him.",
        "Yu Chuang had never seen Lu Yiman like this.",
        "Le couldn’t help but lean closer, his breath falling onto Ou Timan’s face.",
        "“Ou Timan.” ",
        "Le called his name softly, reaching out to poke his cheek.",
        "Ou Timan’s body temperature was usually low, but now he was burning hot to the touch.",
        "“Zm.” Ou Timan responded, but frowned, unable to open his eyes.",
        "Yu Chuang’s dark pupils, for a moment, seemed like a black hole ready to swallow everything. ",
        "The lights in the living room were turned off, the lights in the room as well, the window shut, the door locked, leaving only a bedside lamp so that Yu Chuang could see his face.",
        "He quickly climbed into bed, lying down next to Lu Yiman.",
        "The unfamiliar yet intimate presence made Lu Yiman frown even more. He struggled to open his eyes, only to meet Yu Chuang’s dark and bright eyes staring straight at him.",
        "“What, planning to eat me?” He smiled faintly. ",
        "It seemed Lu Yiman still hadn’t grasped the situation, where he was clearly at a disadvantage.",
        "Yu Chuang didn’t answer, just kept staring at him.",
        "",
        "The blanket was making him uncomfortable. He tried to free his hands and push the blanket away.",
        "Yu Chuang’s shadow loomed over him, pressing him down again, stuffing his hands back inside, and tightly wrapping the blanket around him. ",
        "“Careful not to catch a cold.”",
        "That low, hoarse voice echoed the words Lu Yiman had once said to Yu Chuang on a rainy night.",
        "Seeing Yu Chuang’s tense expression now, for some reason, Lu Yiman felt like laughing.",
        "So he did. ",
        "He curved his eyes and laughed out loud, filled with joy.",
        "Lu Yiman stared deeply at him. He raised his hand to caress Yu Chuang’s face and then pinched his chin, exposing him under the bedside lamp.",
        "The person who had seemed so imposing just moments ago now clearly looked like someone holding back, brimming with a childish eagerness.",
        "“What do you want to do to me?” ",
        "Lu Yiman wasn’t fully conscious, but he would never let himself be completely unaware. Even in the face of a high fever and intoxication, his strong willpower kept him on edge.",
        "Yet, he was still different from usual. His once gentle and captivating voice had become much hoarser, lazy but carrying a hint of danger.",
        "What would Yu Chuang do? What could he do?",
        "Yu Chuang persistently tucked Lu Yiman’s hand back under the blanket, wrapping him tightly again, and then lay down beside him, staring at him without blinking. ",
        "“Sleep.”",
        "He only wanted Lu Yiman to sleep. He just wanted to sleep beside him.",
        "Hadn’t he been saying that all along, even a long time ago?",
        "Lu Yiman didn’t have the strength to resist anymore. He stared directly into Yu Chuang’s eyes, and in the silent stillness, he quietly let go of the taut string in his mind, allowing the exhaustion to gradually swallow him. ",
        "“Okay, sleep.” He smiled faintly and closed his eyes.",
        "The moment he relaxed, fatigue crashed over him like a roaring wave, consuming him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang silently moved closer to him, watching as his breathing gradually evened out and his body became still. He shifted again, pressing closer until their shoulders touched, feeling Lu Yiman’s scorching breath on his face.",
        "He stared at him, his cheek brushing against Lu Yiman’s forehead. Trying his best to control himself, he slowly extended his arm and firmly embraced Lu Yiman. ",
        "The moment his arms were filled, his heart was filled as well.",
        "With his eyes open, he softly parted his lips.",
        "“Lu Yiman, you’re mine.”",
        "*** ",
        "In the dream, he was back on that snowy day. He stood bewildered in front of the cold iron gate, staring through the bars at the curious eyes inside.",
        "They were about his age, with some older kids staring coldly and scrutinizing him, their eyes even colder than the snow on the ground.",
        "A three-year-old might not understand much, but they can keenly sense unfamiliarity and fear.",
        "But he knew that soon the gate would open for him, like another world welcoming him in. ",
        "And soon, he would become just another ordinary orphan inside, no different from the rest.",
        "When he opened his eyes, faint sunlight streamed through the gap in the curtains. His head felt heavy and his body weak, yet seeing that thread of golden light brought no reaction to his eyes.",
        "The past could no longer defeat him, so it was just a dream.",
        "The room was very quiet. He threw off the blanket and sat up, though even such a simple movement made him uncomfortable. Yet, the exhaustion that weighed down on him and the mental strain that refused to let go felt even worse. ",
        "Sitting on the edge of the bed, he lowered his head and lit a cigarette.",
        "His hand holding the cigarette trembled slightly—he was sicker than he had imagined.",
        "He rarely got sick because he understood that the pain of illness was hard to endure, so he tried his best to avoid it.",
        "That sense of vulnerability would become a burden. ",
        "Just like now.",
        "He lowered his head, his long hair covering his eyes, and his once upright posture sagged.",
        "",
        "Even smoking, such a simple action, now felt like a burden. The exhaustion that had been pressing on his heart suddenly surged over him, overwhelming him like a tidal wave.",
        "The hand resting on the edge of the bed was too tired to move, so he simply watched the cigarette burn quietly, the gray-white ash falling like something withered. ",
        "Yu Chuang stood silently at the door, watching him.",
        "This version of Lu Yiman felt unfamiliar, yet it shattered the gentle and composed facade, bringing a sense of grounded reality.",
        "The curtains were blown open by the wind, and a large swath of sunlight poured in. After days of gloomy rain, the sunlight was especially dazzling. When Lu Yiman raised his head, the golden light illuminated his pale face.",
        "At this moment, Lu Yiman looked very lonely. ",
        "Yu Chuang pressed his lips together, walked over, and quietly sat beside him. The slight dip in the bed made Lu Yiman sluggishly turn his head.",
        "His eyes shifted, and instinctively, he tried to smile, but Yu Chuang raised a hand to cover his eyes and gently pressed his head down with the other.",
        "Lu Yiman’s head rested on Yu Chuang’s lap.",
        "Neither of them spoke. The only sound was the quiet rhythm of their breathing. ",
        "Lu Yiman’s eyelashes brushed against Yu Chuang’s palm, tickling slightly.",
        "Yu Chuang’s ears turned red as he sat upright, looking down at Lu Yiman lying on his lap. His expression remained calm, but a faint trace of genuine tenderness flickered briefly in his dark eyes.",
        "He liked every version of Lu Yiman but didn’t like the loneliness he had just witnessed—the kind that excluded him.",
        "Lu Yiman, who had initially been stiff, slowly forced himself to relax. It was a process that seemed simple but was difficult for him. ",
        "He had to peel back his layers, cautiously revealing a sliver of vulnerability—just a sliver.",
        "Then he would tell himself that it was safe now, that he was sick, and it was okay to indulge just a tiny bit.",
        "As he felt his heart begin to stir, the steady, lifeless calm that had settled over him for who knows how many years finally gave way to the slow, genuine beat of a heartbeat.",
        "No one in this world truly understood the real Lu Yiman. ",
        "Even someone as seemingly close as Peng Duoduo only knew the “Lu Yiman” of the past.",
        "Every relationship was built on the continuation of “Lu Yiman,” but none marked the beginning, nor could any offer him a perfect conclusion.",
        "",
        "Only Yu Chuang.",
        "He suddenly crushed the burning cigarette butt in his palm, his eyes peering through Yu Chuang’s fingers at the rays of sunlight outside—beams that could pierce through anything. The shadows in his heart wove into a tight, intricate web. ",
        "Yu Chuang, love me a little more. Love me more.",
        "Show me, let me hear, let me feel your unwavering resolve—that no one but me will do.",
        "***",
        "By the time evening came, they were on the plane back. ",
        "Originally, they should have left in the morning, but Lu Yiman had been too sick then.",
        "Perhaps for someone who rarely gets sick, when they do fall ill, it hits harder.",
        "The assistant, feeling the weight of Yu Chuang’s gaze, asked with a headache, “May I ask, when did Mr. Lu’s fever start?”",
        "Yu Chuang, with a cold expression, answered, “Last night.” ",
        "Last night!",
        "The assistant nearly choked in shock.",
        "“And did you call a doctor last night?” he asked, forcing a smile.",
        "“No.” ",
        "No?!",
        "So they just toughed it out?!",
        "“Why didn’t you call a doctor last night?” the assistant asked, his forced smile becoming more strained.",
        "Yu Chuang remained silent, merely staring at him with those cold, heavy eyes. ",
        "“This is the fever-reducing medicine. It’s best to take it with warm water. If the situation doesn’t improve, I’ll contact a doctor immediately after we land.”",
        "The secretary, who was also returning with them, promptly found the medical kit and explained the dosage and instructions to Yu Chuang, without causing any disturbance.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang took the items and cast a fleeting glance at the secretary, offering a subtle, silent approval.",
        "Meanwhile, the assistant was still agonizing over why Lu Yiman hadn’t been taken to the hospital the night before! ",
        "\n[Kerry: I love Lu Yiman’s character design… it’s so vivid.]"
    ],
    "previous": "Chapter 30.2",
    "next": "Chapter 31.2"
}