{
    "title": "Chapter 7",
    "content": [
        "When Yu Ziming came back to his senses, he had already taken an involuntary step forward.",
        "He pressed his lips together, his heart pounding like a drum. The suppressed stirrings within him began to rise uncontrollably again, making his thoughts hazy. ",
        "“Yiman-ge , I…” His lips, moist, parted, and he found himself less than an inch away from Lu Yiman. The faint scent from the person in front of him made him feel a bit dazed.",
        "Just a little more, he could feel the other’s breath. But suddenly, he stiffened, as if doused in cold water, waking up completely.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lu Yiman stood at the door, his back facing the light from the living room. The light and shadows cast from his tall figure and the doorframe formed a dark shadow.",
        "He stood there silently, watching him, unmoving, unyielding, forming an untouchable wall—just like his eyes, clear behind the glasses yet distant and indifferent. ",
        "Yu Ziming shuddered violently, his heart plummeting. He took several quick steps back, and only then did the compressed air begin to circulate again, allowing him to breathe once more.\n\n",
        "But that distance and coldness carried an inherent attraction. Under the cold light, Lu Yiman’s slightly open collar and rolled-up sleeves made his wrists appear like a forbidden temptation.",
        "Yu Ziming felt a bit unwilling.",
        "“Yiman-ge , I…”\n\n ",
        "“It’s late. You should rest.”",
        "The gentle voice fell softly, yet it felt like ice dropped into a lake.",
        "The slight redness on Yu Ziming’s face finally faded, turning into a pale white.\n\n",
        "After a brief silence, this time, he completely lowered his head, no longer daring to look into Lu Yiman’s eyes. ",
        "“Yiman-ge , goodnight.”",
        "“Goodnight.”",
        "The door clicked shut, and Yu Ziming stared at the floor, waves of disappointment and confusion surging within him, unable to calm down for a long time.",
        "… ",
        "The next day, Yu Ziming was awakened by the warm sunlight. After the autumn rain, the bright sunlight was refreshing.",
        "It was as if everything from the previous night had vanished. He got up in a light mood and even carefully folded the bedding on the tatami mat.",
        "It was quiet outside, no one was around. When he went to wash up in the bathroom, he saw his own clothes in the washing machine. For some reason, his face flushed, thinking that he shouldn’t trouble Lu Yiman with even such small matters. So, he took out his clothes, preparing to hang them up to dry.",
        "The balcony connected to the living room was spacious, and especially in the early morning when the sun began to rise, one could catch a glimpse of the sunrise from here. ",
        "Such an environment would undoubtedly make people feel happy, and Yu Ziming thought that the person living here must also be gentle and patient.",
        "His heart softened at the thought. Holding his clothes, he walked to the balcony, but something soft brushed against his cheek. He paused for a moment, and when he looked up, the relaxed, happy expression on his face suddenly stiffened.",
        "Please visit chrysanthemumgarden (dot) com",
        "It was a black tie of excellent quality.",
        "… ",
        "When Lu Yiman returned and opened the door, Yu Ziming was on the balcony talking on the phone. When he saw Lu Yiman, his expression was a bit blank and confused.",
        "“Yiman-ge , Yu Chuang wants to see me.”",
        "Le stood at the door, noticing the black tie swaying gently in the breehe above his head. Slowly, he moved his gahe back to Ou Timan’s face, his eyes slightly curved as he asked softly, “Go you want to see him?”",
        "Tu Iiming didn’t know. Le was a person who lacked decisiveness, finding it difficult to make decisions even on small matters. ",
        "“I don’t know.”",
        "He looked at Lu Yiman, with an expectation in his eyes that even he hadn’t realized.",
        "Perhaps he was hoping Lu Yiman would say something to him.",
        "“Do you have any plans for yourself?” Lu Yiman continued smiling gently. ",
        "His little braid had come undone, his long hair now draped over the back of his neck. The soft light scattered in his eyes, making him appear gentler than ever.",
        "“Have you thought about what you’ll do from now on?”",
        "He walked toward him, step by step, against the light.",
        "The confusion in Yu Ziming’s eyes deepened. “I don’t know.” ",
        "He knew nothing, but he felt that a more meaningful choice was gradually emerging from the fog in Lu Yiman’s questions.",
        "But that choice seemed too bold for him. He dared not think any further and suddenly snapped back to his senses.",
        "Lu Yiman narrowed his eyes, his voice soft and flowing.",
        "“Then go meet him.” ",
        "…",
        "After dropping Yu Ziming off at the hospital, Lu Yiman didn’t plan to go inside.",
        "",
        "This made Yu Ziming hesitate. He thought of the black tie on the balcony, bit his lip, and softly asked, “Yiman-ge , could you come inside with me?”",
        "Lu Yiman had been about to light a cigarette. Hearing this, he flipped his slender fingers, tucking the cigarette behind his ear. ",
        "“Sure,” he said with a smile.",
        "His mid-length hair was tied back into a braid about the length of his finger, now draped over his shoulder instead of hanging down his back.",
        "Yu Ziming let out a sigh of relief and couldn’t help but smile at him.",
        "A group of black-clad bodyguards continued to stand dutifully at the door. ",
        "As they pushed the door open and entered, the moment Yu Chuang, who was sitting up in bed, saw them, his gaze turned sharp as a blade.",
        "He was holding a piece of clothing, connected by a long thread. The moment their eyes met, he quickly hid his hands under the blanket and glared coldly at him.",
        "Feeling uneasy, Yu Ziming approached the bedside. He didn’t harbor no feelings for Yu Chuang; in fact, people like him, who were easily soft-hearted, were also easily drawn to others.",
        "“Yu Chuang, how are you?” he asked cautiously. ",
        "Lu Yiman smiled quietly, pretending not to see anything. His fingers toyed with the small braid resting on his shoulder, then reached for the cigarette tucked behind his ear.",
        "Yu Chuang’s narrow, phoenix-like eyes followed him for a while before he shifted his gaze back to Yu Ziming.",
        "“Fine.”",
        "It was still just two cold words, his slightly hoarse voice carrying no warmth. Instead, it felt overly distant and indifferent. ",
        "Yu Ziming felt a pang of disappointment, thinking Yu Chuang still hadn’t forgiven him.",
        "Seeing his expression, Yu Chuang pressed his lips together in frustration, furrowing his brows tightly. His sharp, severe features only added to the oppressive atmosphere.",
        "Startled, Yu Ziming took a few steps back, his feelings shifting from disappointment and unease to hesitation and fear.",
        "Lu Yiman observed their expressions with amusement. ",
        "“Well, get some rest. If there’s nothing else, I’ll take my leave.”",
        "The sudden silence made Yu Ziming lower his head, instinctively wanting to escape this atmosphere.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang always told him not to leave, hoping they could be together all the time.",
        "But there was always more silence between them. In those moments when Yu Ziming shyly hoped Yu Chuang would express affection, there was only cold air closing in around him. ",
        "He didn’t understand why Yu Chuang wanted to be with him or what exactly Yu Chuang wanted.",
        "Suddenly, Lu Yiman’s words from that morning echoed in his mind.",
        "—”What are your plans for the future?”",
        "He froze. The question began to echo in his head like a curse. ",
        "Noticing Yu Ziming standing there dazed, Yu Chuang wanted to say something, but after struggling for a long time, he couldn’t bring himself to speak. His lips tightened further, the veins on his forehead bulging, clearly angry with himself.",
        "Suddenly, a soft laugh reached his ears, familiar yet unsettling.",
        "Yu Chuang’s cold, knife-like gaze immediately slashed toward Lu Yiman.",
        "Lu Yiman was fiddling with the cigarette behind his ear, his slender, pale fingers drawing attention with their elegance. ",
        "Even though Yu Chuang glared at him, Lu Yiman remained unfazed, his scholarly demeanor tinged with a strange nonchalance.",
        "Raising an eyebrow, his gaze slid over Yu Chuang’s sharp nose, then his perfectly shaped lips, before suddenly landing on his hands hidden under the blanket.",
        "The blanket immediately twitched, as though a small secret had been exposed.",
        "Lu Yiman’s eyes curved into a smile, one that was especially charming. ",
        "Yu Chuang’s veins bulged again, his eyes fixed intensely on him. His Adam’s apple bobbed up and down without making a sound, but it felt as though he had silently cursed him out several times.",
        "When Yu Ziming finally snapped out of his thoughts and sensed the tension in the air, he realized that Lu Yiman and Yu Chuang were locked in a silent exchange of glares.",
        "“Yiman-ge , what are you laughing at?” he asked awkwardly.",
        "Lu Yiman lazily lifted his eyelids but didn’t turn his gaze toward him. ",
        "“The flowers are blooming beautifully.”",
        "Flowers? What flowers?",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He looked around in confusion, but the spacious and bright hospital room didn’t contain a single splash of color.",
        "Inadvertently, he caught a glimpse of Yu Chuang’s gaze and froze. Those jet-black eyes were fixed on Lu Yiman with an icy intensity, but the long, narrow corners of his eyes had subtly flushed red. ",
        "This realization made Yu Ziming’s heart tighten. He quickly turned his head away, not daring to look further, though he wasn’t sure what exactly he was trying to avoid.",
        "“Yiman-ge , I don’t see any flowers, but you’re right. We should have brought a bouquet.”",
        "“No need.”",
        "“Hm?” He looked up at Lu Yiman. ",
        "But this time, Lu Yiman didn’t say anything more.",
        "Yu Ziming fell back into silence. He felt as though he was being pulled in two directions—one by Lu Yiman, the other by Yu Chuang. But despite being the center of it all, he had a vague sense that he was somehow being left out.",
        "From the moment Lu Yiman had spoken, Yu Chuang’s eyes hadn’t left him. Now, his gaze had grown even deeper.",
        "From a purely physical perspective, Yu Chuang was undeniably a very handsome man. Even though he engaged in many inexplicable behaviors, when he looked at someone so intently, the darkness of his eyes became eerily cold and profound. ",
        "Lu Yiman stood tall, unyielding, meeting his gaze head-on.",
        "“Yiman-ge , let’s go,” Yu Ziming blurted out, unable to bear the tense atmosphere any longer.",
        "Yu Chuang whipped his head around, his eyes cold and heavy.",
        "“No!” ",
        "The forceful, irrefutable tone immediately brought back bad memories for Yu Ziming. In a flash, he reacted, “What do you want? This is a hospital!”",
        "Yu Chuang raised an eyebrow, staring at him coldly.",
        "That gaze sent a shiver down Yu Ziming’s spine. He even started trembling, his shaking hand reaching out to grab Lu Yiman’s arm.",
        "“Yiman-ge , let’s leave now!” ",
        "A cold laugh suddenly rang out behind him.",
        "Yu Ziming hadn’t even touched Lu Yiman before the hair on the back of his neck stood on end.",
        "",
        "Outside the room, the group of black-clad bodyguards formed an impenetrable wall at the door.",
        "Yu Chuang had already thrown off the blanket and was getting out of bed, his tall, imposing figure steadily closing the distance between them. ",
        "As his hand lifted, Lu Yiman raised his arm to block it, sighing helplessly. “Mr. Yu, since I carried you into the hospital, go easy on me.”",
        "After he finished speaking, everything went black.",
        ""
    ],
    "previous": "Chapter 6",
    "next": "Chapter 8"
}