{
    "title": "Chapter 6",
    "content": [
        "No one expected it, but Yu Chuang fainted from blood loss.",
        "When Lu Yiman appeared in that cramped room, Yu Ziming couldn’t hide the shock on his face, but soon it turned into delight. ",
        "He almost immediately supported himself on the table and stood up, dragging his limp legs as he rushed over, wanting to throw himself into Lu Yiman’s arms for comfort.",
        "But Lu Yiman didn’t look at him. Instead, he looked at Yu Chuang, who had collapsed on the ground. Seeing the blood on his forehead, Lu Yiman lowered his eyes and, with one hand, hoisted him onto his shoulder.\n",
        "",
        "Feeling the firm, tight waist beneath his hand, Lu Yiman tightened his grip.",
        "Yu Ziming, who had rushed forward, stopped in his tracks, stunned as he looked at him. ",
        "“Do you want to go to the hospital with me?”\n\n",
        "His tall, lean frame carried the unconscious Yu Chuang effortlessly, and he still remembered to turn around and ask, his soft voice offering reassurance.",
        "Yu Ziming stared blankly into his eyes. Perhaps his mind wasn’t fully clear yet, so he nodded in agreement.",
        "“Then come with me,” Lu Yiman smiled, his eyebrows gently curved. He added warmly, “Don’t be afraid.”\n\n ",
        "Yu Ziming’s nose tingled, and he lowered his head to hide the redness in his eyes, nodding messily.",
        "…",
        "Yu Chuang’s injuries weren’t severe, just a mild concussion, but Yu Ziming was still restless, unable to conceal the guilt and unease on his face.\n\n",
        "He was someone who softened easily. ",
        "Lu Yiman quietly observed him.",
        "“Yiman-ge,” Yu Ziming called out shyly when he noticed Lu Yiman’s gaze.",
        "“What’s wrong?” Lu Yiman smiled gently.",
        "“Nothing.” ",
        "Yu Ziming lowered his head and discreetly wiped his eyes.",
        "Lu Yiman took off his jacket and draped it over Yu Ziming’s shoulders. The latter had rushed out in a thin pajama, but with the warmth now covering him, Yu Ziming lifted his head to look at him. His eyes, wet with unshed tears, seemed like a pool of melting water.",
        "“Yiman-ge…” Yu Ziming softly murmured, lifting his chin slightly as if drawn toward him.",
        "“Don’t worry, everything will be fine.” ",
        "Lu Yiman spoke softly, wrapping the jacket securely around him before withdrawing his fingers at just the right moment.",
        "Yu Ziming froze for a moment, but when he saw Lu Yiman’s warm yet clear eyes, he suddenly came to his senses. Embarrassed, he lowered his head, hiding his flushed face in the collar of his jacket.",
        "",
        "After a long while, he stole a glance at Lu Yiman. But Lu Yiman was staring ahead, his handsome profile elegant and refined, with his peach blossom eyes devoid of much emotion.",
        "Tu Iiming’s heart, which had been warmed, suddenly felt a chill. ",
        "Then, his pupils trembled slightly as he saw a figure at the end of the hallway, his body freehing in place.",
        "Ou Timan’s gahe was also drawn to the dark shadow approaching.",
        "Several tall, muscular bodyguards in black suits filled the corridor, their oppressive presence even causing the nurses to stop in their tracks, stepping aside in astonishment to make way for them.",
        "Leading the group was a man also dressed in a black suit, exuding an air of nobility. But what was even more striking was his stunningly beautiful yet aggressive face. ",
        "Lu Yiman recognized him at once.",
        "“Yu Chuan…” Yu Ziming, standing beside him, muttered the name softly.",
        "Yes, it was Yu Chuang’s twin brother, Yu Chuan.",
        "“Mr. Lu,” the radiant young man smiled and nodded at Lu Yiman but, with a hint of pride, didn’t extend his hand. ",
        "As for Yu Ziming, Yu Chuan hadn’t spared him a single glance since walking down the hallway.",
        "“Mr. Yu,” Lu Yiman stood up, looking at the extraordinarily beautiful face before him. Once standing, he was half a head taller than Yu Chuan.",
        "If Lu Yiman hadn’t read about him in books, no one would have believed that Yu Chuan was actually Yu Chuang’s twin brother.",
        "The two looked nothing alike. Unlike Yu Chuang’s gloomy and stern demeanor, Yu Chuan was almost too beautiful for a man. ",
        "His fair skin and full, rosy lips were almost overly striking.",
        "The only feature they shared was their almond-shaped eyes.",
        "But unlike Yu Chuang’s cold, brooding eyes, Yu Chuan’s added a dazzling brilliance to his beauty. Yet, upon closer inspection, one could see the icy coldness in them, devoid of any warmth. Though he smiled, the smile never reached his eyes.",
        "Yu Chuan was no ordinary figure. As the current heir of the Yu family, he wasn’t someone who could be easily judged by his appearance alone. ",
        "His narrow almond-shaped eyes stared directly at Lu Yiman. Compared to Yu Chuang, his lighter brown pupils were as deep as an endless swamp.",
        "But he smiled at him, “Mr. Lu, I hope my brother hasn’t caused you any trouble?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "His tone, full of double meanings and drawn out, matched the lofty and unruffled demeanor of a noble gentleman perfectly.",
        "“No,” Lu Yiman responded with a polite smile. ",
        "With people like him, there was no need for others to spell things out—he had surely already investigated everything thoroughly.",
        "Especially since Yu Chuan was an extreme brother-protector.",
        "To what extent? Even when Yu Chuan was under tremendous pressure, facing threats both within and outside the Yu family, he still single-handedly brought Yu Chuang out of it, due to some of Yu Chuang’s particular circumstances.",
        "And after the Yu family became his possession, the first thing Yu Chuan did was transfer a large portion of the family’s shares to Yu Chuang. ",
        "Everyone said he was crazy. Any person with power and influence typically ends up with more enemies and fewer people they trust. Even close family members would want to keep all authority tightly within their grasp.",
        "Yet, he willingly relinquished his power, as if cutting off a piece of his own flesh, just to ensure Yu Chuang stood at the highest level.",
        "And he was right. Yu Chuan managed to protect Yu Chuang, and Yu Chuang held his position firmly—not a fragile paper barrier, but an impregnable fortress.",
        "Even now, Yu Chuan still lived with Yu Chuang outside the family estate. Yu Ziming had been locked up by Yu Chuang several times, and every time he managed to escape, one couldn’t help but wonder if Yu Chuan had a hand in it. ",
        "The book had clearly mentioned that Yu Chuan had no regard for the ordinary Yu Ziming, thinking he could never give Yu Chuang what he truly needed.",
        "Yu Chuan didn’t engage in more conversation with Lu Yiman. He quickly withdrew his gaze, as if the brief exchange was merely because Lu Yiman was more deserving of his attention than Yu Ziming.",
        "Lu Yiman raised an eyebrow slightly and smiled.",
        "“Stand guard. Without my orders, no one is allowed in.” ",
        "“Yes, sir!”",
        "Yu Chuan, with a noble air, didn’t spare anyone else a glance as he walked straight into the hospital room. His tall, muscular bodyguards immediately stationed themselves on either side of the door, like towering walls.",
        "Yu Ziming was a bit afraid of Yu Chuan, but it was different from the fear he felt toward Yu Chuang—his gaze held more complexity.",
        "Lu Yiman had no interest in standing guard for anyone. Now that Yu Chuan had arrived, he planned to leave. But after glancing at the frail Yu Ziming, he stopped and asked in a soft voice, “Ziming, are you going to wait here?” ",
        "Yu Ziming hesitantly looked at the tightly guarded door in front of him, bit his pale lips, and said quietly, “No need.”",
        "“Alright, let me walk you out, then.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "His voice was gentle, like that of a refined gentleman.",
        "This gave Yu Ziming immense courage. He gripped the jacket on his shoulders tightly, warmth filling his body again. Looking into Lu Yiman’s patient eyes, he summoned up the courage to ask, “Yiman-ge, could you… could you take me in for a while?” ",
        "His voice trailed off toward the end, and his face flushed slightly.",
        "He had no intention of returning to that old house where his friend lived. The things that had happened there left him with a deep psychological scar, and now he desperately needed someone trustworthy to stay by his side and comfort him.",
        "Nervously, he looked at Lu Yiman. Lu Yiman’s eyes were as gentle as a lake reflecting the moonlight, but somehow, they also held a coolness, like the moon’s quiet chill, devoid of much warmth.",
        "Just as Yu Ziming began to feel uneasy, Lu Yiman spoke. ",
        "“Alright.”",
        "Yu Ziming looked up, and seeing the smile on Lu Yiman’s face, he immediately felt his heart settle.",
        "…",
        "Lu Yiman’s home was a meticulously designed apartment for one. The warm-colored curtains, soft carpets, a few lively green plants, and even the wall hangings and wind chimes on the balcony all exuded a sense of warmth, encouraging anyone to lower their guard. ",
        "As soon as Yu Ziming entered, his expression softened, a comfortable sense of security wrapping around him. By the time Lu Yiman came out with a set of fresh clothes, Yu Ziming was already sitting on the sofa, not even bothering to take off his shoes.",
        "Seeing Lu Yiman, Yu Ziming quickly stood up, lowering his head in embarrassment.",
        "“You must be tired. These clothes are new, the tags haven’t been removed yet. You can use them for now. I’ll tidy up a room for you to rest in.”",
        "Lu Yiman didn’t scold him; his tone remained as gentle as ever. ",
        "This made Yu Ziming feel a slight pang in his heart, and an impulse arose within him. If only he had broken the silence between them earlier, perhaps…",
        "He took the clothes from Lu Yiman’s hands, the softness of the fabric soothing him. When he looked up, the impulsive words hovered on the tip of his tongue, but when he met Lu Yiman’s calm, unwavering gaze, he swallowed them back down.",
        "“Yiman-ge, these clothes…”",
        "“I don’t design menswear.” ",
        "The blunt response interrupted his thoughts.",
        "Yu Ziming paused, pressing his lips together awkwardly.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Oh… I see.”",
        "They had attended the same school but were in different departments. They were more like neighbors—Lu Yiman studied design, while Yu Ziming was in the fine arts program, focusing on oil painting. ",
        "The quiet air gradually broke the warm atmosphere. Yu Ziming turned his head hurriedly and said, “I’ll go wash up first. Thanks, Yiman-ge.”",
        "As he watched Yu Ziming’s somewhat hurried retreat, Lu Yiman, left alone in the quiet living room, glanced down at the beige carpet, now dirtied with shoe prints, his eyes remaining calm.",
        "The guest room Lu Yiman prepared was a tatami area in his study. It was difficult to ready a proper guest room on short notice since he rarely hosted overnight guests. Even his closest friend, Peng Duoduo, had to sleep on the sofa when he visited.",
        "The tatami mat in the study was there because Lu Yiman enjoyed reading in the afternoon sunlight. Sometimes, the warmth would make him feel so comfortable that he would doze off for a while. ",
        "The previous “Lu Yiman” didn’t have this habit; the tatami was a new addition after he arrived. The mattress and bedding were also brand new, never used before.",
        "“The guest room isn’t ready yet, so I’m afraid you’ll have to make do with this for tonight.”",
        "Lu Yiman stood at the door wearing light-colored loungewear, with a pair of silver-framed glasses resting on his nose. His tall, lean figure gave off an aura of refined elegance.",
        "Yu Ziming turned to look at him. It was the same face, the same gentle personality, but for some reason, the current Lu Yiman made his heart race with every move he made. ",
        "Even the sight of his Adam’s apple bobbing when he spoke was mesmerizing.",
        "His fair, almost translucent skin—if marked by a kiss—would surely be strikingly beautiful.",
        "Yu Ziming’s thoughts began to stray, and his face turned bright red as he lowered his head in embarrassment. He was, after all, a freshly graduated young man and found it hard to control his feelings.",
        "“What’s wrong? Are you afraid to be alone?” ",
        "In the play of light and shadow, Lu Yiman adjusted his glasses with slender fingers, the brief flash of cold light on the lenses making Yu Ziming’s heart skip a beat. His legs suddenly felt weak, and his heart raced wildly.",
        ""
    ],
    "previous": "Chapter 5",
    "next": "Chapter 7"
}