{
    "title": "Chapter 5",
    "content": [
        "He leaned against the side of the street, surrounded by swirling smoke. His half-closed eyelids cast a layer of obscure, elusive light, and shadows delicately traced the contours of his features.",
        "A black car stopped in front of him. The door was pulled open forcefully, and a man in a black jacket strode toward him. ",
        "His collar was grabbed, and facing that cold, slightly menacing face, he obediently raised both hands, a half-smoked cigarette still between his fingers.",
        "“Mr. Yu, calm down.”\n",
        "",
        "Yu Chuang gritted his teeth, veins bulging. His hair was blown messily by the wind, and his entire body was teetering on the edge of fury. The hand gripping his collar was tense, like a string pulled tight.",
        "“Where is Ziming!” His voice was hoarse, brimming with barely contained anger. ",
        "The man lowered his eyes, looking at him. His beautiful peach blossom eyes were covered by thick lashes, hiding the deepening colors beneath.\n\n",
        "“Mr. Yu, Ziming didn’t come looking for me.”",
        "“Liar!” Yu Chuang shouted, his eyes practically blazing as he glared at him.",
        "The man smiled slightly, almost imperceptibly.\n\n ",
        "“Really, Mr. Yu, I don’t think Ziming would come looking for me at a time like this.”",
        "After all, just yesterday he had been “caught cheating.”",
        "Yu Chuang realized it too, and suddenly trembled. He let go of the man’s collar, his tightly pressed lips trembling, eyes stormy and chaotic.\n\n",
        "He turned around, stumbling as he tried to get back to the car. ",
        "Where is he? Where is he!",
        "Why did he disappear?",
        "Why did he leave me!",
        "He grabbed his own hair, on the verge of a suppressed breakdown, the vine-like tension on his neck becoming chains that restrained him. ",
        "And so, he walked unsteadily toward the edge of the street, his emotions unstable.",
        "“Mr. Yu.”",
        "His trembling wrist was grabbed, and when he turned his head, his dark eyes revealed no trace of light.",
        "At this moment, Yu Chuang was frightening. He looked like an uncontrollable madman, his handsome face cold and sharp. His body, shadowed in darkness, was like a rock sinking into the sea, exuding a gloomy aura that made people afraid. ",
        "Usually, by now, people around him would start to keep their distance.",
        "The first time Yu Ziming didn’t return to his side on time, it was because he was terrified of this very image.",
        "Please visit chrysanthemumgarden (dot) com",
        "But Lu Yiman’s eyes remained calm, still bright and warm, with a depth like a pond under the moon.",
        "“Mr. Yu, I’ll help you find him.” ",
        "Yu Chuang glared at him, forcefully trying to shake off his hand.",
        "But the man didn’t let go, calmly watching him.",
        "Yu Chuang felt annoyed, even the veins on his forehead were throbbing.",
        "Sver since he discovered Tu Iiming had silently escaped, his emotions had been on the verge of erupting. ",
        "Tes, escaped.",
        "Le hated that word!",
        "“Oet go!”",
        "Ou Timan looked into his eyes seriously and said firmly, “Zr. Tu, I’ll go with you to find him.” ",
        "The grip on his wrist tightened, and Tu Jhuang’s pupils contracted sharply, as if ready to snap the man’s arm.",
        "In that moment, even the surrounding air seemed to plummet, filled with a dangerous aura.",
        "But Lu Yiman still didn’t let go, his face serene as he looked at him.",
        "After a brief silence, irritation appeared on Yu Chuang’s face. He said impatiently, “Suit yourself!” ",
        "He tried to shake off his hand again, but this time, it didn’t budge.",
        "He turned back sharply, his face a mix of shock and confusion, which made Lu Yiman chuckle.",
        "“Mr. Yu, what now? It seems like our hands are stuck together.”",
        "He lifted their joined hands and shook them, and Yu Chuang, still unwilling, tried to shake him off again. ",
        "Their arms swayed together, but they still didn’t separate.",
        "He froze, lowering his head in disbelief.",
        "",
        "Perhaps it was because the expression on his face was so vivid that Lu Yiman’s eyes brimmed with amusement. He tugged on Yu Chuang’s wrist and opened the car door for him.",
        "“It seems we really can’t separate, so Mr. Yu will have to bear with it for now,” Lu Yiman said with a seriousness that, for a moment, left Yu Chuang dazed. It even felt as though what he said might actually be true, so much so that Yu Chuang didn’t even realize he had been pushed into the passenger seat. ",
        "It wasn’t until the car restarted that he came to his senses, only to hear the soft “click” of the seatbelt fastening around him.",
        "“Mr. Yu, do you have any idea where Yu Ziming might have gone?”",
        "His wrist had already been released, and Yu Chuang turned his head to look at the perfect profile of the man beside him, briefly illuminated by the light. He lowered his gaze, staring at his own wrist.",
        "After a long pause, he glanced at the pair of unusually pale hands gripping the steering wheel and furrowed his brows tightly, growing more irritated by the second. ",
        "“I don’t know!” he snapped.",
        "He was angry.",
        "Lu Yiman glanced at him, noticing his tightly pressed lips and obvious displeasure. After a brief look, he turned his attention back to the road, saying lightly, “Really don’t know? That will make it hard to find him.”",
        "Yu Chuang’s brow furrowed even deeper, forming a clear crease, but after that remark, Lu Yiman fell silent. ",
        "In the quiet stillness, Yu Chuang’s agitation became all the more obvious.",
        "Especially after the car passed through a traffic light, he clenched the hand resting on his thigh tightly.",
        "“Turn left!”",
        "Lu Yiman said nothing, only turning the wheel calmly. ",
        "“Turn left!”",
        "Yu Chuang shouted, his whole body tense.",
        "Wrong direction! We’re going the wrong way!",
        "He couldn’t control the turmoil raging in his chest, crashing back and forth with no outlet, so he clenched his fists even tighter. ",
        "As they moved farther and farther from his intended destination, his tightly wound body began to tremble, his eyes locked on the road ahead.",
        "“Turn left! Turn left!”",
        "Please visit chrysanthemumgarden (dot) com",
        "His voice grew more agitated, and the seatbelt constraining him made a low, strained noise.",
        "But Lu Yiman remained calm, continuing through the light, making a turn only when they reached a suitable spot, and eventually pulling into a parking space. ",
        "By then, Yu Chuang was almost out of control.",
        "His heavy breathing made him seem aggressive, almost threatening.",
        "In the silent car, no one spoke. Lu Yiman turned his head and quietly looked at him.",
        "Yu Chuang’s broad shoulders and tall, solid frame radiated menace, but Lu Yiman still didn’t move. ",
        "Only when Yu Chuang slowly and with difficulty crossed his hands and gripped his trembling wrists did Lu Yiman finally speak.",
        "“Mr. Yu, I think you should eat something now. People tend to be in a bad mood when they’re hungry.”",
        "His voice, as gentle as a spring breeze, dispelled the stifling atmosphere inside the car along with the fresh air flowing in.",
        "The car door opened, and Lu Yiman stretched his long legs out, stepping onto the street. As he shut the door, he caught sight of the eyes hidden in the shadow, staring at him intently. ",
        "Yu Chuang was staring at him, his body locked in a tense, defensive posture as if he were trying to control himself, as though he were bound by two invisible locks.",
        "“Bang.”",
        "The car door closed, and with the keys in hand, Lu Yiman walked toward the convenience store across the street.",
        "… ",
        "The car drove into a narrow alley, so tight it nearly filled the road. Only after they ventured deeper in did it gradually widen, but even then, it was no clean, broad road—just an old, rundown residential area.",
        "Overhead, the tangled mess of power lines intertwined, a few abandoned stalls lay discarded at the entrance of the residential buildings, and a greasy trash bin emitted a foul stench, its dark color gleaming under the moonlight.",
        "Lu Yiman watched as Yu Chuang flung open the car door, heading straight toward the building with clear intent. It wasn’t long before a startled cry came from the second floor.",
        "He really found him. ",
        "Leaning against the car window, Lu Yiman had a cigarette between his fingers, who knows when it had appeared. He took a gentle puff, exhaling smoke into the air as Yu Ziming’s panicked and furious voice echoed through the silent building.",
        "“Yu Chuang, how did you know I was here? You’ve been spying on me! You even investigated my friends!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“What do you want from me? I’ve already hidden myself away here, why won’t you leave me alone!”",
        "“Yu Chuang, I’m begging you, let me go. We’re different, we can’t be together. If this continues, you’ll drive me insane!” ",
        "Lu Yiman gazed at the tree leaves, their shine bright under the moonlight. From the night, Yu Chuang’s hoarse but deliberate voice came, each word pronounced with difficulty.",
        "“You said you were willing.”",
        "“That’s because I didn’t know you were a madman!”",
        "The sharp voice pierced through the night, leaving behind a deathly silence. ",
        "Lu Yiman casually took another drag of his cigarette, watching the smoke rise and slowly disappear.",
        "…",
        "Yu Ziming stared in horror at Yu Chuang, whose eyes, in the dim light, seemed like bottomless pits, devoid of any light. Even the vine tattoo on his neck seemed to come alive, tightening around his breath.",
        "“You will never be able to leave me.” ",
        "Yu Chuang was never one to speak at length, but the moment his voice broke the silence, he seemed like a demon crawling out of hell.",
        "Yu Ziming felt suffocated.",
        "“Yu Chuang, you can’t do this.” His throat was dry, and he began to retreat frantically.",
        "He had gone through so much trouble to find this old house of a friend, hiding alone in a dark alley, just because he didn’t want to be imprisoned by Yu Chuang anymore! He didn’t want to be a bird trapped in a cage, never able to fly free! ",
        "“Bang!”",
        "The door that was about to shut was blocked by a slender, defined hand. Yu Chuang lifted his head, staring at him with a chilling gaze, his voice raspy as he said, “Ziming, come home.”",
        "Yu Ziming regretted it. Not just now—he had been regretting it ever since the moment he met Yu Chuang!",
        "He should not have been painting in Central Park. He shouldn’t have approached him that rainy night when he saw him sitting alone on the bench, and he definitely shouldn’t have smiled at him. ",
        "That day, when his heart pounded at the sight of Yu Chuang’s gaze in that gloomy, rain-soaked night, he should have realized it wasn’t love—it was fear!",
        "Now, he truly regretted it.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Yu Ziming kept backing away, his pupils shaking as he looked at Yu Chuang, his pale face filled with undisguised terror.",
        "Yu Chuang pushed open the door that symbolized Yu Ziming’s fragile defense, slowly stepping inside like an invader. ",
        "Step! Step! Step!",
        "Yu Ziming’s limbs went weak, his whole body trembling.",
        "At that moment, his fear and rejection of Yu Chuang reached its peak!",
        "As Yu Chuang, standing under the dim light, extended his hand toward him, Ziming’s heart pounded wildly, as if it would burst from his chest. Unable to bear the suffocating pressure any longer, he screamed and threw whatever was on the table at him. ",
        "The sharp crash of shattered ceramics echoed in the silent night, startling the heart with its intensity.",
        "Yu Chuang stood tall, slowly lifting his hand to touch his now damp forehead.",
        "And Yu Ziming could no longer hold on, collapsing weakly to the ground with a thud.",
        "As the burnt ash from the cigarette fell with a soft “swish” following the loud crash, Lu Yiman calmly crushed the still-glowing cigarette butt between his pale fingers. He lifted his chin and gazed up at the brightly lit window upstairs. ",
        ""
    ],
    "previous": "Chapter 4",
    "next": "Chapter 6"
}