{
    "title": "Chapter 21",
    "content": [
        "Yu Chuan stood at the doorway, and as soon as he saw Yu Chuang’s car drive in, a smile immediately spread across his face.",
        "The bright light from the living room fell on the stone steps at the entrance. He quickly walked over, reaching out to take Yu Chuang’s coat. Yu Chuang also lifted his hand to hand it over but then, as if recalling something, he withdrew his hand. ",
        "Yu Chuan’s expression immediately changed, his bright smile turning into a gloomy shade.",
        "But when Yu Chuang looked his way, he quickly concealed his emotions.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Brother, you’ve been coming home a bit late these past few days.”",
        "There was an unconscious hint of both whining and disappointment in his tone. ",
        "Yu Chuang thought for a moment and turned to look at him.\n\n",
        "“How’s the company doing lately?”",
        "It was the first time Yu Chuang had asked him such a question. Even though it was just a few more words than his usual terse remarks, the joy in Yu Chuan’s eyes was unmistakable.",
        "“It’s going well. Yu Ci has been much more obedient lately. But you know, there are always some parasites in the company who think they’ve done great deeds for the Yu family. One day, I’ll make them understand that ‘Yu’ in Yu Corporation stands for my Yu Chuan.”\n\n ",
        "As he said this last sentence, a surge of ambition rose in Yu Chuan’s eyes, a gleam of ruthless and cold determination flashing through.",
        "Yu Chuang pressed his lips together and reached out to ruffle Yu Chuan’s hair.",
        "Yu Chuan squinted his eyes, the earlier sinister look vanishing, as he obediently leaned into Yu Chuang’s hand.\n\n",
        "Suddenly, his expression froze, and his eyes snapped open, staring directly at Yu Chuang. ",
        "“Brother, when did you start liking perfume?”",
        "A long time had passed, and the scent on Yu Chuang had already faded quite a bit.",
        "But this sweet fragrance, which did not belong to Yu Chuang, was so out of place.",
        "Yu Chuang withdrew his hand and indifferently averted his gaze, striding inside on his long legs. ",
        "He didn’t respond, but Yu Chuan’s gaze stayed fixed on his back.",
        "After Yu Chuang entered the bathroom, Yu Chuan’s dark silhouette stood at the doorway of his room.",
        "His cold, brown eyes locked onto the suit jacket draped over the chair.",
        "Not long after, a delicate lighter appeared in his view. ",
        "His brother never smoked.",
        "Although his brother didn’t smoke, the moment Yu Chuan saw the lighter, another man who smoked quickly came to mind.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "His deep eyes revealed no emotion. He didn’t touch the lighter. Glancing toward the bathroom, he silently withdrew.",
        "When Yu Chuang walked out wearing a bathrobe, his damp black hair softened his features, adding a touch of tranquility to his typically aloof demeanor. ",
        "As he dried his hair, he frequently glanced at that coat.",
        "Minally, he took the lighter, his dark eyes reflecting some unknown emotion.",
        "A faint trace of tobacco seemed to start lingering around him.",
        "Lis Adam’s apple bobbed as he turned around and opened the drawer of the bedside table. Lowever, after pausing for a long time, he still couldn’t bring himself to put the lighter inside. ",
        "…",
        "The weather was getting colder, with dried yellow leaves covering the ground, impossible to clean up completely. The wind carried a hint of dryness as it blew through.",
        "Lu Yiman wore a long khaki trench coat with a black shirt underneath. His long hair was all combed back from his forehead, with the remaining strands braided into a small braid on the right side.",
        "His hair had grown longer than when he first started. ",
        "“Mr. Gao, my dashcam has recorded everything, from your malicious tailgating to your deliberate attempt to ram my car, which nearly caused an accident.”",
        "He slowly took a sip of coffee, crossing his legs while looking at the design on his computer screen.",
        "——”What do you mean, ‘deliberately rammed your car and nearly caused an accident’? The one who got into an accident was me! The one who barely escaped death was me!”",
        "He was the one who went home and had a fever for two days! ",
        "And the damn fever wasn’t even from the cold wind—it was from being scared!",
        "While burning up with fever, he broke into a cold sweat in his dreams, scaring his mom so much that she invited a spiritual master to perform a ritual beside his bed all night long!",
        "Damn it!",
        "Gao Qinchang angrily grabbed the bowl on his nightstand, ready to smash it on the floor. Just then, his mom passed by his room and glanced his way. He froze immediately and obediently drank the entire bowl of herbal medicine. ",
        "Once his mom left, satisfied, he quickly got out of bed, locked the door, then smashed the empty bowl on the floor with a vicious expression.",
        "Damn it, so bitter!",
        "Please visit chrysanthemumgarden (dot) com",
        "But the thick carpet muffled the sound completely, and the bowl didn’t even break. It just rolled in a circle on the ground.",
        "He let out a burp in frustration, the bitter taste rising in his throat, almost making him vomit, which only worsened his mood. ",
        "——”I’m telling you, don’t think you can threaten me just by releasing those videos. You have no idea how easy it is for my family to get rid of someone.”",
        "He was threatening viciously, speaking in a hushed tone into the phone, while cautiously glancing at the door before comfortably snuggling back under the covers.",
        "Lu Yiman was still unsatisfied with his design. He tapped the table with his fingers, noticing that the server had glanced at him several times, using the excuse of delivering coffee to pass by his table repeatedly.",
        "He pretended not to notice, leaning back in his chair and smiling lightly. “Mr. Gao, why would you think I’m going to send the video to your family? Do you think your family would send you to the police station?” ",
        "——”What do you mean!”",
        "Gao Qinchang shot upright from under the covers.",
        "“I’m just an ordinary person. When something like this happens, of course, I’ll report it to the police.”",
        "The pleasant sound of a bell rang at the door, and out of the corner of his eye, Lu Yiman noticed a man walking directly to a seat by the window. ",
        "The man wasn’t late, but the woman had arrived earlier. Even at a meeting like this, the man was still dressed in a black suit, clearly having come straight from the office, which seemed a bit boring and perfunctory.",
        "Lu Yiman squinted slightly, a faint smile playing on his lips. This expression caught the attention of the young server, who kept glancing at him. While delivering coffee, the server nearly bumped into the corner of a table.",
        "Lu Yiman reached out just in time, blocking the server’s waist with the back of his hand, preventing him from hitting the sharp corner and almost spilling the coffee.",
        "“Th-thank you, sir.” ",
        "The young man, who looked like a college student, blushed in front of him.",
        "Lu Yiman smiled and nodded, retracting his hand.",
        "On the other side, Yu Chuang, who had just sat down, heard the commotion, but he never paid attention to irrelevant things. Instead, he focused on the woman sitting across from him.",
        "Beautiful, elegant, seductive. ",
        "But in Yu Chuang’s eyes, she wasn’t any different from the others he had met before.",
        "He quickly looked away.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lu Yiman’s smile deepened, while on the other end of the phone, Gao Qinchang nearly jumped out of bed.",
        "——”How can you go to the police!” ",
        "Shouldn’t this be a game of back-and-forth negotiation, testing each other and then bargaining for terms?",
        "No sense of honor!",
        "If people found out he got into trouble while out having fun and ended up being reported to the police, how could he ever show his face again?",
        "“Why not? Isn’t ‘call the police when in trouble’ a common principle?” ",
        "Lu Yiman tilted his head slightly, his eyes fixed intently on Yu Chuang.",
        "Neither of them spoke, and the heavy silence created an uncomfortable atmosphere that made the woman sitting across from Yu Chuang fidget uneasily.",
        "She tried to open her mouth to start a conversation, but Yu Chuang’s cold, expressionless face stopped her words before they could escape.",
        "The two of them sat there, facing each other stiffly. ",
        "The woman kept stirring her coffee, swirling it so vigorously that the thick brew nearly frothed.",
        "Suddenly, she looked up, only to unexpectedly meet Lu Yiman’s gaze.",
        "Lu Yiman slowly shifted his focus to her face, his almond-shaped eyes curving slightly as he gave her a gentle smile.",
        "The woman froze for a moment, feeling slightly embarrassed as she pursed her lips, her pale skin turning a faint shade of red. ",
        "On the other end of the phone, Gao Qinchang was practically losing his mind.",
        "The first time he met Lu Yiman, he had been fooled by his scholarly and attractive appearance. Who would have thought that this man was actually so cunning!",
        "——”What do you want!”",
        "Lu Yiman lazily propped his head on his hand, his gaze lingering on Yu Chuang. The woman across from Yu Chuang kept sneaking glances at him, but Lu Yiman indifferently looked away. ",
        "“Mr. Gao, do you know what I was supposed to do that day? I spent days choosing that place, but because of you, I couldn’t make it to my appointment on time. You affected my work, Mr. Gao. And you also destroyed my studio.”",
        "There was a brief silence on the other end of the line before Gao Qinchang’s voice, filled with clenched-teeth frustration, rang out again.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "——”I get it! I’ll take care of it for you!”",
        "Lu Yiman smiled softly, his voice gentle. “Thank you, Mr. Gao. You really are a good person.” ",
        "The call ended abruptly.",
        "Not long after, a text message full of emotion came through.",
        "——Delete the dashcam footage! Don’t call the police!",
        "Lu Yiman glanced at it and deleted the message immediately. ",
        "His car was still being repaired. There was no dashcam footage to speak of.",
        "…",
        "Even though Yu Chuang usually paid no attention to what was happening around him, the woman’s occasional glances toward someone behind him piqued his curiosity.",
        "He frowned slightly and turned his head, only to see a tall, slender figure walking toward the restroom. ",
        "A strange sense of familiarity made his heart skip a beat.",
        "His gaze stayed fixed on the retreating figure, and his fingers unconsciously began to rub the cuff of his sleeve.",
        "He repeated this motion in silence for a moment.",
        "“Excuse me,” he said quickly, standing up. The sound of the chair scraping against the floor briefly broke the heavy atmosphere. ",
        "The woman looked up at him, surprised and puzzled.",
        "As Yu Chuang passed by the corner table, his footsteps paused slightly, and his peripheral vision caught sight of the computer on the table.",
        "The lit-up screen displayed a simple chibi-style comic.",
        "There was only a little figure dressed in a suit, standing expressionless, with two large black, beady eyes staring directly at him. ",
        "“…”",
        "For a moment, Yu Chuang stood there, his blank expression matching the cartoon figure on the screen, staring at each other.",
        "",
        "Then, with a somewhat awkward pursing of his lips, he turned and headed toward the restroom.",
        "His steps remained steady, his upright posture exuding the same noble coldness as before. But the hand clutching the cuff of his sleeve became even more restless, now nervously tugging at the embroidered lily inside the lining. "
    ],
    "previous": "Chapter 20",
    "next": "Chapter 22"
}