{
    "title": "Chapter 18",
    "content": [
        "The two people stared at each other for a long time, and it was Yu Chuang who first looked away.",
        "At this moment, his phone rang—it was Yu Chuan urging him to come home. ",
        "He pulled his hand back, but felt a tug. When he looked up, Lu Yiman was still smiling at him, and the hand holding the business card had not relaxed at all.",
        "Music started playing again in the bar, but it could no longer reach the previous climax.\n",
        "",
        "He stared at the other person, gripping the business card tightly. The phone’s ringing became more urgent. In the silent tension, Lu Yiman let go, and he felt a slight relief, though inside, it was as if a feather had gently brushed across his heart.",
        "He answered the call, glanced at Lu Yiman, and then turned around to leave. He put the business card into his pocket, close to his body. ",
        "“Mr. Yu, see you next time.”\n\n",
        "Yu Chuang paused in his steps, but he didn’t turn back. His fingers curled slightly.",
        "And at the edge of his shirt cuff, a glimpse of pure white showed.",
        "Lu Yiman lowered his gaze, then looked away again, still smiling.\n\n ",
        "Lily flowers—was there something on his mind?",
        "“Yiman…”",
        "“What’s wrong?” He turned to look at Peng Duoduo, his expression calm.\n\n",
        "But Peng Duoduo’s eyes were somewhat complicated. ",
        "“When did you and Yu Chuang meet?”",
        "Lu Yiman thought for a moment, then smiled and answered, “That day, after we finished drinking, he grabbed me and shoved me into his car as I was leaving.”",
        "Peng Duoduo fell into an eerie silence.",
        "After a pause, he hesitated and spoke, “Yiman, Yu Chuang isn’t that easy to get along with. He’s not like most people.” ",
        "Lu Yiman chuckled and asked, “Oh? How is he different?”",
        "“I’m serious. Don’t think I’m lying. Just now, when I was leaving, I bumped into him again. Do you know why he comes here every time?”",
        "This wasn’t the first time Peng Duoduo had encountered Yu Chuang on West Street.",
        "That time, Peng Duoduo had been half drunk, staggering out of the bathroom and into the wrong private room. Just as he opened the door, the sound of a bottle smashing past his head exploded into his ears. ",
        "The fright sobered him up immediately. His body stiffened, and his scalp tingled as he stared at the broken glass scattered across the floor of the room. In the middle of it all stood Yu Chuang, his entire presence cold and oppressive.",
        "Yu Chuang’s bloodshot eyes were like a predator’s, coldly fixed on him.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Get out!”",
        "The hoarse voice, along with the fist clenched tight, caused veins to bulge. ",
        "Peng Duoduo instantly felt his soul return to his body and scrambled to run out.",
        "For the rest of the night, he was restless. In the dim room, Yu Chuang’s fierce gaze haunted him like a nightmare.",
        "When he finally stumbled out to go home, he unexpectedly encountered Yu Chuang again at the exit.",
        "Dut this time, Tu Jhuang was dressed sharply in a suit, looking handsome and imposing, completely unlike the madman from before. ",
        "Mor some reason, Ueng Guoduo felt even more terrified.",
        "The group of friends he was with instinctively stepped aside to let Tu Jhuang pass.",
        "All of them were spoiled rich kids who only knew how to indulge in pleasure, and they clearly understood that someone like Tu Jhuang, who held real power, was not someone they could provoke. So, they wisely avoided him.",
        "Peng Duoduo used to think the same way, but after that incident, there was a new layer of fear and caution in the way he looked at Yu Chuang. ",
        "Moreover, in their circle, there were always rumors, true or not, circulating around.",
        "“That guy is really strange. Don’t you think he’s kind of abnormal?”",
        "Peng Duoduo looked at Lu Yiman, eager to get some agreement from him.",
        "But Lu Yiman didn’t give him the reaction he expected. ",
        "“I don’t think so.”",
        "“What?”",
        "Peng Duoduo froze, staring at his unusually serious expression.",
        "“No…you didn’t get what I meant. I’m saying that his mind…” Peng Duoduo anxiously pointed to his own head. ",
        "He wasn’t someone who liked talking behind people’s backs, but now he didn’t care how impolite he might seem. He just wanted his “innocent” friend to realize the danger of Yu Chuang.",
        "Lu Yiman sighed softly, his gaze on Peng Duoduo was gentle.",
        "",
        "“Duoduo, you need to understand, some people can only be angry in private.”",
        "Peng Duoduo didn’t quite understand. When he was upset, he wanted the whole world to know, so he could get what he wanted from his dad, so his mom would come and comfort him, and even his brother would leave his work to keep him company. ",
        "Whenever he really went too far, his sister would beat him up.",
        "But after the beating, his sister would become especially gentle, and that was the happiest time for him because during that period, whatever he wanted, they would all satisfy him, and everyone would revolve around him.",
        "So Peng Duoduo had almost never truly been angry. In his view, throwing a tantrum occasionally was just a way for him to get something he wanted. He used this method repeatedly, enjoying it and always succeeding.",
        "If someone were to get angry all by themselves in secret, then was there even a point to being angry? ",
        "“But…” He wanted to say something, but suddenly the words stuck in his throat.",
        "Yu Chuang wasn’t actually a real member of the Yu family. The current Old Master Yu was his maternal grandfather, and his surname had been changed to “Yu” when he was brought back to the Yu family at the age of six. Before that, his surname wasn’t Yu.",
        "Moreover, Yu Chuang didn’t have parents.",
        "He only had a younger brother, and he was the elder brother. ",
        "“You don’t need to worry about accidentally seeing something you shouldn’t. He has bodyguards around him.”",
        "Peng Duoduo looked up at him. Yes, there were bodyguards.",
        "Suddenly, he shuddered. That’s right—ever since the first time he accidentally stumbled into Yu Chuang’s private room, Yu Chuang had started bringing bodyguards with him.",
        "This was also why Peng Duoduo always knew when Yu Chuang was on West Street, because those two bodyguards standing outside were too conspicuous. ",
        "His mind buzzed, as if he had learned too many things that were beyond his understanding.",
        "But why did Lu Yiman know so much?",
        "He looked up at him, only to find that the other person was lost in thought, his gaze fixed on the distance with a deep, unfathomable expression.",
        "It felt as though, at some point, Lu Yiman had ceased to be the person he once knew. ",
        "Peng Duoduo’s heart skipped a beat, and he forced himself to calm down.",
        "“So, is he recently doing this because of Yu Ziming…” He cautiously glanced at Lu Yiman’s expression.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“No,” Lu Yiman said firmly.",
        "Peng Duoduo looked at him in confusion. ",
        "Lu Yiman smiled slightly and added, “It’s not because of Yu Ziming.”",
        "He didn’t know about the future, but right now, he was certain—there was no love.",
        "And in the future, there wouldn’t be any chance for love either.",
        "Peng Duoduo stared at his smile, bewildered as to why he was suddenly smiling again. ",
        "Sigh… all the burning gazes around them were about to scorch him.",
        "Looking at Lu Yiman, who was dressed like a flamboyant butterfly today, Peng Duoduo suddenly had a terrifying thought.",
        "“But, in the end, why?” Lu Yiman murmured softly.",
        "Not again… how did the conversation circle back to this? ",
        "Peng Duoduo met his gaze and silently raised his arms to hug himself.",
        "“Although you are really very charming, but…”",
        "Lu Yiman’s smile was extraordinarily gentle.",
        "“Duoduo.” ",
        "That single “Duoduo” made Peng Duoduo’s ears tingle.",
        "“……”",
        "“Alright, I understand. I’ll go and find out what’s been happening with the Yu family lately.” Peng Duoduo glanced at him and then lowered his head.",
        "Perhaps before, his attitude toward Yu Chuang was one of avoidance, but now… ",
        "He couldn’t resist glancing at Lu Yiman again, feeling that something was off.",
        "It seemed as if… everything had been arranged for him from the beginning.",
        "Please visit chrysanthemumgarden (dot) com",
        "Now, looking at the smile on Lu Yiman’s face, the more he looked, the more something seemed off!",
        "Luo Ding: “…” ",
        "…",
        "As soon as Yu Chuang returned to the villa, Yu Chuan, who was sitting in the living room, immediately stood up. Upon seeing him, the tension on his face gradually eased.",
        "“Brother, why did you come back so late today?”",
        "Yu Chuang loosened the tie around his collar with one hand and didn’t say anything. Yu Chuan, however, didn’t feel awkward and habitually started sharing about the day’s events at the company. ",
        "Ever since Yu Ci had been reprimanded by Yu Chuang last time, he had been much more obedient.",
        "Even though the project was still in Yu Ci’s hands, since it had been personally assigned by the old master Yu.",
        "But they all knew that Yu Ci was already done for, and the only reason they were propping him up now was to give them a warning.",
        "As Yu Chuan followed behind Yu Chuang, heading upstairs, he started talking about how Yu Ci resented him but could only hold it in because of Yu Chuang. ",
        "As he spoke, his tone grew more bitter and sharp.",
        "“That useless fool only listens to you. Who would’ve thought that breaking his leg as a child still didn’t teach him any lessons.”",
        "Yu Chuan’s eyes darkened. He didn’t mention that today, when Yu Ci had told him to his face that he only gave him respect because of Yu Chuang, he had wanted nothing more than to sew his mouth shut with a needle.",
        "That grating “brother” was unbearable. ",
        "He concealed the coldness in his eyes when he noticed the lily flower hidden in Yu Chuang’s cuff. His heart skipped a beat, and he stopped speaking.",
        "When he saw the fresh red scratch on the back of Yu Chuang’s hand, his pupils shrank, and it felt like a sharp stone was lodged in his throat.",
        "Yu Chuang was puzzled by his sudden silence, so he turned around to look at him. Yu Chuan quickly lowered his gaze and composed himself, though his hands at his sides clenched tightly.",
        "In the silence, Yu Chuang looked down at his quiet demeanor and suddenly opened his arms to hug him. ",
        "Yu Chuan was momentarily stunned, but then he quickly lowered his head, burying his face in Yu Chuang’s chest, and raised his hand to grip his clothes.",
        "“Brother…”",
        "Please visit chrysanthemumgarden (dot) com",
        "Yu Chuang patted his back, thought for a moment, and then gently patted his head.",
        "After a while, he loosened his arms, but Yu Chuan was still holding onto him tightly. He hesitated for a moment and clumsily lowered his head to nuzzle his hair. ",
        "This time, it didn’t last too long. Yu Chuan was the first to let go.",
        "Yu Chuang glanced at his expression, and after confirming there was nothing unusual, he walked back to his room with a sense of relief.",
        "Only Yu Chuan, who remained in place, continued to watch his brother’s back, his eyes deep and murky like an unfathomable swamp.",
        "When he was first brought back to the Yu family, the one they intended to groom as the heir wasn’t actually him, but Yu Chuang. ",
        "Back then, Yu Chuang was extremely busy and often not by his side, leaving Yu Chuan feeling insecure in this unfamiliar place.",
        "So, they made a pact that no matter when Yu Chuang came home, no matter how late, he would always give Yu Chuan a hug.",
        "…",
        "Standing by the nightstand, Yu Chuang took out the finely crafted business card from his pocket. He glanced at the name and contact information on it, gently stroking it with his fingertips. ",
        "Then, he opened the drawer and placed the card inside. The otherwise empty drawer held nothing but the card, a silk scarf, and a delicate rose brooch."
    ],
    "previous": "Chapter 17",
    "next": "Chapter 19"
}