{
    "title": "Chapter 13",
    "content": [
        "Yu Chuan had a thoroughly refined and noble appearance. Indeed, in this generation of the Yu family, there weren’t many young ones worth mentioning. Only the two brothers, Yu Chuang and Yu Chuan, were presentable. Even if their status wasn’t completely legitimate, who would dare say otherwise?",
        "That’s why, as Yu Chuan stayed here to seek some peace and quiet, no one dared to disturb him. ",
        "“Mr. Lu, I haven’t yet thanked you.”",
        "After saying this, Yu Chuan took a sip of his wine and raised his glass in acknowledgment.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lu Yiman smiled lightly and replied, “President Yu has already thanked me. The last time I was invited as a guest left quite an impression.”",
        "His gentle tone revealed no hint of displeasure over the last time he had been detained at the villa. ",
        "Yu Chuan glanced at him and, without changing his expression, said, “I thanked you last time. This time, I haven’t yet.”\n\n",
        "Seeing Yu Chuan’s eyes, Lu Yiman suddenly understood and couldn’t help but chuckle, raising his own glass in return.",
        "“President Yu, you’re too kind.”",
        "It seemed Yu Chuan really didn’t like Yu Ziming.\n\n ",
        "After finishing his sentence, Yu Chuan stood up and left, as if he had been waiting here just to say that one thing to him.",
        "Always cold and dignified.",
        "Lu Yiman’s smile deepened as he looked in the direction Yu Chuan had gone and saw Yu Chuang coming out.\n\n",
        "The two brothers were both dressed in black suits, one cold and severe, the other bright and striking. Whether smiling or not, their shared phoenix eyes carried the same air of cold arrogance when they glanced at others. ",
        "Amidst the clinking of glasses, beneath the luxurious atmosphere, Yu Chuang’s young yet handsome face held a restrained sharpness. When speaking with others, he rarely looked at them directly; only those who matched his status would receive a brief glance.",
        "He would cast the occasional sidelong glance, remaining silent and still. Only when something piqued his interest would he slightly raise an eyebrow or nod, his entire demeanor exuding noble aloofness.",
        "It almost made people forget that although Yu Chuan was the heir of the Yu family, the one who truly held power was Yu Chuang.",
        "This was a man who could stand alone and had already matured, carrying with him an air of distant superiority. ",
        "Lu Yiman couldn’t help but take a sip of his wine.",
        "This version of Yu Chuang—calm, aloof, and noble—was a far cry from the anxious and gloomy man he had seen in front of Yu Ziming.",
        "Lu Yiman stared fixedly at him, his gaze filled with a clear sense of purpose.",
        "No matter how he was described in the book or through recent interactions, Yu Ziming was a rather ordinary person in the grand scheme of things. ",
        "Ordinary in excellence, ordinary in effort, ordinary in kindness, and ordinary in weakness.",
        "But in Lu Yiman’s view, Yu Chuang, who stood at the pinnacle of the thorny path, didn’t need this kind of ordinary healing.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Sometimes, when salvation doesn’t achieve the goal, capturing the heart is the ultimate method.",
        "Noticing Ou Timan’s unhidden gahe, Tu Jhuang furrowed his brows and looked over. The invasive look in Ou Timan’s eyes immediately softened into a gentle smile. ",
        "The person who had pust been so cold and haughty instantly put on a superficial ezpression, his brow furrowed, lips tightly pressed, and from across the distance, Ou Timan could almost hear him “huff.”",
        "This was the Yu Chuang he knew.",
        "A bit cute.",
        "Lu Yiman grinned and drained his glass. ",
        "With a “clang,” the empty glass was placed on the table. As Lu Yiman stood up, the chain dangling from his earlobe caught the light, casting a bright gleam on the rose at his chest.",
        "He was taller than Yu Chuang, not by much, but enough to look him in the eye.",
        "As he stood, Yu Chuang gripped his wine glass tightly and couldn’t help but take a step back.",
        "But he quickly realized that this action looked like he was showing weakness. His brow furrowed immediately, and he forced himself to stop retreating, standing straight and fixing his gaze firmly on the approaching Lu Yiman. ",
        "The tall and lean man was good-looking, and his smile was just as attractive. As he moved, he naturally drew attention from the crowd.",
        "Perhaps even Yu Chuang himself didn’t realize that the way he stood there, staring tensely at Lu Yiman, made him look like a cat with its fur standing on end.",
        "But Lu Yiman knew Yu Chuang wasn’t a cat. If he had to describe him, Yu Chuang was more like a tall, solitary wolf. And as for the wolf’s close relative…",
        "Lu Yiman coughed lightly into his fist, covering a faint, impolite smile. ",
        "Yu Chuang glared at him, even straightening his back further, fully prepared for a confrontation.",
        "But the person walking toward him passed right by, heading instead for a woman in a red evening gown behind him.",
        "“…”",
        "Unsure if he had seen it correctly, Yu Chuang noticed that when they brushed past, the other person had been smiling. ",
        "Yes, he was always smiling.",
        "But Yu Chuang was certain that while smiling, the other person had glanced at him out of the corner of his eye!",
        "Please visit chrysanthemumgarden (dot) com",
        "A rush of heat surged to his head, and even on his not-so-pale skin, the blush was strikingly visible.",
        "Almost before his brain could catch up, his body reacted, and he reached out. However, with the other man’s long legs and large strides, Yu Chuang didn’t manage to grab his wrist as he had intended. Instead, he ended up clutching the edge of his sleeve in a way that looked almost delicate and dependent. ",
        "The surroundings fell silent in an instant.",
        "Both the man who had been speaking with Yu Chuang and Peng Haohao, the woman whom Lu Yiman was walking toward, paused.",
        "Feeling the scorching gaze from behind, Lu Yiman turned his head and then looked down, seeing Yu Chuang’s hand gripping his sleeve, veins bulging.",
        "“Mr. Yu, is there something you need?” His tone was polite, but his actions were anything but considerate. Not only did he fail to preserve Yu Chuang’s dignity, but he even raised his hand slightly, raising an eyebrow as he examined the two fingers lightly grasping his sleeve. ",
        "Yu Chuang’s temple veins throbbed visibly. In the silence, he immediately let go, his face showing frustration and annoyance.",
        "Behind him, there was a light cough. Lu Yiman turned around, and Peng Haohao, with a bright smile, gracefully lifted her skirt and merged into the crowd, waving at him as if to say she wouldn’t disturb him for now.",
        "The man who had wanted to speak with Yu Chuang also quietly made himself scarce, slipping away unnoticed.",
        "Lu Yiman turned back, still patient. “Mr. Yu, is there something you need?” ",
        "Looking at his gentle expression, Yu Chuang felt anger welling up, but no matter how hard he tried, he couldn’t find a way to release it. Frustrated, he ended up getting angry at himself.",
        "“Nothing.”",
        "He turned his head, now just wanting the other man to leave his sight.",
        "“Is that so? I thought Mr. Yu was upset.” ",
        "Hearing this soft sigh, Yu Chuang snapped his gaze back to him, eyes blazing.",
        "Yes, he was upset!",
        "“Apologies, Mr. Yu.”",
        "Lu Yiman apologized quickly, and Yu Chuang instinctively lifted his chin, his Adam’s apple moving slightly, as if wanting to say something to save a bit of face. ",
        "But his talent for words was lacking, and after a long pause, all he could manage was a simple “Hm.”",
        "Lu Yiman almost wanted to laugh, but seeing how even Yu Chuang’s ears had turned red from the strain, he didn’t want to make things more difficult for him. So, in a gentle voice, he said, “I’m very sorry, Mr. Yu.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "With that, he bowed his head and unpinned the brooch from his chest. With a soft click, the chain fell away, becoming a straight dangling earring tassel, while the rose brooch remained just a rose brooch.",
        "As he bent closer, Yu Chuang froze, unsure of what to do with this unexpected gesture, especially with the soft words and delicate movements that followed. ",
        "“Mr. Yu, I’m very sorry for injuring your hand. Please accept this brooch as compensation, and don’t be upset.”",
        "The bright red rose stood out as a singular burst of color against Yu Chuang’s black suit.",
        "Yu Chuang stared in a daze, but soon his hand was lifted again.",
        "The silk scarf tied into a bow had been removed, though whether it had been pocketed or thrown away was unclear. ",
        "No one knew why Lu Yiman carried so many curious items in his pockets, including band-aids, even when attending a high-class banquet.",
        "“I was just joking with Mr. Yu earlier. I hope you don’t mind. If there’s anything uncomfortable, please let me know.”",
        "The other person’s body temperature was always slightly higher than his, but Lu Yiman still thought that Yu Chuang felt unusually warm, suspecting that he hadn’t fully recovered from being sick.",
        "After all, it had been raining heavily that day, and even someone as strong as iron wouldn’t have that kind of resistance. ",
        "The small wound was treated with the same gentle care Lu Yiman showed in his demeanor, neatly and smoothly covering Yu Chuang’s finger.",
        "Lowering his gaze, he noticed Yu Chuang’s sleeve. That brief glimpse in the restroom earlier had given him a clear answer—it was a small lily flower, no larger than a thumb, embroidered on the inside of the cuff.",
        "Sensing his gaze, Yu Chuang immediately snapped out of it and quickly pulled his hand away.",
        "In a rush of heat, he stomped off, wanting to leave the area. But after walking away, he pressed his lips together in frustration and returned, his dark eyes fixed on Lu Yiman. ",
        "“Lu Yiman.”",
        "“Yes,” he responded gently.",
        "Yu Chuang’s Adam’s apple bobbed, and the words stuck in his throat came out in a different tone.",
        "“Just you wait!” ",
        "The harsh words lost some of their chill, instead sounding a bit like embarrassment mixed with anger.",
        "Lu Yiman said nothing, just smiled. Yu Chuang, who had already stepped away, returned again, his hand with the band-aid clenched slightly, his face stiff as he awkwardly said, “Thank you.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This time, the words carried far more conviction than the earlier threat.",
        "Watching Yu Chuang’s rigid back as he walked away, his neatly combed hair even seeming stiff against his scalp, Lu Yiman couldn’t hold back his smile any longer. ",
        "“Did Mr. Lu see something interesting?” A quiet voice suddenly sounded from behind him.",
        "Yu Chuan, who had apparently never left, was now standing there, his gaze fixed intently on the direction where Yu Chuang had just departed.",
        "Without waiting for a reply, Yu Chuan continued speaking to himself, “When he’s happy, he embroiders begonias. When he’s sad, he embroiders lilies.”",
        "“Do you know why?” As he said this, Yu Chuan turned to look at him. ",
        "Lu Yiman was about to ask why, but before he could, Yu Chuan continued on his own.",
        "“Because lilies were our mother’s favorite flower. She used to keep them on the windowsill, but they died quickly. The begonias bloomed the brightest along the roadside at our parents’ funeral.”",
        "After this, Yu Chuan smiled, and Lu Yiman fell silent.",
        "He recalled the day at the hospital, when Yu Chuang’s hand had been hidden under the blanket. Was he embroidering lilies at that time? ",
        "Yu Chuan left after finishing his story, and Lu Yiman wasn’t entirely sure why he had gone out of his way to share it.",
        "But he didn’t feel like thinking too deeply about the reason either.",
        "Maybe he was a little drunk.",
        "Feeling too lazy to move and not wanting to think, he leaned half-heartedly against the table, absentmindedly touching his ear, where a cigarette was tucked within his loose strands of hair. "
    ],
    "previous": "Chapter 12",
    "next": "Chapter 14"
}