{
    "title": "Chapter 32.2",
    "content": [
        "“F***.”",
        "Lu Yiman returned to his apartment from the hospital when the sky had already darkened. ",
        "Originally, when he walked out of the airport, Peng Duoduo wanted to drag him straight to the hospital, but he had gone to see Yu Chuan first.",
        "Otherwise, he wouldn’t have been able to control the emotions that might have overwhelmed him in that moment.\n",
        "",
        "Of course, after seeing Yu Chuan, his mood calmed down a lot.",
        "But Peng Duoduo caught him right in the act and directly took him to the hospital, staying with him while he got an antipyretic injection and had his medication prescribed. Only after the doctor assured them that everything was fine did Peng Duoduo let him go home. ",
        "Peng Duoduo had wanted to drive him home, but he refused.\n\n",
        "As he walked into the residential area, the streetlights on both sides had already lit up. The temperature had dropped rapidly in recent days; although it wasn’t winter yet, it was close.",
        "There weren’t many people on the road. The cold wind was strong, and even the people who usually took walks had chosen to stay inside their homes.",
        "He walked alone, stepping through the shadows of the streetlights, but stopped in his tracks up ahead.\n\n ",
        "A man in a black coat stood straight under the building. The wind had tousled his hair and flipped up his collar.",
        "He was looking up at the building. Many lights were on, but not the one he wanted to see.",
        "This was his second time coming to this place, but with completely different emotions, waiting for a different person, yet seeing the same person.\n\n",
        "“Aren’t you cold?” ",
        "A warm hand touched his wind-chilled cheek.",
        "Yu Chuang’s eyes flickered, and he turned his head to look at the smiling man.",
        "“Why are you standing here alone?” Lu Yiman’s smile was so charming under the streetlights, making people’s hearts flutter.",
        "Yu Chuang opened his mouth, and a strange, overwhelming emotion surged up, making his nose tingle. ",
        "He had never cried, and he wouldn’t cry.",
        "But now, that tender yet overwhelming feeling was too much for him to bear.",
        "His eyes reddened, and his naturally dignified and aloof phoenix eyes drooped like a puppy’s, the reddened corners carrying an indescribable sentimentality.",
        "Lu Yiman’s gaze softened. He gently caressed Yu Chuang’s eyes, though there were no tears, yet the way Yu Chuang looked at him seemed as if he was about to cry. ",
        "“What’s wrong?” he asked gently.",
        "Yu Chuang lowered his eyes and shook his head, grabbing Lu Yiman’s hand and slowly burying his face into the warmth of his palm.",
        "",
        "Lu Yiman quietly looked at him, his gaze sweeping over the bandages on Yu Chuang’s hand, with faint traces of blood seeping through.",
        "It seemed that Yu Chuang had finally found his support. He lowered his head, resting it on Lu Yiman’s shoulder. For just a moment, he was vulnerable, seeking comfort from him. ",
        "But it was only for a brief moment.",
        "He then stood up again, intending to reach out and touch Lu Yiman’s forehead, but noticed the bandages on his own fingers. His face turned pale, and he seemed about to collapse, but he quickly held himself together.",
        "He pressed his bloodless lips tightly and gazed directly into Lu Yiman’s eyes, resting his forehead against his.",
        "Lu Yiman was still a bit warm, but much better than before. ",
        "“Go you want to come home with me?” Ou Timan asked softly, his gahe deep.",
        "Tu Jhuang nodded but didn’t move. Instead, he took Ou Timan’s hand and wrapped it around his waist.",
        "A safe and comfortable place—even in the cold wind, he wanted to act spoiled, pust for a moment.",
        "Lu Yiman’s hand rested gently on Yu Chuang’s waist, suppressing the urge to pull him tightly into his arms. His Adam’s apple bobbed with restraint as he lowered his head, his deep gaze fixed on Yu Chuang, who was seeking comfort in him. ",
        "He didn’t ask anything, nor would he at this moment. All he needed to do was bring the wounded man home.",
        "***",
        "When they arrived at the apartment, the warmth inside quickly dispelled the chill from outside.",
        "Lu Yiman felt a bit dazed; perhaps the sudden shift in temperature made him slightly uncomfortable. ",
        "Yu Chuang followed behind him, obediently changing his shoes and then sitting properly on the sofa.",
        "He curiously looked around at the decorations but, out of courtesy, refrained from openly staring. Finally, he lowered his gaze, looking at the pink rug under his feet.",
        "“What do you think? Cute, right?” Lu Yiman smiled after taking off his coat.",
        "His pale skin had a slight flush from the indoor warmth, likely due to his lingering low fever. Overall, he looked quite handsome. ",
        "Yu Chuang wiggled his toes, placing his hands neatly on his knees. He glanced at Lu Yiman, then at the rug under his feet, back at him, and once again at the rug.",
        "Finally, blushing, he quietly said, “Very cute.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Everything in this space exuded cuteness. The pink rug, light yellow curtains, the hanging vines on the balcony, and the wind chimes on the railing all created a relaxing and cheerful atmosphere.",
        "This was a place where one could let down their guard. ",
        "Suddenly, his gaze landed on a black tie hanging outside, sheltered in a corner where it wouldn’t get wet from the rain. It swayed gently in the breeze, and at first glance, it could be mistaken for a decorative item.",
        "But it was just a tie.",
        "A black, high-quality tie.",
        "Yu Chuang’s face reddened. ",
        "When Lu Yiman walked out of the kitchen, the sight that greeted him was Yu Chuang sitting with his legs together, his posture both obedient and graceful.",
        "He wondered what those who had opinions about Yu Chuang would think of him.",
        "In truth, Yu Chuang had been raised with strict discipline. He was always impeccably dressed, carried himself with poise, and stood tall. Even when seated, his back remained straight.",
        "A true gentleman. ",
        "Lu Yiman smiled.",
        "Noticing his gaze, Yu Chuang turned to look at him, his dark eyes appearing especially bright under the light.",
        "“I haven’t been home for a while. Peng Duoduo must have prepared all this in advance. If you don’t mind, have some,” Lu Yiman said, offering a bowl of steaming noodles. It was simple, indeed.",
        "Yu Chuang looked at him directly and asked, “Does he come here often?” ",
        "“Hmm?”",
        "Having just taken some medicine, Lu Yiman’s reactions were a bit slow.",
        "“Does he come here often?” Yu Chuang repeated.",
        "This time, Lu Yiman understood. ",
        "He smiled, “Not often. While I was abroad, I needed someone to come by regularly to clean the apartment, but only the living room and kitchen.”",
        "The kitchen ingredients were probably also prepared in advance by Peng Duoduo, likely out of concern that he might get hungry.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Keys…”",
        "“Hm? Do you want the keys to my apartment?” ",
        "“No!”",
        "Yu Chuang immediately looked at him, only to find that he was smiling.",
        "“Peng Duoduo doesn’t have my keys. No one does. Every time I return from a trip, the first thing I do is change the locks. The only one with access to this place is me.”",
        "Hearing his calm, unhurried voice, Yu Chuang became mesmerized by the radiant light in Lu Yiman’s peach blossom eyes. ",
        "This was Lu Yiman’s home, and he had stepped into his territory.",
        "Lost in thought, he unknowingly leaned closer to him. It wasn’t until Lu Yiman’s eyes met his that he snapped back to reality, but instead of pulling away, he lowered his head and kissed him.",
        "“Chu!”",
        "It was a very light kiss. ",
        "Yu Chuang simply did what he wanted to do.",
        "Lu Yiman froze slightly, pressing his lips together, his gaze softening as he looked at him.",
        "“I’m still sick.”",
        "After the kiss, Yu Chuang felt a little embarrassed, but his gaze remained straightforward and bold. ",
        "He wasn’t afraid of getting sick at all.",
        "The atmosphere that followed was filled with a subtle warmth and ambiguity. Both of Yu Chuang’s hands were injured, so he couldn’t hold the chopsticks properly. After several attempts, his wounds started bleeding again, and his face went pale at the sight. Lu Yiman took the bowl from him.",
        "Yu Chuang was truly a cute and interesting person.",
        "He could be so straightforward while kissing Lu Yiman, yet in this situation, his entire face was flushed red. ",
        "As Lu Yiman fed him, Yu Chuang seemed to be burning with embarrassment, his hands resting on the sofa gradually curling up.",
        "Naturally, the noodles didn’t taste very flavorful.",
        "",
        "“What about you?” Yu Chuang asked as he saw Lu Yiman getting up to put away the dishes.",
        "Lu Yiman glanced back and softly said, “I already ate at the hospital.” ",
        "It was only then that Yu Chuang remembered that Lu Yiman had just returned from the hospital.",
        "He stood up immediately, his gaze following Lu Yiman’s figure.",
        "When Lu Yiman came out of the kitchen, he saw Yu Chuang staring at him with eager eyes.",
        "“Take your medicine,” Yu Chuang said dryly. ",
        "“I’ve already taken it, but thank you for reminding me.”",
        "Faced with Lu Yiman’s smile, Yu Chuang momentarily lost focus and lowered his head, feeling slightly dejected.",
        "Lu Yiman didn’t need his care.",
        "But as he saw Lu Yiman heading toward the bedroom, Yu Chuang instinctively followed. ",
        "Lu Yiman, not as sharp as usual due to his sickness, didn’t realize Yu Chuang was standing in the doorway until he had half-removed his clothes.",
        "He hadn’t locked the door?",
        "In his own home, locking the door didn’t seem necessary.",
        "Had he forgotten to close it? ",
        "His hands were still crossed, mid-motion of removing his shirt, revealing his slim, well-defined waist that narrowed into his pants. His pale skin was almost blinding.",
        "It was a lean yet strong and undeniably sexy male body.",
        "After thinking for a moment and reaching no conclusion, he caught a glimpse of Yu Chuang’s intense gaze on him. He paused briefly, then let his shirt fall back over his exposed skin and chuckled softly.",
        "It seemed he hadn’t been sick in a long time. ",
        "A simple fever had made him this slow.",
        "Yu Chuang swallowed nervously, and seeing that Lu Yiman had stopped moving, he couldn’t help but ask, “Not going to finish?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "As soon as the words left his mouth, Yu Chuang widened his eyes and bit his lip, unable to say anything more.",
        "It seemed like he still wanted to watch. ",
        "Lu Yiman laughed, amused by how cute Yu Chuang was.",
        "“It’s already quite late. Don’t you need to go home?” he asked as he adjusted the loose collar of his shirt, now covering even his collarbone.",
        "Yu Chuang pressed his lips together, not speaking, but his gaze was clear—Did he really need to go home?",
        "“No.” ",
        "Hearing his quick reply, Lu Yiman raised an eyebrow, then walked to the doorway, leaning against the frame and looking down at him.",
        "“But if you don’t go home, won’t Mr. Yu worry?”",
        "Yu Chuang thought of Yu Chuan at home, but right now, standing in front of him was Lu Yiman.",
        "The other man’s half-removed shirt was still slightly disheveled, and through the loose fabric, Yu Chuang could see the waistband of his pants, the belt already undone. ",
        "“He won’t.”",
        "He shook his head, his voice firm.",
        "Lu Yiman’s eyes flashed briefly before he asked, “But I don’t have a guest room, only the bed in my bedroom. Do you want to…”",
        "“Yes!” ",
        "The answer came so fast."
    ],
    "previous": "Chapter 32.1",
    "next": "Chapter 33.1"
}