{
    "title": "Chapter 24.2",
    "content": [
        "Yu Ci didn’t even dare to breathe. The atmosphere felt as though a blade was suspended over their heads.",
        "After that, Yu Chuan didn’t say another word, and Old Master Yu’s expression wasn’t much better. ",
        "In this mutual battle of intimidation, neither of them won.",
        "***\n",
        "",
        "When the plane landed, Lu Yiman woke up just in time.",
        "His eyes were still slightly sore, and he kept them closed for a moment to adjust. ",
        "He wasn’t particularly gifted, just someone who performed well in school, so for this exchange competition, he had naturally dedicated even more time and effort.\n\n",
        "Before this, he had only been sleeping about four hours a night for three consecutive nights.",
        "A wave of lethargy washed over him, making him reluctant to move, but something didn’t feel right. When he opened his eyes, he saw Yu Chuang’s tense jaw and his straight, slender neck…",
        "He was resting on Yu Chuang’s shoulder, watching the people disembark one after another.\n\n ",
        "Yu Chuang sat as straight as a well-behaved schoolboy, his hands slightly clenched and placed on his legs, seemingly unaware that Lu Yiman had woken up or how long he had been holding this posture.",
        "By now, almost everyone had deplaned.",
        "Lu Yiman could feel the growing tension and anxiety in Yu Chuang, who was clearly trying to suppress it.\n\n",
        "He felt a slight stir in his heart but didn’t move, letting time tick by second by second. When everyone else had disembarked, he heard Yu Chuang’s heartbeat, clear and steady. ",
        "Yu Chuang clearly wasn’t great at handling anxiety, especially as someone not particularly good at communicating with others. Now, with only the two of them left on the plane, Yu Chuang’s nervousness seemed to surface uncontrollably.",
        "But still, he didn’t wake Lu Yiman. He just silently wrestled with himself.",
        "A flight attendant approached them, kindly asking if there was anything they needed.",
        "Yu Chuang tensed up completely. When his emotions fluctuated, he struggled to speak properly. ",
        "As someone well-educated, he knew he shouldn’t waste the staff’s time here.",
        "But…",
        "He lowered his head, his chin brushing against Lu Yiman’s hair.",
        "“Hush.” ",
        "He finally raised a finger to his lips, looking at her with wide eyes.",
        "The flight attendant was stunned—she had likely never encountered such a situation before.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Meanwhile, Mr. Assistant, who had been too afraid to speak the whole time, was equally frozen.",
        "When did his boss, who had always been so rational, start acting under the influence of love? ",
        "This kind of domineering behavior was completely out of character for his boss!",
        "After making that gesture, Yu Chuang’s face reddened slightly, but he had already decided to wait a bit longer for Lu Yiman to wake up, so despite the embarrassment, he turned and looked earnestly at the flight attendant.",
        "Although he appeared to be a mature and stern man, his dark eyes held such a focused gaze that it unexpectedly softened people’s hearts.",
        "The flight attendant’s expression became gentler. This was their last flight, and they weren’t in a hurry to return. ",
        "Uncertain whether the other gentleman was unwell, she brought over a blanket and a cup of warm water, leaving a note as well.",
        "—If you need anything, please don’t hesitate to contact us. If this gentleman hasn’t woken up in half an hour, we will arrange for a doctor.",
        "Awkwardly yet obediently, Tu Jhuang clutched the small note in his hands.",
        "Le glanced down at Ou Timan, carefully folded the note, then glanced at him again, unfolded the note, looked at him once more, folded it again, and repeated the process. ",
        "He performed this childish yet endearing action over and over to pass the time and to calm his own turbulent emotions.",
        "Meanwhile, the already-awake Lu Yiman lowered his gaze, watching Yu Chuang’s slender fingers continuously repeat this small action. His eyes grew darker and more profound.",
        "***",
        "In the end, Lu Yiman didn’t let Yu Chuang struggle for the full half-hour; he “woke” right on time at the 25-minute mark. ",
        "The moment Yu Chuang sensed his movement, he froze, hurriedly folding the note in his hand.",
        "Lu Yiman didn’t hide his laziness, his deep, almond-shaped eyes still a little sleepy, giving him a mesmerizing and slightly dazed look.",
        "Yu Chuang’s gaze fixed on his face, and when Lu Yiman turned to look at him, he didn’t look away, only blinking quickly.",
        "“You’re awake,” Yu Chuang said stiffly, his voice dry. ",
        "Lu Yiman looked directly at him and smiled.",
        "“I’m awake.”",
        "",
        "Yu Chuang opened his mouth, but no words came out. His fingers nervously fidgeted with the folded note.",
        "Noticing this small gesture, Lu Yiman pretended to be surprised and asked, “Is this the contact information of a lady or gentleman who left it for you, Mr. Yu?” ",
        "Yu Chuang froze and looked up at him.",
        "“No.”",
        "“There’s no need to be shy. It’s only natural for someone as charming as you to attract attention.”",
        "Suddenly complimented, Yu Chuang: “…” ",
        "“No.”",
        "This time, his voice was much quieter than before.",
        "“Oh? Then is it for me?” Lu Yiman blinked, seemingly very interested in the possibility of a romantic encounter on this trip.",
        "“…” ",
        "Yu Chuang remained silent, the emotions in his eyes quickly fading.",
        "“No.”",
        "It was still the same two words, but his tone was even heavier than before.",
        "Yu Chuang, with lips pressed tightly together, didn’t notice the deepening smile in Lu Yiman’s eyes. So when Lu Yiman reached out and took the paper note, Yu Chuang didn’t react. ",
        "“Then it must not be anything important.”",
        "The meticulously folded paper, with every edge carefully creased, slipped easily into Lu Yiman’s hand.",
        "Yu Chuang glanced at him but said nothing, standing up.",
        "The assistant, who had been waiting on the side, quickly stood up as well, grabbing the already prepared luggage, eager to get off the plane. ",
        "After taking a few steps, Yu Chuang paused, glancing back to see Lu Yiman still playing with the folded paper. He pursed his lips and said, “Let’s go.”",
        "Lu Yiman looked up and met Yu Chuang’s gaze, smiling. “Alright.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "***",
        "Yu Chuang had a private driver waiting for him, along with a secretary who had already arrived in Germany to greet him. Lu Yiman, on the other hand, had to call a taxi to a nearby hotel. ",
        "As the two were about to part ways, Yu Chuang seemed to have something on his mind, casting glances at Lu Yiman.",
        "But the usually perceptive and considerate Lu Yiman pretended not to notice his hesitation.",
        "He stood there, watching as Yu Chuang got into the car. Yu Chuang, sitting inside, stared at him through the window, his gaze unwavering.",
        "Neither of them said anything, and the atmosphere became strangely tense. ",
        "Suddenly, Lu Yiman smiled softly, took a step forward, bent down to look at him, and gently said, “Mr. Yu, I wish you a pleasant journey.”",
        "With that, he placed a small, folded white rose in Yu Chuang’s jacket pocket. The delicate flower was intricate and adorable.",
        "As Yu Chuang looked down at the white rose, Lu Yiman turned and left. Yu Chuang immediately looked back up at him.",
        "“Lu Yiman!” ",
        "He turned around, and Yu Chuang, with one hand resting on the car window, stared at him with his dark eyes.",
        "After a long moment, Yu Chuang parted his tightly pressed lips.",
        "“Until next time.”",
        "Lu Yiman was momentarily stunned but soon smiled brightly, his eyes sparkling like a galaxy of stars. ",
        "However, as Yu Chuang watched him leave, a sense of melancholy and frustration stirred within him.",
        "This time, he didn’t say, “Until next time.”",
        "His fingers slowly curled into a fist, and only when Lu Yiman’s figure disappeared from sight did he finally look away.",
        "Once in the car, Lu Yiman gave the driver the hotel’s address and then opened his phone. ",
        "There were messages from Ms. Song and Chen Zizi, both asking if he had arrived safely in Germany.",
        "Chen Zizi, in particular, seemed excited and asked about the local food and attractions. But given that she was a senior in high school, the messages soon stopped, likely because her phone had been confiscated.",
        "",
        "Mr. Chen had given him a contact number—a friend of his in Germany—who could help if he needed anything.",
        "Lu Yiman didn’t reply to any of these messages. His expression remained indifferent as he shifted his attention to the blinking red notification from Peng Duoduo. ",
        "The message was from a user with the avatar of Gargamel.",
        "——I heard Yu Chuang is also going to Germany, and on today’s flight. You were flying to Germany too, right? Did you run into him?",
        "A smile tugged at the corner of his lips.\n——Yes, we ran into each other.",
        "The reply from Peng Duoduo came almost immediately, as if they had been waiting. ",
        "——No way! It’s really that coincidental!",
        "He put down his phone, gazing at the linden trees flashing by outside the car window. It was late autumn, and the ground was already covered with a blanket of golden leaves, quiet and elegant, the kind of scene that calmed the heart and allowed one to reflect.",
        "It was quite a coincidence.",
        "But how could coincidence ever be enough? ",
        "Resting one hand against his temple, he let out a soft chuckle.",
        "Meanwhile, at the hotel, Yu Chuang held the paper rose in his hand, hesitantly unfolding it, piece by piece, as a faint glimmer of gold caught his eye. His gaze widened slightly as he revealed the hidden surprise—a gold-and-red invitation tucked inside.",
        "—You are cordially invited to attend the design exhibition at 8 p.m. sharp.",
        "… ",
        "A portion of the design pieces that Lu Yiman had shipped over had been damaged during transit, and amidst this, he still needed to meet with the models who would showcase his work during the exchange competition.",
        "Time was tight. He hadn’t arrived early, so many of the models had already been selected by other designers.",
        "Initially, the competition had intended to use mannequins for the display, as their consistent body measurements would ensure fairness.",
        "But the organizers weren’t keen on such a dull approach. After all, the venue and financial support they provided weren’t just for “art”—there was the potential for profit involved. ",
        "After all, a runway full of lively models dressed in new designers’ works would generate much more buzz than lifeless mannequins.",
        "The models that remained were a mixed group. Most designers had brought about three outfits, so in a stroke of “luck,” Lu Yiman was left with one white model and two Black models.",
        "Please visit chrysanthemumgarden (dot) com",
        "Although the Black models had excellent body measurements, the challenge lay in matching the designs to their proportions.",
        "This wasn’t a casual runway to showcase concepts. Even though it was an exchange competition, there was still an element of competition. And where there’s competition, there’s pressure to deliver results. ",
        "He met with the three models first. To his surprise, the white model had a fuller figure, while the two Black models were on the slimmer side, with long limbs that emphasized their tall and lean frames.",
        "“Oh! What a handsome designer we have here!”",
        "The white model exclaimed dramatically, covering her mouth in mock surprise when she first laid eyes on him.",
        "Even though there was a hint of exaggeration and teasing in her tone, Lu Yiman still smiled politely, appreciating the humor. ",
        "“While I’d love to chat with such beautiful ladies, we’re a bit pressed for time. May I ask if you could provide me with your measurements today?”",
        "His tone was polite, but his attitude was efficient and decisive.",
        "Designing a piece and bringing it to life took an enormous amount of time, especially when creating three different looks.",
        "Most designers had brought finished pieces, but being able to make last-minute adjustments was a skill every designer needed to master. ",
        "“Of course! Shall we start right now?”",
        "The white model winked and, without hesitation, began to move as if to take off her clothes.",
        "Although the organizers had already provided the models’ body measurements to the designers in advance, that was merely a preliminary guide.",
        "Most designers still trusted their own measuring tapes over pre-provided data. ",
        "“Let’s start.”",
        "Lu Yiman didn’t shy away. His smile remained calm and refined, without the slightest hint of embarrassment that the model might have been hoping to provoke."
    ],
    "previous": "Chapter 24.1",
    "next": "Chapter 25.1"
}