{
    "title": "Chapter 27.1",
    "content": [
        "Because Lu Yiman’s black wedding dress received a great response, it was showcased as the final exhibit.",
        "He didn’t look worried at all, not even the slightest bit nervous. He watched the enthusiastic bidding below with calm confidence. ",
        "The other designers who had been bid on earlier were now showing less pleasant expressions.",
        "Especially the white designer, whose eyes were wide open, causing the other designers to steer clear of him.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "“Hey, I want this ‘Black Swan’ piece. You all aren’t planning to fight me for it, are you?”",
        "A clear male voice echoed through the auction hall. ",
        "Oh, it’s Reed again.\n\n",
        "The others, who had been planning to bid, silently lowered their paddles.",
        "The auctioneer glanced at the others with some difficulty.",
        "He didn’t really want the bidding to stop here, as the auction house also took commissions.\n\n ",
        "“Box No. 5 has placed a bid!”",
        "The auctioneer’s eyes lit up, and his loud voice resounded throughout the room.",
        "Everyone else looked shocked—Reed had clearly taken the lead. Who would dare not give him face?\n\n",
        "Unexpectedly, Reed didn’t continue bidding, seemingly intending to yield to the guest in Box No. 5. ",
        "The auctioneer acted quickly, bringing the gavel down immediately.",
        "The final piece was sold to the guest in Box No. 5 for the highest price.",
        "At the same time, Lu Yiman was declared the winner of this design competition.",
        "The others left, either unwillingly or regretfully. ",
        "Lu Yiman looked in the direction of Box No. 5, his gaze thoughtful, then a faint smile appeared on his face.",
        "He stood up to leave, but the white designer, panting heavily, blocked his way.",
        "The man appeared extremely angry, on the verge of losing control.",
        "Lu Yiman eyed the bulging veins on the man’s face with some concern, but calmly asked, “Sir, is there something you need?” ",
        "“You damned scum, you dared to have Dani disqualified!”",
        "Lu Yiman’s eyes darkened, and he replied coolly, “I believe that’s the consequence you and she should bear.”",
        "",
        "“Shut up, it’s all because of you!”",
        "The man, completely losing control, shouted and charged at him like a wall of muscle. ",
        "The aggressive behavior caused the nearby women to scream in fear.",
        "Seeing the man’s clearly unstable state, Lu Yiman’s expression turned grim.",
        "Sven though he appeared to be a tall and mature man, his slender frame was still too weak compared to the muscular man.",
        "The fear of a bloody incident had the high-society crowd in a panic. ",
        "Dut Ou Timan stepped aside and stuck out his foot, causing the charging man to fall heavily to the ground with a loud thud.",
        "When the man lifted his head, two bright streams of nosebleed stained the floor red.",
        "Looking down at him, Lu Yiman softly asked, “Sir, do you need a doctor?”",
        "The expected brawl didn’t happen. Seeing the man’s uncontrollable nosebleed and hearing Lu Yiman’s calm remark, the onlookers fell silent. ",
        "This… doesn’t seem like something that needs a hospital visit.",
        "Then they noticed that one of Lu Yiman’s feet was firmly pressing on the man. His seemingly relaxed stance was actually applying subtle force through his leg.",
        "The others opened their mouths as if to speak but swallowed their words.",
        "Though Lu Yiman seemed gentle and easygoing, in truth, he fought dirty. ",
        "If the man kept attacking, Lu Yiman couldn’t promise he wouldn’t make him lose more composure here.",
        "The sight of the blood seemed to further agitate the man, who, despite his disadvantaged position, lost control completely, his eyes turning bloodshot.",
        "Those unprepared for the situation began screaming once again.",
        "But just as the man was about to turn over and get up, his body suddenly froze, then limply collapsed to the ground, completely unresponsive. ",
        "After a brief moment of stunned silence, the crowd began screaming even louder.",
        "It was only then that the auction house staff arrived hurriedly with the police.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "What they saw was a muscular white man lying unresponsive on the ground, with two Asian men standing beside him, one of whom still had his foot on the white man.",
        "“He attacked me first, and we only acted in self-defense. There is surveillance footage and recordings to prove it. Also, he’s just fainted; he’s in no life-threatening condition,” Lu Yiman said with a faint smile, responding to the skeptical gazes of the onlookers. ",
        "“I’m sure of it,” he added, because he had experience—the length of unconsciousness depends mostly on the force applied.",
        "The others still didn’t believe him, some even suspecting that the man’s neck might have been broken.",
        "“I suggest we send this gentleman to the hospital…”",
        "Before the sentence could be completed, a woman in a long dress suddenly ran over. When she saw the white man lying on the ground, her face turned pale, and she immediately collapsed onto him. ",
        "“Dani, he’s fine.”",
        "At the sound of his voice, the panicked Dani finally looked up at him, her already pale face now looking so distressed she seemed about to cry.",
        "“I’m very sorry, sir. I’ve already said this has nothing to do with you. He just couldn’t accept the outcome. Please understand. I know I was wrong. I tried to tamper with your show behind your back, and he just passively allowed it.”",
        "It seemed Dani had been having a tough time lately. At least in the modeling world, her actions would be condemned. ",
        "“He didn’t mean to attack you. He suffers from bipolar disorder and can’t control his emotions. Please don’t hold it against him, sir, I beg you.”",
        "Without makeup, Dani was a very young and beautiful girl.",
        "He quietly observed her, and after listening to her rambling and disorganized explanation, he squatted down and gently said, “I’m not angry. He just needs to go to the hospital. Dani, wipe away your tears, okay?”",
        "He handed her a clean tissue. Dani wiped her eyes, and after a long while, her emotions gradually settled down. ",
        "During this time, Reed had already cleared out the unrelated onlookers.",
        "This made Lu Yiman glance at him for a moment, but when Reed looked back at him, he calmly averted his gaze.",
        "Dani lowered her eyes to the man on the ground, and just as her eyes began to well up again, tears were about to fall.",
        "“Sir, I’m deeply sorry. I was the one who offended you in the first place. It’s just that he’s been too anxious and cares too much about the outcome. I didn’t want him to continue like this, so, with his passive approval, I chose to take this unfair action.” ",
        "She lowered her eyes, slowly regaining her composure.",
        "“I’m truly sorry. He just couldn’t accept that I lost my job because of you.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“I understand,” Lu Yiman responded gently, looking at her.",
        "With his calm reassurance, Dani’s emotions finally settled. After politely apologizing, she and the man were taken to the hospital with the help of the staff. ",
        "This was not an outcome Lu Yiman had expected, though his calm, unbothered gaze suggested he had no particular feelings about the matter.",
        "Once the surrounding area quieted down again, he turned his attention to Yu Chuang, only to see that his face had gone completely pale, and he looked as though he was about to collapse at any moment.",
        "Lu Yiman quickly reached out to pull Yu Chuang into his arms.",
        "Earlier, in the rush of the moment, he hadn’t reacted, but now that things had settled, Yu Chuang’s blood phobia immediately kicked in. ",
        "“Yu Chuang,” he called softly, gently patting his cheek.",
        "Yu Chuang’s body was limp and weak. Though he hadn’t lost consciousness, he wasn’t very alert either.",
        "He bent down and picked him up, and a bottle of pills rolled out of Yu Chuang’s pocket and onto the ground.",
        "Reed reached out to pick it up, but when he saw the writing on the bottle, he froze for a moment. ",
        "Thank God, he had been a bright child and had learned some Chinese, so he could read it.",
        "“Mr. Reed, please hand me the medicine.”",
        "Lu Yiman looked at him calmly, showing no sign of concern about the fact that it was medication for mental illness.",
        "Reed, with a complicated expression, handed the medicine over, unsure of Yu Chuang’s fainting. He hesitated before asking, “Do you need me to drive you to the hospital?” ",
        "“No, thank you.”",
        "Lu Yiman carried the limp Yu Chuang down the stairs.",
        "In his dazed and confused state, Yu Chuang slowly raised his hand, grasping tightly onto Lu Yiman’s braid as if seeking support.",
        "*** ",
        "When Yu Chuang woke up, he was lying in a soft bed. There was no usual incense burning, but instead, a faint scent of tobacco lingered in the air.",
        "He gripped the bedsheet beneath him, opening his mouth somewhat confusedly.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Lu Yiman.”",
        "By instinct, he had already begun searching for Lu Yiman. ",
        "On the balcony outside, Lu Yiman paused mid-drag on his cigarette. He stubbed it out, and once the wind had dispersed the smoke from his clothes, he opened the sliding door and walked inside.",
        "His presence carried the sharpness of the cool air, but his tone was gentle.",
        "“What’s wrong?”",
        "Only then did Yu Chuang realize this wasn’t his hotel room. The cigarette pack on the bedside table confirmed that this was Lu Yiman’s room. ",
        "His face was still pale, but he was much more alert now. The bed dipped slightly as Lu Yiman sat down, reaching out to touch his forehead and then his cheek.",
        "“Are you feeling okay?” he asked softly. In his dream earlier, Yu Chuang had been sweating, subconsciously touching his neck repeatedly.",
        "“I’m fine,” Yu Chuang replied, staring at Lu Yiman’s face without blinking.",
        "Lu Yiman chuckled. “What is it? Do you want some water?” ",
        "Yu Chuang shook his head.",
        "In the past, every time he woke up, he would still feel a lingering fear—a physiological reaction. Even if his face showed no signs of discomfort, he knew that the heavy feeling in his chest was hard to shake off.",
        "But now, looking at Lu Yiman’s gentle gaze and warm smile, a profound sense of security enveloped him.",
        "After a brief silence, Yu Chuang opened his arms, looking steadily at Lu Yiman. “Can I have a hug?” ",
        "After saying that, he pressed his lips together, adding a quiet question, “Is that okay?”",
        "In the warmth of Lu Yiman’s care, he was slowly learning how to express gentleness to someone he liked, even if he had only just begun to learn.",
        "“Of course.”",
        "Lu Yiman gazed into his deep, dark eyes. He always enjoyed finding himself reflected in those jewel-like eyes, and when he did, it brought him immense satisfaction. ",
        "He reached out and embraced Yu Chuang, feeling him lean his head gently against his shoulder, like a child seeking comfort. In Lu Yiman’s gentle eyes, a rare emotion flickered.",
        "It was like a small flame, gradually revealing the softness beneath his calm, distant exterior.",
        "",
        "Yu Chuang gave Yu Chuan a hug every day, soothing his restless heart.",
        "But at the same age, Yu Chuang was still a child, too. ",
        "He also felt fear and wanted to draw safety from someone else.",
        "Lu Yiman seemed soft and harmless, but his body was cold.",
        "Yet now, these two small fires, not burning too brightly, came together. They both equally shared a little warmth from each other.",
        "As the moon rose, Lu Yiman turned to his computer, handling work from back home. "
    ],
    "previous": "Chapter 26",
    "next": "Chapter 27.2"
}