{
    "title": "Chapter 36.1",
    "content": [
        "The Yu Building was filled with many shareholders today, and the solemn atmosphere was tinged with a sense of oppression.",
        "After today’s shareholders’ meeting, Yu Chuang will completely step down from his position and his duties. ",
        "All these will be handed over to Yu Chuan.",
        "Yu You’s long, narrow eyes swept towards the expressionless Yu Chuang. Though smiling, his hand gripped the pen tightly.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "“I wonder why the eldest Yu is leaving the group.”",
        "He couldn’t quite describe how he felt, but the anger swelling inside Yu You at this moment surpassed everything. ",
        "“It’s none of your business.”\n\n",
        "Yu Chuang gave him a cold glance, and Yu You’s face couldn’t help but change.",
        "The share transfer agreement signed yesterday officially took effect today. In addition to handling some resignation matters, today’s meeting also served to make the shareholders understand one thing.",
        "That is, in the future, Yu Chuan’s control will increase greatly, and no matter when, these two brothers are one. Whether it was when Yu Chuan gave these shares to Yu Chuang, or now as Yu Chuang transfers them back to Yu Chuan.\n\n ",
        "They always have each other’s support.",
        "So, those with ulterior motives no longer need to try to work between them.",
        "Yu You’s face looked grim, and it was hard for him to control his expression under the watchful eyes of everyone.\n\n",
        "Yu Chuan, with a hint of pride and mockery, glanced at him, carrying an air of absolute superiority. ",
        "Today, he wore sunglasses because he had cried for a long time on the bed last night, and when he woke up this morning, his eyes were swollen.",
        "To avoid losing face, he deliberately wore the sunglasses. Although it seemed less serious at the shareholders’ meeting, with a large amount of shares concentrated in his hands, no one dared to say anything.",
        "Perhaps the only one who could balance him was the old master Yu, but the old master didn’t come today.",
        "In a certain sense, in today’s situation, Yu You could be considered the representative of old master Yu. ",
        "Yu Chuang’s sharp eyes scanned the room, silently asking if there were any other opinions.",
        "Of course, there were none, as these shares had merely been passed between the brothers and had nothing to do with them. Even if not for the two brothers, it wouldn’t have concerned them.",
        "In the silence, Yu Chuang only gave them three seconds.",
        "“Meeting adjourned.” ",
        "Since there were no objections now, there would be no chance for objections later.",
        "Yu Chuan stood up as well. Standing beside Yu Chuang, his slightly raised chin showed his pride.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "This highlighted the difference between the two brothers. Yu Chuang was always brief with his words, often showing no emotion, carrying an invisible pressure.",
        "Yu Chuan, on the other hand, exuded elegance and innate arrogance. Because of his overly handsome face, there were moments when one might mistake him for a young noble, rather than the president of a corporation. ",
        "But in reality, it was Yu Chuan who came to the company every day, handling all the projects and documents. He was the one dealing with the daily affairs.",
        "Yu Chuang, on the other hand, was rarely seen, only appearing for major meetings or important projects.",
        "However, in terms of methods, most people might feel that Yu Chuang was easier to deal with. Even though he didn’t speak much, he acted decisively and wouldn’t make things difficult for his subordinates.",
        "As for Tu Jhuan… ",
        "Le completely embodied the ruthlessness and cutthroat methods of a businessman.",
        "Lis cruelty and mercilessness were the common complaints of the partners he had harshly dealt with.",
        "As they walked out of the meeting room, Tu Jhuan felt a strange, twisted emotion rise within him as he faced Tu Tou’s cold stare.",
        "Deliberately moving to Yu You’s side, he whispered, “If that old man were here, he might have a few words to say. But you, a puppet abandoned and now manipulated, what right do you have to be dissatisfied?” ",
        "To someone like Yu You, he normally wouldn’t give a second glance, but today he was in a bad mood, so Yu You’s gaze was an eyesore.",
        "“Yu Chuan.”",
        "Standing by the door, Yu Chuang called out to him, and Yu Chuan immediately composed himself, putting away all expressions on his face, and walked over with a bright smile.",
        "“Here.” ",
        "Yu You clenched his fist tightly, casting a chillingly cold glance, which just so happened to meet the gaze of Yu Chuang, who was standing sideways. The latter’s pitch-black eyes looked at him coldly, carrying a silent warning.",
        "***",
        "“Brother, you today…”",
        "Yu Chuan hadn’t even finished his sentence when he saw Yu Chuang grab his coat, ready to leave. His words were instantly stuck in his throat. ",
        "Hearing his voice, Yu Chuang turned his head to look at him, his lips moved slightly, but he said nothing.",
        "Yet, those eyes revealed everything.",
        "",
        "The expression on Yu Chuan’s face became somewhat stiff, and his feelings toward Lu Yiman became even more complicated. All in all, deep down, he felt a bit stifled.",
        "“It’s fine, brother, you can go.” ",
        "Yu Chuang stared at him for a few seconds. Seeing nothing out of the ordinary, he turned and left.",
        "Yu Chuan’s gaze followed him, and he couldn’t help but walk out after him.",
        "But abruptly, he stopped in front of the elevator.",
        "“Brother…” ",
        "Yu Chuang turned to look at him.",
        "“Be careful, it’s cold outside,” he forced a smile.",
        "Standing in the elevator, Yu Chuang looked at him. As the elevator doors closed, he opened his mouth.",
        "“You too.” ",
        "Yu Chuan’s nose stung, but he held back his emotions.",
        "As he watched the elevator slowly descend, the disappointment on his face instantly transformed into a half-smile, half-sneer, with a chilling coldness.",
        "With more cards in hand, those old, parasitic bloodsuckers could just wait for their turn.",
        "As the red arrow of the elevator descended, Yu Chuang had never felt such urgency before. ",
        "He wanted to see Lu Yiman, desperately.",
        "Since they parted ways at the café that day, they hadn’t seen each other.",
        "Lu Yiman’s withdrawal and conservativeness seemed to have drawn an invisible line between them. Yu Chuang couldn’t see or touch it, but he could feel the burning anxiety within him.",
        "Every second that passed without seeing Lu Yiman quietly accumulated in his heart, transforming from a trickling stream into a vast ocean, with giant waves now beginning to surge. ",
        "He was eager to see Lu Yiman.",
        "“Ding!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The elevator door opened, and he walked out with large strides. The passing employees stared at him in surprise; they had never seen him in such a rush.",
        "In his eagerness to find Lu Yiman, Yu Chuang failed to notice that the elevator next to him had opened less than thirty seconds later. ",
        "Just as Yu Chuang walked out of the front door, Yu You slowly stepped out of the other elevator, his eyes cold as he gazed at Yu Chuang’s retreating figure.",
        "***",
        "Although Lu Yiman didn’t go to the studio, that didn’t mean he wasn’t working at all.",
        "Some documents still required his signature, and he had to continue monitoring the studio’s operations online. ",
        "Moreover, his appearance on IM magazine had already reached domestic shores. Peng Duoduo seized this opportunity to promote him heavily, not just in the fashion industry but also in the entertainment circle, where his name was starting to become known.",
        "This brings up the need to talk about Peng Duoduo’s older brother, who is thriving in the entertainment industry.",
        "It had been mentioned long ago that Peng’s older brother wasn’t just an actor—he was also heavily involved in the modeling world, and he had a great passion for Peng Duoduo’s career.",
        "So, even though Lu Yiman hadn’t appeared publicly yet, his name already had a place in the industry. ",
        "If he wanted to develop further, he couldn’t just rely on others spreading his name. He needed to organize his own show, one that would bear his name.",
        "Peng Duoduo’s older brother was willing to invest and support this, with the only condition being that he wanted to be the lead model in the show. It didn’t matter if he had to wear women’s clothing.",
        "It’s hard to say that Peng Duoduo’s older brother wasn’t mesmerized by that black wedding dress.",
        "After giving it some thought, Lu Yiman didn’t refuse, as this could only benefit him. ",
        "He hadn’t met Peng Duoduo’s older brother in person yet—only on screen. The other was a very handsome and distinctive man.",
        "His “distinctiveness” referred to his ability to carry the strength of a man while also embodying the gentle grace of a woman. It was hard to discern his exact age, but when needed, he could portray a mature, steady businessman, or an outgoing, talkative young man.",
        "All in all, Peng Duoduo’s older brother was very charming on screen.",
        "As he walked into the flower shop, he thought about making a good first impression on their first meeting and showing some sincerity. ",
        "“Hello, sir. What flowers would you like to buy?”",
        "The person tending the shop was a very young girl. When she saw him, her eyes lit up, and she wiped her hands on her apron before eagerly walking up to him, her bright eyes fixed on him.",
        "Please visit chrysanthemumgarden (dot) com",
        "So tall…",
        "Lu Yiman smiled slightly and said in a soft voice, “Please give me a bouquet of tulips, thank you.” ",
        "“Okay, sir. Are you going to visit a friend?”",
        "The girl skillfully began to wrap the flowers.",
        "He smiled and gently said, “You could say it’s for my boss.”",
        "“Huh?” The girl looked at him, confused. She glanced back at him just as he smiled with his eyes, and her face turned red. She quickly turned away and said, “Then… then can I add some sunflowers for you?” ",
        "“Sure, I don’t know much about flowers. If you think it’s appropriate, feel free to choose.”",
        "That simple sentence made the girl’s face turn even redder.",
        "But Lu Yiman was being honest. If he could, he would’ve even asked Peng Duoduo’s older brother’s fans what kind of flowers they usually gave him.",
        "Once the flowers were wrapped, they looked more lively than the simple tulips—fitting the young girl’s enthusiastic and sincere touch. ",
        "He politely thanked her and left the shop, holding the bouquet.",
        "The agreed meeting place wasn’t far, and he could walk there.",
        "He wasn’t wearing a watch today, so he pulled out his phone to check the time, only to see a message from Yu Chuang.",
        "——”Lu Yiman, where are you?” ",
        "It was sent just one minute ago.",
        "He didn’t reply. But even that one minute was the limit of Yu Chuang’s patience.",
        "——”Lu Yiman, I’m coming to find you.”",
        "——”Wait for me.” ",
        "——”I’m here.”",
        "One message after another came through, filled with urgency and a heartbeat that could be felt even through the screen.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The phone’s screen naturally went dark, reflecting Lu Yiman’s deep gaze.",
        "How long had it been since they last saw each other? Eighty-four hours, five thousand forty minutes, three hundred thousand two hundred forty seconds. Oh, and the clock was still ticking. ",
        "Every second felt like sand falling through an hourglass.",
        "“Sir?” The young girl looked at him, puzzled, as he turned back.",
        "“Hello, could you please change them to roses?”",
        "Seeing the smile on his face, the young girl froze for a moment but quickly responded and hurriedly swapped the flowers for him. ",
        "“Oh, oh… alright, sir. The lilies here are also blooming beautifully. Would you like to add one to your bouquet?”",
        "“No, just the roses.”",
        "“Alright.”"
    ],
    "previous": "Chapter 35.2",
    "next": null
}