{
    "title": "Chapter 29.1",
    "content": [
        "“Don’t go!”",
        "Yu Chuang spread his arms and blocked him. ",
        "He raised an eyebrow, looking at the seriously angry face of the other person, while also noticing the people who turned to look because of the commotion.",
        "“Why aren’t you letting me go?”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Of course, it was because he was angry!",
        "But Yu Chuang couldn’t figure out why he was angry. Was it because Lu Yiman had just deliberately ignored him as a tease? That didn’t seem to be it either. ",
        "But he couldn’t say it out loud.\n\n",
        "He could get angry, but he couldn’t express why he was angry.",
        "Just like how he wouldn’t smile when he was happy, wouldn’t admit pain when he was hurt, and when he was angry, he could only express it through his actions.",
        "He didn’t want Lu Yiman to leave.\n\n ",
        "The veins on his forehead began to pulse, his eyes became dark and cold, and his hands slowly clenched into fists.",
        "Lu Yiman noticed his movement and wrapped his fist in his palm.",
        "“Why are you angry?” His voice softened.\n\n",
        "Yu Chuang’s eyes flickered, and his emotions immediately began to waver. ",
        "“Hmm? Why are you upset?” He loosened his hand and interlaced his fingers with his.",
        "A tingling sensation spread from Yu Chuang’s palm, making his heart melt.",
        "He opened his mouth, staring at Lu Yiman’s patient and gentle eyes. After holding back for a long time, he finally squeezed out three words.",
        "“I’m upset.” ",
        "Those eyes, full of tolerance, seemed to absorb all of his emotions.",
        "“Did I say something wrong?”",
        "Holding Yu Chuang’s hand, he had no interest in standing at the hotel entrance for people to watch and led him into the elevator.",
        "Yu Chuang followed obediently, and those terrifying, uncontrollable emotions from moments ago vanished as if they had never existed. ",
        "“No.”",
        "Lu Yiman hadn’t said anything wrong. Lu Yiman was the gentlest person in the world.",
        "",
        "He gazed at Lu Yiman’s profile, gradually losing himself in thought. Unconsciously, he tightened his grip on his hand, his pounding heart slowly calming down, turning into a steady peace.",
        "But as soon as the elevator doors closed, Lu Yiman let go of him. Yu Chuang’s heart tightened instantly, and he instinctively reached out for his hand. ",
        "But Lu Yiman was just pressing the elevator button.",
        "Yu Chuang’s outstretched hand paused, then he withdrew it, holding back his feelings.",
        "Through the reflective walls of the elevator, Lu Yiman observed his face, noticing his subtle actions.",
        "His deep almond-shaped eyes concealed even deeper emotions. ",
        "Uerhaps he was acting strange, too.",
        "Le wanted to provoke even more intense emotional reactions from Tu Jhuang.",
        "Dut when he saw Tu Jhuang on the verge of losing control at the hotel entrance, he couldn’t help but, like a sly foz, grasp his hand.",
        "And now he had let go again. ",
        "How devious of him.",
        "Staring at his reflection on the wall, his eyes became unfathomable.",
        "***",
        "Back in the hotel suite, Yu Chuang turned into his little shadow again. They hadn’t eaten outside because Lu Yiman could cook, and he often prepared meals himself in the hotel suite. ",
        "Yu Chuang followed by his side. When Lu Yiman went to wash the vegetables, Yu Chuang immediately stretched his hand out to dip his fingers into the water.",
        "When Lu Yiman went to crack an egg, Yu Chuang already had one in his hand.",
        "However, when Lu Yiman reached for the knife, Yu Chuang remained still, quietly holding the egg in his hand and watching him silently.",
        "And when he began to slice the vegetables, Yu Chuang took a step back, his earlier eagerness turning into careful restraint. ",
        "Lu Yiman noticed his movements but said nothing.",
        "After preparing a bowl of egg and tomato noodles for Yu Chuang, he grabbed a pack of cigarettes and headed to the balcony.",
        "",
        "“Lu Yiman.”",
        "Yu Chuang called out to him. ",
        "“What’s wrong?” He tapped a cigarette from the pack and held it between his fingers.",
        "The coffee table in the living room was low, and Yu Chuang sat on the carpet, his dark eyes staring straight at him.",
        "“Are you angry?”",
        "He was a little surprised and smiled, “Why do you say that? I’m not angry.” ",
        "Yu Chuang kept looking at him without saying a word.",
        "He held out the cigarette and gently said, “I’m just going to the balcony for a smoke.”",
        "With that, he walked away, closing the floor-to-ceiling window to the balcony behind him. He sat alone at the round table under the moonlight, lighting his cigarette, his long hair falling slightly before he tucked it behind his ear.",
        "Then he turned his head to look at the pool beyond the railing, leaving only a side profile for Yu Chuang to see. ",
        "Yu Chuang’s brow twitched as he tightly clutched his sleeve and quickly pulled a small book from his pocket.",
        "A very, very small book, only the size of his palm.",
        "He quickly flipped through the pages, which contained many key points and notes.",
        "Of course, such an exquisite and slightly absurd object could only have been prepared by his assistant. ",
        "It was made so small precisely so that he could carry it with him at all times.",
        "——”What to do if the person you like is angry.”",
        "——”Of course, you should hug them and tell them you love them.”",
        "With Yu Chuang’s current understanding of emotions, he hadn’t quite reached that level yet. ",
        "He frowned as he read on, his serious expression as if he were studying a multi-million dollar deal.",
        "——”Is your partner acting a bit differently? Though they’re still gentle with you, they seem to choose solitude.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Yu Chuang’s eyes lit up as he glanced at Lu Yiman, who was sitting alone on the balcony smoking. His long, pale fingers held the slender cigarette, and his elegant, handsome face appeared uniquely romantic under the moonlight.",
        "When his lips parted slightly, and the smoke drifted from his mouth, it added a striking sensuality. ",
        "Yu Chuang stared at him for a long time before snapping out of it and continued reading.",
        "——”Then, perhaps they are dealing with an unresolved worry. At this time, you should accompany them well.”",
        "Yu Chuang closed the little book in his hand and carefully placed it back into his pocket. Then, he lowered his head and finished eating the noodles Lu Yiman had made for him before cleaning the bowl himself.",
        "Finally, he found a soft cushion and thoughtfully placed it near the spot by the floor-to-ceiling window. ",
        "He sat down, turning his head to look at Lu Yiman, who was still gazing at the pool. Through the window, Yu Chuang silently and quietly accompanied him.",
        "***",
        "Outside on the balcony, Lu Yiman smoked slowly.",
        "Ever since that interview, his emotions had been a little off. ",
        "Even though those memories were now far behind him.",
        "But for someone who could remember everything as clearly as when he was three years old, these things were destined never to fade.",
        "He took another drag of his cigarette, the rich tobacco scent filling the air, bringing him back to his murky past.",
        "He could remember things from when he was three, yet he couldn’t recall when he first learned to smoke. ",
        "He had been walking his path alone for far too long.",
        "Staring at the reflection of the moon in the pool, he let out a silent laugh.",
        "***",
        "The character “Lu Yiman” in the book was strikingly similar to him. ",
        "But when they were seventeen, they made entirely different choices.",
        "“Lu Yiman” chose to return to his mother’s side, to a place that may or may not be called a “home,” while he chose to leave, growing up alone.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "From that moment on, he threw himself into his studies with fervor.",
        "The boy, once burdened with so much, suddenly shed his load, only to be enveloped by even darker shadows. ",
        "He refused to allow himself to be inferior to anyone. That day, standing on the awards stage and looking at his glamorous mother, what came to his mind was his father, too poor to even afford a suit for their wedding photo, having to borrow one from a shop.",
        "Did his mother feel wronged at that time?",
        "His father had given her all his love, building a fortress for her in the midst of their difficult life, but the one thing he couldn’t provide was wealth, freedom from the worries of survival.",
        "It wasn’t until he was returned by the adoptive family at the age of seven that the orphanage director handed him a parcel. ",
        "Inside were a pristine wedding dress and a well-preserved black suit.",
        "These were the two things his father had often spoken of with both pride and great care.",
        "When his adoptive family sent him back to the orphanage, his mother mailed these two items there.",
        "It was from that moment on that he understood: he was truly an orphan. ",
        "As a child, he didn’t understand why his mother had taken these two things away, only to send them to him at that time.",
        "When he grew up, he no longer wished to understand.",
        "At seventeen, he did not take the 10,000 yuan offered to him; instead, he turned and walked away.",
        "That same night, he burned the two items that had been his mental and emotional support throughout his childhood into ashes. ",
        "The stains on that suit had been faint, just a tiny mark on the chest the size of a grain of rice.",
        "But it didn’t matter anymore.",
        "He had no money, no home, no support. All he had was effort and an indomitable heart.",
        "Without the means to learn piano, he sat outside the piano room every day, listening, drawing the black-and-white keys by hand to teach himself. ",
        "Unable to afford a teacher, he spent his days in the library, poring over books in English, German, French…",
        "He memorized bit by bit, listening with his old phone, repeating it over and over.",
        "Please visit chrysanthemumgarden (dot) com",
        "By day, he attended classes; by night, he worked as a waiter in a bar.",
        "On his first day, he didn’t know how to smile, but by the second, he had learned to navigate between different private rooms. ",
        "He met all kinds of people and gradually learned how to smile, how to walk, how to engage in conversation.",
        "He even learned how to stand out and become the most unique person in a crowd.",
        "Eventually, he was noticed and invited to play piano in high-end cafés. What began as clumsy became skilled. He gained more opportunities to interact with people, and his once hesitant and awkward pronunciation became more fluent.",
        "He then entered more lavish parties, witnessing the so-called high society that didn’t belong to his world. ",
        "Decadence, indulgence, and hedonism—drunk on luxury and excess.",
        "He moved among them, always finding a way out cleanly.",
        "All of this shaped the person he is today and led to his current success.",
        "But the ashes from that night, the things he burned, will never truly disappear from his life. ",
        "He simply accepted that part of his past, facing his former self head-on.",
        "Because he would never allow the past to control him."
    ],
    "previous": "Chapter 28",
    "next": "Chapter 29.2"
}