{
    "title": "Chapter 28",
    "content": [
        "After Yu Chang left, Lu Yiman didn’t continue with his work.",
        "He held a cigarette between his fingers, gazing at the clear sky outside. ",
        "Then he lowered his eyes again and let out a heavy sigh.",
        "Now, he felt a bit like an irresponsible bad guy.\n",
        "",
        "Well, even though yesterday all he did was ask for a kiss.",
        "But that meant he had lost the composure he used to have. Otherwise, he would have known that now wasn’t the right time. ",
        "The cigarette was nearly smoked down, and when the last bit of ember burned out, he lit another one.\n\n",
        "Just then, his phone received a picture message, showing a stern Yu Chang sitting upright, with a furrowed brow, seemingly suppressing his impatience.",
        "The number was unfamiliar.",
        "But he knew it was Reed.\n\n ",
        "Only Reed would do something so pointless.",
        "Oddly enough, Reed was exactly the friend that Mr. Chen hoped he would make.",
        "It had to be said, Mr. Chen was truly a remarkable person. He could become lifelong friends with the elderly Professor Yang and also get to know a young, exuberant person like Reed.\n\n",
        "If Mr. Chen had any interest in business, he might even have been able to compete with the top three companies. ",
        "He recognized Reed, and Reed had probably recognized him long ago.",
        "It’s just that he hadn’t reached out to Reed, and he didn’t know where Reed had gotten his contact information. But for someone like Reed, it probably wasn’t difficult.",
        "—Hey, I found something really interesting.",
        "Reed sent a message mixing clumsy Chinese with German. ",
        "Before Lu Yiman could reply, another picture came through.",
        "It was of Yu Chang raising his arm while drinking coffee, with the camera focused on his sleeve.",
        "— There’s actually a flower hidden inside!",
        "— Oh my god, what a cute little treasure! ",
        "Several exclamation marks conveyed Reed’s strong excitement.",
        "Lu Yiman’s brows furrowed, and he calmly made a call.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "On the other end, Reed had been secretly observing Yu Chang, and the sudden call startled him.",
        "“Good heavens, my phone nearly fell into the coffee cup!” ",
        "Reed complained in frustration.",
        "Yu Chang glanced at him.",
        "But Reed, being his usual outgoing self, immediately said excitedly into the phone, “Did you see that? Isn’t it cute?”",
        "Lu Yiman thought he hadn’t pointed out anything specific, so Yu Chang wouldn’t understand what Reed was talking about. In reality, Reed’s eyes were practically sparkling as he stared at Yu Chang. ",
        "Yu Chang frowned again, feeling like he was wasting his time sitting here!",
        "After this, he would no longer accept Reed’s invitations, nor would he engage in any future cooperation with him!",
        "“Reed, you’re really rude.”",
        "Lu Yiman said these words calmly, as the once clear sky suddenly became overcast with dark clouds. ",
        "Reed pouted, casually leaning back in his chair, crossing his legs. “Did you call just to scold me?”",
        "Sometimes, Reed really hated people who were constantly so righteous.",
        "Did they never lose their composure?",
        "Lu Yiman exhaled a puff of smoke and softly said, “Of course not.” ",
        "“Then do you want to be friends with me?” Reed suddenly burst out laughing.",
        "Yu Chang, who had remained silent, frowned again and turned his body, lifting his coffee cup, signaling with his actions that he was fed up with the noise.",
        "“I want you to delete all the photos related to Yu Chang.”",
        "His gentle tone carried an unexpectedly aggressive demand. ",
        "Reed was stunned for a moment, then he stared at Yu Chang with great interest and smiled, “What if I refuse?”",
        "“Then I’ll come find you tonight.”",
        "",
        "Good heavens, just listen to the terrifying things this man says!",
        "Reed’s expression changed, and he said resentfully, “You’re such a boring man. Don’t you know that night is my party time?” ",
        "He was interested in Yu Chang, but he was also interested in all the cute people in this world.",
        "He had just taken a liking to the little cutie who served him coffee earlier and had already decided to “get to know them better” tonight. But Lu Yiman—this man—was just too much!",
        "Well, Reed was just playing around anyway.",
        "“Men’s possessiveness is truly terrifying,” he muttered, raising an eyebrow. Under Yu Chang’s cold gaze, Reed hung up the phone. ",
        "Yu Chang was practically radiating coldness.",
        "Ever since their first meeting left a bad impression, every encounter between Yu Chang and Reed had been unpleasant.",
        "Reed could sense that Yu Chang didn’t like him, but he still enjoyed inviting him out, using business discussions as an excuse just to hear Yu Chang speak a little more.",
        "What a shame—he had even recorded their conversations. But now, he could only delete them. ",
        "“It’s unfortunate that we couldn’t come to an agreement, but I hope we’ll have another chance to work together in the future.”",
        "Once again, they parted ways on a bad note. Reed stood up, offering his hand for a handshake.",
        "Since the negotiation had fallen apart, there was nothing more to say.",
        "Yu Chang glanced at Reed’s outstretched hand, stood up without looking back, and left. Knowing there would be no future collaborations, he didn’t even say goodbye. ",
        "Watching Yu Chang’s departing figure, Reed chuckled softly. He thought, maybe one day he would visit Yu Chang’s country.",
        "With such an interesting person, that must be a very interesting place.",
        "***",
        "As the car drove out onto the main street, they passed by a flower shop. Tu Jhang asked his assistant to stop the car. ",
        "Le got out, but as soon as he reached the shop, the overcast sky began to pour with rain.",
        "The assistant hurried to get an umbrella, but was stopped by Mr. Secretary.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“What’s wrong?”",
        "The assistant looked at him in confusion, only to see the composed secretary gazing ahead, adjusting his glasses without saying a word. ",
        "Yu Chang arrived just in time, avoiding the rain. The shopkeeper, looking at the heavy rain outside, smiled and said, “Sir, you can take shelter from the rain here. Come on in.”",
        "In private, Yu Chang was not much of a talker, and when he spoke too much, he often became involuntarily nervous.",
        "He was dressed in an overcoat, with a suit underneath, and his hair was neatly combed. He looked like a handsome business elite, but in reality, his hand at his side was quietly gripping his sleeve.",
        "“Hello.” ",
        "He deliberately paused for a moment, to prevent himself from stuttering when speaking in long sentences.",
        "“I’d like to buy some flowers.”",
        "The shopkeeper smiled warmly at him, enthusiastically asking, “What kind of flowers would you like, sir? Are they for a family member, or for a loved one?”",
        "Yu Chang’s face reddened slightly, but his expression remained unchanged, looking as serious as ever. ",
        "“Roses.”",
        "He avoided the shopkeeper’s question but subtly answered it anyway.",
        "The book had said: when you pass by a flower shop, buy a bouquet of flowers for the one you like.",
        "He was learning how to express himself. ",
        "“Very well, sir. Please wait a moment.”",
        "The shopkeeper smiled and immediately wrapped a bouquet of vibrant roses for him.",
        "Each delicate rose seemed to remind him of Lu Yiman: like the rose brooch Lu Yiman had once given him, like the rose earrings Lu Yiman wore that night at the bar, and like the paper rose Lu Yiman had folded for him under the moonlight.",
        "He found himself thinking of Lu Yiman more and more. From now on, every rose he saw would carry Lu Yiman’s shadow. ",
        "Holding the bouquet with satisfaction, he turned around, but the rain outside was too heavy.",
        "He had no choice but to stand at the entrance, puzzled as to why his assistant hadn’t come to fetch him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The shopkeeper was about to offer him an umbrella, but upon seeing a man in a trench coat approaching, he wisely stopped himself.",
        "Yu Chang tilted his head, staring up at the gloomy sky overhead. ",
        "Cold raindrops splashed onto his face and fell onto the vibrant red petals.",
        "He blinked, and suddenly saw the dark canopy of an umbrella sheltering him from above.",
        "His heart skipped a beat, and he followed the hand holding the umbrella to the person standing beside him.",
        "The other man smiled gently, his face full of warmth. ",
        "“I was worried you didn’t bring an umbrella, so I came to get you. But then I realized you’re going home by car, so it seemed unnecessary. Still, since I was already on my way, I figured I’d come and find you.”",
        "Yu Chang didn’t bother wondering how the man knew he was here.",
        "He looked into Lu Yiman’s eyes, eyes that seemed to hold him completely, and it felt as if his heart was falling right into them.",
        "“Ready to go?” ",
        "Lu Yiman asked.",
        "“Yes.”",
        "And so, without a second thought, Yu Chang stood under Lu Yiman’s umbrella and followed him through the rain, without hesitation.",
        "Even as they walked straight into the pouring storm. ",
        "Perhaps this symbolized that now and in the future, Yu Chang’s choices would always be just as straightforward.",
        "The hotel wasn’t far from here.",
        "After walking for a while, Yu Chang suddenly realized something. He stopped and turned to look at Lu Yiman with a serious expression.",
        "Lu Yiman gazed at him patiently, still holding the umbrella over his head. ",
        "“Here.”",
        "Yu Chang placed the roses into Lu Yiman’s arms, looking directly into his eyes and said, “Roses, they’re beautiful.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Crabapple blossoms and lilies weren’t his favorite flowers, but those two had deeply significant memories in his past.",
        "So, he recalled that in his memories of joy, anger, sorrow, and happiness, there were only these two types of flowers. ",
        "But now, there was also the passionate color of roses added to the mix.",
        "Lu Yiman caught the vibrant roses in his arms but didn’t speak for a long time.",
        "The sound of rain pattering against the umbrella wasn’t crisp, but it struck a chord deep inside.",
        "Lu Yiman let out a sigh. ",
        "He looked up at Yu Chang and lowered the umbrella.",
        "“Thank you, I really like them.”",
        "The soft, gentle tone made Yu Chang feel a tingling sensation throughout his body.",
        "Feeling the warmth of breath, light and fleeting against his lips, Yu Chang experienced a heart-throbbing moment like never before. ",
        "It should be said that all his feelings of excitement came from Lu Yiman.",
        "The other stopped just at the point where their lips almost touched but didn’t.",
        "So light, it felt like the air itself had gently kissed him.",
        "Yu Chang’s heart was in disarray, with waves of heat rising to his head. ",
        "Through his dazed eyes, he knew—it was over. He had completely fallen into the vortex that was Lu Yiman.",
        "***",
        "In the afternoon, Lu Yiman went to a studio for a magazine interview, which was also recorded on video and would be aired later.",
        "He sat on the sofa, composed, his naturally distinguished appearance showing through without any excessive grooming. ",
        "The reporter was a voluptuous and glamorous woman. Her tight white blouse outlined her figure in a very seductive way, to the point that she hadn’t buttoned it completely, and the lanyard with her name tag hung perfectly on her chest.",
        "“It’s an honor to meet you, Mr. Lu.”",
        "",
        "The last line of address was spoken in clumsy Chinese.",
        "But the sincerity behind it made Lu Yiman smile. He had always been a gentle man who easily left a good impression on people. When he chose to close the distance with someone, no one could resist. ",
        "“I’m also very happy to meet you, Ms. Greya.”",
        "He glanced at her name tag and then politely looked away.",
        "“Oh, your German is very good, but we can also communicate in English.”",
        "The smooth exchange clearly delighted and satisfied her, making her work much easier. ",
        "Besides, who wouldn’t enjoy chatting with such a kind and gentlemanly person?",
        "Greya was already starting to feel excited.",
        "“Alright.”",
        "He immediately switched to English, and his already soft voice became even more pleasant in certain tones. ",
        "Greya was a bit curious. “It’s rare to meet someone with such perfect pronunciation who also speaks several other languages. Did you study them specifically, Mr. Lu?”",
        "Lu Yiman smiled softly. “Yes, I enjoy learning. I was especially passionate about it when I was younger.”",
        "He used the word “passionate,” which made Greya glance at him in surprise before smiling. “I thought that word would be far from someone like you.”",
        "Because anyone who saw Lu Yiman for the first time would assume he came from the upper class, had a happy family, and was well-educated and affluent. ",
        "Such a person would be poised and graceful, always maintaining an air of decorum, a unique blend of elegance and calm.",
        "Just one glance would be enough to be captivated by his distinctive aura.",
        "“Is that so? Perhaps everyone has been deceived by my false appearance,” he blinked playfully, making a little joke that was half-true and half-false.",
        "Greya could tell he had evaded the question. No journalist could resist being curious, but there were more important questions ahead, and with time limited, she had no choice but to let that topic go with some regret. ",
        "Next, Greya began the interview, focusing on the competition and his design philosophy.",
        "Greya was a very professional individual with an excellent sense of art. Lu Yiman didn’t need to explain everything word for word; their communication was smooth and pleasant.",
        "",
        "“‘One Cut Studio’—what a unique name,” Greya remarked with an intrigued expression.",
        "Lu Yiman smiled, “I wanted something simple, something that people could easily remember.” ",
        "“You’re right. I think all the staff here will remember it now,” Greya said with a friendly laugh.",
        "“I’ve heard that you’ve never designed menswear. Is that because women’s fashion is easier to market? You know, most people in the industry believe it’s easier to make money off women, and I must admit, we are all lovers of beauty.”",
        "Greya’s question was rather sharp.",
        "Yu Chang, standing just outside the recording area, frowned slightly and leaned toward the secretary, giving him some instructions. ",
        "The secretary nodded, adjusted his glasses, and left.",
        "“I won’t deny that’s part of the reason. Many men are stingy, and I’m a stingy man myself.”",
        "His words were ambiguous, somewhere between truth and jest. Greya studied him for a moment, as if wanting to pursue the topic further. After all, even a fashion magazine needed attention-grabbing topics now and then.",
        "“But a bigger reason has to do with my father.” ",
        "However, Lu Yiman’s next words cut off her opportunity to delve deeper.",
        "“He only wore a suit once, for his wedding photos. It was a rented suit. Later, when it got stained by accident and couldn’t be returned, he had no choice but to buy it, heartbroken. He always regretted it, because that money could have covered two months of rent.”",
        "He smiled. “But he did buy a beautiful wedding dress for my mother.”",
        "“Wow, your father must have loved your mother very much.” ",
        "“Yes.”",
        "“Is your black wedding dress inspired by the one your father bought for your mother?”",
        "“Yes.”",
        "The smile on his face faded slightly, and for a moment, his gaze became distant. But it was only for a moment, and he quickly regained his composure. ",
        "“That’s truly a unique inspiration. It must symbolize your father’s love for your mother—a poor, young man who was so frugal with his own suit but willing to spend his savings on a wedding dress for the woman he loved.”",
        "Greya was already lost in her romantic imagination.",
        "",
        "Lu Yiman simply smiled and said nothing.",
        "“Is that suit still around?” ",
        "An item with such deep meaning surely would have been carefully preserved.",
        "Perhaps in old age, one would point to that suit and say, “Look, I couldn’t bear to buy it at the time, but fate left it with me.”",
        "And those eyes would be filled with fond memories and affection for that suit.",
        "It symbolized a past that was both impoverished and sincere. ",
        "“No, it’s not.”",
        "Greya was momentarily stunned and asked, “Was it lost?”",
        "“No.” He smiled, but there was something strange about that smile that made Greya uneasy.",
        "“And what about the wedding dress?” she asked. ",
        "“It’s gone too.”",
        "She looked into his eyes, hesitated for a moment, and then tentatively asked, “Why?”",
        "Lu Yiman looked directly at her, smiled faintly, and said, “I burned them—the white wedding dress and the black suit, both gone in flames.”",
        "The pure white wedding dress turned into black ashes in the red flames. ",
        "It was like a rose blossoming from the soil of death.",
        "Artists often associate love and death with deeper meanings.",
        "Greya was suddenly startled, and when she came back to her senses, her expression wasn’t as pleasant as before.",
        "Lu Yiman still hadn’t explained why he didn’t design menswear, and Greya hesitated, wanting to probe further. ",
        "Sometimes, a designer’s personal life can be more intriguing than their work.",
        "But suddenly, a voice came through her earpiece, instructing her not to ask any more questions.",
        "",
        "She paused and glanced toward the man standing outside in a black suit.",
        "His handsome, stern face and the aristocratic, elite air he exuded were unmistakable. ",
        "Good heavens, how many wealthy people are there in this world?",
        "Suppressing her disappointment and frustration, she maintained her polite smile and wrapped up the interview with Lu Yiman on a somewhat cordial note.",
        "“Mr. Lu, it was a pleasure speaking with you. I hope we can collaborate again in the future.”",
        "He looked at her false smile and couldn’t help but chuckle. Shaking her hand, he politely responded, “The pleasure was mine.” ",
        "***",
        "As they stepped out of the studio, the ground still carried the dampness of the heavy rain that had fallen earlier in the morning.",
        "A light drizzle, carried by the wind, brushed against their bodies, bringing a cool, wet chill.",
        "Yu Chang stood at the entrance with an umbrella, waiting for him. When he saw Lu Yiman walk out, his eyes immediately focused on his face. ",
        "“It’s over, let’s go.”",
        "Naturally, Lu Yiman took the umbrella from Yu Chang’s hand. The slight difference in their heights made them look harmonious under the umbrella.",
        "Yu Chang quietly followed by his side, not asking about the interview, and Lu Yiman didn’t bring it up either.",
        "They got into the car together, with small droplets of water clinging to Lu Yiman’s shoulders, and even his braid seemed to glisten with tiny, transparent pearls. ",
        "Yu Chang’s gaze lingered on his braid for a few seconds before he suddenly grabbed it.",
        "Lu Yiman, who was bending down to close the umbrella, was caught off guard when his braid was tugged. He paused, then couldn’t help but laugh.",
        "“You seem to like it a lot.”",
        "Yu Chang rubbed the water droplets off the braid before letting go. ",
        "Hearing Lu Yiman’s comment, he responded honestly, “It looks good.”",
        "The first time they met outside the bar, Lu Yiman’s braid was tied at the back of his neck, not easy to notice. But ever since that day, his braid had hung over his shoulder, and as it grew longer, it added a certain sensual charm to his otherwise refined demeanor.",
        "",
        "Why does a grown man always have a little braid hanging over his chest?",
        "It kept drawing Yu Chang’s eyes to it. ",
        "“Thank you for the compliment,” Lu Yiman replied with a smile.",
        "The car drove back to the hotel where Lu Yiman was staying. The assistant had silently accepted the fact that his boss hadn’t returned the entire night.",
        "He had wanted to share with the secretary what he had observed on the plane, but the indifferent secretary wasn’t interested and had even refused to engage in conversation.",
        "What frustrated the assistant was that even though the secretary hadn’t seen or heard as much as he had, he was always able to perfectly anticipate the boss’s reactions. ",
        "Eventually, through the secretary’s gaze, the assistant understood one thing:",
        "He was dumb.",
        "He was a foolish man.",
        "And so, he could only resign himself to being the silent driver. ",
        "As the car pulled up to the hotel entrance, Yu Chang naturally followed behind Lu Yiman.",
        "From following him to the studio for the interview in the afternoon, to standing outside waiting for him to finish, and now, like a little shadow, following him back to the hotel—it all felt very natural.",
        "But suddenly, Lu Yiman stopped in his tracks. Caught off guard, Yu Chang walked past him, taking a few more steps before realizing he wasn’t moving. Turning around, he looked at him in confusion, as if to ask why he had stopped. Weren’t they heading back?",
        "Lu Yiman met his gaze and, with a smile, said, “There’s only one bed in the hotel suite.” ",
        "Yu Chang knew that, so what?",
        "“I don’t want to sleep on the couch tonight.”",
        "For a man who’s 1.87 meters tall, that single sofa was way too uncomfortable.",
        "Yu Chang thought for a moment, then his eyes flickered slightly as he looked at Lu Yiman’s face and said seriously, “We can sleep together.” ",
        "He hadn’t considered going back to his own hotel.",
        "“Sleep together?”",
        "",
        "Lu Yiman raised an eyebrow, repeating his words.",
        "Yu Chang nodded, “Yes, sleep together.” ",
        "Lu Yiman stepped forward, walking past him lazily. “I’m not used to sleeping with other people.”",
        "Yu Chang pressed his lips together, his eyes fixed on Lu Yiman’s back.",
        "Other people?",
        "He didn’t even consider himself as “other people.” ",
        "Taking a few big strides forward, Yu Chang turned his head to look at Lu Yiman’s face.",
        "But Lu Yiman turned his head away.",
        "Yu Chang circled around to the other side to look at him again, and once again, Lu Yiman turned his head in the opposite direction.",
        "After several back-and-forth attempts, Yu Chang grew angry. ",
        "And he was very, very angry."
    ],
    "previous": "Chapter 27.2",
    "next": "Chapter 29.1"
}