{
    "title": "Chapter 11",
    "content": [
        "After he finished speaking, Yu Ziming lowered his head a little awkwardly. He clenched his fingers, and his voice gradually softened, but the determination within it did not wane.",
        "“I’m very happy and grateful to Professor Yang, so I don’t want to miss this opportunity.” ",
        "He then looked up at Lu Yiman, his eyes bright and sparkling, with a trace of shyness and a faint sense of relief, while a hint of wistfulness was buried deep inside.",
        "“Yiman-ge, I’m leaving tomorrow.”\n",
        "",
        "After saying this, the suppressed emotions in his heart were completely released, and he felt much lighter.",
        "Sometimes, making a change might be the best way to deal with a stagnant situation. ",
        "“So soon?” Lu Yiman was a little surprised.\n\n",
        "“Yes, I’m afraid that if I stay longer, I won’t want to leave.”",
        "He smiled, his eyes curving like crescent moons.",
        "Lu Yiman’s gaze softened. The smiling Yu Ziming still carried the youthful innocence of a boy.\n\n ",
        "He raised his hand, patted him on the shoulder, and gently said, “If you’ve really made up your mind, then I support you. I also believe you’ll achieve great things in the future.”",
        "Yu Ziming smiled at him, then lowered his head to hide his slightly reddened eyes. The confusion and unease about the unknown future were suddenly replaced by a newfound strength, thanks to Lu Yiman’s gentle support.",
        "“If you run into any financial difficulties, feel free to tell me.”\n\n",
        "“No need, Yiman-ge. Professor Yang said that if I’ve made up my mind, he’ll help me apply for a dedicated funding channel.” ",
        "“That’s good. I wish you all the best on your journey.”",
        "“Thank you, Yiman-ge, thank you.”",
        "Meanwhile, on a hospital bed, Yu Chuang lay with a high fever that wouldn’t subside, his brow tightly furrowed. Upon seeing him like this, Yu Chuan couldn’t hide the worry on his face.",
        "Then he noticed that Yu Chuang was tightly clutching a black coat. Suppressing his frustration, Yu Chuan asked, “Where did this coat come from?” ",
        "The assistant quickly answered, “It seems to belong to Mr. Lu.”",
        "“Seems?” He raised an eyebrow.",
        "The assistant, feeling nervous, immediately replied with certainty, “I’m sure. This coat belongs to Mr. Lu. When the young master came back, he was wearing this coat.”",
        "Yu Chuan fell silent, but his gaze darkened considerably. ",
        "Meanwhile, Yu Chuang, lying on the bed, seemed to be dreaming. His brow furrowed, and his fingers tensed, tearing a small hole in the not-so-thick fabric with his nails.",
        "Yu Chuan’s eyes darkened further, and he said in a low voice, “Investigate Yu Ziming… no…” His lips parted slightly, “Investigate Lu Yiman.”",
        "",
        "…",
        "Today was a rare day of good weather. The constant rain of the past few days had given way to bright sunshine, and even the morning air felt fresher, as if signaling the brightness of the road ahead. ",
        "Lu Yiman took Yu Ziming to the airport. Along the way, the other person didn’t say a word, staring blankly. Several times, he took out his phone, stared at it for a moment, then put it back without even turning on the screen.",
        "“Did you forget something?” Lu Yiman asked gently, as concerned as ever.",
        "The hesitant Tu Iiming snapped back to reality, stared at him for a moment, then gave a faint smile and took a deep breath, saying, “No.”",
        "Nor could there be. ",
        "Le had finally made up his mind to leave, and he couldn’t let himself be held back by such things anymore.",
        "Casting aside all the thoughts in his heart, he smiled lightly, his eyes sparkling as he looked at him.",
        "“Thank you, Yiman-ge.”",
        "“You’ve already said thank you so many times,” Lu Yiman said with a slight chuckle. ",
        "Yu Ziming couldn’t help but laugh as well. Yes, he had already thanked him many times.",
        "People passed by him in a blur, turning into indistinct shadows. Standing tall before him was Lu Yiman, and for some reason, he felt a little dazed, with a touch of indescribable melancholy.",
        "“Yiman-ge…” he murmured, unconsciously tightening his grip on his suitcase.",
        "“What’s wrong? Are you reluctant to leave?” Lu Yiman smiled, his eyes glimmering like waves. ",
        "Yu Ziming paused, suddenly snapping back to his senses, and for a moment, he was fully awake.",
        "In that instant, the internal tug-of-war nearly made him want to retreat.",
        "But he couldn’t. He couldn’t give up so easily.",
        "He exhaled a breath of turbid air, firmly suppressing the terrifying retreat and hesitation in his heart. Lifting his head high, he tried to appear more confident. ",
        "“How could that be? I’m going to become a painter in the future, and everyone will know my name, Yu Ziming.”",
        "“That’s good,” Lu Yiman smiled gently, his voice softening as the corners of his mouth lifted.",
        "",
        "Yu Ziming didn’t dare to delay any longer; he had an inexplicable feeling tugging at him, as if something wanted him to stay on this land.",
        "He was really leaving. ",
        "As he took his first step, the sudden sinking feeling in his chest startled him. Going abroad alone was far more difficult than he had imagined.",
        "But still, he walked forward.",
        "With that first step, it felt as though he had broken through an invisible barrier.",
        "The swirling emotions in his heart surged even more violently, to the point where it frightened him. ",
        "He turned his head and looked back at Lu Yiman, who was watching him leave.",
        "The other stood amidst the crowd, backlit, hands in his pockets. His tall, elegant figure stood out among the masses. The shadows obscured his face, but the occasional flicker of light on his hair and the smooth contours of his face gave the impression that he was smiling.",
        "He was always smiling, with a warmth and radiance that could stop anyone in their tracks, evident from the halted steps of those around him.",
        "But suddenly, a sense of unfamiliarity washed over Yu Ziming, so intense it made his heart race. ",
        "“What’s the matter, Ziming? Did you forget to bring something?” Lu Yiman’s gentle voice brought him back to reality. Even though they were only a few meters apart, the distance felt like it stretched to the ends of the earth.",
        "Shaking his head, Yu Ziming forced himself to focus.",
        "“No, Yiman-ge, I…”",
        "He struggled to open his mouth, his hands clenching tighter and tighter. ",
        "“Yu Chuang might have some kind of illness, maybe related to his background. He didn’t originally have the surname Yu; he changed it later. He…” He muttered, unsure of what he was even saying, his head swimming with dizziness.",
        "His brow furrowed deeply, and sweat began to bead on his forehead.",
        "Suddenly, he stopped talking. His expression froze as he thought of the black tie hanging on the balcony of the apartment, and the way Lu Yiman occasionally looked at Yu Chuang.",
        "He opened his mouth slightly, hesitating. “Yiman-ge, you need to think carefully.” ",
        "The air was still for a moment.",
        "“Alright, thank you.”",
        "",
        "Hearing that gentle response, Yu Ziming looked at the figure standing in the shadows, and for some reason, the emptiness inside him deepened.",
        "“I’m leaving now, Yiman-ge. Goodbye.” ",
        "The last two words were as light as the wind. He took one final, deep look at the figure standing in the shadow, and this time, he didn’t look back.",
        "As his steps grew lighter and lighter, everything behind him faded into the distance. But it felt as if something had been forcibly torn away from his heart, leaving an emptiness, as if all the past had nothing more to do with him.",
        "As Yu Ziming’s figure disappeared into the crowd, a ray of light stretched out like golden threads, casting over half of Lu Yiman’s body.",
        "The half-lit face lifted slightly into a smile. ",
        "“Yu Ziming, goodbye.”",
        "He turned around, greeted by the dazzling golden light, and answered his phone as he headed toward the exit.",
        "“Professor Yang…”",
        "He smiled, his downcast eyes slightly curved. When he lifted them again, they were filled with a brilliant light that made passersby frequently turn their heads. ",
        "Under the blue sky and white clouds, he stopped, lit a cigarette with one hand, and parted his smiling lips. The thin white smoke blurred his face.",
        "Save the protagonist?",
        "From this moment, the story would no longer follow its predetermined course.",
        "Everything would be a new beginning. ",
        "His deep almond-shaped eyes gazed ahead. He extinguished the cigarette butt, flicked his fingers, and the half-smoked cigarette was tossed into the trash can by the roadside. He then took a long stride forward, his ponytail catching the last breeze.",
        "…",
        "By the time Yu Chuang awoke, the sun had already set, and the rare good weather brought with it a magnificent afterglow. The sky was bathed in shades of orange and purple, nearly covering half the horizon.",
        "Sitting in bed, Yu Chuang felt a bit disoriented, staring blankly out the window before suddenly lowering his head to silently inspect the piece of clothing in his hands. ",
        "Near the collar, there was a small tear, made by his fingernail at some unknown time, and his index finger had unconsciously poked through it.",
        "The tear was just wide enough for one finger.",
        "",
        "He stared at it with a frown for a moment, then, in frustration, tossed the garment aside. Despite his annoyance, it was hard to ignore the tear in the high-quality coat.",
        "When Yu Chuan entered the room, he saw Yu Chuang fixated on the coat at the foot of the bed, his face tense in silent conflict. ",
        "He paused for a moment before speaking. “Brother?”",
        "Yu Chuang looked up at him, his expression blank.",
        "“Brother, are you feeling better now?” Yu Chuan asked, relieved as he walked over and touched Yu Chuang’s forehead.",
        "The fever had broken, and Yu Chuan’s anxiety visibly eased. ",
        "He was always particularly worried when Yu Chuang got sick, because Yu Chuang was the type who wouldn’t say anything, no matter how uncomfortable he felt. The more critical the situation, the less likely he was to speak up.",
        "“Brother, you shouldn’t attend the Pearl Coast banquet tonight. You should rest for a while instead.”",
        "Yu Chuang’s health was more important than any event.",
        "However, Yu Chuang frowned. ",
        "He was already feeling better, and after sweating so much, he was restless from lying down.",
        "“No need.”",
        "He lifted the blanket and got out of bed, casting a glance at the black coat at the foot of the bed before quickly looking away.",
        "Yu Chuan opened his mouth, as if he wanted to say something, but ultimately remained silent. ",
        "Even if Yu Chuan didn’t want to speak, Yu Chuang still asked, “Where’s Ziming?”",
        "Removing his shirt, he glanced back at Yu Chuan.",
        "Yu Chuan coughed but said nothing. No matter how decisive he was outside, in front of Yu Chuang, he instinctively lowered his head.",
        "“Speak!” Yu Chuang demanded, growing impatient. ",
        "Yu Chuan immediately straightened up and looked at him directly. But when their eyes met, he instinctively averted his gaze.",
        "“Yu Ziming has left.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Left?”",
        "“He went abroad.” ",
        "Yu Chuang’s expression darkened. He hadn’t finished buttoning his shirt, revealing a broad, muscular chest, but his stern face still exuded an undeniable pressure.",
        "“When?”",
        "Yu Chuan silently counted; this time Yu Chuang had spoken four words in one go, more than usual.",
        "“This morning.” ",
        "He raised his eyes to Yu Chuang and opened his mouth, “Yesterday morning…”"
    ],
    "previous": "Chapter 10",
    "next": "Chapter 12"
}