{
    "title": "Chapter 26",
    "content": [
        "Entering the backstage, Lu Yiman hadn’t removed his makeup yet, and Dani was already waiting there.",
        "Her eyes were locked onto the black wedding dress he was wearing. ",
        "Of course, if she hadn’t dropped out, it would have been her wearing that dress. She would have been today’s center of attention, the “Black Swan.”",
        "“Sir, it’s a bit unfair to dismiss me just because I was late.”\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Dani’s eyes were filled with rage, along with a raw jealousy.",
        "No one knew she was on the verge of losing her sanity. Something that was supposed to be hers was slipping away, and she couldn’t accept it. ",
        "“Miss Dani, your questioning means nothing to me right now.”\n\n",
        "He pushed back the curls from his forehead, revealing his eyes.",
        "Those usually gentle eyes now had a sharp intensity.",
        "“Miss Dani, as a model, you are simply terrible. You’ve completely disregarded your professional ethics and lack any sense of contractual obligation.”\n\n ",
        "His harsh tone made Dani’s face change. The well-mannered, tall man suddenly became incredibly intimidating, causing her to stumble back a step.",
        "She opened her mouth to say something, but the force of his gaze seemed to pierce her soul, exposing the filth she had hoped to hide.",
        "He knew everything.\n\n",
        "“I didn’t… I was just…” ",
        "“You just assumed that, as a small-time designer, I wouldn’t discover your secret. Even if I did, I wouldn’t do anything because, if I didn’t want my show to be ruined, I would still need you.”",
        "Lu Yiman remained calm, but his calmness now felt chilling.",
        "“Although I’m the unlucky one who was chosen, I have to say, you’ve overestimated both yourself and your boyfriend’s abilities. And to abandon your career for a man? You’re far too foolish.”",
        "Dani’s face instantly turned pale, speechless. ",
        "Just as Lu Yiman had said, she was romantically involved with one of the competing designers. As the last remaining model, the final designer would inevitably have picked her.",
        "Even if it wasn’t Lu Yiman, it would have been some other unfortunate soul.",
        "But Lu Yiman, despite seeming approachable, was in fact extremely distant in how he handled things.",
        "Dani had no chance of getting close to him. Contrary to his outward appearance, he was not easy to approach. ",
        "So, she intentionally showed up late for the rehearsal, knowing it would cause significant psychological stress and test the adaptability of any designer.",
        "Especially for a new designer with no connections, traveling far from home.",
        "",
        "If he didn’t want to make a fool of himself the next day, he should be extremely anxious and distressed.",
        "But in reality, Lu Yiman handled things with exceptional decisiveness. ",
        "That very night, Dani received the news that she had been removed from the show.",
        "She panicked for a moment, because this wasn’t just about missing a show—she had been blacklisted by a designer as a model.",
        "But the panic was short-lived, as she didn’t believe he could find a new model in such a short time.",
        "And since the event organizers remained indifferent, even if he did find a replacement model, it would have to be approved by them to prevent any unfairness to other designers. ",
        "Of course, if Lu Yiman insisted on removing her, as long as he could bear the consequences, the organizers wouldn’t interfere.",
        "So he walked the runway himself.",
        "No one had ever overlooked the fact that this was a very young and handsome designer.",
        "He wasn’t as rugged and tall as Western men, but his tall and slender figure was elegant like a bamboo stalk. Likewise, he had a very beautiful face. ",
        "In the end, his pale skin perfectly matched the theme of the black wedding dress.",
        "Dani could be entirely replaced.",
        "“Sir, I don’t want this… I just…” Now she was genuinely panicking. Being removed by a designer was not something a model could easily recover from.",
        "Especially since after today, this designer’s fame would likely grow far beyond her expectations. ",
        "“I’m not interested in hearing your excuses, Miss Dani. You need to pay the price for your choices.”",
        "He no longer looked at her expression and walked straight toward the changing room.",
        "Of course, he was angry. No one could accept being tricked like this, or seeing their hard work trampled by such stupidity.",
        "Dani, left standing there, had completely lost her light. ",
        "She couldn’t understand why someone who seemed so gentle could be so ruthless when dealing with problems.",
        "***",
        "Please visit chrysanthemumgarden (dot) com",
        "After changing his clothes, Lu Yiman walked out of the backstage.",
        "All of today’s designs would now be handled by the event organizers, who would later display and auction them off. ",
        "The highest bidder at the auction would be the ultimate winner of the competition, and the winner would receive 60% of the auction proceeds, as well as an interview with IM Magazine.",
        "IM, a newly rising fashion magazine, has reached a level of popularity that makes even some of the old established magazines jealous. They are more novel and bold, constantly seeking more interesting breakthroughs.",
        "So, why was a show without any big-name designers so popular? Because whether it was the organizers, the partnering IM magazine, or the designers from different regions, their ultimate goal was profit. Be it money, fame, or connections.",
        "The invited audience, of course, wasn’t composed of ordinary people. Seeing the presence of a young jeweler’s son at such a show gave a hint of the exclusivity. ",
        "However, the intricate social dynamics of the event weren’t Lu Yiman’s concern.",
        "As soon as he walked out of the gate, he saw a man standing under the streetlight.",
        "The man wore a dark blue suit with a black coat over it, his hair perfectly groomed, standing straight outside the now-deserted gate.",
        "It was the first time Lu Yiman had seen him wearing something other than black suits. ",
        "He seemed a bit less formal, more vibrant, and with those refined gemstone cufflinks and the deep red embroidered tie, it was clear he had dressed up meticulously.",
        "Especially that dark red embroidered tie—it was just… too eye-catching.",
        "Lu Yiman clenched his fist and coughed lightly to hide the smile tugging at the corner of his mouth.",
        "Learing his voice, Tu Jhuang immediately turned his head, his deep black eyes catching the light of the streetlamp. ",
        "Lis gahe was gentle, and his curly long hair added a touch of romantic charm to his already handsome face.",
        "As Ou Timan, bathed in the golden glow of the lights behind him, walked toward Tu Jhuang standing under the streetlamp, Tu Jhuang’s gahe stayed fized on him, never looking away.",
        "“Mr. Yu, are you waiting for someone?”",
        "His soft voice carried a hint of amusement. ",
        "“Waiting for you.” Yu Chuang didn’t take his eyes off him.",
        "Lu Yiman paused briefly, his gaze flickering for a moment before becoming deep and unreadable.",
        "Please visit chrysanthemumgarden (dot) com",
        "He smiled slightly, his expression shadowed by the backlight, making his eyes appear unfathomable.",
        "“Shall we take a walk?” ",
        "“Alright.”",
        "The assistant, who was standing by, thought to himself: “…”",
        "He watched as the two of them walked side by side and had no choice but to drive slowly behind them, stopping periodically to avoid being noticed.",
        "It was late at night, and he was worried that when the two needed the car, they wouldn’t be able to find it. ",
        "***",
        "Although the show had started at 8 p.m., it was already approaching midnight.",
        "There were hardly any people on this road, and as they walked, the sound of fallen leaves crunching under their feet echoed crisply in the silence.",
        "Neither of them spoke, and the atmosphere was quiet. ",
        "Lu Yiman’s heart also felt at peace.",
        "He rarely felt like this, as there were always layers upon layers of thoughts weighing on him, causing him to instinctively analyze, measure, and weigh the pros and cons of every situation.",
        "But now, he truly felt relaxed.",
        "Even though he hadn’t had a proper night’s sleep in several days. ",
        "A soft sigh, like a whisper in the wind, escaped him.",
        "Yu Chuang immediately turned to look at him, then lowered his eyes, lost in thought.",
        "Before long, Lu Yiman felt a warmth. Surprised, he looked up at Yu Chuang, who had draped his coat over his shoulders.",
        "“Mr. Yu, aren’t you cold?” ",
        "“You are.”",
        "Lu Yiman was indeed dressed too lightly.",
        "",
        "His expression softened as he said in a quiet voice, “Thank you, Mr. Yu.”",
        "Yu Chuang looked at him again. ",
        "He had seen many sides of Lu Yiman, and each one was imprinted in his mind like a painting.",
        "As he recalled those moments, he realized just how deeply Lu Yiman had left an impression on him.",
        "Watching the profile of Lu Yiman’s face, Yu Chuang began to lose focus. Occasionally, their shoulders brushed against each other, the light friction of their arms stirring a strange, unfamiliar itch in his chest.",
        "It made him involuntarily swallow, a restless desire rising within him. ",
        "Now, both his mind and eyes were entirely filled with Lu Yiman.",
        "The growing emotions pressed against his heart. As the path they walked grew quieter, and their shoulders brushed once again, Yu Chuang reached out his hand.",
        "Lu Yiman’s coat slipped off his shoulder, and as he looked down, he realized he had grasped the sleeve of the coat.",
        "“…” ",
        "In the brief silence, judging from Yu Chuang’s expression, Lu Yiman had a pretty good idea of what was happening.",
        "He almost wanted to laugh, but seeing Yu Chuang’s somewhat frozen expression, he held back out of kindness.",
        "To save Yu Chuang from embarrassment, Lu Yiman decided to smooth things over.",
        "“I’m not that cold, Mr. Yu, you—” ",
        "Before he could finish speaking, he suddenly glanced down at the hand Yu Chuang was holding.",
        "Those long fingers had intertwined with his, their palms pressed closely together.",
        "Lu Yiman raised his eyes, meeting Yu Chuang’s unwavering gaze. Though Yu Chuang’s face remained expressionless, his pitch-black eyes flickered nervously.",
        "Clearly, he was very tense, but unsure of how to express it. ",
        "Yet, in his honesty, he made it evident—he wanted to hold Lu Yiman’s hand.",
        "Lu Yiman’s throat tightened, and an intense surge of emotion made him grip Yu Chuang’s hand more firmly.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang opened his mouth but couldn’t utter a word, feeling as though that same force had clenched his heart. The earlier anxiety instantly transformed into a fiery, overwhelming feeling.",
        "He felt like he was being pulled deeper into Lu Yiman’s gaze. ",
        "“Lu Yiman.”",
        "He called his name.",
        "When he didn’t know how to respond or couldn’t find the words, he always called Lu Yiman’s name as an emotional outlet.",
        "“Hmm.” ",
        "Lu Yiman answered.",
        "The low tone of his voice added a heated spark to the thick, stifling air around them.",
        "The lingering warmth from the fashion show began to swell again, even more intensely.",
        "Yu Chuang’s heart pounded so hard it felt like it was going to burst. ",
        "He had never felt his heart race like this before.",
        "It wasn’t until now that he realized this was what people called feeling something.",
        "The excessive saliva in his mouth and the heat clouding his mind made him crave Lu Yiman’s proximity.",
        "He wanted him. ",
        "Yu Chuang’s eyes were filled with nothing but Lu Yiman—just him.",
        "This was what Lu Yiman had always wanted.",
        "His other hand involuntarily brushed against Yu Chuang’s cheek, gently gripping his chin.",
        "Yu Chuang seemed completely drawn in, clearly inexperienced with this kind of situation. It was evident that he had never felt such intense and ambiguous emotions with his former partner, Yu Ziming. ",
        "This realization gave Lu Yiman a strange sense of satisfaction.",
        "It was as if Yu Chuang was slowly becoming his prize.",
        "Please visit chrysanthemumgarden (dot) com",
        "Under the moonlight, Yu Chuang’s plump, tender lips looked impossibly soft. His pupils trembled slightly as he lifted his face, lips tightening and loosening as he stood frozen in place.",
        "“Mr. Yu, it’s getting windy. Be careful not to catch a cold.” ",
        "The soft touch of Lu Yiman’s voice brushed lightly past Yu Chuang’s ear, sending a tingling sensation straight to his heart.",
        "The warmth of the coat was once again draped over Yu Chuang’s shoulders. Lu Yiman stepped away at just the right moment, causing the tension in Yu Chuang’s heart to plummet, leaving him feeling empty and hollow.",
        "His gaze followed Lu Yiman, the obvious disappointment and confusion in his eyes made Lu Yiman glance back and reach out to push aside the hair that had fallen over Yu Chuang’s forehead.",
        "“Let’s head back. It’s late.” ",
        "Lu Yiman smiled at him briefly, then turned and walked away.",
        "Yu Chuang stared at his retreating figure, then looked down at his hand, clenching his fist only to grasp at nothing but air.",
        "Frowning in dissatisfaction, the immense sense of emptiness inside him made him lower his gaze, like an abandoned puppy.",
        "Meanwhile, walking ahead, Lu Yiman had his hands tucked into his pockets. His usually gentle face was expressionless, shrouded in shadow under the dim moonlight. ",
        "The hand Yu Chuang had held was hidden in his pocket, the cold night air having long since erased any trace of the warmth that had lingered there.",
        "But there was still a terrifying feeling that seeped into his body through his pores.",
        "At that moment, his heart also became unsettled.",
        "*** ",
        "The way back was even quieter than the journey there.",
        "This place was close to the hotel where Lu Yiman was staying, but far from Yu Chuang’s hotel.",
        "At some point, the assistant had driven the car back to the entrance of the show venue. The once brightly lit venue was now dark, with only the streetlights and a faint moonlight illuminating the road.",
        "“I’ve arrived. Thank you, Mr. Yu, for coming to see my show today.” ",
        "It was late at night in Germany. The warm and bright lights of the hotel reached out toward the steps, but Lu Yiman had no intention of inviting Yu Chuang in for a cup of tea.",
        "Of course, Yu Chuang would not make such a request at this moment either.",
        "",
        "He stood before him, his dark eyes gazing directly at him.",
        "Lu Yiman met his gaze, a faint smile on his face. ",
        "After a long while, Yu Chuang lowered his head and seriously took out the golden-red invitation from his pocket.",
        "He watched his movements but said nothing.",
        "“Lu Yiman,” Yu Chuang looked at him again.",
        "“I want…” ",
        "He quietly looked at his face.",
        "“A rose.”",
        "He held out the golden-red invitation in front of him. Yu Chuang looked into his eyes, his expression extremely focused and serious.",
        "After a brief silence, Lu Yiman reached out to accept the invitation. The creases on it hadn’t completely faded but were already faint. ",
        "“Alright.”",
        "Under the quiet late-night streetlights, standing in a foreign land, Lu Yiman carefully folded a rose for him.",
        "Yu Chuang watched him the entire time, his dark eyes never once shifting away. Without him realizing it, the image of Lu Yiman had already been clearly etched into his reflection.",
        "Handing the folded rose to Yu Chuang, he took it, pursed his lips. He didn’t smile, but his eyes visibly brightened, filled with the joy of a child receiving candy. ",
        "His gaze was gentle as he watched Yu Chuang lovingly place the rose into his coat pocket. Then, seeing him look up again, the subtle glimmer in his eyes seemed to seek approval.",
        "“It suits you well.”",
        "Just like the rose brooch he gave him that day on the Pearl Coast.",
        "*** ",
        "The auction was scheduled for three days later, open for anyone to attend.",
        "Of course, there were different invitations for spectators and bidders, as they held different statuses.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Yu Chuang watched as Reed deliberately waved the black invitation in front of him, his face expressionless, his eyes cold.",
        "“Mr. Reed, do you have any objections to our terms?” ",
        "“Of course, no objections. It’s just, as you understand, ‘Jennie’ is a high-end luxury brand. It’s beautiful and pure, and accepting partnerships with other brands recklessly could affect ‘Jennie’s’ image…”",
        "With a snap, Yu Chuang closed the contract in his hands, immediately standing up to leave.",
        "“Then there’s nothing more to discuss. Thank you, Mr. Reed, for taking the time to meet with me today.”",
        "Yu Chuang spoke emotionlessly, his figure turning away swiftly and decisively. ",
        "He now fully understood that the other party had never intended to cooperate in the first place.",
        "After two consecutive meaningless meetings, Yu Chuang felt an immense sense of irritation.",
        "He hated wasting time on such pointless matters.",
        "Suddenly, laughter erupted behind him. ",
        "Turning his head, he saw Reed, the impeccably dressed aristocrat, laughing loudly and without any regard for appearance in the café.",
        "Given the disastrous experience of their last meeting, this time Yu Chuang had chosen the venue.",
        "But now, feeling the stares from those around him, he felt utterly embarrassed.",
        "“Mr. Yu, you really are a delightful man. I’m sure someone has complimented you on that before.” ",
        "Reed was completely unfazed by the attention. He crossed his long legs, waving the black invitation in his hand, raising an eyebrow, and said, “Actually, I came today to deliver an invitation to you, Mr. Yu.”",
        "Auction invitations weren’t that difficult to obtain, but they weren’t exactly easy either.",
        "At least, to receive an invitation as a bidder, one needed a certain level of fame and wealth.",
        "Of course, Yu Chuang could easily obtain one, but as the host, Reed always had more convenient access. ",
        "“Don’t you want to see if your lover will manage to win the auction’s top prize?”",
        "Alright, Reed had to admit, he just wanted to hear Yu Chuang speak more.",
        "",
        "By now, he had figured out that this cold, aloof man only maintained basic communication when it came to business matters, and even then, he was notably reticent.",
        "But the moment they stepped outside of that context, Yu Chuang became even more sparing with his words. ",
        "Reed regretted that someone with such a captivating voice was so stingy about using it.",
        "“Lover?” Yu Chuang, momentarily stunned, looked at Reed in confusion.",
        "Seeing his reaction, Reed’s expression gradually turned strange.",
        "“Aren’t you two in a romantic relationship?” ",
        "Yu Chuang had no experience with love. He possessed the instincts and desires of an adult, but he was someone who didn’t even know how to properly express emotions, let alone comprehend them deeply.",
        "However, he was a quick learner.",
        "He soon regained his cold expression, looking down at Reed seated before him, and said coldly, “That’s none of your business.”",
        "With that, he strode off, but his secretary, who had been following him, suddenly stopped and came back. With a blank, emotionless face, the secretary politely took the invitation from Reed’s hand. ",
        "After all, wasting their boss’s time on two meetings for nothing — it was only right to take the invitation.",
        "The secretary was never one to let such things slide.",
        "***",
        "Before the auction, the works needed to be displayed. This time, mannequins would suffice. ",
        "However, the impression left by Lu Yiman’s “Black Swan” was simply too striking.",
        "The organizers hoped he would showcase it himself.",
        "“Thank you, but I don’t wish to wear it a second time.”",
        "He politely declined, though the organizers continued to hope he might reconsider. However, seeing his firm stance, they reluctantly gave up. ",
        "This auction gathered all the designers together, marking the first formal reunion since the previous show.",
        "Today, the results would also be revealed.",
        "",
        "Lu Yiman spotted that white designer, whose face was tense and silent, avoiding conversation with others. Lu only gave him a brief glance before looking away.",
        "But that glance didn’t go unnoticed. The designer’s cold eyes immediately fixed on him. ",
        "The resentment within them made Lu Yiman furrow his brow slightly, his lowered lashes concealing the dark look in his eyes.",
        "The auction was about to begin. Designers were allowed to observe, but they could not interfere with the bidding process.",
        "As Lu Yiman was leaving, the white designer bumped into his shoulder forcefully, the hard muscles causing a dull pain to shoot through him.",
        "“Get out of the way, trash.” ",
        "The sharp insult made Lu Yiman’s face darken.",
        "It was surprising that an unofficial competition could stir up such intense jealousy. Then again, from someone who could resort to petty tricks during a show, expecting professionalism was too much.",
        "He walked out, his shoulder throbbing with pain. The man was as tall as him but significantly more muscular. Even though Lu Yiman was a grown man, the impact was still hard to bear.",
        "He was in a foul mood. ",
        "He moved his shoulder, intensifying the pain.",
        "But on his handsome face, there was no visible sign of discomfort.",
        "“Mr. Lu.”",
        "As he passed by a private room, a man with blue eyes smiled and called out to him. ",
        "He remembered this man. He had been seated next to Yu Chuang during the show.",
        "It was Roercher’s youngest son, a notorious playboy from a wealthy and influential family.",
        "Lu Yiman didn’t respond, walking straight ahead without even glancing in his direction.",
        "Reed’s hand, which had been raised in greeting, froze mid-air. ",
        "What was going on? From what he’d seen that day, Yu Chuang’s lover should have been a gentleman, polite and gentle.",
        "Uncertain, he watched Lu Yiman’s retreating figure.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "All he could see was the lean, tall frame exuding a heavy, oppressive aura.",
        "Hiss…! "
    ],
    "previous": "Chapter 25.2",
    "next": "Chapter 27.1"
}