{
    "title": "Chapter 35.1",
    "content": [
        "“Sir, are you alone?”",
        "Lu Yiman, with the autumn wind behind him, walked step by step into Yu Chuang’s eyes. He lowered his head with a soft smile in his eyes and asked, “May I invite you for a cup of coffee?” ",
        "Yu Chuang, his bright eyes unwaveringly fixed on him, softly replied, “Yes.”",
        "He didn’t care at all whether the Miss Gao would come or not, but when Lu Yiman appeared, the ginkgo tree outside the window, caught between autumn and winter, seemed to have transformed into a springtime bloom.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Every time Yu Chuang needed him, Lu Yiman would always appear, as if he could hear the thoughts in Yu Chuang’s heart.",
        "At this moment, Yu Chuang himself didn’t know, but in Lu Yiman’s eyes, the way he looked at him was filled with incredible tenderness. ",
        "Lu Yiman’s gaze was indescribably gentle, as he quietly looked into Yu Chuang’s eyes, seeing not only the present but the countless years of his past.\n\n",
        "“Sir, from the moment I first saw you, I thought you were very charming. May I ask if you’re single?”",
        "He sat down across from him, filling the long-vacant spot with another half.",
        "Yu Chuang’s gaze never wavered from him, firmly answering, “Single.”\n\n ",
        "Lu Yiman’s gaze deepened, and the smile at the corner of his mouth widened as he said softly, “What a coincidence, so am I.”",
        "His gentle voice rippled through the air like waves spreading across water.",
        "Yu Chuang’s eyes slightly moved, though just a faint arc, yet he smiled.\n\n",
        "The wind rang the bell at the café’s entrance, and a golden leaf from the ginkgo tree outside fluttered down. ",
        "In the slightly dazed look from Lu Yiman, Yu Chuang laughed softly, very softly.",
        "Not only he noticed, but on the other side, Yu Chuan was staring blankly at that faint smile from Yu Chuang, his heart suddenly clenching, almost forgetting how to breathe.",
        "In his memory, Yu Chuang never smiled.",
        "But it wasn’t that he didn’t know happiness. ",
        "Among the rows of clothes embroidered with lilies in the wardrobe, there was only one embroidered with a crabapple flower.",
        "That was on a night in Germany, when Lu Yiman folded him a paper rose at the entrance of the hotel.",
        "Yu Chuan started to laugh, covering his face as tears overflowed from between his fingers, along with overwhelming guilt that almost drowned him.",
        "*** ",
        "The news of the marriage alliance between the Yu family and the Gao family spread more and more, though it’s unclear who started spreading it widely.",
        "An angry Peng Duoduo got out of bed, ready to go find Gao Qinzhang for a fight.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "But before he could do anything, his sister had already suppressed him.",
        "Still disgruntled, he mumbled that his sister was disloyal, always praising Lu Yiman to the skies before, and now she didn’t even want to show her face. ",
        "Peng Haohao, with a lady’s cigarette in her mouth, slapped him on the back of the head.",
        "“What good are you? I’ve told you many times to read more and watch the news. Tou act like a little kid, shouting all the time. What’s the rush? That marriage is definitely not going to happen.”",
        "Ueng Laohao blew out a puff of smoke and sneered.",
        "“Low are you so sure?” Ueng Guoduo, with a tuft of unruly hair, looked at her. ",
        "“Anything related to interests won’t go so smoothly, especially when those interests involve others.”",
        "Peng Duoduo was baffled, not quite understanding the cryptic meaning behind his sister’s words, but he did understand the part about the marriage not succeeding.",
        "He immediately jumped up and excitedly said, “Then I have to quickly tell Yiman the good news! He must be heartbroken!”",
        "Peng Haohao looked at her silly brother with a complicated expression and sarcastically said, “He might not be as heartbroken as you think, maybe he’s not even as worried as you are.” ",
        "Getting drunk and crying his eyes out, even getting into a fight, as if it was his wall being torn down.",
        "“Don’t say that! Yiman just has a habit of keeping things to himself.” Peng Duoduo looked at her disapprovingly.",
        "Peng Haohao cast him a cool glance and sneered, “Wait and see, he’s sharper than you think. He’s the kind of person who never loses out in this world.”",
        "She’s always been accurate in judging people. ",
        "Peng Duoduo almost doubted whether the person she was talking about was the same Lu Yiman he knew.",
        "“Whatever, I’m going to see him anyway.” He hurriedly got ready to leave.",
        "But just then, Mrs. Yu’s angry voice came from outside the door.",
        "“What’s with this strong cigarette smell? Who’s smoking?” ",
        "Peng Duoduo watched in shock as his sister’s hand, holding the cigarette, shook, and she quickly put it in his hand at lightning speed.",
        "When Mrs. Yu opened the door, Peng Haohua was sternly scolding him.",
        "",
        "“You’re still young, and you’re already smoking? And a lady’s cigarette at that? What kind of example are you setting?”",
        "Peng Duoduo, blank-faced, holding the cigarette: “…” ",
        "***",
        "When Yu Chuan returned home, Yu Chuang was already there.",
        "Even so, he was still busy with work, focused on the documents on the desk. That handsome face remained as cold and silent as ever.",
        "But he had already seen the sadness beneath Yu Chuang’s silence and that fleeting yet breathtaking smile. ",
        "“Brother, have you eaten yet? I thought you wouldn’t come back,” Yu Chuan asked casually as he walked over, his face showing the same calm smile as usual.",
        "Yu Chuang paused as he flipped through the documents, turning his head to look at him.",
        "Under the gaze of Yu Chuang’s dark eyes, Yu Chuan felt a little uneasy and asked, “What is it?”",
        "“You’ve been crying,” Yu Chuang said calmly, with certainty in his voice. ",
        "Yu Chuan’s facade of calmness and forced composure crumbled in an instant.",
        "He quickly turned his head and, steadying his voice, said, “I wasn’t crying.”",
        "But the hard, dry tone sounded far from natural.",
        "Yu Chuang looked at him quietly for a moment, then withdrew his gaze and resumed going through the documents in front of him. ",
        "His silence was a form of unspoken acceptance. Behind him, Yu Chuan blinked his damp lashes, struggling to suppress the bitterness rising in his chest.",
        "That night, Yu Chuang didn’t go out again; he stayed in the villa.",
        "Yu Chuan was restless. No matter how he acted outside, in front of Yu Chuang, he was always the younger brother who had followed him around as a child.",
        "When Yu Chuang was about to return to his room, Yu Chuan finally stood at the door, nervously asking, “Brother, if I did something wrong, would you blame me?” ",
        "Yu Chuang looked back at his still slightly red eyes, and his gaze drifted to Yu Chuan’s hands, which were anxiously tugging at the seam of his pants.",
        "“What did you do?”",
        "Please visit chrysanthemumgarden (dot) com",
        "Yu Chuan quickly glanced at him, then lowered his head and softly said, “Something that wasn’t good for you.”",
        "“I wouldn’t.” ",
        "Yu Chuang gave his answer.",
        "Even though it was expected, Yu Chuan still felt a bit heartbroken.",
        "He wanted Yu Chuang to blame him, so it could ease some of the overwhelming guilt he was feeling. But at the same time, he was terrified of Yu Chuang blaming him, thinking he wouldn’t be able to bear it.",
        "He really was as greedy as their father said, and as childish as Lu Yiman described. ",
        "His heart felt heavy and disappointed, his head hanging low like a dejected puppy.",
        "Yu Chuang looked at him quietly, then suddenly reached out and lightly patted his head.",
        "Yu Chuan lowered his head from the gentle hit, then covered his head, looking at him with a bewildered expression.",
        "“Brother?” ",
        "Yu Chuang responded with a simple, “Hmm.”",
        "Yu Chuan rubbed his head and watched Yu Chuang’s back as he walked into the room. He suddenly didn’t feel so down anymore, though the bitterness in his heart still lingered.",
        "He stood there at the door, watching Yu Chuang’s strong back and broad shoulders, and it was as if he was seeing the same figure from childhood, who had always stood like a mountain in front of him.",
        "“Brother, give me a little more time.” ",
        "Yu Chuang stopped in his tracks, listening to the voice behind him.",
        "Yu Chuan felt like crying again.",
        "He wiped his eyes, and when he spoke, the sobs in his throat could no longer be hidden.",
        "“Brother, just give me a little more time, it won’t take long, just a little more, just a little.” ",
        "He pressed his lips together, the sobs welling up causing his voice to tremble.",
        "Yu Chuang didn’t turn around. He stood there for a long time before he finally said, “A little more.”",
        "",
        "“Yes, just a little more.”",
        "Hearing Yu Chuang’s serious tone, Yu Chuan, while wiping away his tears, couldn’t help but let out a small laugh. ",
        "He clumsily wiped his nose, looking ahead at Yu Chuang’s back. In his daze, the heavy burden that seemed to weigh on those shoulders appeared to lighten just a bit.",
        "***",
        "Peng Duoduo hadn’t seen Lu Yiman at the bar in a long time. Lu Yiman didn’t often come to this place either.",
        "When he arrived, Lu Yiman was sitting on a barstool, watching the band on stage like a spectator admiring a performance. ",
        "It was said that after Lu Yiman’s performance that day, the bar stayed in the limelight for quite a while. Many people were eager to meet him, but not long after, Lu Yiman left for Germany.",
        "The buzz gradually died down, and by the time Lu Yiman returned to the bar, there were few who still recognized him.",
        "Of course, it also had to do with how tightly he was wrapped up today.",
        "Lu Yiman wasn’t good with alcohol and got drunk easily, so he only ordered a glass of fruit wine to sip on. ",
        "Under the dim light, Peng Duoduo’s large head leaned close to him, studying his face closely.",
        "Lu Yiman glanced at him and pushed his head away.",
        "“What are you looking at so intently?”",
        "Following his gaze, Peng Duoduo noticed a man on stage twisting his hips. ",
        "He immediately choked, asking in disbelief, “Is that what you’re into?”",
        "Lu Yiman didn’t answer his question, instead lazily looking at him, “What happened to your face?”",
        "Peng Duoduo touched the slap mark on his face and sighed, “Family drama, that’s all.”",
        "After saying that, he sighed again and downed a glass of alcohol. ",
        "“When are you going to visit the studio?” He was hoping to show off a bit in front of Lu Yiman.",
        "“In a couple of days.”",
        "",
        "Peng Duoduo seemed to think of something and paused, before looking at him with a face full of affection, saying, “Yeah, waiting a couple of days is a good idea.”",
        "At least wait until his heartbreak is over, he thought. After all, he’s not short of this two days’ money. ",
        "Although Lu Yiman didn’t know what Peng Duoduo was thinking, he could tell from his gaze that his thoughts had gone off track."
    ],
    "previous": "Chapter 34.2",
    "next": "Chapter 35.2"
}