{
    "title": "Ch1 - Transmigration",
    "content": [
        "When Qi Shiyan opened the door of the escape pod, he was stunned by the scenery outside.",
        "What did he see? He saw green all over the mountains and plains! ",
        "He also smelled fresh air and saw bright sunshine!",
        "Not far from him, there was even the sound of gurgling water!\n",
        "",
        "Was he in heaven? Wasn’t this place too good to be true?",
        "Qi Shiyan’s face showed ecstasy. He hugged a big tree next to him, kissed the tree, and then pressed his face against the tree. ",
        "He actually saw a living tree. He was so moved!\n\n",
        "This tree was really beautiful, with green leaves and dark bark. It even exuded an attractive herbal fragrance.",
        "Qi Shiyan reached out and touched the rough tree trunk, tears welling up in his eyes. He was extremely excited.",
        "What a wonderful tree! He wanted to hold on to this tree forever!\n\n ",
        "Of course this was just a thought.",
        "Wherever he looked, there were trees everywhere. He would not give up a forest for a single tree!",
        "Thinking of this, Qi Shiyan hugged another tree next to him and kissed it.\n\n",
        "At this moment, Qi Shiyan was filled with excitement and wanted to recite a poem to express his emotions, but he couldn’t. ",
        "After all, he was illiterate.",
        "Born in the apocalypse, he had never been to school and could only recognize a few simple characters.",
        "So at this time, let alone asking him to write a poem to praise the beautiful scenery in front of him, it would be difficult for him to even recite a poem.",
        "Qi Shiyan was born in the fourth year of the apocalypse. ",
        "The apocalypse his planet faced came about due to an asteroid that hit their planet.",
        "This asteroid was made of materials that also contained strong toxins and radiation.",
        "Its impact not only caused volcanic eruptions, tsunamis and continental plate collapse on the planet where Qi Shiyan lived, but the flying dust and smoke also polluted the air, water and soil on the planet with toxins and radiation.",
        "Animals and plants died one after another. Humans survived by various means, but life was difficult. ",
        "In the fourth year of the apocalypse, there were already fewer and fewer surviving humans. They lived in sealed underground cities and struggled to survive.",
        "It should be impossible to conceive a child in such a bad environment, but Qi Shiyan was born.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He was a miracle.",
        "He had special abilities that allowed him to purify toxins and radiation. ",
        "The surviving humans regarded Qi Shiyan as their only hope. They tried their best to protect Qi Shiyan, but they couldn’t provide Qi Shiyan with very good living conditions.",
        "Qi Shiyan, who was still very weak at the time, could not help the people around him and could only watch these people die.",
        "Oater, as his abilities grew stronger, the radiation around him also grew stronger. The survivors around him died one after another, including himself. Le died at the age of twenty.",
        "There was not much sadness when Hi Shiyan died. ",
        "At that time, he was the only one left in the entire world. Apart from him, everything was dead silent. Le felt that there was no difference between death and life.",
        "But he didn’t expect that he could transmigrate!",
        "He transmigrated to the interstellar and became the future* crown princess of the interstellar Human Empire*, a person with a bad reputation who was hated by everyone.",
        "This future crown princess was very unlucky. Not only did his spaceship have an accident while he was participating in a live broadcast, causing him to land on an undeveloped* planet, but he also ingested poisonous substances* and died as soon as he landed. As a result, his body became Qi Shiyan’s. ",
        "Being stranded on an undeveloped planet was miserable for the interstellar people who couldn’t live without all kinds of high-tech products, but not for Qi Shiyan.",
        "After opening the door of the escape pod and seeing the appearance of the “undeveloped planet”, Qi Shiyan was extremely excited.",
        "This planet was so beautiful!",
        "He was willing to live here forever! ",
        "The apocalypse where he had lived was gray and lifeless, but this planet was full of vitality. How wonderful!",
        "As for the fact that the original owner was in poor health and there were still residual toxins in his body, this was not a problem for Qi Shiyan!",
        "His special ability to purify toxins had been brought to this world. He could use his own supernatural powers to remove the toxins from his body.",
        "As for the original owner’s weak body… no matter how weak the original owner was, he was not as weak as him! ",
        "In the apocalypse, no matter how well the food was sealed, it would still be contaminated by radiation. It was just a matter of degree.",
        "And fresh food had long disappeared.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He grew up eating all kinds of canned food containing radiation. Although he did not die from eating it like the people around him, his health was always very poor. He was thin and weak. When he died, he was extremely thin, with only a skeleton covered with skin.",
        "Although the original owner of this body was thin and weak, he was much healthier than him. His skeleton was also very large. If he ate more and exercised more, he should be able to become a strong man! ",
        "He liked muscular men.",
        "Speaking of food…Qi Shiyan hugged the tree in front of him and couldn’t help swallowing.",
        "He wanted to chew the tree bark.",
        "To be honest, he should have starved to death in his previous life. ",
        "In order to purify toxins, he needed energy. Where did energy come from? It naturally came from food.",
        "But his food contained toxins.",
        "In the end, the energy contained in the food he ate was not enough for him to purify the food he ate, so this was considered starving to death, right?",
        "Those contaminated foods were extremely unpalatable and tasted rotten. How could they be as fragrant as the tree bark in front of him? ",
        "But after considering for a while, Qi Shiyan finally gave up the idea of ​​chewing the tree bark.",
        "Although the tree bark was good, his body might not be able to digest it if he ate it raw.",
        "So he wouldn’t eat tree bark. He would eat something else!",
        "Qi Shiyan glanced around and noticed the grass beside the stream. ",
        "The grass was growing so lush and green, and looked delicious!",
        "The stream was as attractive to him as the trees.",
        "This was clean water! Clean!",
        "Qi Shiyan walked to the stream in two or three steps, scooped up a handful of stream water, and drank it. ",
        "There were no toxins or pollution in this stream water, but it did have a light taste of grass.",
        "It tasted so good, really so good. He had never drunk such delicious water in his life!",
        "Please visit chrysanthemumgarden (dot) com",
        "And the grass that he was just looking at…",
        "This grass looked like a large spinach, with emerald green leaves that were tender and juicy. ",
        "Qi Shiyan plucked off a small leaf and put it in his mouth. After tasting it, he found that it was not only non-toxic, but also had a wonderful grassy taste.",
        "He had never eaten such delicious food in his life!",
        "He was very sensitive to all kinds of substances that were harmful to the human body. In the past, he felt very uncomfortable and painful when he ate food contaminated by radiation.",
        "But this kind of grass only brought him enjoyment. ",
        "Qi Shiyan picked a leaf and began to taste it carefully, as if he was eating some delicacy.",
        "At the same time, everyone watching the live broadcast was dumbfounded.",
        "“Is Qi Shiyan crazy?”",
        "“He must be crazy! After coming out of the escape pod, he not only hugged a tree and kissed it, but also picked grass and ate it at random. He is definitely crazy.” ",
        "“From his expression, it seems that this grass is delicious… I want to taste the flavor of this grass.”",
        "“Isn’t this live broadcast a bit unethical? He doesn’t know anything. What if he is really scared to death?”",
        "…",
        "People were talking about the protagonist of the live broadcast, Qi Shiyan. ",
        "Yes, Qi Shiyan was broadcasting live right now, but he himself didn’t know it.",
        "A month ago, the largest entertainment company in the interstellar issued an announcement saying that the future crown princess had signed a contract with them and would broadcast a live broadcast on the star network, covering the entire process of the future crown princess going to the front lines to comfort wounded soldiers.",
        "The future crown princess of the Human Empire was named Qi Shiyan, a descendant of a martyr.",
        "The Human Empire had been fighting against star worms. Twenty years ago, a high-level star worm led many low-level star worms to break through the defense line built by the Human Empire and attacked a habitable planet of the Human Empire. ",
        "The humans on the planet evacuated urgently, but 300 million people did not have time to escape and were about to become food for the high-level star worm. At this time, Qi Yuncheng, a Major General of the First Legion stationed nearby and an S-level warrior, who was also Qi Shiyan’s father, arrived and brought his army to stop the high-level star worm.",
        "In the end, he even went so far as to self-destruct to kill the high-level star worm.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Before that, in the war between star worms and humans, star worms had always had the upper hand, and humans were steadily losing ground. There had never been a case of a high-level star worm being killed by humans.",
        "Qi Yuncheng was the first human warrior to kill a high-level star worm. He also saved 300 million people on the planet who hadn’t had time to escape. ",
        "In addition, Qi Yuncheng’s wife also died in this battle, so the only child left alive in the Qi family was Qi Shiyan, who had just been born and was crying for food.",
        "Therefore, people throughout the empire at that time paid great attention to Qi Shiyan.",
        "Qi Shiyan grew up under the watchful eyes of people throughout the empire and could be called the empire’s son.",
        "When he was eighteen years old, he was engaged to the crown prince and became the future crown princess. ",
        "But it was from this time that Qi Shiyan’s reputation took a sharp turn for the worse.",
        "Going to bars, disrespecting elders, and being extravagant and wasteful were all small things. There were mainly three things that made Qi Shiyan hated by the entire network.",
        "The first thing was that more than one person reported him using their real name for bullying his classmates, forcing them to drop out of school. This matter was also confirmed.",
        "The second thing was that when he participated in an event and met a veteran, he showed disgust on his face, used inappropriate words and even insulted the other party, and then refused to admit his mistake. ",
        "The third thing was that he kept a close watch on the crown prince. Anyone who got close to the crown prince would be insulted by him as a mistress. He would also guide netizens to cyberbully the person.",
        "In the beginning, when people didn’t understand his true nature, several people were bullied by netizens because he falsely accused them as mistresses.",
        "Qi Shiyan got engaged to the crown prince three years ago, and it had been three years now. In these three years, he had destroyed all the goodwill of the people of the empire toward him and had become a black figure on the star network.",
        "A month ago, when Qi Shiyan said he was going to the front lines to comfort the wounded soldiers and would broadcast the entire process live, netizens didn’t have a single good word to say. Everyone thought he was putting on a show and trying to whitewash himself. ",
        "At that time, netizens spontaneously organized a boycott of the platform that claimed to be hosting Qi Shiyan’s live broadcast.",
        "But today, that platform gave them a surprise.",
        "The contract they signed with Qi Shiyan was very beneficial to the platform. As long as the platform sent Qi Shiyan to the front lines, they could live broadcast Qi Shiyan.",
        "Then, the platform pretended that the spaceship crashed, let Qi Shiyan enter the escape pod, and then sent the escape pod to a convalescent planet for the recuperation of soldiers who had been injured on the front lines. At the same time, they turned on the live broadcast camera on Qi Shiyan. ",
        "The live broadcast had already started, but Qi Shiyan’s reaction left the entire online audience confused.",
        "***",
        "",
        "T/N: Yes, I’m picking up another novel, but this one is short and relatively easy to translate so hopefully won’t take too long to finish. I just needed a break from ASRR (too many cultivation terms, names, etc. to remember and keep consistent – both translating and editing take forever) and RTS (I originally thought this one would be easier to translate than ASRR because it’s semi-modern, but it’s actually even harder. The chapters are long and there are way too many details and small things that take a lot of research). I also couldn’t help myself when I saw Jue Jue (same author as RTS) had posted another “raising” type novel because my favorite of all her many novels is Stone Age Husband Raising Journal. Unfortunately, this one is not a beastman world, but it’s still super sweet.",
        "*Here and in most places in the raws, it just says “crown princess” (no “future”), but that’s obviously misleading because he isn’t yet the crown princess so I’ve taken the liberty to add “future” where appropriate. ",
        "*In the summary, it’s Interstellar Empire, but in the text, it appears to always be Human Empire.",
        "*荒星 (huang xing) – 荒 (huang) can mean many things, usually barren, desolate, etc., but since the planet is clearly not barren, I’m using undeveloped/wild planet.",
        "*Raws actually said he ate poisonous food and died, but it’s later clarified that the air in his escape pod was poisoned, so I changed it to ingested poisonous substances."
    ],
    "previous": null,
    "next": "Ch2 - Live Broadcast"
}