{
    "title": "Ch10 - Poison Flare-up",
    "content": [
        "Qi Shiyan roasted and ate the rabbit at the same time. After he and Ming Zheng shared one rabbit, he started roasting the second rabbit.",
        "The man he picked up had been poisoned and needed his supernatural powers* to heal. ",
        "If he wanted to restore his supernatural powers, he needed to consume more energy.",
        "Half a rabbit was not enough for him. He needed to eat more!\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Qi Shiyan had collected a lot of firewood before. He also used his mental power when roasting the rabbits so that the flames would cover the rabbits evenly and not waste fuel. He finished roasting all the rabbits before the firewood burned out and ate until his belly was round.",
        "When he ate the roasted rabbits, he always ate one piece himself and gave one piece to Ming Zheng to eat. Ming Zheng also had a good appetite and did not waste any of the rabbit meat he fed him and ate it all. ",
        "Qi Shiyan really liked the feeling of feeding him meat.\n\n",
        "Because he liked Ming Zheng too much, he completely ignored the tiger he had captured not long ago, which he once loved very much and had hugged and kissed for a long time.",
        "He even took back the mental power he had used to suppress the tiger.",
        "Compared to fur, he still preferred the touch of human skin.\n\n ",
        "Thinking of this, Qi Shiyan grabbed Ming Zheng’s hand and pressed it against his face again.",
        "At the same time, the tiger stood up.",
        "The tiger was ecstatic when it discovered that the energy that had been surrounding him, suppressing him, controlling him and making him unable to move, had disappeared.\n\n",
        "There were always a lot of barrages in the live broadcast room. ",
        "“I didn’t expect that I could watch others eat roasted rabbit for so long.”",
        "“I kept my camera fixed on Qi Shiyan’s face. His expression is so gentle. I don’t think my own mother would be so gentle when feeding me.”",
        "“Me too! He keeps calling Xiao Guai. I’m falling in love with him.”",
        "“Are you guys sick? You’re actually obsessed with a cheating scumbag!” ",
        "“I’ve already left a message on the crown prince’s Xingbo account. Qi Shiyan is so disgusting and unworthy of the crown prince!”",
        "…",
        "Just then, they noticed that the tiger had stood up.",
        "“The tiger stood up!” ",
        "“It’s looking so fiercely at Qi Shiyan!”",
        "“Qi Shiyan, be careful! I feel like this tiger wants to bite you!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Hahahaha! Qi Shiyan is going to be unlucky. Looking forward to it!”",
        "“Qi Shiyan must have used up all his mental power. Right now, his attention is not on the tiger. Tiger! Bite Qi Shiyan to death!” ",
        "…",
        "Everyone was paying attention to the tiger’s movements, and then they saw the tiger roar fiercely at Qi Shiyan, then turn around and run away with its tail between its legs.",
        "People watching the live broadcast: “…” Where was the well-known ferocious beast? Wasn’t it too cowardly?",
        "The tiger’s departure did not attract Qi Shiyan’s attention. He still kept his face in Ming Zheng’s hand, reluctant to let go. ",
        "It was morning when he came out of the escape pod. Now half a day had passed and it was already afternoon.",
        "His stomach was full. Next, it was time to find a place to live.",
        "The temperature where he was now was not low, but he still had to guard against nighttime drops in temperature and rain, thus it would be best to have a place to shelter from the wind and rain.",
        "In fact, his escape pod was very suitable for living, but that might attract trouble. They could only sleep in the open air. ",
        "Qi Shiyan reluctantly removed Ming Zheng’s hand from his face, touched it a few more times, then stood up with Ming Zheng and said to Ming Zheng, “Xiao Guai, let’s go forward and find a place to live.”",
        "Ming Zheng seemed to understand. He stood up obediently, opened his big eyes, and looked at Qi Shiyan in confusion.",
        "Qi Shiyan noticed that his own image was reflected in Ming Zheng’s eyes.",
        "Being stared at intently by Ming Zheng, Qi Shiyan’s heart beat rapidly and his whole body shook with excitement. ",
        "“Xiao Guai, I really like you!” Qi Shiyan grabbed Ming Zheng’s other hand and covered his face with it, with the palm facing his lips.",
        "For a person who had been lonely for many years and had mental problems, it was really tempting to have someone who could accompany him suddenly appear out of nowhere.",
        "His mind was now full of perverted thoughts. He even wanted to kiss this person all over his body.",
        "Restrain himself. He had to restrain himself! ",
        "Qi Shiyan kissed Ming Zheng’s palm several times, took a few deep breaths, and calmed down for a while before taking Ming Zheng’s hand and walking forward.",
        "This time, he not only used his mental power to clear a path for himself, but also used his mental power to clear a path for Ming Zheng, ensuring that Ming Zheng would not be scratched by branches.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The star network became lively again, with everyone scolding Qi Shiyan for cheating.",
        "After the live broadcast began, Qi Shiyan’s performance was unexpected. He also showed at least B-level mental power and excellent control of his mental power. ",
        "Because of this, many people on the star network questioned the Qi family and the top leaders of the empire.",
        "The crown prince, Ming Qingyu, regretted his decision when he saw the chaotic situation.",
        "Many people contacted him, asking him if he knew Qi Shiyan’s mental power level, and asking him if he knew why Qi Shiyan hid his strength…",
        "He didn’t know. He didn’t know anything! ",
        "He only knew one thing, that the person in the live broadcast was indeed Qi Shiyan.",
        "This meant Qi Shiyan had lied to him. Or rather, Qi Shiyan had been lying to him all along!",
        "Ming Qingyu hated Qi Shiyan very much, but he was also a little panicked.",
        "He was afraid that his actions against Qi Shiyan would be discovered. ",
        "Ming Qingyu wanted to shut down the live broadcast, but unexpectedly, at this time, someone other than Qi Shiyan appeared in the live broadcast.",
        "Ming Qingyu didn’t recognize the person who suddenly appeared. This person was disfigured and it was impossible to tell what he originally looked like.",
        "But Ming Qingyu knew why this person looked so terrifying.",
        "This person who suddenly appeared should be a frontline soldier who had been poisoned by star worm poison and was recuperating on the convalescent planet. ",
        "These people were said to be recuperating, but in fact they were trapped on this planet and waiting to die.",
        "Star worm poison was contagious. People poisoned with this kind of poison would become delirious and indiscriminately attack the people around them. The empire couldn’t release these people into society, as that would be irresponsible to the people.",
        "The person who appeared in front of Qi Shiyan was obviously deeply poisoned.",
        "Ming Qingyu had been watching the live broadcast. After this person appeared, he hoped that the poison would flare up and turn him into a madman, killing Qi Shiyan. ",
        "His expectations were not fulfilled, but what happened next was also beneficial to him!",
        "Qi Shiyan actually hugged this person and was very close to him.",
        "",
        "Qi Shiyan cheated in front of the entire empire!",
        "After Qi Shiyan did such a thing, he could get rid of Qi Shiyan openly! ",
        "Not only that, Qi Shiyan was so close to the person poisoned with star worm poison that he might also become poisoned with star worm poison.",
        "Even if Qi Shiyan was not poisoned… the man who suddenly appeared was already deeply poisoned. If he stayed with Qi Shiyan all the time, the poison would flare up sooner or later and he would kill Qi Shiyan.",
        "Even if Qi Shiyan’s mental power level had reached B+, even if Qi Shiyan had mastered the use of mental power, he was still a young man who had never been on the battlefield.",
        "People who were poisoned with star worm poison had all fought against high-level star worms. Their mental power level was at least A. They also had rich combat experience. After the poison flared up, they would become crazy and fearless of death. ",
        "Facing such a person, Qi Shiyan would definitely die.",
        "After Qi Shiyan hugged Ming Zheng, Ming Qingyu immediately asked someone to help him write a post accusing Qi Shiyan.",
        "He wanted to take this opportunity to break up with Qi Shiyan.",
        "He couldn’t let his beloved down anymore. ",
        "Ming Qingyu thought so and went to watch the live broadcast again.",
        "In the live broadcast, Qi Shiyan looked at the person poisoned with star worm poison with burning eyes, as if that person was his entire world.",
        "Qi Shiyan had also once looked at him in this way.",
        "He had always felt that Qi Shiyan’s gaze was too crazy and too paranoid, but when Qi Shiyan cast such a gaze at another person, he felt a little uncomfortable. ",
        "While Ming Qingyu took action, Qi Shiyan was looking for a place to live.",
        "It wasn’t easy to find a place to live in the primitive jungle.",
        "Fortunately, Qi Shiyan had strong mental power.",
        "As he walked forward, he scanned the surroundings with his mental power and found a cave. ",
        "Actually, it couldn’t really be considered a cave, just a dent in the rock, forming a hole at an acute angle of 45 degrees. The inside of the hole was very small, but the outside was very large.",
        "In the cave, a person couldn’t even stand up straight, but fortunately they could sit.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan planned to collect some tree branches and leaves to block the entrance of the cave, and then spread leaves and dry grass inside and sleep here for the night.",
        "At this moment, Qi Shiyan was once again thankful that he had mental power. ",
        "With his mental power, he could go chop branches without letting go of Ming Zheng’s hand!",
        "Qi Shiyan looked for a suitable branch, concentrated his mental power into a beam, and cut off the branch with many leaves from the tree.",
        "However, after he cut off two branches, Ming Zheng beside him suddenly groaned.",
        "Immediately afterward, Ming Zheng pulled his hand away from him with force and covered his head with his hands. ",
        "Before, Ming Zheng had always been dazed and expressionless, but at this moment, his face was grim and he seemed to be in pain.",
        "“Ah!” He shouted. Something seemed to be surging under his blue and purple skin.",
        "Ming Zheng looked particularly scary at this moment.",
        "The audience on the star network were all shocked. “What’s wrong with this person?” ",
        "“This person is really ill!”",
        "“He looks so scary. Qi Shiyan is actually so close to someone like him. It’s so disgusting. I want to vomit.”",
        "“Qi Shiyan, stay away from him!”",
        "… ",
        "Lu Yuan was handling official business, but he did not forget to watch the live broadcast.",
        "He was His Majesty’s adjutant, mainly responsible for assisting His Majesty. Now that His Majesty was not here, the one leading the troops was the Marshal of the First Legion. He didn’t have much to do and had time to watch the live broadcast.",
        "It was just that the moment he looked at it, his face changed drastically.",
        "His Majesty’s illness was acting up! ",
        "His Majesty looking like this meant that his mental power could no longer suppress the star worm poison in his body!",
        "If he was in the sanatorium, the flare-up of the poison could be delayed by injecting drugs and asking the sanatorium director to use mental power to help suppress it.",
        "",
        "But now he was in the wild, with only Qi Shiyan by his side.",
        "Qi Shiyan’s mental power exceeded C-level, but he was very cautious when using his mental power and always used it economically. ",
        "Lu Yuan felt that Qi Shiyan’s mental power was at most A-level.",
        "A-level mental power couldn’t suppress the poison in His Majesty’s body.",
        "Even if Qi Shiyan possessed S-level mental power, he had no experience and could not suppress the star worm poison in His Majesty’s body.",
        "After the poison flared up, His Majesty would go crazy and die! ",
        "If Qi Shiyan stayed by His Majesty’s side, he would be killed by His Majesty!",
        "Even if Qi Shiyan managed to save his life by chance… after the poison flared up, His Majesty would not be able to control the poison in his body, and Qi Shiyan would definitely be poisoned with the star worm poison.",
        "He should have sent someone to find them immediately after seeing the live broadcast. He shouldn’t have hesitated!",
        "Lu Yuan regretted it immensely, but he forgot that even if he sent someone to look for Qi Shiyan immediately, they still might not have found him yet. ",
        "The convalescent planet was huge, and they had no idea where Qi Shiyan was.",
        "“Isn’t the poison in His Majesty’s body relatively stable? How could this suddenly happen?” Lu Yuan was going crazy.",
        "Just at this moment, he saw a scene that shocked him.",
        "When His Majesty was about to go crazy and indiscriminately attack everything around him, Qi Shiyan suddenly hugged His Majesty. ",
        "Qi Shiyan kept muttering, “Xiao Guai, are you in a lot of pain? It’s okay, it will be fine soon…”",
        "Lu Yuan wanted to roar – why didn’t Qi Shiyan run away at this time?",
        "He actually went to hug His Majesty!",
        "His Majesty was about to go crazy. The moment that happened, Qi Shiyan would be torn to pieces by His Majesty’s mental power! ",
        "Lu Yuan closed his eyes, not daring to look at this horrible scene.",
        "***",
        "",
        "T/N: *I hope this is clear to everyone – mental power is something everyone in this world has. Qi Shiyan has an additional special ability that I am calling his supernatural powers. It’s been mentioned before that he was born with this power in the apocalypse and that he brought it with him when he transmigrated. His supernatural powers allow him to purify toxins and radiation and are what made him so special to survivors in his previous world/life."
    ],
    "previous": "Ch9 - Live Streaming “Cheating”",
    "next": "Ch11 - Clear-headed"
}