{
    "title": "Ch11 - Clear-headed",
    "content": [
        "Qi Shiyan didn’t know Lu Yuan’s fears.",
        "But he knew that the poison in Ming Zheng’s body had flared up. He also knew that after the poison flared up, Ming Zheng, who was already delirious, might attack him. ",
        "Fortunately, he had supernatural powers, so there was no need to be afraid.",
        "The original owner of this body died of poisoning. After transmigrating to this world, he had been using his supernatural powers to eliminate the poison in his body, and had used up all his supernatural powers. So when he first met Ming Zheng, he did not have the ability to help Ming Zheng eliminate his poison.\n",
        "",
        "But when he ate the rabbits, he had already eliminated all the poison from his body. At the moment, he had recovered some of his supernatural powers.",
        "Ming Zheng was too deeply poisoned. He couldn’t help Ming Zheng eliminate all the poison from his body, but he could still eliminate a small portion. ",
        "He had discovered long ago that Ming Zheng’s mental power was very strong, not inferior to his, and should be at S-level. After he helped Ming Zheng eliminate some of the poison, Ming Zheng could completely use his mental power to suppress the remaining poison.\n\n",
        "He hugged Ming Zheng and buried his face in Ming Zheng’s neck. Qi Shiyan’s supernatural power entered Ming Zheng’s body.",
        "The first thing he eliminated was, naturally, the poison in Ming Zheng’s brain.",
        "He hoped that this person would become clear-headed sooner. He was anxious to ask about this person’s marital status!\n\n ",
        "If this person was not single, he would just have to exercise some restraint in the future and not do anything other than holding hands.",
        "“Don’t be afraid, Xiao Guai. It’ll be fine.”",
        "“I’m here. You’ll be fine.”\n\n",
        "“I will definitely raise you to be plump and white.” ",
        "“You’ll be fine.”",
        "…",
        "Qi Shiyan used his supernatural powers and also comforted Ming Zheng. As he spoke, tears fell unconsciously.",
        "In the apocalypse, those who grew up with him all died from excessive toxins in their bodies. ",
        "He had supernatural powers that allowed him to help people eliminate toxins, but the planet he was on was full of toxins. Even every bite of food they ate contained toxins.",
        "He was still young at the time. After eliminating the toxins from his own body, he didn’t have much supernatural power left.",
        "That little bit of supernatural power could only help others eliminate a small amount of toxins, but it couldn’t stop the deaths of people around him.",
        "He watched helplessly as the toxins in those people’s bodies accumulated more and more, and then they died one by one. ",
        "He tried desperately to keep them and used his supernatural powers on them, neglecting himself, so toxins began to accumulate in his body.",
        "Poisoning was uncomfortable and painful.",
        "Please visit chrysanthemumgarden (dot) com",
        "Those people didn’t want him to suffer, so they started to refuse his treatment…",
        "The environment in the apocalypse was so terrible that he couldn’t save the people around him. ",
        "Others might still be in their rebellious period at the age of sixteen, but he watched the last person around him die at the age of sixteen.",
        "Fortunately, this world was not apocalyptic.",
        "Even if he could only help the person in front of him eliminate a small part of the poison in his body for the time being, as long as the poison in this person’s body didn’t continue to accumulate, he would be able to cure this person sooner or later!",
        "“Xiao Guai, it won’t hurt soon!” ",
        "“You’re going to be fine.”",
        "“My family’s Xiao Guai is the bravest and most powerful!”",
        "…",
        "Qi Shiyan was laughing while speaking. ",
        "He wiped his accidentally fallen tears on Ming Zheng’s clothes, and his smile became even bigger.",
        "The people watching the live broadcast were discussing. “Did Qi Shiyan cry just now?”",
        "“Yes, he shed tears. For a moment, I thought his eyes looked particularly sad.”",
        "“I noticed it too. After seeing Qi Shiyan’s eyes, I inexplicably wanted to cry.” ",
        "…",
        "However, what most people were concerned about was still Ming Zheng.",
        "“What on earth is going on with this weird guy who suddenly appeared?”",
        "“Le looks so scary!” ",
        "“Gid his illness flare up so he went crahy pust now?”",
        "“I thought he was pust a fool, but I didn’t ezpect he was also a lunatic.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“This fool is obviously ill, but Hi Shiyan actually hugged him and coazed him. It’s disgusting.”",
        "“The crown prince will definitely not marry Qi Shiyan if he’s like this. I’m relieved!” ",
        "“That lunatic might have an infectious disease. It would be fun if Qi Shiyan got infected.”",
        "…",
        "Lu Yuan said he didn’t dare to watch, but he actually still watched the live broadcast.",
        "Then he saw that after Qi Shiyan hugged His Majesty, His Majesty actually slowly calmed down. ",
        "In the past, when His Majesty went crazy while fighting the star worms, he would kill all the star worms around him until he was exhausted!",
        "But now, His Majesty’s illness had just flared up when it stopped. He was even staying obediently in Qi Shiyan’s arms.",
        "This was the reaction that occurred when the star worm poison was suppressed.",
        "No one else paid much attention to what Qi Shiyan said, but Lu Yuan noticed it. ",
        "Qi Shiyan said more than once that His Majesty would be fine.",
        "He suddenly had a bold thought. Did Qi Shiyan help His Majesty suppress the star worm poison in his body?",
        "Qi Shiyan actually had such an ability?",
        "His Majesty was the most deeply poisoned person in the entire empire. Since Qi Shiyan could even suppress the poison in his body, then what about the poison in other people’s bodies? ",
        "Also, with Qi Shiyan’s help, could His Majesty survive?",
        "The average life expectancy of the people in the empire had reached 200 years. His Majesty’s mental power level was so high that normally, living to 300 years old wouldn’t be a problem.",
        "But now, His Majesty wasn’t even forty years old and his life was reaching its end.",
        "His Majesty went to the front lines at the age of eighteen. Since then, he had constantly remained on the front lines. He had never even had a love life… All of them hoped that he could live on. ",
        "It would be great if Qi Shiyan could really cure His Majesty!",
        "Lu Yuan was excited again. He realized that his emotions had been fluctuating wildly since he started watching this live broadcast.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "In order to calm himself down, Lu Yuan took a look at the barrage that he had moved to the side.",
        "With one look, Lu Yuan discovered something was wrong. ",
        "At this moment, there was a group of people partying in the barrage.",
        "“The crown prince posted on Xingbo, saying that he wants to cancel his engagement with Qi Shiyan!”",
        "“Great! Qi Shiyan should have been kicked away long ago!”",
        "“He is not worthy of the crown prince!” ",
        "“It’s best for such a person with such bad character to die on an undeveloped planet and never come back!”",
        "…",
        "Lu Yuan split the screen into two parts, went on the star network and saw that the crown prince had posted a heartfelt message on Xingbo.",
        "The writing of this Xingbo post was not gorgeous, but it was very touching. ",
        "Lu Yuan, who was in charge of the army’s external propaganda, knew that it was definitely not written by the crown prince, but was probably specially crafted by someone else.",
        "This Xingbo post was very long, but the meaning was very simple. It was written in the tone of the crown prince, saying that he was deceived by Qi Shiyan.",
        "He said that he had always taken good care of Qi Shiyan and wanted Qi Shiyan to be self-reliant, but he didn’t expect that everything Qi Shiyan showed in front of him was a lie.",
        "This Xingbo post did not mention Qi Shiyan’s intimacy with another man on the live broadcast, but at the end of the Xingbo post, he wrote this sentence: “I always thought Qi Shiyan loved me very much. Only today did I learn that wasn’t the case. He may have never loved me. I will set him free.” ",
        "Ever since Qi Shiyan hugged Ming Zheng in the live broadcast, countless people on the star network had been talking about Qi Shiyan cheating.",
        "Some of these were said spontaneously by the public, but some were posted by water armies*.",
        "The live broadcast had only been on for a short time. It was impossible for the public alone to make the fact of Qi Shiyan’s cheating known to everyone.",
        "And under the Xingbo post that the crown prince published a few days ago, hundreds of millions of people were talking about this matter. ",
        "These people all hoped that the crown prince would give a response, and now, the crown prince had done so.",
        "When he said he wanted to set Qi Shiyan free, didn’t that mean he wanted to break up with Qi Shiyan?",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Shiyan, this annoying guy, was finally abandoned by the crown prince!",
        "Netizens were partying in the live broadcast room and also partying under the crown prince’s Xingbo. ",
        "“Your Highness, you are finally clear-headed!”",
        "“Your Highness, you are free!”",
        "“Your Highness, you will definitely find a better crown princess than Qi Shiyan! No, I think anyone you find will be better than Qi Shiyan!”",
        "“Qi Shiyan will regret this!” ",
        "…",
        "The people were very happy. At this time, Qi Jianuo also posted on Xingbo again to apologize to the crown prince on behalf of Qi Shiyan.",
        "On Xingbo, Qi Jianuo took all the blame on himself, saying that it was because he had not educated Qi Shiyan well that Qi Shiyan did such a thing.",
        "Before this, Qi Jianuo had posted another Xingbo post, saying that he didn’t know that Qi Shiyan’s mental power level was higher than C. In that Xingbo post, he also said that Qi Shiyan didn’t like their family very much and wouldn’t tell them many things. ",
        "Now, Qi Jianuo’s Xingbo was also very lively.",
        "“Jianuo is so pitiful. He was a good only child, but Qi Shiyan suddenly came to his family and took away his resources. He also treated their whole family like servants.”",
        "“Qi Shiyan’s mental power level is obviously not low, but he never said anything about it. This shows that he doesn’t care about the Qi family and the crown prince at all.”",
        "“Qi Shiyan is really not a good person.” ",
        "“Jianuo is too kind. This matter has nothing to do with him, yet he actually apologized on his behalf!”",
        "“Qi Shiyan is so disgusting!”",
        "…",
        "Lu Yuan was very angry when he saw this. ",
        "These people really had unclear minds!",
        "If Qi Shiyan concealed his mental power level, how could it be Qi Shiyan in the wrong?",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "They didn’t even think about it. If Qi Shiyan was really cared for and loved by the Qi family and the crown prince, why would he hide his mental power level?",
        "But the people didn’t think that deeply, especially now that Qi Shiyan was a little too close to His Majesty in the live broadcast. ",
        "This was blatant cheating and would definitely attract criticism.",
        "How should they deal with this situation?",
        "While Lu Yuan was worried, he went to watch Qi Shiyan’s live broadcast again.",
        "Before, there were still many friendly comments in the barrage of Qi Shiyan’s live broadcast room, but now, those friendly comments had been completely overshadowed by those scolding Qi Shiyan. ",
        "Those who said Qi Shiyan was “disgusting” were considered good. Some people cursed him particularly harshly, even cursing His Majesty, cursing the pair of them as a cheating man and his mistress.",
        "Lu Yuan saw this and his blood pressure soared again.",
        "Although the comments in the barrage were harsh, the interactions between Qi Shiyan and Ming Zheng were actually very warm.",
        "After being hugged by Qi Shiyan, Ming Zheng’s ferocious expression slowly disappeared. ",
        "He struggled violently at first, but soon calmed down and allowed Qi Shiyan to hold him.",
        "Later, he closed his eyes and fell unconscious.",
        "Ming Zheng was tall and muscular, so he was quite heavy.",
        "After holding Ming Zheng for a while, Qi Shiyan felt a little tired, so he sat on the ground and let Ming Zheng lie on his lap. ",
        "He used his supernatural powers to slowly eliminate the poison that was trying to invade Ming Zheng’s brain.",
        "Unfortunately, his supernatural powers had not fully recovered, and there was too much poison in Ming Zheng’s body. After working for a long time, he only eliminated about one percent of the poison in Ming Zheng’s body.",
        "This wouldn’t allow Ming Zheng to return to normal, but it would make him feel much better.",
        "The remaining poison could only be eliminated slowly. ",
        "Qi Shiyan looked at Ming Zheng, who was lying on his legs with his eyes closed, and his expression changed again.",
        "At this moment, he was holding Ming Zheng’s hands with one hand and had his other hand on Ming Zheng’s face, having a lot of contact with Ming Zheng.",
        "",
        "But he felt it was not enough.",
        "He really wanted to kiss Ming Zheng… ",
        "Restraint, restraint!",
        "He didn’t even know if this person was single!",
        "At this moment, Ming Zheng in Qi Shiyan’s arms opened his eyes.",
        "“Xiao Guai, are you awake?” Qi Shiyan smiled at the other person. ",
        "Xiao Guai? Was he calling him? Ming Zheng was a little slow to react, and then the memories of this period of time appeared in his mind.",
        "He was originally staying in the sanatorium, but someone lured him out of the sanatorium and put him into an airship*.",
        "He was in a daze and flew in the airship for a long time. Finally, the airship landed in a forest.",
        "He stayed inside for a while, but later, when he was hungry, he came out and wandered around in the forest. ",
        "As he walked, he saw an escape pod falling from the sky and subconsciously walked in that direction.",
        "Then, he met the person in front of him.",
        "Who was this person? How did he appear on this planet? Was there some conspiracy?",
        "Ming Zheng had such doubts in his mind, but he quickly rejected them. ",
        "He could sense that this person had no ill will toward him, but rather liked him very much.",
        "He could also sense that this person’s mental power was very strong!",
        "If this person’s mental power was not strong, there was absolutely no way he could help suppress the poison in his body after the poison flared up.",
        "The fact that he was able to become clear-headed showed that this person’s mental power was at least SS-level. ",
        "If such a person really had ill intentions toward him, he could simply kill him. There was no need to go through so much trouble to get close to him and help him suppress the poison in his body.",
        "“Who are you?” Ming Zheng asked.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "After Ming Zheng was poisoned, his throat was affected and his voice was not as pleasant as before.",
        "But for Qi Shiyan, this was already a heavenly sound! ",
        "This person was talking to him! Someone was finally talking to him!",
        "Qi Shiyan’s whole body trembled, his eyes full of excitement and enthusiasm. “Are you single?”",
        "Ming Zheng didn’t expect Qi Shiyan to ask such a strange question, but he subconsciously said, “Yes.”",
        "“I’m single too! Although I had a fiancé before, he cheated on me with my cousin. I have nothing to do with him now! Can I pursue you?” Qi Shiyan asked anxiously. ",
        "He wanted a partner! He couldn’t wait to have one!",
        "Ming Zheng was stunned. Why did this person confess his feelings right away?",
        "Those who were cursing Qi Shiyan in the live broadcast room and felt sorry for the crown prince and Qi Jianuo were dumbfounded.",
        "What did Qi Shiyan say? The crown prince cheated on him with Qi Jianuo? ",
        "***",
        "T/N: I agree with Lu Yuan – the public is either braindead or trolls and members of the water army. For Qi Shiyan to hide his mental power probably means he’s in danger in the Qi family, but idiots only know how to sympathize with that white lotus cousin of his lol. The crown prince is obviously suspicious too – it’s as if the public has completely forgotten that he was an unknown just a few years ago and only got his current position by riding on Qi Shiyan’s popularity.",
        "*水军 (shui jun) – literally water army. Internet water armies mean a group of users paid to post comments with a specific goal (e.g. to mislead the public, blacken a certain celebrity, hype up certain topics, etc.).",
        "*I will be translating 飞艇 (fei ting) as airship and 飞船 (fei chuan) as spaceship. Both basically mean flying ship, but 飞艇 (fei ting) usually refers to a smaller vessel (and it’s described later as similar to automobiles on earth, meaning they’re usually used for transport on a planet and not in outer space, although there are exceptions). 飞船 (fei chuan) are the usual spaceships you see in interstellar novels, capable of interplanetary travel. "
    ],
    "previous": "Ch10 - Poison Flare-up",
    "next": "Ch12 - Confession"
}