{
    "title": "Ch12 - Confession",
    "content": [
        "Qi Shiyan desperately wanted a partner.",
        "Every moment, he wanted to touch the person in front of him, but when there was no relationship between the two of them, he couldn’t go too far. ",
        "If this person was his partner, the situation would be different!",
        "Then, he would be able to kiss, hug and lift this person up all the time. How wonderful!\n",
        "",
        "The person in front of him had wounds all over his body left by star worms. He should be a soldier who had fought desperately with star worms on the battlefield.",
        "In addition, after becoming clear-headed, this person’s eyes were clear and he held no malice toward him. ",
        "Such a person couldn’t be a bad person. Since he wasn’t a bad person, he could be his partner.\n\n",
        "Qi Shiyan made a quick judgment and then asked the other party whether he was single.",
        "After knowing that the other party was single, he quickly explained his own situation and confessed without hesitation.",
        "The original owner was engaged, so he wasn’t actually single. But Ming Qingyu had cheated on him, so why should he remain faithful?\n\n ",
        "Qi Shiyan looked at Ming Zheng with shining eyes. Seeing Ming Zheng was shocked and speechless, he continued, “I was schemed against by my ex-fiancé and ended up on this undeveloped planet. There are only you and me here. I don’t want to live alone. Are you willing to be my partner and accompany me?”",
        "While speaking, he grabbed Ming Zheng’s hand and put it on his face. “I only have you. I want to be with you forever and ever.”",
        "This was the first time in Ming Zheng’s life that someone confessed to him, and also the first time that someone looked at him with such focused and fanatical eyes.\n\n",
        "Before going to the battlefield, he was only eighteen years old. For various reasons, he didn’t go to school like ordinary people, so naturally no one had expressed their feelings to him. ",
        "After going to the battlefield, he was the strongest fighter in the empire, fighting against the star worms all the time. He was surrounded by generals who were older than him. It was even more unlikely for anyone to confess to him.",
        "He wouldn’t even get very close to anyone else!",
        "Lying on Qi Shiyan’s lap and meeting Qi Shiyan’s gaze, Ming Zheng had the feeling that this person loved him very much and that he was this person’s whole world.",
        "His heart trembled unconsciously. ",
        "But he quickly calmed down and asked, “Do you have skin hunger syndrome?”",
        "When he was clear-headed, he would retain the memories of when he was delirious.",
        "He was sure that the person in front of him did not belong to the sanatorium.",
        "An escape pod had landed on this planet before. This person should have come here via the escape pod. ",
        "This person was very young, a little too thin and looked unhealthy, but he had fair skin, handsome looks and strong mental power.",
        "Such a person should be a pampered, arrogant and proud child of destiny, but this person’s reactions were not right.",
        "",
        "From the moment they met, this person had been finding ways to touch him.",
        "At this moment, his hand pressing against the man’s face was blue and purple. Even he himself disliked it, but this person treated his hand as a treasure. ",
        "Dis this person have skin hunger syndrome?",
        "Qi Shiyan didn’t expect that the person he liked would instantly notice that something was wrong with him.",
        "He put on a pitiful appearance. “I have been locked up since I was a child, with only robots around me. Those robots wouldn’t talk to me and always ignored me… I can’t stand being alone, so my behavior may be a little weird. I’m sorry.”",
        "After saying this, Hi Shiyan grabbed Zing Iheng’s hand, rubbed it on his face several times, and kissed it twice openly. ",
        "Zing Iheng didn’t dare to use his mental power. Lis body was still very weak, so he could only watch his hand being kissed.",
        "Lowever, he had no intention of resisting.",
        "People with high mental power were more sensitive to other people’s emotions.",
        "After hearing what Qi Shiyan said, Ming Zheng was shocked and thought of some things. ",
        "The Human Empire was too large. There were too many planets, and therefore there was a lot of darkness hidden.",
        "In some unknown dark corners, there were many laboratories that conducted human experiments in violation of regulations.",
        "Some wealthy people would support these experiments and ask the people conducting them to help cultivate babies with strong mental power.",
        "Even the imperial family had funded human experiments related to mental power. ",
        "The reason why his mental power was so strong was somewhat related to these laboratories. He was once an experimental subject.",
        "The person in front of him might have encountered the same thing as him.",
        "This made it impossible for him to blame the person in front of him for holding his hand and kissing it.",
        "He even felt a little closer to the person in front of him. ",
        "“You…” Ming Zheng wanted to say something to comfort the other person, but the poison in his body flared up again.",
        "He left the sanatorium because of a traitor’s plot.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "There were many retired high-ranking military officials living on the convalescent planet. These people were thorns in the eyes of the star worms. In order to protect them, the entire convalescent planet was strictly managed.",
        "People entering the convalescent planet were not allowed to bring high-tech communication equipment. This place wasn’t even connected to the star network. ",
        "Therefore, except for a few trustworthy people, other people living on the convalescent planet had no way to contact the outside world.",
        "The traitor probably couldn’t get the news of his stay on the convalescent planet out and just wanted to kill him.",
        "Although he was delirious, he was still alert and could sense the ill intentions of others.",
        "That person didn’t dare to get close to him, and just used a nanny robot to lure him to the airship, and then controlled the airship to take him away from the sanatorium. ",
        "There were also some drugs in that airship that could make the poison in his body less stable.",
        "That was why he had an attack prematurely and fell into madness.",
        "And now that his poison had become unstable again, he was afraid that he would soon lose awareness again.",
        "Could the person in front of him survive in this primitive forest? ",
        "Could he become clear-headed again?",
        "He didn’t even know this person’s name.",
        "Ming Zheng’s eyes became confused again.",
        "Qi Shiyan was not surprised by this, as he had long known that Ming Zheng would become a fool again. ",
        "Just eliminating one percent of the poison would not restore Ming Zheng to normal.",
        "This was also the reason why he was anxious to ask Ming Zheng whether he was single.",
        "This person was single and did not refuse after he expressed his desire to pursue him.",
        "This person also knew about him having skin hunger syndrome. ",
        "Right now, this person was not his partner, so he couldn’t get too close to him, but touching and kissing his hand should be fine. Touching his arm also shouldn’t be disliked.",
        "In the next while, he would be nicer and better to this person. When this person became clear-headed again, maybe he would accept him?",
        "",
        "Even if he didn’t accept him next time, there was still the next, next time, and the next, next, next time!",
        "Qi Shiyan was in a good mood. He grabbed Ming Zheng’s hands and used them to completely cover his face. ",
        "Comfortable, so comfortable!",
        "If he didn’t have to tidy up the place, he would have wanted to stay like this forever.",
        "Qi Shiyan kissed Ming Zheng’s palms reluctantly, and started to use his mental power to “chop” branches again.",
        "He was in a good mood, but the star network had exploded. ",
        "When Ming Zheng suddenly asked who Qi Shiyan was, netizens were all shouting, “He’s a cheating scumbag.”",
        "“He is a scumbag!”",
        "“He’s a beast!”",
        "… ",
        "Then the next second, they heard Qi Shiyan asking the ugly guy if he was single.",
        "“Qi Shiyan actually asked such a question. Is he really planning to be with this ugly freak?”",
        "“What kind of vision and aesthetics does he have?”",
        "“Is Qi Shiyan crazy?” ",
        "“I feel sorry for the crown prince!”",
        "…",
        "As a result, while they were scolding Qi Shiyan, Qi Shiyan suddenly said that his fiancé had cheated on him with his cousin.",
        "Wasn’t Qi Shiyan’s fiancé the crown prince? ",
        "Wasn’t Qi Shiyan’s cousin Qi Jianuo?",
        "They felt sorry for the crown prince because Qi Shiyan cheated on him, but it turned out that the crown prince had cheated on him a long time ago?",
        "Please visit chrysanthemumgarden (dot) com",
        "The barrage of comments went quiet for a moment, and then surged again after a moment later.",
        "Some people didn’t believe Qi Shiyan’s words and thought that Qi Shiyan was not in his right mind and falsely accused the crown prince and Qi Jianuo. ",
        "“Qi Shiyan must be talking nonsense. He is always like this. He thinks everyone he sees is a mistress!”",
        "“It’s not enough for Qi Shiyan to say that someone else is a mistress. Now he’s starting to wrongly accuse Qi Jianuo?”",
        "“Qi Shiyan is really good at putting the blame on others!”",
        "… ",
        "But there were also some people who believed Qi Shiyan, especially those who had raised doubts before.",
        "“If Ming Qingyu and Qi Jianuo really have no problems, why did Qi Shiyan hide his mental power level from them?”",
        "“I’ve long felt that something was wrong with the Qi family and the crown prince!”",
        "“Real-name request – strictly investigate Qi Shiyan’s past!” ",
        "…",
        "The barrage was a mess, but overall, most people still felt that Qi Shiyan was not in his right mind and was talking nonsense.",
        "Qi Shiyan always accused others of being mistresses. After crying wolf so many times, no one believed him anymore.",
        "But the live broadcast continued. ",
        "Then, Qi Shiyan said that he was schemed against by his ex-fiancé and ended up on this undeveloped planet.",
        "The barrage was silent again for a moment.",
        "There was indeed something wrong with this live broadcast. Qi Shiyan was the future crown princess, but a live broadcast platform actually dared to throw him on an undeveloped planet and broadcast him live without his knowledge.",
        "If this was really investigated, it was a violation of the privacy of an imperial family member. The live broadcast platform could be sued to bankruptcy, but the imperial family’s legal team had not responded at all. ",
        "The researcher at the Imperial Research Institute, who previously paid to post a barrage, paid to post another barrage. “From the beginning, I felt that this live broadcast was abnormal. The technology used in this live broadcast has a very high level of confidentiality. A star network live broadcast platform definitely cannot obtain it! I have always been curious about who found this technology and made this live broadcast. It turns out to be the crown prince!”",
        "As soon as this comment appeared, many people questioned Ming Qingyu and asked him to give an explanation.",
        "Please visit chrysanthemumgarden (dot) com",
        "At this time, Qi Shiyan made another big move.",
        "He said he had been locked up since he was a child and only had robots to take care of him, so he couldn’t stand being alone. ",
        "Qi Shiyan’s words caused the entire star network to explode.",
        "“I said that Qi Shiyan’s behavior was abnormal.”",
        "“It turns out that he has skin hunger syndrome. No wonder he keeps touching that ugly guy’s hand.”",
        "“How did the Qi family take care of Qi Shiyan?” ",
        "“It’s suffocating to think that a child only has robots to take care of him and the robots don’t even pay attention to him.”",
        "“If this is true, the Qi family is too terrifying!”",
        "“No wonder Qi Shiyan wanted to hide his mental power.”",
        "“This matter must be investigated thoroughly! If what Qi Shiyan said is true, we must not let the Qi family off!” "
    ],
    "previous": "Ch11 - Clear-headed",
    "next": "Ch13 - A Brewing Storm"
}