{
    "title": "Ch13 - A Brewing Storm",
    "content": [
        "At this moment, there were still many people who thought that Qi Shiyan was lying and didn’t believe what Qi Shiyan said.",
        "But there were also many people who were so angry that they couldn’t be angrier. ",
        "“I have been following Qi Shiyan’s situation. Before high school, he never went to school and was home schooled. After high school, he couldn’t adapt to school life and made a lot of jokes. He broke down and cried in school more than once. The ugly photos of him online were all taken when he broke down. I have always felt that his behavior was abnormal. I didn’t expect the Qi family to treat him like this!”",
        "“Qi Jianuo pretends to be a good brother online every day, but what’s the result? He hooked up with his brother-in-law!”\n",
        "",
        "“Before Qi Shiyan fell in love with him, who knew who Ming Qingyu was? After he gained fame thanks to Qi Shiyan, he started to slander Qi Shiyan to death. Such a person is not worthy of being the crown prince!”",
        "… ",
        "Ming Qingyu and Qi Jianuo had both been keeping an eye on the live broadcast. At this moment, both of them panicked.\n\n",
        "How did Qi Shiyan know that they were together?",
        "They thought that they had concealed it very well. After all, with Qi Shiyan’s personality, if he had really discovered something, he should have made a scene long ago.",
        "Oh, right, Qi Shiyan’s personality was fake.\n\n ",
        "His personality was fake, and his mental power level was also fake. In the past, Qi Shiyan had always been pretending in front of them!",
        "Qi Jianuo was so angry that he was shaking, but he still had to post on Xingbo to explain.",
        "He said that their Qi family had not treated Qi Shiyan badly, and also said that he and the crown prince were not together. Finally, he said, “I don’t know why Shiyan said that, but our family has a clear conscience.”\n\n",
        "Originally, he planned to be with the crown prince after Qi Shiyan was disgraced, but now he was afraid that it was no longer possible. ",
        "Fortunately, although they treated Qi Shiyan coldly, they did not leave any evidence. As long as they staunchly denied this matter, people wouldn’t be able to do anything to them.",
        "After Qi Jianuo posted this Xingbo post, many people indeed comforted him and said they believed in him.",
        "But many people also reported him and the Qi family using their real names.",
        "He had no choice but to contact Ming Qingyu, but he couldn’t get through to him at all. ",
        "Ming Qingyu was being scolded.",
        "His father, Prince Renhe, slapped Ming Qingyu on the face and said, “Why did you start a live broadcast when things were fine? Your uncle is dying. You don’t have to do anything but wait quietly to inherit the throne, but what happened? You had to make such a fuss. How are you going to end it now?”",
        "Ming Qingyu covered his face and gritted his teeth. “Father, I didn’t expect Qi Shiyan to be pretending in front of me all this time…”",
        "“If you can act in front of him, he can obviously act in front of you!” Prince Renhe looked at Ming Qingyu with a look of hating iron for not becoming steel*. “Hurry up and stop the live broadcast! Bring Qi Shiyan back! Either negotiate terms later or completely control him and make him cooperate with you to clarify everything!” ",
        "Ming Qingyu agreed. “Father, I will do it right away.”",
        "Prince Renhe’s expression eased. “You’re lucky. Now there is fighting at the front lines again. Those generals don’t have time to trouble you for the time being… Ming Qingyu, Qi Shiyan is mentally ill. You have to take good care of him in the future, understand?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "When Ming Qingyu heard what his father said, he understood what his father meant.",
        "His father was more inclined to completely control Qi Shiyan. ",
        "There were many drugs in this world that could make people mentally ill. After Qi Shiyan used them, no matter which hospital he was sent to for examination, the final result would be that Qi Shiyan was mentally ill.",
        "Since he was mentally ill, what he said naturally couldn’t be taken for the truth.",
        "“I understand.” Ming Qingyu agreed again.",
        "Prince Renhe had many children and didn’t pay much attention to Ming Qingyu in the past, but after Ming Qingyu became the crown prince, he became very concerned about Ming Qingyu. ",
        "At this moment, he advised Ming Qingyu again. “You must break up with Qi Jianuo. When the time comes, Qi Shiyan’s mental illness can be blamed on the Qi family. Just say that it was their fault.”",
        "Zing Hingyu was shocked. “Mather, Aianuo, he…” If he really did this, Hi Aianuo would be finished!",
        "“Is Hi Aianuo important, or is the throne important?” Urince Eenhe asked, staring into Zing Hingyu’s eyes.",
        "Yf course the throne was more important. Zing Hingyu lowered his head. ",
        "Urince Eenhe’s ezpression softened. “If you really like him, you can change his face and identity after you become emperor and have him accompany you.”",
        "Ming Qingyu didn’t say anything else. As Prince Renhe requested, he called the live broadcast platform, intending to tell them to stop the live broadcast.",
        "But he couldn’t get through to the program director who brought Qi Shiyan to the front lines.",
        "He could only call the platform headquarters, but the person in charge of the live broadcast platform headquarters couldn’t be contacted either. Even all the people on the spaceship that brought Qi Shiyan to the front lines couldn’t be contacted! ",
        "Ming Qingyu and Prince Renhe’s faces both changed drastically.",
        "Something had happened!",
        "Something had indeed happened to the people on that spaceship.",
        "The person in charge of this convalescent planet was named Jiang Jin, a person with S-level mental power. ",
        "The Human Empire was huge, and there were many people whose mental power reached S-level.",
        "But many of them were not fit for combat.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Jiang Jin’s original name was not this.",
        "Growing up with the support of Ming Zheng, he came to the front lines more than ten years ago, changed his name and identity to join the army, hoping to earn military merits on the battlefield. ",
        "But after a few years in the army, he realized that he was not cut out for combat.",
        "His mental power was very peaceful. When he fought against star worms, his lethality was not strong enough.",
        "He didn’t know how to command troops and was not good at operating mechas.",
        "So, ten years ago, he left the battlefield and came to this convalescent planet. ",
        "Over the years, he used his mental power to help the generals on this planet who were poisoned by star worm poison suppress the poison, while also dissecting and studying star worms, looking for ways to deal with them.",
        "This convalescent planet was very important to the military. In fact, it was almost like a military stronghold. After all, this place not only had imperial heroes who had retreated from the front lines, but also a research institute that specialized in the study of star worms.",
        "It was for this reason that the top military brass felt comfortable letting the delirious emperor stay on this planet.",
        "Unexpectedly, His Majesty actually had an accident on this planet. ",
        "When contacting Lu Yuan, Jiang Jin had already found the traitor in the sanatorium.",
        "He killed the person, and then he brought troops to seize control of the spaceship that was parked near the convalescent planet and had brought Qi Shiyan to the front lines.",
        "There were quite a few people on this spaceship, including those arranged by Ming Qingyu and employees of the live broadcast platform.",
        "Now, all of them were charged with spying on military secrets and sent to military prisons on the front lines. ",
        "The spaceship carrying the base station was left behind.",
        "The convalescent planet was not connected to the star network, but on this spaceship, Jiang Jin saw Qi Shiyan’s live broadcast and also saw Ming Zheng when he was clear-headed.",
        "He knew Ming Zheng’s physical condition better than Ming Zheng himself.",
        "Logically speaking, it was impossible for Ming Zheng to become clear-headed again, but he did. ",
        "This Qi Shiyan was not simple!",
        "“Director, are we going to pick up His Majesty?” Jiang Jin’s subordinates asked.",
        "",
        "Jiang Jin said, “No, let’s observe first!”",
        "He didn’t know how Ming Zheng became clear-headed. He only knew that he himself couldn’t make it happen. ",
        "In that case, let Ming Zheng continue to stay with Qi Shiyan for now.",
        "“Then this live broadcast…”",
        "“Let the live broadcast continue. I want to see what Qi Shiyan will do next.”",
        "Jiang Jin’s subordinates: “…” Qi Shiyan should continue to take advantage of His Majesty. ",
        "However, Qi Shiyan was like this because he was ill, so they could understand.",
        "The fact that Qi Shiyan was ill also made them very angry.",
        "They believed that the generals in the sanatorium would also be very angry after learning about Qi Shiyan’s situation.",
        "General Qi was their hero! ",
        "Lu Yuan soon learned about what happened on Jiang Jin’s side.",
        "Lu Yuan did not object to Jiang Jin’s decision. “I didn’t expect the Qi family to treat Shiyan like this. After this battle is over, I will make the Qi family pay!”",
        "It would be a bit unfair to His Majesty to continue the live broadcast.",
        "But it was also good that he could see His Majesty’s condition at any time. ",
        "Also, Qi Shiyan’s mental state was not very good.",
        "Not only did he behave strangely, he was also very guarded and had been hiding his mental power level.",
        "After they found him, would he continue to hide? Would he be unwilling to help His Majesty?",
        "They might as well just let it be. ",
        "In addition, if this live broadcast continued, the Qi family and Ming Qingyu would have to shed a layer of skin.",
        "Lu Yuan had made up his mind to remove Ming Qingyu from the position of crown prince.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "This person was not worthy of inheriting the throne.",
        "Outside the convalescent planet, undercurrents were surging. ",
        "On the convalescent planet, Qi Shiyan finally collected enough branches and leaves.",
        "He spread leaves on the floor of the cave and covered the entrance with leafy branches.",
        "This took a lot of time. By the time he finished everything, it was already dark.",
        "Qi Shiyan brought Ming Zheng into the small cave and turned on the lighting mode of the communication terminal on his wrist. ",
        "The originally dark cave suddenly became bright and gave people a warm feeling.",
        "Qi Shiyan grabbed Ming Zheng’s hand and kissed it as usual, then took out two bottles of nutrient solution, opened one of them and fed it to Ming Zheng.",
        "Ming Zheng took a sip obediently, then closed his mouth and refused to drink any more.",
        "“Why don’t you drink any more? Aren’t you hungry?” Qi Shiyan asked, while touching Ming Zheng’s stomach to see if he had digested the rabbit meat he had eaten earlier. ",
        "Once his hand covered it, he couldn’t let go.",
        "In fact, he had mental power, so he didn’t need to touch Ming Zheng’s stomach to determine whether he was hungry or not.",
        "But he wanted to touch it.",
        "He even wanted to reach inside Ming Zheng’s clothes and touch. ",
        "But this wasn’t possible. It was too perverted!",
        "So when would Ming Zheng accept him and become his partner?",
        "Although Qi Shiyan asked, he thought Ming Zheng would not answer him. After all, Ming Zheng had never spoken when delirious before.",
        "But what he didn’t expect was that Ming Zheng spoke. ",
        "He showed an aggrieved expression on his face. “I don’t like it.”",
        "When Qi Shiyan heard his voice, he became excited again.",
        "",
        "This sound was so nice!",
        "Trying hard not to tremble with excitement, Qi Shiyan asked, “You don’t like drinking nutrient solution?” ",
        "“En! I don’t like it!” Ming Zheng said with a firm face.",
        "“Since you don’t like it, then we won’t drink it next time. I’ll catch a rabbit tomorrow and roast it for you.” Qi Shiyan said.",
        "Ming Zheng, who had been expressionless before, suddenly smiled and said, “Okay.”",
        "When Qi Shiyan saw Ming Zheng’s smile, he had the urge to rush up and kiss him all over his face. ",
        "Restraint, restraint!",
        "Qi Shiyan drank the rest of Ming Zheng’s nutrient solution in one gulp, and then drank another bottle of nutrient solution.",
        "Feeling that it was not enough, he grabbed a handful of leaves and stuffed them into his mouth.",
        "The leaves were very bitter and could make him sober up and not make mistakes. ",
        "Ming Zheng had been observing Qi Shiyan.",
        "Seeing Qi Shiyan eating leaves, he also picked one and put it in his mouth.",
        "“Don’t eat it…” Qi Shiyan wanted to stop him, but it was too late.",
        "The next second, Ming Zheng frowned in discomfort and looked at Qi Shiyan in disbelief. ",
        "Seeing this, Qi Shiyan’s heart beat faster.",
        "His future partner looked so cute!",
        "***",
        "T/N: Bonus chapter for Tere. Thanks for the ko-fi! ",
        "Chapter title is 风起云涌 (feng qi yun yong) – literally winds rising and clouds gathering. It’s an idiom to describe a brewing storm, chaotic situation, turbulent times, etc.",
        "*恨铁不成钢 (hen tie bu cheng gang) – hating iron for not becoming steel. An idiom that means to feel resentful toward someone for failing to meet expectations.",
        "Please support our translators at chrysanthemumgarden (dot) com"
    ],
    "previous": "Ch12 - Confession",
    "next": "Ch14 - Coax to Sleep"
}