{
    "title": "Ch14 - Coax to Sleep",
    "content": [
        "Seeing Ming Zheng’s face wrinkled with discomfort, Qi Shiyan stretched out his hand and said, “Spit it out quickly.”",
        "Ming Zheng looked like he wanted to spit out the leaf, but he didn’t really do it. ",
        "He swallowed the leaf, and after swallowing it, he said with a look of grievance, “It tastes so bad…”",
        "“We won’t eat it next time. Do you want to drink some nutrient solution to suppress the taste in your mouth?” Qi Shiyan took out another bottle of nutrient solution.\n",
        "",
        "Ming Zheng immediately covered his mouth. “I don’t want to drink this.”",
        "It could be seen that Ming Zheng really hated drinking nutrient solution. ",
        "But he had nothing else that was edible except the nutrient solution.\n\n",
        "“Then we won’t drink it. Don’t worry, the bitter taste in your mouth will go away after a while… Xiao Guai, are you tired? Do you want to sleep?” Qi Shiyan asked.",
        "“I’m not tired,” Ming Zheng blinked, “I don’t want to sleep.”",
        "“But it’s dark now. It’s time to sleep. Xiao Guai, I’ll tell you a story, and then we’ll go to sleep together after listening to the story, okay?” Qi Shiyan asked again.\n\n ",
        "“Okay.” Ming Zheng agreed immediately, looking expectant.",
        "Qi Shiyan grabbed his hand and kissed it. “Let me tell you the story of the ugly duckling…”",
        "Qi Shiyan told Ming Zheng the story of “The Ugly Duckling” seriously.\n\n",
        "Ming Zheng listened attentively, his expression changing again and again. When the ugly duckling turned into a swan, he exclaimed “Wow” in surprise. ",
        "Qi Shiyan kept staring at him, his eyes a little hot.",
        "In his previous life, he would tell stories to his dolls before going to sleep.",
        "He pretended that they were all alive and told stories vividly to lull them to sleep.",
        "But they would not give him any response. ",
        "He could only change his voice, encourage himself, and perform in the lonely night.",
        "He was the only one left alive in that world. He had really wanted someone to accompany him.",
        "Fortunately, things were different now.",
        "There was someone next to him! ",
        "He was a living person who even liked to listen to him tell stories!",
        "Ming Zheng was very interested in the story. The more he listened, the more excited he became. Qi Shiyan also became more excited. After finishing the story of “The Ugly Duckling”, Qi Shiyan asked, “Do you want to listen to more stories?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng said, “Want!”",
        "Qi Shiyan said, “I can tell many interesting stories. I will tell you a few more.” ",
        "This time, Qi Shiyan did not tell Ming Zheng stories from his previous life. Instead, he picked out some fairy tales from this world in the original owner’s memories and told them to Ming Zheng.",
        "The original owner was treated coldly in the Qi family and lacked love.",
        "He was also afraid of being alone, and even more afraid of sleeping alone.",
        "When he was a little older and could use the communication terminal, he would use it to play fairy tales for himself every time he went to bed. He would have it play all night long. ",
        "The original owner could recite many fairy tales.",
        "Qi Shiyan liked fairy tales that were more positive, so he picked a few and slowly told them to Ming Zheng.",
        "Although Ming Zheng did not show it, Qi Shiyan knew that he must be in a lot of pain all the time because he had been poisoned.",
        "So, while telling stories, he also used his mental power to comfort Ming Zheng and coax Ming Zheng to sleep. ",
        "As he coazed him, the ezcitement in his body slowly subsided.",
        "This leaky cave, which made sleeping uncomfortable, gave him an unprecedented sense of satisfaction. Le wished things could continue like this forever.",
        "Sveryone watching the live broadcast was affected. “These two look so warm and cohy.”",
        "“Hi Shiyan’s demeanor when telling stories reminds me of my mother.” ",
        "“I’m a psychology major. Qi Shiyan’s behavior does seem like he suffers from skin hunger syndrome. He also clearly lacks company.”",
        "“I also feel that he lacks company… So how did he get by in the past? Has anyone started investigating?”",
        "“Someone must be investigating, but the results won’t come out so quickly.”",
        "“This live broadcast has only been going on for one day, but I always feel like a long time has passed…” ",
        "…",
        "Of course, these were comments from ordinary viewers with a calm mind. Those who firmly hated Qi Shiyan still scolded Qi Shiyan and Ming Zheng in the live broadcast.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“This scene is eye-catching.”",
        "“Qi Shiyan is disgusting. He actually coaxed an ugly guy like this.” ",
        "“That ugly guy made all kinds of weird expressions, making me vomit my late night snack!”",
        "“Is this ugly guy an actor chosen by Qi Shiyan? Why did he choose such a weird one?”",
        "“Qi Shiyan is so ugly!”",
        "“Someone actually said it looks warm, but Qi Shiyan keeps touching the other person’s hands. He is clearly a pervert.” ",
        "…",
        "Jiang Jin had been watching the live broadcast.",
        "After seizing control of the spaceship sent by the live broadcast platform, he began to contact Ming Zheng’s subordinates.",
        "“You should have also seen Qi Shiyan’s live broadcast room. Maintain this live broadcast room well and don’t let anyone block it. Then immediately arrange for someone to sue the live broadcast platform. The reason can be spying on military secrets or violating the privacy of the imperial family.” ",
        "“After that, write down the names of all the people who insulted Qi Shiyan in the live broadcast room and sue them together.”",
        "“Investigate the situation of the Qi family and Qi Shiyan’s past experiences as soon as possible!”",
        "…",
        "After doing this, he began to contact the generals who were responsible for training new recruits on several nearby garrison planets. ",
        "Now, the convalescent planet had been exposed and might be in danger. They needed people to come and protect it.",
        "The soldiers on the front lines were fighting the star worms and couldn’t be spared, so they could only send those new recruits who were being trained to come and protect the planet.",
        "The reason for mobilizing troops could be military exercises.",
        "Jiang Jin made arrangements while watching the live broadcast, focusing on Ming Zheng’s behavior. ",
        "The star worm poison would make Ming Zheng delirious, but his instincts remained.",
        "Ming Zheng had always been a very cautious person. Even if he was left with only his instincts, he would still be wary of the people around him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "His behavior was to stay alone quietly and ignore others, just like when he was a child.",
        "He and Ming Zheng had known each other since childhood. Ming Zheng trusted him very much, but he would never show such a vivid expression in front of him. ",
        "Did Ming Zheng trust Qi Shiyan so much?",
        "As he was thinking this, he noticed that there were many messages from Lu Yuan in his communication terminal, asking him what was going on with Ming Zheng’s reaction.",
        "Jiang Jin chuckled and replied, “He should like Qi Shiyan very much.”",
        "Lu Yuan had been doubting life since His Majesty refused to drink the nutrient solution. ",
        "His Majesty didn’t like to drink nutrient solution? How come he didn’t know?",
        "The soldiers on the front lines usually mostly consumed nutrient solution. In order to save trouble, His Majesty also drank nutrient solution.",
        "After receiving the nutrient solution, His Majesty always drank it in one gulp without changing his expression. When did he develop a dislike of nutrient solution?",
        "The most important thing was, how could His Majesty, in his delirious state, still respond to Qi Shiyan? He had clearly cried loudly in front of His Majesty before, but his Majesty ignored him! ",
        "His Majesty actually asked Qi Shiyan to tell stories to coax him to sleep!",
        "Lu Yuan sent several messages to Jiang Jin to ask about this matter, and at the same time, wanted to turn off the live broadcast.",
        "Now no one knew who the disfigured man in the live broadcast was, but if the live broadcast continued, His Majesty’s identity might be exposed.",
        "If that was the case, then all of His Majesty’s current actions would become his black history. ",
        "God, at this moment, His Majesty was actually resting his head on Qi Shiyan’s arm, being hugged by Qi Shiyan and sleeping.",
        "In front of the people of the entire empire, their wise and mighty emperor was hugged by Qi Shiyan and fell asleep!",
        "What was going on with Qi Shiyan?",
        "His arms were so thin and looked so weak. Why was he still hugging His Majesty to sleep? Wasn’t he afraid that his arms would break? ",
        "The key point was that His Majesty unexpectedly slept very soundly.",
        "His Majesty didn’t usually sleep so well.",
        "",
        "Lu Yuan was a little dazed, and then he received Jiang Jin’s message.",
        "What did “He should like Qi Shiyan very much” mean? What was Jiang Jin saying? His Majesty liked Qi Shiyan? ",
        "How was this possible?! They had only known each other for half a day!",
        "Lu Yuan went to watch the live broadcast again, and then saw Qi Shiyan grab His Majesty’s hand, put it in front of himself, and kiss it gently.",
        "These two really looked like a young couple.",
        "Qi Shiyan also knew that Ming Zheng liked him very much. ",
        "He possessed the ability to eliminate toxins, and he had been using his mental power to comfort Ming Zheng. It was impossible for Ming Zheng not to like him.",
        "Ming Zheng was deeply poisoned, and his physical and mental strength were on the verge of collapse.",
        "And he was Ming Zheng’s medicine. Ming Zheng would instinctively get close to him.",
        "After Ming Zheng fell asleep, Qi Shiyan also fell asleep. ",
        "His body badly needed rest.",
        "But he would always jolt awake suddenly while sleeping.",
        "After jolting awake, he felt at peace when he saw Ming Zheng lying obediently in his arms. He grabbed Ming Zheng’s hand and kissed it a few times before continuing to sleep.",
        "He really liked this person. ",
        "And his emotions were also transmitted through his mental power.",
        "There were several times when Ming Zheng was about to wake up, but the mental power that enveloped him made him quickly fall asleep again.",
        "The two of them slept well, but many people stayed awake all night.",
        "It didn’t necessarily mean that they stayed up all night. After all, when it was night where they were, it was actually daytime in many places. ",
        "Ming Qingyu suffered a lot while Qi Shiyan and Ming Zheng slept.",
        "He wanted to get rid of Qi Shiyan through this live broadcast, but now, everything had been messed up.",
        "",
        "This live broadcast was no longer even under his control.",
        "The person in charge of the live broadcast platform that he had cooperated with had been arrested, and the live broadcast platform had also been sued in court. ",
        "Some of the things he did in private might be discovered soon.",
        "The fact that he instigated Qi Shiyan to participate in the live broadcast was not serious and wouldn’t cause him to be convicted, but his reputation would definitely plummet.",
        "Ming Qingyu regretted it deeply.",
        "He should have become the emperor first and then dealt with Qi Shiyan! ",
        "Fortunately, although his uncle was not dead, he was no longer able to handle political affairs.",
        "Therefore, his position as the crown prince was very secure.",
        "Even if his reputation was ruined, he was still the legitimate heir and could ascend the throne after his uncle’s death.",
        "Even though people in the military might dislike him. ",
        "He had to put all the blame on Qi Jianuo.",
        "At this moment, Ming Qingyu actually felt a little resentful toward Qi Jianuo.",
        "He had always looked down on Qi Shiyan who kept pestering him and had never taken Qi Shiyan seriously. In addition, he was about to ascend the throne and he was hot-headed, so he set up this live broadcast.",
        "But he wasn’t stupid. ",
        "Qi Shiyan’s current situation made him realize one thing.",
        "The Qi family probably didn’t treat Qi Shiyan very well.",
        "Qi Jianuo’s words and actions made it seem as if he had always been bullied by Qi Shiyan, but in fact, it was their Qi family who had treated Qi Shiyan badly.",
        "If not for this, why would Qi Shiyan hide his mental power level? ",
        "Not long ago, Ming Qingyu, who felt that he could still control Qi Shiyan, had wanted to protect Qi Jianuo.",
        "But now, he had changed his mind.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "It was the Qi family who harmed him, so don’t blame him for being heartless.",
        "Qi Shiyan didn’t know that Ming Qingyu’s feelings for Qi Jianuo had changed. ",
        "When the sun rose, he woke up.",
        "The person in his arms was still sleeping soundly. He was lying there obediently, so cute and so lovable!",
        "Qi Shiyan moved closer to Ming Zheng and let Ming Zheng’s breath spray on his face.",
        "The warm breath gave him a sense of reality. ",
        "He first pressed his face against Ming Zheng’s face, and then sent some of his recovered supernatural powers into the other person’s body to remove the poison in his body.",
        "After the treatment was over, Ming Zheng should be able to remain clear-headed for a while. At that time, he could make a second confession.",
        "***",
        "T/N: One of the things I like about this story is that it’s short and sweet – the villains don’t jump around forever like in other stories when they should have been finished long ago. It is a little frustrating because obviously Qi Shiyan isn’t aware of the live broadcast and can’t respond (unlike the villains), but overall, things get cleared up quickly and people are actually rational lol. Even Ming Qingyu, as much as I dislike him, isn’t braindead – he’s quickly realized Qi Jianuo’s white lotus persona is just an act. I’ve read a lot of novels where the scum gong has way fewer brain cells and is misled by the white lotus for much longer. "
    ],
    "previous": "Ch13 - A Brewing Storm",
    "next": "Ch15 - Second Confession"
}