{
    "title": "Ch15 - Second Confession",
    "content": [
        "When Ming Zheng woke up, he was a little confused.",
        "Not only was he being held tightly by someone, he was also tightly wrapped by mental power. ",
        "That mental power kept conveying its affection for him to him, as if he was deeply loved.",
        "No wonder he felt inexplicably at peace while he slept.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "At this moment, the memories from last night appeared in his mind.",
        "The person who was holding him at this moment, told him stories, coaxed him to sleep, and used his mental power to help him suppress* the poison. ",
        "For the entire night, the other party had been using his mental power to comfort him. It was due to this mental power that he was able to sleep well and become clear-headed again.\n\n",
        "“Are you awake? Good morning!” Qi Shiyan greeted Ming Zheng enthusiastically.",
        "Ming Zheng then opened his eyes and saw a handsome face very close to him. Their breathing even blended together.",
        "He froze for a moment. After all, from young to now, he had never been so close to anyone.\n\n ",
        "“Good morning.” Ming Zheng looked away and sat up.",
        "He wasn’t used to being held.",
        "But when he sat up, the person in front of him also sat up. This person sat close to him, holding his hand, and continued to look at him with a focused and passionate gaze.\n\n",
        "This was a warm emotion he had never experienced before. It made him feel a little uncomfortable. ",
        "For him, who was born in a laboratory, what he was more accustomed to was the indifference and alienation of others.",
        "He was a lab-grown baby.",
        "Nowadays, there were still many imperial family members whose mental power reached S-level, but their mental power was mostly acquired through the use of various potions, barely allowing them to reach S-level.",
        "If they hadn’t been born into the imperial family, their mental power would never reach S-level. ",
        "But the founding emperor of the imperial family and the early generations of the imperial family were different.",
        "At that time, the Human Empire’s research on mental power was still superficial, and there were no potions that could enhance mental power. The mental power of the ancestors of the imperial family all naturally reached S-level.",
        "The imperial family had always wanted to restore the glory of their ancestors, so they invested in many research institutes and had them study ways to increase mental power.",
        "The imperial family was the largest landlord and business tycoon in the entire empire, possessing innumerable wealth. They had enough money to conduct research, and thus produced many results. ",
        "Currently, 90% of the potions on the market that could enhance one’s mental power level were sold by the Imperial Research Institute.",
        "Many years ago, when the retired emperor had his mental power tested for the first time, his mental power level was only B-. If there was no intervention, his mental power level would be at most A- when he grew up, and it would most likely be B+.",
        "",
        "He had been taking various potions that were not available outside since he was young, and only then did he manage to raise his mental power to S-, which was also considered S-level mental power.",
        "But his S-level mental power was very weak. After taking special potions and undergoing mental power testing, he could only reach the lowest level of S-level mental power. ",
        "He was always dissatisfied with this and wanted to have better offspring, so when he grew up, he married an empress with S-level mental power. As a result, the situation of the eldest prince that was born, now Prince Renhe, was exactly the same as his.",
        "This made the retired emperor very dissatisfied. In order to have better offspring, he asked the laboratory to help him and the empress cultivate embryos. They then screened the best embryos and transplanted them into the empress’s body.",
        "As a result, a researcher in the laboratory used the retired emperor’s genes without authorization and combined them with their own genes to cultivate a child.",
        "This child was Ming Zheng. ",
        "Ming Zheng was bred in secret. The retired emperor didn’t know of his existence at first, and no one in the laboratory, except the researcher, knew that he was part of the retired emperor’s bloodline.",
        "He, Jiang Jin, and some other babies had their genes modified during the embryonic stage.",
        "Who knew if this was the reason, but he had shown mental power far beyond that of ordinary people since he was a child. When he was seven years old, his mental power level had already reached S.",
        "He was the most important experimental subject in the laboratory. In his memory, only robots took care of him. Those robots never talked to him or educated him. ",
        "When he was ten years old, his mental power had already reached S+.",
        "When the retired emperor learned about this, he became very interested and planned to train him as his own bodyguard, so he had his genetic data collected and assigned him an identity.",
        "During this examination, it was discovered that he possessed the genes of the retired emperor.",
        "He was an experimental subject and his genes had been altered. According to the laws of the Human Empire, he couldn’t have offspring. ",
        "Le grew up in a laboratory and had a strange personality. Le didn’t understand anything and didn’t even know how to greet people.",
        "Le was born without the retired emperor’s knowledge.",
        "The retired emperor didn’t like him.",
        "The empress and the other children of the retired emperor disliked him even more. ",
        "Before he was eighteen, very few people knew of his existence.",
        "Later, the retired emperor was afraid of the star worms and sent him to the front lines. Only then did people learn of his existence.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Even fewer people knew about his experience.",
        "And now, seeing the person in front of him, he felt like he was seeing his former self. ",
        "Ming Zheng still remembered that when he was in the laboratory, even though the researchers were very cold to him and none of them had a good look on their faces, he still wanted to get close to them.",
        "He would even hold their fingers while they drew his blood.",
        "They would turn away from him in disgust, but he would still do it again next time.",
        "The person in front of him kept getting close to him, just like when he was a child, he couldn’t help but get close to those researchers. ",
        "Ming Zheng did not shake off Qi Shiyan’s hand.",
        "He actually felt very uncomfortable when he was shaken off by those researchers.",
        "What was more, he didn’t hate this person’s closeness.",
        "Ming Zheng thought a lot, but in fact it only took a moment. ",
        "At this time, Qi Shiyan hugged Ming Zheng’s waist again. “Xiao Guai, my name is Ah Yan*. What’s your name?”",
        "He had confessed that he had a fiancé, but planned to hide his identity.",
        "If the person in front of him knew that he was Qi Shiyan and that his ex-fiancé was the crown prince, Ming Qingyu, he would definitely not want to be with him.",
        "It was better to tell him his real name later. ",
        "Ming Zheng had experienced too many things, and now, his life was about to come to an end.",
        "He was very calm about being called “Xiao Guai” by Qi Shiyan.",
        "There were only the two of them here, so being called “Xiao Guai” was no big deal.",
        "“My name is Ah Zheng*.” Ming Zheng also concealed his identity. ",
        "The name “Ming Zheng” was basically known to everyone in the Human Empire. If the person in front of him knew that he was the emperor, he would probably be frightened.",
        "“Ah Zheng, your name is so nice. Ah Zheng, I like you very much. Can you be my partner?” Qi Shiyan confessed again.",
        "",
        "Ming Zheng felt like laughing.",
        "He didn’t expect that when he was about to die, he would be confessed to several times. ",
        "He did not answer Qi Shiyan’s question, but said instead, “Ah Yan, this planet is a military convalescent planet. There is a military sanatorium on the planet. I used to live in the sanatorium. If people from the sanatorium come to find me, don’t conflict with them. You can go back with them. They will take good care of you.”",
        "The last time he was clear-headed, he didn’t say much to Qi Shiyan because the time was too short. Now he had time to explain the situation of this planet clearly.",
        "This place was a bit far from the sanatorium, and his condition was not good. He had no way to bring Qi Shiyan back.",
        "But people from the sanatorium would definitely come to find him. At that time, he could have Qi Shiyan follow him back to the sanatorium. ",
        "He believed that Jiang Jin would take good care of Qi Shiyan.",
        "“I understand, so can you be my partner?” Qi Shiyan asked again.",
        "Ming Zheng still didn’t answer, and continued, “I came here by airship. The airship is broken, but it is habitable. If you can find it, you can live in the airship. It will be more comfortable.”",
        "The young man in front of him named “Ah Yan” had very strong mental power and would not encounter any danger living in the forest. ",
        "But this cave was not suitable for people to live in.",
        "At this moment, Ah Yan’s face was covered with messy marks because of sleeping on tree branches.",
        "“Ah Zheng, I really like you. Please promise me.” Qi Shiyan confessed tirelessly.",
        "Ming Zheng looked at Qi Shiyan and smiled. “I am not in good health and do not plan to find a partner.” ",
        "“What if your health gets better?” Qi Shiyan asked.",
        "Ming Zheng reached out and touched Qi Shiyan’s head. “If my health gets better, I will be your partner.”",
        "He was too deeply poisoned to recover.",
        "The person in front of him appeared too suddenly. Normally, he should be on guard. ",
        "But he was dying. In this situation, there was no point in arranging for someone to get close to him.",
        "It should be a coincidence that Ah Yan appeared in front of him.",
        "",
        "When Qi Shiyan heard Ming Zheng’s words, he immediately said, “You said it, and you can’t regret it later!”",
        "“I won’t regret it.” Ming Zheng said. ",
        "Qi Shiyan noticed that Ming Zheng looked at him with a kind look.",
        "Yes, it was kindness.",
        "This person clearly treated him as a junior.",
        "But it didn’t matter. After spending a few more days together, this person would discover that he was a real man who was worth relying on! ",
        "Qi Shiyan was very smart.",
        "From Ming Zheng’s mental power, the state of his injuries, and the demeanor he displayed after waking up, he was able to determine that Ming Zheng had once been a high-ranking general.",
        "Judging from Ming Zheng’s reaction, he had a good temper.",
        "Although Ming Zheng might be a little old, he didn’t mind. ",
        "Qi Shiyan had already decided that Ming Zheng would be his future partner. “Don’t worry, I will definitely take good care of you and cure you!”",
        "Ming Zheng smiled again.",
        "He seldom smiled before, but now that he was dying and not on the battlefield, he just followed his heart.",
        "“You look so beautiful when you smile. You are the most beautiful person I have ever seen.” Qi Shiyan said immediately. ",
        "Ming Zheng laughed again. He knew how ugly he looked now.",
        "So, had Qi Shiyan only seen a few people before?",
        "He wanted to ask, but soon felt dizzy.",
        "He was stunned for a moment, and then his eyes became clear and simple again. ",
        "Qi Shiyan knew that Ming Zheng had become delirious again.",
        "He didn’t dare to go too far before, but now…",
        "",
        "Qi Shiyan grabbed Ming Zheng’s hand and kissed it. “Xiao Guai, your hands are so beautiful, the most beautiful hands I have ever seen. Xiao Guai, your eyes are also beautiful, your eyebrows are also beautiful, and your nose is also beautiful… Xiao Guai, you are so cute. You are the cutest person I have ever seen.”",
        "Ming Zheng was very happy to be praised. Although his expression didn’t change, his eyes lit up. ",
        "Seeing this, Qi Shiyan moved closer and put his face against Ming Zheng’s.",
        "First, he put his left cheek against Ming Zheng’s left cheek, and then put his right cheek against Ming Zheng’s right cheek.",
        "So happy!",
        "Ming Zheng also felt very happy. Affer Qi Shiyan finished sticking their faces together, he took the initiative to stick to Qi Shiyan’s face. ",
        "He liked to stick close to Qi Shiyan!",
        "Qi Shiyan felt even happier.",
        "He knew that although his future partner had not yet agreed to his confession, he liked him in his heart.",
        "While the two of them were sticking to each other, the watching Lu Yuan’s blood pressure rose again. ",
        "He really wanted to turn off the live broadcast, then rush to His Majesty, shake His Majesty’s shoulders, and make him sober up.",
        "His Majesty was actually acting sticky with Qi Shiyan in a live broadcast in front of the entire empire!",
        "When His Majesty was still clear-headed, he promised Qi Shiyan that if he got better, he would be Qi Shiyan’s partner.",
        "Did His Majesty truly like Qi Shiyan? ",
        "He was so different with Qi Shiyan!",
        "But His Majesty was dying.",
        "His Majesty’s health would never get better. It was impossible for him to be Qi Shiyan’s partner.",
        "Lu Yuan’s eyes felt a little sore. ",
        "On the other side, Jiang Jin, who was on the spaceship, suddenly burst into laughter.",
        "If Ming Zheng became clear-headed once, that was nothing, but he actually became clear-headed a second time. That was obviously not normal.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Maybe Qi Shiyan could really cure Ming Zheng.",
        "This was really interesting. Ming Zheng, this guy, promised himself away! ",
        "As an uncle, he actually stole his nephew’s fiancé. How amazing!",
        "Jiang Jin’s subordinates looked at Jiang Jin who suddenly laughed and felt a little puzzled.",
        "The director had always been serious before. Why was he suddenly laughing today?",
        "Jiang Jin really liked to see Ming Zheng and Qi Shiyan being close. ",
        "On the Capital Star, Ming Qingyu saw Qi Shiyan getting close to that ugly guy, and his face looked ugly.",
        "Back then, he deliberately approached Qi Shiyan with the intention of taking advantage of Qi Shiyan.",
        "Qi Shiyan had poor talent and an empty head. He had no feelings for Qi Shiyan at all.",
        "But he enjoyed Qi Shiyan’s obsession with him. ",
        "Qi Shiyan’s closeness with another person in the live broadcast made him even more disgusted.",
        "This guy had been lying to him!",
        "When he became emperor, he would definitely make Qi Shiyan pay!",
        "Thinking of this, Ming Qingyu’s gaze unconsciously fell on Qi Shiyan’s face. ",
        "Ever since he told Qi Shiyan that he liked people with petite and delicate figures, Qi Shiyan had been trying to shape himself in that direction.",
        "In the past two years, Qi Shiyan’s appearance disgusted him. He didn’t even want to look at him.",
        "Now that Qi Shiyan had removed the mask on his face, revealing a clean face, he discovered that Qi Shiyan was actually better looking than Qi Jianuo.",
        "He had never touched Qi Shiyan before, but he could get a taste of this person in the future. ",
        "“Have you found out the identity of the person next to Qi Shiyan?” Ming Qingyu asked the people around him.",
        "One of the people around Ming Qingyu said, “The information from the sanatorium is confidential. We haven’t found anything. However, star worm poison can be suppressed by mental power. This person is so deeply poisoned, and it should be because his mental power is too weak to suppress it… He is most likely an inconspicuous A-level expert.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Another person said, “None of those high-level generals who retreated after being poisoned by star worm poison match this person. His status must not be high.”",
        "Ming Qingyu said, “When I inherit the throne, I will make sure he dies!” ",
        "He would not let these two people off for cuckolding* him in front of the entire empire.",
        "***",
        "T/N: *At this point and in some future parts of the story, it’s not known that Qi Shiyan can eliminate the star worm poison, so Ming Zheng thinks Qi Shiyan has only helped him suppress the poison.",
        "*He is only giving his first name (Yan 宴). Technically, his full first name is Shiyan (时宴), but it’s not uncommon for those with two character names to just be referred to by one character (usually the second character). 阿 (Ah or A’) is a prefix Chinese people use in front of names to indicate closeness. Similar to using xiao (small/little), but Ah is used more often for peers and xiao for children or a pet name. ",
        "*Same thing as with Qi Shiyan. Ming Zheng (明诤) introduces himself using only his first name as 阿诤 (Ah Zheng). In English, it’s actually totally normal to only introduce yourself with only your first name, but in Chinese culture, it’s not the norm. People usually give their full names so this is definitely suspicious and they both know it (that the other has something to hide).",
        "*戴绿帽子 (dai lu maozi) – literally wear/put on a green hat. A proverb that means to be cuckolded, to be cheated on."
    ],
    "previous": "Ch14 - Coax to Sleep",
    "next": "Ch16 - Sika Deer"
}