{
    "title": "Ch16 - Sika Deer",
    "content": [
        "Although Ming Qingyu was being questioned, he was not too anxious.",
        "He was the crown prince after all. ",
        "The emperor was already terminally ill. He would soon be able to ascend the throne. Although the Qi Shiyan incident would cause him some trouble, it wouldn’t cause him any serious harm.",
        "Qi Jianuo was different. He didn’t sleep all night last night and was very anxious.\n",
        "",
        "Their family was very careful. Qi Shiyan should not be able to produce evidence of their cold violence against him, but after Qi Shiyan revealed the matter of Ming Qingyu cheating on him, it became difficult for him and Ming Qingyu to be together.",
        "“Jianuo, Ming Qingyu hasn’t replied to you yet?” Qi Jianuo’s father asked. ",
        "Qi Jianuo nodded.\n\n",
        "Father Qi said, “He hasn’t replied to your message. Maybe he wants to pour dirty water on us.”",
        "Qi Jianuo was shocked.",
        "Father Qi gritted his teeth and said, “I really underestimated Qi Shiyan. I didn’t expect him to have been hiding his strength.”\n\n ",
        "Father Qi hated Qi Shiyan, and hated Qi Yuncheng even more.",
        "The Qi family was a large family. When he was a teenager, he was chosen as the heir of the Qi family. He should have enjoyed glory and success, but a branch of the family produced Qi Yuncheng, who was better than him in every way.",
        "His father kept going on and on about how outstanding Qi Yuncheng was. He also spent a lot of money to support Qi Yuncheng’s studies and bought him a mecha.\n\n",
        "At that time, he found Qi Yuncheng displeasing to the eye. ",
        "However, he knew that Qi Yuncheng had a promising future and would be beneficial to the Qi family, so he did not show any dislike for Qi Yuncheng. Instead, he treated Qi Yuncheng as a brother.",
        "Later, Qi Yuncheng passed away and Qi Shiyan was sent to the Qi family.",
        "He used to be Qi Yuncheng’s foil. He didn’t want his son to become Qi Shiyan’s foil.",
        "A little child was really easy to control, not to mention that he had studied psychology. ",
        "Over the years, the money left by Qi Yuncheng became his, and Qi Shiyan was raised by him to be ignorant and incompetent. He had been very pleased with himself.",
        "Who would have thought that Qi Shiyan had actually been acting all along?",
        "He hid it so well that not a single flaw was revealed!",
        "“Dad, what should we do now?” Qi Jianuo asked. ",
        "Father Qi said, “Don’t worry, we will be fine.”",
        "He had always been very careful. Those people couldn’t produce any evidence that he had abused Qi Shiyan.",
        "",
        "It was inherently difficult to obtain evidence for something like cold violence.",
        "Even if they produced evidence, according to the laws of the empire, he only needed to pay Qi Shiyan some compensation. ",
        "Like Ming Qingyu, Father Qi began to prepare for clarification and arranged for people to bring up what Qi Shiyan had done in the past to arouse people’s disgust for Qi Shiyan.",
        "There were already many people who did not believe what Qi Shiyan said in the live broadcast. Now, those people were making a fuss again.",
        "“You guys who keep asking for justice for Qi Shiyan, have you forgotten about those students who were bullied by Qi Shiyan?”",
        "“Having a heroic father, can he be forgiven even if he acts recklessly and bullies others?” ",
        "“In my opinion, Qi Shiyan has no good intentions in hiding his mental power! He might just be trying to avoid going to the battlefield.”",
        "“He insulted a veteran before!”",
        "“The matter of the crown prince and Qi Jianuo having an affair is just Qi Shiyan’s one-sided claim. There is no evidence at all. But Qi Shiyan is having an affair in front of the entire empire!”",
        "… ",
        "Yf course, some people also spoke up for Hi Shiyan. “Tou will know after watching the live broadcast. Hi Shiyan is completely different from the person in the news reports. Who knows whether those news reports are true or false?”",
        "“The person who accused Hi Shiyan of insulting a veteran, I clicked into your account and saw that you keep calling Wiao Xuai an ugly freak*. Tou are also insulting veterans!”",
        "“That’s right. Xiao Guai is wearing a military uniform. This planet is also a convalescent planet for the military. He is also a soldier who has fought on the front lines.”",
        "… ",
        "From the outset, the live broadcast platform had told the audience that Qi Shiyan would be sent to a non-dangerous convalescent planet.",
        "Not long ago, “Ah Zheng*”, who was called “Xiao Guai” by Qi Shiyan, also said that there was a military sanatorium on this planet.",
        "Now, the audience had confirmed that “Ah Zheng” was a frontline soldier.",
        "As a result, everyone’s attitude toward him became much better. There were also people who were curious about his condition. “Why is he a fool one moment and clear-headed another?” ",
        "“From the way he spoke, it seems as if he feels he has no hope of getting better.”",
        "“What kind of illness does he have? Can anyone explain?”",
        "",
        "…",
        "Some people, regardless of the chaos on the star network, focused on watching the live broadcast. “I like this live broadcast very much. It is very warm to watch.” ",
        "“Qi Shiyan not only told Xiao Guai stories to coax him to sleep, but he also woke up several times at night to check on him. He is really completely different from what I imagined.”",
        "“Although Xiao Guai is a little ugly, they inexplicably appear well matched when they stick together.”",
        "“Oh, I’ve gotten used to Xiao Guai’s face. Now, like Qi Shiyan, I think he’s cute and want to stick to him.”",
        "“I want to stick to Qi Shiyan. He’s so handsome!” ",
        "…",
        "In the live broadcast, Qi Shiyan acted sticky with his future partner for a while and then took the other party and left the cave.",
        "He was going to find something to eat to fill their stomachs.",
        "Thinking of this, Qi Shiyan grabbed Ming Zheng’s hand, put it to his lips and kissed it. “Ah Zheng, let’s go hunting together. After I catch prey, I will roast meat for you.” ",
        "Ming Zheng nodded happily. “Okay, I’m hungry!”",
        "“Let’s go!” Qi Shiyan said.",
        "Qi Shiyan used his mental power to clear the way as usual, leading Ming Zheng forward.",
        "Along the way, he would pick some leaves to eat from time to time. ",
        "But this time, Ming Zheng did not eat with him, but kept looking at him with admiration.",
        "Barrage: “Xiao Guai’s expression is making me laugh to death. He must be shocked – someone is actually eating something so disgusting!”",
        "“I used to think that the leaves and weeds that Qi Shiyan ate were delicious. But yesterday, when I saw Xiao Guai’s face wrinkled with bitterness, I realized that they were disgusting… What’s wrong with Qi Shiyan’s taste buds? Why does he eat everything?”",
        "“Qi Shiyan is very abnormal…” ",
        "…",
        "Qi Shiyan thought these leaves were delicious.",
        "",
        "Bitterness was also a kind of flavor. He hadn’t been able to taste bitterness before!",
        "However, plants contained too little energy. They still had to find meat to eat. ",
        "While he was using his mental power to investigate the surrounding situation, he spoke to Ming Zheng. “Ah Zheng, your posture is so straight.”",
        "“Ah Zheng, you are so strong. Do you exercise often? You are really amazing!”",
        "“Ah Zheng, you are really careful while walking. Your shoes haven’t gotten dirty at all!”",
        "“Ah Zheng…” ",
        "In Qi Shiyan’s eyes, his future partner was good in every way.",
        "Therefore, no matter what he saw, he couldn’t help but praise it. He even thought Ming Zheng’s nails were the most beautiful in the world.",
        "Ming Zheng was very happy to be praised.",
        "The people watching the live broadcast couldn’t help but say, “Qi Shiyan used to be sarcastic and mean. I didn’t expect him to be so good at praising people.” ",
        "“I suddenly feel that being his child would be a very happy thing.”",
        "“He is very sensitive to emotions and knows how to take care of people. I wish I had a boyfriend like him!”",
        "…",
        "Jiang Jin couldn’t help laughing when he saw Ming Zheng in the live broadcast holding his head high with his chest puffed out, looking extremely happy to be praised. ",
        "Those in the military didn’t know about Ming Zheng’s past, but he grew up with Ming Zheng in the laboratory and knew Ming Zheng very well.",
        "For example, he knew very early on that Ming Zheng didn’t like drinking nutrient solution.",
        "He (Jiang Jin) didn’t like drinking it either.",
        "Nutrient solution didn’t taste bad, but if one drank it for every meal growing up, they would definitely hate it. ",
        "Because he and Ming Zheng consumed nutrient solution instead of food for a long time when they were young, they ended up with stomach atrophy and had to undergo stomach surgery.",
        "However, even if Ming Zheng didn’t like drinking nutrient solution in the past, he wouldn’t show it. But now, Ming Zheng was picky in front of Qi Shiyan.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Their empire might have an empress.",
        "Just as he was thinking this, Jiang Jin saw the message from Lu Yuan. “Has His Majesty reverted back to how he was when he was a child? I didn’t expect him to be like this when he was a child. It’s quite cute.” ",
        "Jiang Jin sneered.",
        "Ming Zheng was not like this when he was a child. At that time, he always stayed quiet and ignored people.",
        "Now he had not reverted back to his childhood appearance, but was reliving his childhood.",
        "In the live broadcast, Qi Shiyan finally found prey using his mental power. ",
        "It was a beautiful sika deer, grazing at a distance from them, out of sight of the naked eye.",
        "Sika deer were very beautiful. Qi Shiyan kind of wanted to raise one.",
        "But he already had Ming Zheng.",
        "Qi Shiyan was ruthless and used his mental power to end the life of the sika deer. ",
        "Ming Zheng sensed something and looked in the direction of the sika deer with some confusion.",
        "Qi Shiyan asked, “Does Ah Zheng want to go over there? Shall we go over and take a look?”",
        "Ming Zheng nodded. Qi Shiyan took him over, and they just happened to see the sika deer.",
        "Qi Shiyan was pleasantly surprised. “Ah Zheng! You are so lucky. We found a sika deer! We have meat to eat!” ",
        "When he used his mental power to “see” the sika deer, the sika deer was still a little far away from them.",
        "He killed the sika deer without Ming Zheng noticing.",
        "And now, he gave the credit to Ming Zheng.",
        "After saying that, Qi Shiyan picked up Ming Zheng and twirled around with difficulty. “Ah Zheng, you are a very lucky person. Being with you, my luck has also improved! I like you so much!” ",
        "He really liked Ming Zheng, but given the current situation… he needed to exercise.",
        "When he was holding Ming Zheng, he actually felt it was very difficult. This situation couldn’t continue, absolutely not!",
        "",
        "Ming Zheng was actually a little confused about the situation, but Qi Shiyan said he liked him!",
        "He was very happy and wanted to be close to Qi Shiyan. ",
        "Thinking of this, Ming Zheng grabbed Qi Shiyan’s hand and kissed it.",
        "Qi Shiyan was so happy that he coaxed Ming Zheng. “Ah Zheng, kiss a few more times.”",
        "Ming Zheng kissed his hand a few more times, which then led to a series of compliments.",
        "Lu Yuan: “…” Could His Majesty pay attention to his image?! ",
        "Jiang Jin: “Hahahahahahaha!” These were all Ming Zheng’s black history. They must be preserved!",
        "The field of view in the live broadcast room was limited, and mental power couldn’t be seen.",
        "At this moment, the audience was confused. “What’s going on? How did they pick up a sika deer?”",
        "“Are they so lucky?” ",
        "“Wild animals should not be eaten randomly, especially dead wild animals. This deer cannot be eaten!”",
        "…",
        "However, some people noticed something. “You don’t think that this deer was really picked up, do you?”",
        "“Go and look back at Qi Shiyan’s expression. He must have discovered this deer a long time ago.” ",
        "“He must have killed this deer with his mental power. He said they found it just to coax the other person.”",
        "“At such a long distance, he was able to discover the sika deer and kill it with his mental power. His mental power might be A+.”",
        "“Qi Shiyan has really been subverting my impression of him.”",
        "… ",
        "Qi Shiyan didn’t know what other people were thinking.",
        "He was particularly happy at this moment. He could finally feed Ming Zheng again!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He loved to feed people!",
        "He needed to eat more so that he could recover his supernatural powers as soon as possible and cure Ming Zheng. ",
        "Then he would have a partner!",
        "***",
        "T/N: *Probably should have explained this earlier, but this is the term used to describe Ming Zheng, which I’ve been translating as “ugly guy”. 丑八怪 (chou ba guai) is a way to refer to an extremely ugly person in a mean/derogatory tone. It roughly translates to ugly monster/freak.",
        "*The netizens use 阿正 (Ah Zheng), a different “Zheng” than his name, which is 明诤 (Ming Zheng). In the last chapter, Ming Zheng introduced himself as 阿诤 (Ah Zheng), using the same “Zheng” as his real name. I can only conclude that because they sound similar (although not exact –  正 and 诤 are both spelled “Zheng” in English, but they have different tones in Chinese), netizens misheard when he introduced himself during the live broadcast and thought it was 阿正 when he said 阿诤. "
    ],
    "previous": "Ch15 - Second Confession",
    "next": "Ch17 - Feeding"
}