{
    "title": "Ch17 - Feeding",
    "content": [
        "Qi Shiyan reluctantly let go of Ming Zheng’s hand. “Ah Zheng, I have to deal with the sika deer. I can’t hold your hand anymore. Stand behind me and put your hand on my neck, okay?”",
        "He wanted to stick to Ming Zheng all the time. If he wasn’t so weak, he would have wanted to carry Ming Zheng on his back all the time. ",
        "Ming Zheng was a little confused, but he was very obedient. He stood behind Qi Shiyan, put his hand on the back of Qi Shiyan’s neck and pinched it.",
        "He also used his other hand to play with Qi Shiyan’s hair and pinch Qi Shiyan’s earlobes like a naughty child.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Shiyan was very satisfied. He took out the multi-purpose pen, flicked out the blade, and started processing the sika deer meat.",
        "At the same time, his mental power was tightly wrapped around Ming Zheng, sensing everything about Ming Zheng. ",
        "Cooking for one’s partner was such a blessing!\n\n",
        "Qi Shiyan had a big smile on his face. He quickly processed the sika deer meat and started picking up branches and dry grass as firewood.",
        "While he was doing things, Ming Zheng followed him with his hand on his neck.",
        "Ming Zheng seemed to treat this as a game and was having a lot of fun. Qi Shiyan felt warm inside when he saw him constantly following him.\n\n ",
        "This person was his, his!",
        "In the past, he couldn’t keep those who loved him around him, but this time, he would definitely let his Ah Zheng live a long life to one hundred years old!",
        "Well, people in the interstellar era lived longer than a hundred years, so he wanted his Ah Zheng to be the longest-lived person and stay with him forever.\n\n",
        "“Ah Zheng is so good. You haven’t let go of me at all!” ",
        "“Who is the most obedient person in the world? It’s Ah Zheng!”",
        "“Ah Zheng, you even helped me collect firewood. How can you be so awesome?!”",
        "…",
        "Ming Zheng helped pick up a dead branch and was praised by Qi Shiyan. ",
        "Even though his face was blueish purple, one could still see his excitement and joy.",
        "Seeing this, Jiang Jin chuckled, “You’re so happy after just a few compliments. You’re hopeless.”",
        "He felt a little jealous. For experimental subjects like them, no one had ever praised them before!",
        "No one around Jiang Jin spoke. ",
        "Their director seemed very reliable before, but now… why did they feel that their director was laughing at His Majesty?",
        "Well, they were also laughing at His Majesty.",
        "Please visit chrysanthemumgarden (dot) com",
        "At this time, someone came to report. “Director Jiang, the new recruits who were undergoing training on the nearby garrison planet have all arrived. Should we send them to the convalescent planet or have them stand guard in space?”",
        "Jiang Jin said, “Have them stand guard in space. I know it’s boring to be stationed in space. Doesn’t this spaceship have signal? Give them the signal and let them watch the live broadcast to relax.” ",
        "Jiang Jin’s subordinates said, “Isn’t this a bit bad?” The person in the live broadcast was His Majesty!",
        "Jiang Jin said, “The whole network is watching. Adding them won’t make much difference!”",
        "That was right…these people went to arrange the new recruits.",
        "There were tens of thousands of new recruits that had come to the convalescent planet this time. ",
        "They were a little confused and didn’t know what they needed to do after arriving here. Then they were told that they could connect to the star network to watch a live broadcast.",
        "At first, they were a little confused about the situation and didn’t know Qi Shiyan and Ming Zheng, but after searching on the star network and finding out the whole story, they became angry.",
        "They were all born on border planets. The network they usually accessed was a network controlled by the military at the border.",
        "They didn’t know much about Qi Shiyan’s life on the Capital Star. ",
        "Now that they found out that Qi Shiyan suffered from skin hunger syndrome and had been hiding his mental power level, they were all heartbroken!",
        "It was at this time that the First Legion’s official Xingbo announced the reason why Qi Shiyan participated in this live broadcast.",
        "At the instruction of the crown prince, the live broadcast platform signed a contract with Qi Shiyan, saying that it would broadcast live the process of Qi Shiyan visiting frontline soldiers to comfort them.",
        "But they privately discussed with the crown prince another method of live broadcast, which was to send Qi Shiyan to the convalescent planet and broadcast the event live without Qi Shiyan knowing anything about it. ",
        "On the star network, those who were on Qi Shiyan’s side were furious. “I knew there was something fishy about this live broadcast! Sure enough!”",
        "“Ming Qingyu’s previous kindness to Qi Shiyan was really just an act. No wonder Qi Shiyan had to hide his mental power level.”",
        "“I still remember when the live broadcast just started, the barrage was full of insults… Did Ming Qingyu deliberately arrange tor people to scold Qi Shiyan? He is a grown man, but he uses this kind of method to deal with his fiancé. It’s too petty.”",
        "“Ming Qingyu is not worthy of being the crown prince!” ",
        "…",
        "Most of these comments were anonymous.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Qingyu was angry, but there was nothing he could do about them.",
        "However, he had already prepared a solution and immediately admitted his mistake and apologized on Xingbo. ",
        "As before, he asked someone to write the apology statement for him.",
        "In this statement, he said that Qi Shiyan had been clinging to him too much, leaving him no time to handle his own affairs, which was why he suggested that Qi Shiyan go to the front lines to comfort wounded soldiers.",
        "As for sending Qi Shiyan to the convalescent planet and starting the live broadcast, these things were not arranged by him. They were arranged by people around him who had objections against Qi Shiyan and who wanted to teach Qi Shiyan a lesson. As soon as he learned about this, he contacted the sanatorium and asked them to go pick up Qi Shiyan, but for some reason, the people from the sanatorium still hadn’t gone to pick up Qi Shiyan.",
        "Between the lines of this statement, he also revealed a bit of grievance – he was deceived by Qi Shiyan, and the people in the sanatorium also did not take him seriously. ",
        "As a result, many people still stood on his side.",
        "“Qi Shiyan is really annoying. It’s normal for someone to want to plot against him!”",
        "“What does this have to do with His Highness?”",
        "“Even if this live broadcast was arranged by His Highness, it is understandable. At that time, Qi Shiyan was acting weird and always causing trouble. It is normal for His Highness not to like him!” ",
        "…",
        "Seeing these comments, Ming Qingyu felt relieved.",
        "This matter was over.",
        "As for the fact that Qi Shiyan was abused as a child and suffered from skin hunger syndrome, those things had nothing to do with him. ",
        "Ming Qingyu asked people to guide public opinion and whitewash himself. Sure enough, there were fewer comments questioning him online.",
        "He was very proud, but he didn’t know that those people from the military who used to be on good terms with him had now made up their minds not to associate with him anymore.",
        "The person who revealed the situation on the convalescent planet to him had been punished and was writing a self-criticism.",
        "Only a few people knew Ming Zheng’s current appearance, but Ming Zheng’s condition wasn’t good. The military top brass all knew this. ",
        "So in the past few years, many people had shown goodwill toward Ming Qingyu.",
        "When they chatted with Ming Qingyu, they also revealed some things.",
        "",
        "For example, when Ming Qingyu asked about a general who was once very brilliant but later disappeared without a trace, they mentioned the military sanatorium.",
        "It was originally no big deal for them to mention this. After all, after Ming Zheng died and Ming Qingyu ascended the throne, Ming Qingyu would know these things sooner or later. ",
        "But who would have thought that Ming Qingyu would actually conduct a live broadcast on that convalescent planet?!",
        "Ming Qingyu was broadcasting live on the planet and had the spaceship carrying the base station parked nearby. He did not take the lives of the generals in the sanatorium seriously at all.",
        "After Qi Shiyan’s live broadcast began, high-ranking military officials gradually learned about this matter.",
        "When they found out, they were furious. ",
        "“We must not allow Ming Qingyu to ascend the throne.”",
        "“My old leader is on the convalescent planet. Now that he has exposed the convalescent planet and made it a target, there might be a surprise attack from star worms! Damn it!”",
        "“Among the members of the imperial family, I only obey His Majesty. What the hell is this Ming Qingyu?”",
        "“In fact, His Majesty has mentioned before that the imperial family is unnecessary…” ",
        "…",
        "The military generals disliked Ming Qingyu, but had a good impression of Qi Shiyan and “Ah Zheng”.",
        "“Who is that Ah Zheng? He’s been poisoned so badly. How come I haven’t heard of him before?”",
        "“Is it because his mental power level is relatively low and he was accidentally implicated?” ",
        "“Qi Shiyan doesn’t dislike him at all. He’s a good child.”",
        "“If I had known the Qi family were such bastards, I would have taken Qi Shiyan and raised him myself!”",
        "“Have the Qi family’s affairs been investigated yet?”",
        "“This child can come to my army unit in the future.” ",
        "…",
        "Those who didn’t recognize Ming Zheng mainly focused on Qi Shiyan.",
        "",
        "Those who recognized Ming Zheng looked at Ming Zheng and Qi Shiyan being intimate on the live broadcast with strange expressions on their faces. No one said a word.",
        "They didn’t expect His Majesty to have such a cute side. They kind of wanted to raise His Majesty… ",
        "In the live broadcast, Qi Shiyan had already roasted the outermost layer of the sika deer.",
        "He asked Ming Zheng to hold his neck and then used a knife to cut off a piece of meat from the outer layer of the sika deer and gave it to Ming Zheng to eat.",
        "As soon as he put the piece of meat near Ming Zheng’s mouth, Ming Zheng ate it obediently.",
        "Qi Shiyan asked, “Is it delicious?” ",
        "“Delicious!” Ming Zheng was very flattering.",
        "He liked to have someone cook for him and feed him.",
        "He didn’t know what to say, but just looking at Qi Shiyan made him want to smile.",
        "Qi Shiyan just happened to like feeding people, so he cut the meat piece by piece and fed it to Ming Zheng, praising him as he fed him. “Ah Zheng, you are not picky about food at all. You are so good!” ",
        "“Ah Zheng, you have such a good appetite. No wonder you are so strong!”",
        "“Ah Zheng, you eat so fast and your teeth are so white!”",
        "…",
        "Ming Zheng ate with more gusto. ",
        "While Qi Shiyan fed Ming Zheng, he of course also ate a lot himself. He even used his mental power and supernatural powers to aid digestion and build muscle.",
        "He must become stronger. His goal was to be stronger than his family’s Ah Zheng. It would be best if he could carry his family’s Ah Zheng on his back and run around.",
        "Jiang Jin: “…” He didn’t know this guy Ming Zheng would have such a good appetite after falling ill!",
        "Why did this person refuse to eat one more bite when he was in the sanatorium? ",
        "Lu Yuan: “…” Was this live broadcast really not being turned off?",
        "The new recruits shared the star network signal with the veterans. Now those veterans who had retired from the front lines and were resting had also gone to watch the live broadcast. They were also guessing who “Ah Zheng” was.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "If they knew that “Ah Zheng” was His Majesty…",
        "Some bigwigs in the military: “…” Was this really His Majesty? ",
        "His Majesty had always been decisive and resolute in killing. They had followed him for twenty years and had never seen him smile. Now he was actually acting clingy with others…",
        "As for ordinary audience members, they didn’t think so much.",
        "However, there was a small group of people who supported the Qi Shiyan and “Ah Zheng” CP, and even thought that “Ah Zheng” was ugly and cute."
    ],
    "previous": "Ch16 - Sika Deer",
    "next": "Ch18 - Airship"
}