{
    "title": "Ch18 - Airship",
    "content": [
        "This sika deer was much bigger than a rabbit and weighed more than 100 catties*.",
        "After getting rid of the skin and internal organs, there were still about 70 to 80 catties of pure meat. ",
        "Qi Shiyan and Ming Zheng both had good appetites, but they couldn’t eat so much in one sitting.",
        "After they ate their fill, Qi Shiyan found a long branch to use as a shoulder pole, then tied the remaining meat on it, so he could carry it while walking.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "This way, he could eat meat whenever he wanted, which was quite good.",
        "Ming Zheng liked to eat roasted sika deer, and Qi Shiyan liked it even more. ",
        "This meat did not contain poison. With every bite, he could feel the protein and fat blooming on the tip of his tongue, and could also feel the energy entering his body.\n\n",
        "His supernatural powers were recovering and his body was getting stronger.",
        "This meat was already very delicious. He couldn’t even imagine how much better it would taste after adding some seasoning.",
        "Putting the “carrying pole” on his shoulders, Qi Shiyan held Ming Zheng’s hand and continued walking forward.\n\n ",
        "When Ming Zheng was clear-headed in the morning, he told him to find the airship. He planned to do as Ming Zheng said.",
        "The original owner had memories of airships. Airships were a bit like automobiles on the planet he was originally from, except that they could travel on land and also fly in the air.",
        "The interior spaces of airships in the interstellar era were designed to be very comfortable. In order to allow passengers to rest better when the airship was autonomously flying, the seats inside could also be converted into beds.\n\n",
        "Even if the airship broke down and could not be driven, it was still a small house that could shelter from the wind and rain. Living in it would definitely be more comfortable than living in a cave. ",
        "Ming Zheng had also said that the military sanatorium would come look for them. If that was the case, the probability of being found by the people from the military sanatorium would definitely be greater if they lived in the airship.",
        "Qi Shiyan didn’t want to be found by Ming Qingyu’s people, but he was very happy to be found by people from the military sanatorium.",
        "Although the original owner had a bad reputation, his father was Qi Yuncheng after all. People from the military would definitely protect him.",
        "In this vast forest, it was not easy to find the airship that Ming Zheng had ridden in before. Fortunately, Ming Zheng left some traces when he ran all the way here yesterday. ",
        "Qi Shiyan used his mental power to search for those traces and moved forward with Ming Zheng.",
        "Carrying meat on his shoulders and holding his partner’s hand.",
        "Life at this moment was full of hope for Qi Shiyan.",
        "He was in high spirits, and as he walked forward, he talked to Ming Zheng beside him. “Ah Zheng, look at that tree. It looks so strange.” ",
        "“Ah Zheng, look, that flower is so beautiful.”",
        "“Ah Zheng, there is a little bird over there!”",
        "",
        "“Ah Zheng…”",
        "… ",
        "Qi Shiyan found everything new and fresh and shared it with Ming Zheng with great interest.",
        "Ming Zheng was also very supportive. He looked at whatever Qi Shiyan mentioned with his eyes shining.",
        "Seeing him like this, Qi Shiyan was so pleased that he grabbed the other person’s hand and kissed it.",
        "The people watching the live broadcast looked at them and felt their hearts calm down. “Watching Qi Shiyan’s live broadcast, I noticed a lot of things that I would not have noticed before.” ",
        "“I feel a lot calmer.”",
        "“This live broadcast’s camera is really good. The flowers, plants and trees around Hi Shiyan are captured very clearly. I always thought that there was nothing good to see on an undeveloped planet, but now I think this place is very beautiful.”",
        "…",
        "Hi Shiyan and Zing Iheng did not walk very fast. They walked and stopped from time to time, eating some meat and plants on the roadside from time to time. ",
        "Although they weren’t really doing anything, Qi Shiyan felt extremely blessed.",
        "He was actually very tired.",
        "The original owner of this body rarely exercised and had been on a diet for a long time, making himself very weak.",
        "Even with his mental power to clear the way, walking in the mountains and forests for a long time carrying the deer meat made him exhausted. ",
        "But even though his legs were shaking, his spirits were still high. After grabbing Ming Zheng’s hand and kissing it, he regained his strength.",
        "The military leaders who were watching the live broadcast noticed this and had a better impression of him.",
        "“Qi Yuncheng’s son is someone who can endure hardships.”",
        "“It’s a pity that he didn’t receive good training before, otherwise he would have become a powerful warrior by now.” ",
        "“He is still young and there is still time. I will go see him after this battle is over.”",
        "…",
        "",
        "In the live broadcast, Ming Zheng also noticed something strange about Qi Shiyan. He stopped and stared at Qi Shiyan.",
        "“Ah Zheng, why aren’t you walking anymore?” Qi Shiyan asked, panting, and then praised, “Ah Zheng, you are really amazing. You walked for such a long time, yet you’re not short of breath.” ",
        "Ming Zheng thought for a moment and said, “I can be even more powerful.”",
        "“Really?” Qi Shiyan asked.",
        "Then the next second, Ming Zheng squatted down and carried him on his back. “I can walk while carrying you!”",
        "Qi Shiyan: “…” ",
        "Damn Ming Qingyu!",
        "If it weren’t for him, the original owner wouldn’t have made himself so weak.",
        "In addition to eliminating toxins, his supernatural powers could also heal people. Given enough time, he could make himself the strongest man in the world.",
        "But there was not enough time now. ",
        "Qi Shiyan didn’t want to be carried on Ming Zheng’s back. He wanted to carry Ming Zheng on his back and show his strength in front of Ming Zheng.",
        "But when he lay on Ming Zheng’s back, his whole body pressed against Ming Zheng, and he suddenly felt that being carried was pretty good.",
        "“Ah Zheng, you’re awesome!” Qi Shiyan hugged Ming Zheng tightly, with his face pressed against Ming Zheng’s head.",
        "When he was a child, there had also been people who had carried him on their backs. It felt really good to be carried. ",
        "Ming Zheng, who was praised, strode forward happily.",
        "Although Ming Zheng was poisoned, the poison did not affect his physical fitness, so he walked very quickly.",
        "Qi Shiyan lay on his back, using his mental power to clear the way for him, and occasionally sliced ​​a piece of roasted deer meat to feed him.",
        "While feeding Ming Zheng meat, Qi Shiyan also ate a lot himself. ",
        "Ordinary people would definitely suffer from indigestion if they ate so much meat, but fortunately they weren’t ordinary people.",
        "Qi Shiyan could clearly feel that his supernatural powers were recovering rapidly.",
        "Please visit chrysanthemumgarden (dot) com",
        "He treated Ming Zheng twice.",
        "Yesterday, he helped Ming Zheng eliminate about one percent of the poison. This morning, he helped Ming Zheng eliminate twice as much poison as yesterday. ",
        "According to the recovery speed of his supernatural powers, by tomorrow morning, the amount of poison he could help Ming Zheng eliminate would be twice as much as this morning.",
        "By then, Ming Zheng should be able to remain clear-headed for longer. After a few days, Ming Zheng would even be able to remain clear-headed all the time.",
        "As for eliminating all the poison from Ming Zheng’s body, it would probably take half a month.",
        "In another half a month, he would have a partner! ",
        "Once again, Qi Shiyan resisted the urge to kiss Ming Zheng on the face.",
        "He didn’t want Ming Zheng to think of him as a pervert.",
        "The two walked until evening before they saw the airship that Ming Zheng had mentioned.",
        "This airship was silver-white and full of technological marvel. ",
        "It was out of place in the primitive forest, but it looked beautiful. Qi Shiyan said, “This airship is so beautiful!”",
        "People in the live broadcast room also said, “This airship is so beautiful!”",
        "“Finally, they found the airship. They don’t have to sleep in a cave tonight.”",
        "“Their journey was so heartwarming. Watching this live broadcast, my mood has suddenly improved.” ",
        "“I don’t know why, but I’ve started to ship this CP.”",
        "“Is it possible to heal Ah Zheng’s face? I hope they can be well and stay together forever.”",
        "…",
        "As they were talking, someone suddenly said, “This airship isn’t quite right. Why does it look so much like the limited edition airship, the Starlight, produced by the Cormier Company?” ",
        "“After the release of the Starlight, many people modified their airships to look like the Starlight. This airship should have been modified as well.”",
        "“The Starlight was limited to only 100 units, and the price was in the billions. Even with money, people couldn’t buy it. This airship can’t be the Starlight.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "As everyone was talking, Ming Zheng had already arrived next to the airship. ",
        "Sensing Ming Zheng’s presence, the door of the airship opened automatically, and the layout inside was revealed to everyone.",
        "Although the original owner of Qi Shiyan’s body was very famous, he was also very poor. In addition, he had no interest in things like airships, so he didn’t know anything about the Starlight.",
        "But the netizens watching the live broadcast were different.",
        "This live broadcast room had a lot of viewers. Among these viewers, there might be none that had bought the Starlight, but there were definitely many airship enthusiasts. ",
        "These people knew too much about the Starlight, which was recognized as the “most expensive airship”!",
        "“Oh my god, this interior. It’s really the Starlight!”",
        "“What’s the background of this Ah Zheng? He actually brought Qi Shiyan to a Starlight airship!”",
        "“This is definitely the Starlight! The Starlight that can travel throughout the universe!” ",
        "“I’ve never heard of the existence of a military sanatorium before. Soldiers who are injured are all treated in military hospitals… The people living in this sanatorium are probably not simple.”",
        "“Speaking of this… I’m a military enthusiast. Although I haven’t had the opportunity to go to the front lines, I pay special attention to the news from the front lines. I discovered one thing a long time ago. Many high-ranking military generals will disappear after fighting with high-level star worms. The military has not announced their deaths, but there hasn’t been any news about them afterward… Could these generals be on this convalescent planet?”",
        "…",
        "Even ordinary viewers were speculating this, not to mention the soldiers who were watching the live broadcast. ",
        "The new recruits that Jiang Jin found went to train in batches today under Jiang Jin’s arrangements.",
        "People who weren’t training could watch the live broadcast.",
        "They became excited after seeing netizens’ speculations.",
        "There might be people they admired living on the planet near them! This was really awesome! ",
        "Jiang Jin’s subordinates were a little worried. “Director, should we block the news online?”",
        "Jiang Jin said, “After the live broadcast started, the news has already spread. There is no need to make a fuss now.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Both the upper echelons of the Human Empire and the star worms knew that those who had been poisoned by star worm poison must be recuperating in a secret place.",
        "When Ming Qingyu sent Qi Shiyan to the convalescent planet, the people and star worms who knew the inside story had already guessed what was on this planet. ",
        "What was more, His Majesty appeared in the live broadcast.",
        "Those people might not recognize His Majesty, but as soon as they saw His Majesty’s appearance, they would know that His Majesty had been poisoned by star worm poison.",
        "In the live broadcast, Qi Shiyan knew nothing about the price of this airship.",
        "He got off Ming Zheng’s back and was a little surprised. “This airship looks really good!” ",
        "“Ah Zheng, it’s great to have you! We can sleep comfortably here tonight.”",
        "“Ah Zheng, this airship suits you very well. You both look really good.”",
        "Qi Shiyan continued to praise as usual, but as he was praising, his expression suddenly changed. “Ah Zheng, get out. This airship has been tampered with!”",
        "He discovered some not-so-good things in this airship. ",
        "Those things had no effect on him, but they would stimulate the poison in Ming Zheng’s body.",
        "Someone wanted to harm Ming Zheng!",
        "Qi Shiyan quickly pushed Ming Zheng out of the airship.",
        "He was a little anxious at first, but after they were out of danger, he smiled again. “Ah Zheng, there was poison in my escape pod and there is also poison in this airship. We are really destined for each other. We are also very lucky. Look, we are both alive and well.” ",
        "***",
        "T/N: *Catty (斤, jin). This is sometimes left untranslated in webnovels as “jin” and is a Chinese unit of mass. Historically, a catty was equal to about 1.33 pounds or 600 grams. However, in modern China, they have standardized the catty to 500 grams."
    ],
    "previous": "Ch17 - Feeding",
    "next": "Ch19.1 - Like"
}