{
    "title": "Ch19.1 - Like",
    "content": [
        "“Ah Zheng, we will live for a long, long time.” Qi Shiyan hugged Ming Zheng, then grabbed Ming Zheng’s hand and kissed it.",
        "Ming Zheng was a little confused about the situation, but he was infected by Qi Shiyan’s smile. He looked at Qi Shiyan and also smiled. ",
        "Both seemed happy that they had survived.",
        "Those watching the live broadcast on the star network were dumbfounded. “What did Qi Shiyan say? His escape pod contained poison?”\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“I’ve always wondered why Qi Shiyan would rather sleep in a cave than in his escape pod. It turns out that the escape pod contains poison!”",
        "“Why would there be poison in the escape pod? Is someone trying to kill Qi Shiyan?” ",
        "“What’s going on with Ah Zheng? Isn’t this a military convalescent planet? How could there be poison on his airship?”\n\n",
        "“So Ah Zheng’s weird appearance is because he’s been poisoned?”",
        "…",
        "Jiang Jin and Lu Yuan saw the Starlight airship and were originally happy that His Majesty didn’t have to sleep in a cave at night. Then they heard Qi Shiyan’s words and were immediately startled.\n\n ",
        "There were drugs on the airship that could stimulate the star worm poison in His Majesty’s body. They had already learned about this from the traitor.",
        "However, the traitor did not put a lot of drugs in the airship. After such a long time, they should have almost completely dissipated. That was why they didn’t interfere with Qi Shiyan’s search for the airship.",
        "They guessed that His Majesty also knew this, which was why he told Qi Shiyan to find the airship.\n\n",
        "But they hadn’t expected Qi Shiyan’s escape pod to also contain poison. ",
        "Was Ming Qingyu crazy? He organized such a live broadcast, and not only wanted to ruin Qi Shiyan, but also poisoned Qi Shiyan?",
        "He and Qi Shiyan had no grudges, plus the fact that he was chosen as heir by His Majesty was related to Qi Shiyan… Wasn’t it too vicious for him to do this?",
        "Or, was there someone else behind this?",
        "Jiang Jin stood up suddenly and said to those around him, “Those people from the live broadcast platform haven’t been sent away yet, right? Keep interrogating them! I want to know what’s going on with that escape pod!” ",
        "“Old* Li, you have the best mecha skills. Go and bring back the escape pod tonight and inspect it carefully.”",
        "“How is the investigation going into Qi Shiyan’s past? Why is there no result yet?”",
        "Jiang Jin had a serious expression on his face as he went over the follow-up of the various things he had arranged.",
        "At the same time, many military generals were also paying close attention to this matter. ",
        "The son of Qi Yuncheng, who sacrificed his life for the empire was nearly killed. This matter must be investigated thoroughly!",
        "If this was done by Ming Qingyu, then Ming Qingyu’s previous light apology was not enough.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Qingyu must pay for what he had done!",
        "At this time, many people came to Ming Qingyu’s Xingbo and asked Ming Qingyu to give an explanation – Qi Shiyan’s live broadcast was arranged by Ming Qingyu. Now it turned out there was poison in the escape pod – was it also related to Ming Qingyu? ",
        "Among those who questioned Ming Qingyu, some were very famous, including well-known scientists from the Imperial Research Institute.",
        "Ming Qingyu hadn’t slept well in the past two days. He had nothing to do today, so he went to take a nap.",
        "As a result, he was woken up in the middle of his nap.",
        "His expression was not good. “What’s going on? Didn’t I tell you not to disturb me?” ",
        "Zing Hingyu’s subordinate said, “Tour Lighness, Hi Shiyan said in the live broadcast room that the escape pod he was riding in contained poison. Now the people want you to give an ezplanation.”",
        "Zing Hingyu was startled and immediately opened the star network.",
        "Le watched the live broadcast while checking the news on Wingbo.",
        "Xingbo was full of people scolding him and asking him to provide an explanation, while in the live broadcast, Qi Shiyan was communicating with the Starlight’s intelligent system. ",
        "Starlight’s propulsion system was broken, so it could not fly, but the intelligent system on the airship was still intact.",
        "Qi Shiyan said, “Turn on the air circulation system and self-cleaning system on the airship and clean it.”",
        "The airship’s intelligent system replied in a cold voice, “Received.”",
        "After it finished speaking, it initiated the cleaning procedures and began to clean the interior of the airship. ",
        "Qi Shiyan took a look at the airship, then pulled Ming Zheng to sit next to him.",
        "He placed Ming Zheng’s hand on the back of his neck, cut off a piece of deer meat with a knife, and asked, “Ah Zheng, do you want to eat meat?”",
        "Ming Zheng shook his head. When he was carrying Qi Shiyan on his back while traveling, Qi Shiyan fed him meat from time to time, so he was not hungry at all right now.",
        "At this moment, his attention was attracted by Qi Shiyan’s earlobe. After pinching the back of Qi Shiyan’s neck, he began to pinch Qi Shiyan’s earlobe. ",
        "Qi Shiyan liked his behavior. He stuffed the meat into his mouth and then cut another piece of meat to eat.",
        "The audience watching the live broadcast were speechless. “After discovering poisonous drugs, how come Qi Shiyan isn’t taking it seriously at all?”",
        "",
        "“They are actually affectionately eating roasted meat together!”",
        "“It’s amazing. These two have never separated since they met. They are like conjoined twins.” ",
        "“It is confirmed that Qi Shiyan suffers from skin hunger syndrome. It seems that Ah Zheng also suffers from skin hunger syndrome.”",
        "“I’m anxious to death! Why didn’t Qi Shiyan say a few more words about the situation?”",
        "“Have you noticed that the amount of food Qi Shiyan eats is a bit strange? He and Ah Zheng almost ate up a whole deer. He even ate much more than Ah Zheng.”",
        "“I noticed this a long time ago, and I even sent out a barrage before… I originally thought it was because he dieted too much before, so now he can’t help but overeat. But thinking about it carefully, even if he suddenly has the urge to overeat, it’s not normal to eat so much…” ",
        "“What the hell is going on with him?”",
        "…",
        "Qi Shiyan didn’t know what the audience was thinking.",
        "He left a piece of meat for Ming Zheng and ate the rest of the deer meat. ",
        "After eating it all, he hugged Ming Zheng who had been pinching his earlobe. His supernatural powers entered Ming Zheng’s body and began to help Ming Zheng eliminate the poison in his body.",
        "He originally planned to wait until tomorrow morning to help Ming Zheng eliminate the poison.",
        "But there was poison targeting Ming Zheng on the airship. He had to let Ming Zheng know about this.",
        "The barrage started chatting again. “After eating and drinking to his heart’s content, he hugged Ah Zheng. Qi Shiyan is really living life happily.” ",
        "“This live broadcast is making me anxious to death. I’m constantly worried about them, but they are just hugging and sticking to each other.”",
        "“There’s poison on the airship, which clearly means someone wants to harm Ah Zheng. Could that person be nearby?”",
        "…",
        "Jiang Jin stared at the live broadcast without moving. ",
        "The previous two times His Majesty had become clear-headed, Qi Shiyan had held His Majesty in his arms for a long time without moving.",
        "It was the same this time.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "If his guess was correct, Qi Shiyan should be helping His Majesty suppress the poison.",
        "Next, would His Majesty become clear-headed again? ",
        "Jiang Jin guessed correctly. Not long after, Ming Zheng’s eyes became clear and focused.",
        "Everything that happened that day appeared in Ming Zheng’s mind.",
        "He froze when he thought about what he had done that day.",
        "He actually imitated Qi Shiyan and kissed Qi Shiyan’s hand. He even put his face close to Qi Shiyan’s, acting extremely intimate. ",
        "He had never been so close to anyone in his life.",
        "However, Ming Zheng quickly put all of this behind him. What he was most concerned about now was what Qi Shiyan had said about his escape pod containing poison.",
        "Ming Zheng was about to ask, but Qi Shiyan spoke first. “Ah Zheng, why would there be poison on your airship? Is someone trying to harm you? Will it be dangerous for us to stay in the airship?”",
        "Ming Zheng said, “There is someone who wants to harm me. A traitor has snuck into the military sanatorium and wants to kill me. But don’t worry, he must have been caught by now. We won’t face any danger if we stay in the airship.” ",
        "“That’s good then.” Qi Shiyan felt relieved.",
        "Ming Zheng then asked, “Ah Yan, you said before that your escape pod contained poison?”",
        "Qi Shiyan knew that Ming Zheng had memories of the times when he was a fool.",
        "If not for this, Ming Zheng would not be able to quickly accept his situation every time he became clear-headed. ",
        "Before, when Ming Zheng was not clear-headed, he kissed and hugged Ming Zheng. Although he had the excuse that he suffered from skin hunger syndrome, he still felt a little guilty and was afraid that Ming Zheng would hate him.",
        "In order to win Ming Zheng’s sympathy, Qi Shiyan did not hide the original owner’s experience. “Yes, my escape pod contained poison. Before, the spaceship I was on had an accident for no apparent reason. I had no choice but to enter the escape pod. As a result, the oxygen in the escape pod contained poison. If I had not been alert enough, I might have been poisoned to death.”",
        "“Someone wants to harm you?” Ming Zheng asked.",
        "Qi Shiyan nodded. “Definitely. Since I was a child, no one has liked me. Instead, there have always been people who want to harm me… Before, I thought that my ex-fiance could save me, but he turned out to not be a good guy either. He arranged for me to come to the front lines this time. The poison in the escape pod might have been put in by him. Once I die, he can marry my cousin.” ",
        "Qi Shiyan had previously always looked happy and very positive.",
        "But at this moment, his expression was very sad and he looked pitiful.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng felt a little distressed when he saw him.",
        "This person had experienced a lot of pain and suffering, but he could still face the world with a smile. It was really rare. ",
        "“Don’t worry. He will definitely be punished.” Ming Zheng said.",
        "“I think so too! Ah Zheng, I only have you now. I really like you! When will you be my partner?” Qi Shiyan confessed again.",
        "Ming Zheng felt a little helpless.",
        "He believed that Qi Shiyan liked him. The look in Qi Shiyan’s eyes when he looked at him could not be fake. ",
        "But this child had suffered a lot in the past. He liked him probably just because of the fledgling complex*.",
        "On top of that, he was dying.",
        "There was no possibility for him and this child.",
        "Ming Zheng did not answer Qi Shiyan. He looked at the airship next to him and began to relay his “last words”. “Xiao Xing*, record my words. When you see Old Three in the future, play them for him.” ",
        "“Master, please speak.” Starlight’s intelligent system spoke.",
        "Ming Zheng said, “Old Three, take good care of Ah Yan for me, and give him the star coins I left with you.”",
        "The Old Three mentioned by Ming Zheng was Jiang Jin.",
        "After learning of his existence, the retired emperor was very angry. He first dealt with the researcher who violated regulations and then disbanded the laboratory. ",
        "He was still young at that time and didn’t understand many things, but he vaguely realized something.",
        "So he broke into the retired emperor’s bedroom, stood in front of the retired emperor, and insisted on meeting his former companions, those who were all experimental subjects like him.",
        "When they were in the lab, they were held separately. He wasn’t actually familiar with them.",
        "But he had seen sick “experimental subjects” destroyed before. ",
        "He had been trying to find a way to escape, not wanting to become one of the experimental subjects that were destroyed.",
        "Since he had the chance to leave, he wanted to take the others with him.",
        "Please visit chrysanthemumgarden (dot) com",
        "The retired emperor was not a cruel person and agreed to his request.",
        "But those experimental subjects had had their genes modified. The modified genes could still be inherited. ",
        "Their offspring might mutate.",
        "Therefore, these people were sterilized and prohibited from using technological means to produce offspring.",
        "Of course, the same was true for him.",
        "When he was still young, he was not able to take care of these people, but after he ascended the throne as emperor, came to the front lines and seized real power, he went to find those people. ",
        "His genes had not been modified much, and he was the treasure of the laboratory back then, so he had not undergone any experiments that were harmful to the human body, and had always been very healthy.",
        "But others were different.",
        "There were a total of more than twenty children taken out of the laboratory that year, but when he went to look for them, only three were still alive.",
        "*** ",
        "T/N: *Fledgling complex – he means Qi Shiyan is attaching himself to him like a baby chick to its mother.",
        "*Xiao Xing (小星) – Little Star. He’s addressing the Starlight’s intelligent system.",
        "*Using 老 (lao), meaning old, in front of someone’s name is a way to indicate familiarity."
    ],
    "previous": "Ch18 - Airship",
    "next": "Ch19.2 - Like"
}