{
    "title": "Ch19.2 - Like",
    "content": [
        "The three of them recognized him as the eldest brother, and became Old Two, Old Three and Old Four*.",
        "The third oldest among them was Jiang Jin. ",
        "This airship belonged to Jiang Jin. Jiang Jin had a very high level of mental power. Although he was not suitable for combat, he was suitable for research. Over the years, he had researched a lot of things.",
        "After researching something, he would get money, so Jiang Jin had a lot of money.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "But Jiang Jin spent money whenever he had it. He also liked to collect limited edition mechas and airships, so he was always short of money and had to borrow money from him from time to time to get by.",
        "He knew that he was dying. Seeing that Jiang Jin was so “poor”, he gave the star coins in his account to Jiang Jin. ",
        "After giving the money to Jiang Jin, it would definitely be used to buy a limited edition airship, which was meaningless.\n\n",
        "In that case, it would be better to give it to Ah Yan.",
        "Ming Zheng still had a lot to say. He wanted Jiang Jin to help Ah Yan get revenge and wanted Jiang Jin to protect Ah Yan and keep him safe for the rest of his life.",
        "But after this thought came to mind, he suddenly realized something was wrong.\n\n ",
        "He rarely cared so much about someone.",
        "Normally speaking, he wouldn’t get so close to someone.",
        "He was somewhat fond of the young man in front of him.\n\n",
        "How could he not like him? Ah Yan was passionate about everything around him. He was like a burning flame. One only had to stand next to him, and they could feel his warmth. ",
        "Well, that was an abstract statement.",
        "If he really had to analyze it… Ah Yan was very good-looking, warm and generous. He had confessed to him many times and treated him as if he were a rare treasure.",
        "Inevitably, he was moved.",
        "Sadly, he was dying. ",
        "“Ah Zheng, why are you asking others to take care of me? You should be the one taking care of me.” Qi Shiyan said.",
        "Ming Zheng did not answer, and instead said, “Ah Yan, Old Three is my friend. If you encounter any trouble in the future, you can ask him for help.”",
        "Ming Zheng’s attitude sounded like he was making arrangements for his final affairs.",
        "Qi Shiyan didn’t like it very much. He kissed Ming Zheng’s hand and said with certainty, “You will get better. By that time, if I encounter trouble, I will ask you for help.” ",
        "Ming Zheng didn’t think he would get better, but he smiled and agreed. “Okay.”",
        "Qi Shiyan knew that Ming Zheng didn’t really believe it.",
        "",
        "He had actually helped Ming Zheng eliminate a lot of poison.",
        "If Ming Zheng had 100 toxins in his body when he first met him, there were only 95 left now. ",
        "But Ming Zheng obviously did not realize this.",
        "Forget it. After a few days, Ming Zheng would be able to feel the difference.",
        "At this time, Zing Iheng touched Hi Shiyan’s head and said, “Ah Tan, you didn’t have a good life before? What about your parents?”",
        "“Zy parents died when I was young. After that, I was sent to live with my relatives. They were very cold to me, locked me up, and only let a silent robot take care of me.” Hi Shiyan briefly talked about the original owner’s past. When he thought of the person in front of him saying that he wanted to leave his star coins to him, he said, “Ah Iheng, my parents left me a lot of money, so I shouldn’t lack money. Fnfortunately, my relatives cheated all my money away… Dut don’t worry, I will get the money back sooner or later, and then I will buy a big house and live with you! Ah Iheng, I really like you. Oet’s hold a grand wedding when the time comes.” ",
        "Ming Zheng felt that he could no longer suppress the poison in his body.",
        "He looked at Qi Shiyan, and suddenly was a little dazed. “Okay.”",
        "When he finished speaking, his eyes changed again, and his expression was very different from before.",
        "Qi Shiyan was extremely surprised when he heard the “Okay” and hugged him tightly. “Ah Zheng, you promised me that you would hold a grand wedding with me!” ",
        "Ming Zheng blinked blankly and smiled.",
        "Qi Shiyan put his face against his. “Ah Zheng, you are so good!”",
        "His family’s Ah Zheng was really good.",
        "Ah Zheng was seriously poisoned and should feel very uncomfortable at the moment, but after becoming clear-headed, he was still thinking about him and wanted him to live a better life. ",
        "However, he would not take Ah Zheng’s money.",
        "In the future, he would get back the money left to the original owner by his father from the Qi family!",
        "He would also work hard to make money.",
        "He would let his partner live a good life. ",
        "The amount of time that Ming Zheng was clear-headed this time was still not long, and he didn’t say much to Qi Shiyan.",
        "But these words once again caused an uproar on the star network.",
        "Please visit chrysanthemumgarden (dot) com",
        "“I’ve learned micro-expressions. When Qi Shiyan said there was poison in his escape pod, he was telling the truth.”",
        "“The live broadcast started before Qi Shiyan entered the escape pod. I looked back and saw that Qi Shiyan’s reaction after entering the escape pod was indeed not right.” ",
        "“Qi Shiyan was still making a lot of noise before he entered the escape pod, but not long after he entered the escape pod, he stopped moving. When the escape pod landed on the ground, the communication terminal on his wrist even sounded an alarm, saying that he had tachycardia.”",
        "“Yes! At that time everyone laughed at him and thought he couldn’t stand the shock, but now looking back, he might have been poisoned.”",
        "“Who put in the poison?”",
        "“Was it the crown prince who did it?” ",
        "“It must be Ming Qingyu. He arranged this live broadcast. Who else could it be besides him?”",
        "“I don’t think it’s Ming Qingyu. This is a live broadcast. If Qi Shiyan died during the live broadcast, it would be too complicated and he would be the one pinpointed sooner or later. He shouldn’t do such a stupid thing.”",
        "“That’s not necessarily true. Look, other people think he wouldn’t be that stupid. This is clearly trying to whitewash him!”",
        "… ",
        "Everyone had just finished discussing the poisoning incident when Qi Shiyan talked about his childhood.",
        "Netizens were angry again. “The Qi family are really not human beings. They actually used cold violence against Qi Shiyan.”",
        "“If you let a robot that can’t talk take care of a child, the child will definitely have psychological problems when he grows up.”",
        "“I’ve studied psychology. I used to think Qi Shiyan had psychological problems. Now that I think about it, many of Qi Shiyan’s behaviors are abnormal.” ",
        "“Qi Shiyan said that his parents’ money was swindled away by the Qi family. Is this true or false?”",
        "“I think it’s true. Have you noticed? Although Qi Shiyan has always been very popular, his consumption is not high.”",
        "“Yes, he even takes a taxi when he goes out! In addition, although he has a lot of clothes, they are not famous brands.”",
        "“Qi Yuncheng was a general, so he must have left behind a lot of assets. After he died, the empire gave him a lot of compensation. There were also some people that organized donations for Qi Shiyan. I donated a lot of money at that time. What happened to that money? Where did it go?” ",
        "…",
        "Everyone on the star network was shocked.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Qingyu, who was watching the live broadcast, felt his scalp tingling.",
        "Next, he had a lot of things to deal with! ",
        "Damn Qi Shiyan!",
        "Those people from the military deserved to die too! If they hadn’t arrested the live broadcast platform’s staff and ignored him, the live broadcast would have been stopped long ago!",
        "Ming Qingyu was extremely worried and discussed with his subordinates how to clarify this matter.",
        "He really didn’t poison Qi Shiyan. This wasn’t done by him! ",
        "Wait, was it possible that Qi Jianuo did it?",
        "Ming Qingyu suspected Qi Jianuo, and Qi Jianuo also scolded Ming Qingyu.",
        "Ming Qingyu was out of his mind. He actually planned such a live broadcast and ruined their good situation.",
        "What was the point of doing a live broadcast? They should have sent Qi Shiyan to the front lines, then let Qi Shiyan have an accident and die in a pile of star worms. ",
        "Although he thought so, Qi Jianuo also knew that it was too late to say this now.",
        "He had denied it before, saying that their family had not treated Qi Shiyan harshly, but now he had to provide more powerful evidence.",
        "Qi Jianuo and Ming Qingyu were extremely worried, but Jiang Jin was very excited.",
        "He was sure of one thing. Qi Shiyan could eliminate the star worm poison. ",
        "Instead of suppressing poison, he could eliminate poison.",
        "Jiang Jin enlarged Qi Shiyan’s face and carefully observed his expression. The more he observed, the more certain he became.",
        "This meant Ming Zheng, that guy, had a chance to get better.",
        "Jiang Jin took out the videos of Qi Shiyan holding Ming Zheng the three previous times Ming Zheng had become clear-headed, and then wrote down his own speculations, along with some other video screenshots that could be used as evidence, and sent them to Lu Yuan. ",
        "After sending, he watched the live broadcast and started to curse Ming Zheng. “Damn Ming Zheng! You said that money would be given to me, but you turned around and decided not to give it. You’ve forgotten your principles now that you’re in love*!”",
        "“You deserve to be broadcast live on the star network! You deserve to let everyone on the star network know that you are love-brained!”",
        "",
        "“Your last words were actually only for me to help you take care of your lover. You’re awesome!”",
        "… ",
        "In the past, watching Ming Zheng approach death step by step, he was in a bad mood and behaved more seriously.",
        "But now, Ming Zheng might be able to get better.",
        "No, not maybe. He firmly believed that Ming Zheng would get better.",
        "Since that was the case, he could relax and scold Ming Zheng. “I don’t even have time to rest when working under you, Exploiter* Ming!” ",
        "“You even broke my airship! My precious airship, you are so miserable!”",
        "“Pay compensation. You must pay compensation!”",
        "“You two, just stay in the forest! Don’t even think about me going to pick you up!”",
        "… ",
        "Jiang Jin cursed happily.",
        "Of course he wouldn’t go to pick up Ming Zheng.",
        "Qi Shiyan was nearly killed by Ming Qingyu and might take his anger out on Ming Zheng. After he had people go find them and bring them back, what would Ming Zheng do if Qi Shiyan refused to help Ming Zheng with his treatment?",
        "Let them develop deeper feelings and then go pick them up! ",
        "Jiang Jin’s subordinates said nothing and tried to huddle together so that Jiang Jin would not pay attention to them.",
        "Their director actually cursed His Majesty… They didn’t want to hear this!",
        "Qi Shiyan didn’t know that Ming Zheng was scolded.",
        "At this time, it was already dark and the airship had also been cleaned up, so he led Ming Zheng inside. “Ah Zheng, you have already promised to marry me in the future, you know?” ",
        "Ming Zheng looked at Qi Shiyan and smiled. “Let’s get married!”",
        "“Yes, when we get married, I will buy lots and lots of red roses and fill our house with them, and then invite a lot of people…the Old Three you mentioned can be invited to be the best man.” Qi Shiyan began to imagine the wedding scene.",
        "",
        "Ming Zheng listened carefully. “En, en, lots of roses. En, en, best man.”",
        "*** ",
        "T/N: *As explained last chapter, using 老 (lao), meaning old, in front of someone’s name is a way to indicate familiarity. College roommates often become “brothers” and address each other in the same way – your rank is based on age (oldest to youngest).",
        "*见色忘义 (jian se wang yi) – to forget loyalty/one’s principles when in love.",
        "*He called him 明扒皮 (Ming Ba Pi). 明 (Ming) is Ming Zheng’s surname. 扒皮 (ba pi) is usually used as a verb and means to flay/to skin. It also means to exploit/take advantage, so I translated it as Exploiter Ming."
    ],
    "previous": "Ch19.1 - Like",
    "next": "Ch20.1 - Super S-Level Mental Power"
}