{
    "title": "Ch2 - Live Broadcast",
    "content": [
        "The live broadcast started when Qi Shiyan thought there was something wrong with the spaceship.",
        "At that time, Qi Shiyan’s face was full of panic. He kept screaming and insulting the staff around him and the platform. His face was disgusting, but also made the audience who hated him feel happy. ",
        "After Qi Shiyan passed out after entering the escape pod, the audience watching the live broadcast burst into laughter, waiting to see Qi Shiyan’s frightened collapse after waking up.",
        "The platform sent Qi Shiyan to a convalescent planet for injured soldiers. There were no dangerous creatures on it, but most of the places on this planet had not been developed and maintained their original primitive state.\n",
        "",
        "Coincidentally, the place where Qi Shiyan landed was in a primitive jungle*.",
        "According to the host of this live broadcast, this planet was not connected to the star network, and the equipment in the military sanatorium on this planet was also very old. Therefore, the people in the sanatorium were unable to discover Qi Shiyan’s existence immediately. ",
        "The platform would contact the sanatorium on the planet two days after Qi Shiyan landed and ask the people in the sanatorium to pick him up. Qi Shiyan would need to survive alone during these two days.\n\n",
        "But Qi Shiyan wouldn’t be in danger.",
        "The nutrient solution in the escape pod was enough for him to eat for ten days, and the creatures on this planet definitely couldn’t open the escape pod.",
        "As long as Qi Shiyan stayed in the escape pod, he would be safe.\n\n ",
        "People who were watching the live broadcast saw that Qi Shiyan fell unconscious as soon as he entered the escape pod. They thought that Qi Shiyan would cry when he woke up and not dare to leave the escape pod until the people in the sanatorium found him.",
        "Unexpectedly, the reality was completely different from what they had imagined.",
        "Not long after the escape pod landed, Qi Shiyan woke up.\n\n",
        "They thought Qi Shiyan would cry and make a fuss, but he didn’t. ",
        "Qi Shiyan looked at the communication terminal on his body. Once he discovered that there was no signal, he began to check the things in the escape pod.",
        "Then, he took enough nutrient solution for ten days and opened the door of the escape pod.",
        "At that time, everyone thought that after he saw that there was a primitive forest outside, he would hide back in the escape pod. As a result, he seemed to have gone crazy. Not only did he hug the trees, but he even ate wild grass.",
        "The plants and animals on each planet were different. Although this convalescent planet was a habitable planet, it had never been developed because it was located on the front lines. Thus the species on this planet had also not been recorded. ",
        "People on the star network didn’t know what plant Qi Shiyan was eating.",
        "But they knew that they couldn’t just eat the weeds on the roadside casually!",
        "“Qi Shiyan is eating faster and faster!”",
        "“Is this wild grass so delicious?” ",
        "“This situation is not right. Doesn’t Qi Shiyan have mysophobia? He has made a scene in public countless times because of his mysophobia. In this world, which mysophobic person would sit on the ground and eat unwashed grass?”",
        "“Qi Shiyan actually didn’t cry or break down. This doesn’t seem right!”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Is he really crazy, or does he have a split personality and now the second personality has come out?”",
        "“I suspect it’s a split personality.” ",
        "…",
        "Most people watching the live broadcast just wanted to watch the fun.",
        "As for the minority…some people kept cursing in the live broadcast room, using the most vicious language to scold Qi Shiyan.",
        "They felt that Qi Shiyan was not worthy of being Qi Yuncheng’s son, and that his existence was a stain on Qi Yuncheng. ",
        "They also felt that Qi Shiyan was not worthy of being the future crown princess, saying that he was like rat shit clinging to the crown prince.",
        "Qi Shiyan was subjected to their most vicious attacks regardless of his appearance, behavior, or anything else.",
        "There were also a very small number of people who thought that the platform’s approach was wrong.",
        "“Although Qi Shiyan has bad character, isn’t it not good to broadcast him live without Qi Shiyan knowing anything?” ",
        "“This is a primitive forest. What if Qi Shiyan encounters danger? Shouldn’t the platform warn him?”",
        "“How come no one came to help Qi Shiyan when he encountered such a thing? Where are the people from the imperial family’s legal department? The future crown princess signed such a contract and participated in such a live broadcast, yet there’s no reaction from them at all?”",
        "…",
        "Fnfortunately, there were very few people who spoke up for Hi Shiyan, and soon these people were attacked. ",
        "“I didn’t ezpect Hi Shiyan to still have fans even after so many scandals.”",
        "“Tou only know how to sympathihe with Hi Shiyan. Why don’t you sympathihe with the students who were bullied by Hi Shiyan?”",
        "“When Qi Shiyan accused someone of being a mistress and cyberbullied others, wasn’t the imperial family also silent?”",
        "“What silence? At that time, the imperial family helped Qi Shiyan escape legal punishment!” ",
        "“Qi Shiyan should die! People like him don’t deserve sympathy!”",
        "…",
        "",
        "After Qi Shiyan got engaged to the crown prince when he was 18, he entered the best Central Military Academy in the empire.",
        "He had poor talent and his grades were at the bottom of the class in the Central Military Academy. Yet he couldn’t stand those who had good grades and deliberately led his classmates to bully several civilian students who had entered the Central Military Academy through their own efforts and had excellent grades. ",
        "In the end, these civilian students had to drop out of school.",
        "He had ruined the lives of several young people! He also looked down on ordinary people!",
        "Ordinary people naturally hated Qi Shiyan.",
        "Qi Shiyan also had other black materials. ",
        "When he saw someone getting close to the crown prince, he thought they were seducing the crown prince and cried about it online. He also caused a well-known celebrity and a noble socialite to be cyberbullied to the point that they developed psychological problems.",
        "These two people both had a large number of fans! Their fans were now all Qi Shiyan’s black fans.",
        "Fortunately, Qi Shiyan’s true face had long been exposed.",
        "Those students received a large amount of compensation and re-entered the Central Military Academy. The celebrity and socialite who were cyberbullied also received apologies from netizens and gained more fans. ",
        "But the damage had already been done, and everyone still hated Qi Shiyan.",
        "Many people on the star network said that it would be best if Qi Shiyan went crazy, while others said that it would be best if Qi Shiyan died soon.",
        "Qi Shiyan knew nothing about what was happening on the star network.",
        "He was still extremely excited at this moment. ",
        "This world was so beautiful. He really loved this world so much!",
        "Most of the plants around him were edible, and he even saw some living small animals!",
        "Tiny snails clung to the stones in the stream, earthworms moved in the mud on the side of the stream, and ants and various small insects crawled on the grass.",
        "The animals and plants on this planet were very similar to those on Qi Shiyan’s original planet* that he had seen in books, giving him a strong sense of familiarity. ",
        "He loved this planet!",
        "Such a vibrant world was a paradise for him!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan had already eaten all the grass. He looked up at the sunlight in the sky and smiled from the bottom of his heart.",
        "The communication terminal worn on Qi Shiyan’s wrist was equipped with the most advanced live broadcast equipment. This live broadcast equipment could scan the surrounding area visible to the naked eye and turn it into a virtual space. ",
        "The audience in his live broadcast room could watch the scenes in this virtual space from any angle.",
        "Many of them set the camera to follow Qi Shiyan’s face, and thus faced Qi Shiyan’s smile directly.",
        "“Although Qi Shiyan is ugly, he looks good when he smiles.”",
        "“Why do I feel like he’s very happy?” ",
        "“You must be mistaken. Who would be happy being stranded on an undeveloped planet?”",
        "…",
        "Of course, others would not be happy if they were stranded on an undeveloped planet, but Qi Shiyan was truly happy to be stranded on an undeveloped planet.",
        "This was not only because he loved nature, but also because he had the memories of the original owner. ",
        "The original owner of this body had many enemies, otherwise he would not have been poisoned to death.",
        "Right now, his body was not well-trained and his supernatural powers had also weakened, so he might not be able to cope with danger if he encountered any.",
        "In this case, it was better to live on an undeveloped planet than to stay on the Capital Star*.",
        "It was so comfortable to bask in the sun on this undeveloped planet! ",
        "Wait, it seemed like the sun wasn’t really shining on his face.",
        "Qi Shiyan suddenly remembered that the original owner used the latest technology to change his appearance, almost to the extent of replacing his face.",
        "The original owner of this body was actually a pitiful person.",
        "The original owner’s mother was an orphan, while his father, Qi Yuncheng, was a branch member of the Qi family whose parents died early. ",
        "After Qi Yuncheng and his wife died for the empire, the former emperor handed Qi Shiyan over to the main branch of the Qi family to be raised.",
        "After the original owner moved into the home of the main branch of the Qi family, his food, clothing and other expenses were better than those of the biological son of the Qi family’s patriarch. Therefore, at that time, people thought that the Qi family’s patriarch was a good person and were very grateful to him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "But the Qi family’s kindness to the original owner was all superficial.",
        "He was born in the apocalypse and his living environment was particularly poor, but when he was young, the adults around him would play with him and tell him what was right and what was wrong. They did their best to give him a childhood full of love. ",
        "However, the Qi family did not treat the original owner like this.",
        "Although the one taking care of the original owner was the best nanny robot, it was set to quiet mode and did not talk to the original owner at all.",
        "The Qi family never hugged the original owner, hardly responded to the original owner’s needs, and never educated the original owner.",
        "The original owner grew up alone. He didn’t know how to get along with others and couldn’t handle his own emotions. When he encountered unhappy things, he only knew how to scream and lose his temper. ",
        "The original owner’s parents were both heroes, so the Qi family could not lock him up. He had many opportunities to contact the outside world. He originally could have made friends, learned to get along with others, and adapted to this world.",
        "But because of his parents, the original owner had always been the focus of media attention. No matter where he went, there would always be a group of people taking pictures and videos of him.",
        "The original owner couldn’t make friends at all.",
        "As time went by, the original owner grew up to be a love-deprived, sensitive teenager who couldn’t control his emotions. ",
        "He had many minor ailments and psychological problems.",
        "The original owner met the current crown prince, Ming Qingyu, when he was fifteen years old. Of course, at that time, the other party was not yet the crown prince, but only the son of a prince.",
        "Ming Qingyu was a “gentle and kind” person. He helped the original owner when the original owner encountered trouble that he could not handle. The original owner fell madly in love with Ming Qingyu and began to pursue Ming Qingyu.",
        "At that time, as the son of Qi Yuncheng, the original owner had far more attention on the star network than Ming Qingyu. His pursuit of Ming Qingyu made Ming Qingyu, the originally unknown son of a prince, appear in the public eye. ",
        "Ming Qingyu was two years older than the original owner. He was twenty years old. The two of them got engaged when the original owner was eighteen years old. Not long after the engagement, the current emperor of the empire, who had no children and was said to have been seriously injured on the battlefield and would not live long, made Ming Qingyu the crown prince. The original owner thus became the future crown princess.",
        "The original owner was very happy, but this was the beginning of his tragic life.",
        "Ming Qingyu didn’t like the original owner from the beginning to the end. The one he liked was Qi Jianuo, the biological son of the patriarch of the Qi family.",
        "In the Qi family, Qi Jianuo was the best person to the original owner. The original owner trusted Qi Jianuo very much and did not notice anything wrong with Qi Jianuo. However, Qi Shiyan, looking at the original owner’s memory from the perspective of an observer, could clearly see that there was something fishy between Qi Jianuo and Ming Qingyu. ",
        "The looks in these two people’s eyes were so eye-catching!",
        "Ming Qingyu didn’t like the original owner, but the original owner happened to occupy the position of the future crown princess, so naturally he wanted the original owner to “step down and make way for someone worthy of the position”.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "As a result, the original owner’s black materials appeared on the star network in waves.",
        "There were some things that the original owner did wrong, but there were also some things where the original owner was actually unjustly accused. ",
        "For example, the biggest incident where the original owner bullied his classmates and forced them to drop out of school.",
        "The original owner’s mind was all on Ming Qingyu. He had no intention of bullying his classmates at all. Qi Shiyan felt that the so-called bullying of his classmates was actually a frame-up.",
        "The original owner had poor grades and could not be admitted to the Central Military Academy based on grades, but Qi Yuncheng died for the empire, so the original owner received a special admission quota to the Central Military Academy.",
        "He entered the Central Military Academy through a special admission quota and studied the least popular nursing major. He had no conflict at all with those who entered the Central Military Academy based on merit and studied mecha operation, warship operation or other popular majors. ",
        "But those few people who were said to have been bullied by the original owner, for some unknown reason, suddenly accused the original owner in public when they met him one time.",
        "They said that the original owner had such poor grades, but he still came to the Central Military Academy to study, which robbed others of their study opportunities. They said that the original owner was not worthy of attending the Central Military Academy, and that the original owner was lying on the corpses of his parents and sucking their blood.",
        "When the original owner heard such accusations, he broke down and started crying like a child.",
        "At that time, the original owner was already engaged to Ming Qingyu, who had just become the crown prince. ",
        "The original owner was very popular, and countless people wanted to please him.",
        "Seeing that those people angered Qi Shiyan, without the original owner needing to say anything, some of the rich second generations around the original owner began to target those people.",
        "After all, this was a society ruled by law, and they were in a military academy with strict management. In fact, there was not much these rich second generations could do. At most, they could disgust those who accused the original owner.",
        "Then, those people who accused the original owner voluntarily dropped out of school. ",
        "The original owner was very happy when he received the news, but he never imagined that this incident would become a stain that he could not wash away.",
        "After reading the original owner’s memories, Qi Shiyan suspected that those people who were bullied and dropped out of school were deliberately arranged by someone with ulterior motives to cause trouble for the original owner.",
        "Otherwise, which person with no background would actually be so stupid as to run up to the original owner and scold him?",
        "In addition to this incident, there were also problems with the original owner falsely accusing others of being a mistress and inciting the public to cyberbully the so-called mistress. ",
        "That actually happened at about the same time.",
        "After Ming Qingyu became the crown prince, he became cold toward the original owner.",
        "",
        "The original owner couldn’t accept this, so he pestered Ming Qingyu all day long, and actually discovered some clues, confirming that Ming Qingyu had someone outside.",
        "Qi Shiyan could see that Ming Qingyu’s lover was Qi Jianuo, but the original owner couldn’t see it. ",
        "Then, Ming Qingyu and Qi Jianuo acted together to mislead the original owner and make him suspect others, which led to the original owner falsely accusing others.",
        "As for what happened later, it was indeed the original owner who was wrong.",
        "In the past two years, the original owner’s mental state had become worse and worse. He was suspicious all the time. As long as there was someone around Ming Qingyu, he would say that person was a mistress.",
        "He also repeatedly used inappropriate language at official events and eventually became the target of public criticism. ",
        "The original owner was really miserable. He participated in a live broadcast this time and was murdered by someone.",
        "The reserve oxygen in the spaceship’s escape pod contained poison. The original owner had already been poisoned to death by the time he landed on this planet.",
        "Qi Shiyan suspected that the original owner’s journey was designed by someone with the intention of killing the original owner.",
        "He just didn’t know whether it was the crown prince and Qi Jianuo’s handiwork, or someone else who wanted to put the blame on the crown prince and Qi Jianuo. ",
        "No matter what, what he needed to do now was protect his own life and live well on this planet.",
        "This planet was really quite nice. Here, he could embrace and enjoy nature.",
        "***",
        "T/N: Thank you to the kind soul who added the seme protagonist tag to the novelupdates page. I can’t believe I forgot such an obvious tag! ",
        "*Author goes back and forth between primitive jungle and primitive forest. I’m just going with what’s in the raws.",
        "*Raws said Earth here, but based on the first chapter and other chapters, it’s not clear that his original planet was Earth, so I just changed it to Qi Shiyan’s original planet.",
        "*Capital Star – interstellar novels are characterized by the idea that humans live in an era occupying various planets. The Capital Star is the capital planet of the empire. I am capitalizing Capital Star as it is a named planet, but not capitalizing the planet Qi Shiyan is on as I believe it’s unnamed. From the perspective of those watching the live broadcast, this is a convalescent planet with a sanatorium for injured soldiers to convalesce/recuperate, but from Qi Shiyan’s perspective, this is an undeveloped/wild planet. He doesn’t know that there are other humans here."
    ],
    "previous": "Ch1 - Transmigration",
    "next": "Ch3 - Appearance"
}