{
    "title": "Ch20.2 - Super S-Level Mental Power",
    "content": [
        "As he spoke, Qi Jianuo posted another list, which was the list of how the inheritance left behind by Qi Yuncheng was used.",
        "Qi Shiyan’s daily expenses were not paid from the inheritance. When Qi Shiyan was a child, this money had not even been touched. ",
        "The money was not used until Qi Shiyan underwent a mental power test. All the money withdrawn was used to buy potions that could enhance mental power.",
        "Qi Jianuo continued to explain. “When we first tested Shiyan’s mental power, his mental power level was only D. He was very sensitive and cried for several days because of this. After that, he wanted to improve his mental power, so he asked us to help him buy potions that could improve his mental power. Before that, his expenses were all paid by our family. But potions that can improve mental power are too expensive. Our family couldn’t afford it, so we paid from the property left by General Qi. This was all done with his consent, and there was no case of deception.”\n",
        "",
        "Those ordinary netizens watched Qi Jianuo’s live broadcast and the list provided by the Qi family, and believed what Qi Jianuo said.",
        "“Qi Shiyan is really full of lies. The money his father left him was clearly all spent on him.” ",
        "“Potions that can improve mental power are really expensive. I can’t afford one even if I work my whole life.”\n\n",
        "“This is obviously something only rich people can buy.”",
        "“Qi Shiyan was still young the first time he had his mental power tested, so he shouldn’t have been hiding his mental power level then. He must have taken countless potions to enhance his mental power, right? That’s how his mental power increased. As a result, he drank the potions himself, and then turned around and said that the Qi family cheated him out of his money.”",
        "“Isn’t Qi Shiyan going too far?”\n\n ",
        "“The Qi family spent so much money on General Qi and Qi Shiyan, but Qi Shiyan doesn’t know how to be grateful at all. He is undoubtedly a white-eyed wolf*.”",
        "“Those who believed Qi Shiyan just because he said a few words during the live broadcast are so stupid!”",
        "“Blacklist Qi Shiyan for life! He is really full of lies!”\n\n",
        "“I feel sorry for Jianuo. Jianuo has been constantly attacked during this period. He’s so pitiful!” ",
        "…",
        "For a moment, Ming Qingyu and Qi Jianuo’s people gained the upper hand again.",
        "Jiang Jin, who had been reading the news online, was furious. He found those who were responsible for investigating the Qi family and Ming Qingyu and asked for the results of the investigation.",
        "But the Qi family and Ming Qingyu were very careful in doing things, so they couldn’t find out much for the time being. They could only find out that Ming Qingyu and Qi Jianuo were often together and had a lot of contact. ",
        "They also found some photos of the two of them together.",
        "But these photos couldn’t prove that they had a relationship.",
        "As for the events of Qi Shiyan’s childhood, that after all was a long time ago. The Qi family was also very careful, so it was very difficult to investigate.",
        "Jiang Jin was just feeling that things were a bit difficult to handle when Kane, a student whom Qi Shiyan had once “bullied” in school, also stood out to speak. ",
        "Kane once reported Qi Shiyan using his real name. Qi Shiyan being blacklisted by the entire network had a lot to do with him.",
        "Now, he once again brought up the bullying incident and questioned netizens. “You guys actually believe the words of a bully? Qi Shiyan is mean and selfish. I don’t believe a word he says.”",
        "",
        "After Kane came forward, those who had been “bullied” by Qi Shiyan also came forward to boycott Qi Shiyan.",
        "When the live broadcast first started, Qi Shiyan had already been blacklisted by the entire network. At that time, almost everyone on the star network was scolding Qi Shiyan. ",
        "In the following two days, because Qi Shiyan’s reactions in the live broadcast were different from people’s impression of him, many people began to question Qi Shiyan’s black materials and stand on Qi Shiyan’s side.",
        "But now, the voices of those speaking for Qi Shiyan could no longer be heard.",
        "Fortunately, after all the back-and-forth, many people were no longer willing to get involved in this matter. “Let the bullets fly for a while. I don’t want to say anything now.”",
        "“I will wait for the official investigation results.” ",
        "“I am also waiting for the official investigation results.”",
        "…",
        "The authorities were indeed investigating, but they couldn’t provide the investigation results for the time being.",
        "And all of this came into the eyes of those with ulterior motives. ",
        "In the vast sea area of ​​the Japital Star, there was a not-so-large continent that was specifically for members of the imperial family to live in. Zany members of the imperial family lived here, as well as people who served them.",
        "At this moment, in one of the manors, someone poured himself a glass of red wine.",
        "The wall in front of this person was a large screen, which was divided into several parts, corresponding to different star network images.",
        "Among them was Qi Shiyan’s live broadcast room, which had a black screen and only sound. ",
        "In the live broadcast room, Qi Shiyan was praising Ming Zheng again.",
        "The person reached out and touched the live broadcast screen, then smiled. “Qi Shiyan… this is really beyond my expectations.”",
        "He then looked at Qi Jianuo’s live broadcast room and the screen showing Ming Qingyu’s Xingbo, and whispered, “This is also good.”",
        "After saying that, he clicked on the lower left corner, and immediately, many intimate photos of Ming Qingyu and Qi Jianuo appeared in front of him. ",
        "Qi Shiyan’s escape pod had indeed been poisoned.",
        "This poison was not placed by Ming Qingyu’s people or Qi Jianuo’s people, but by his people.",
        "Please visit chrysanthemumgarden (dot) com",
        "Of course, if things were investigated carefully, they would definitely end up finding Ming Qingyu.",
        "He originally wanted to use Qi Shiyan’s life to bring down Ming Qingyu. ",
        "If Qi Shiyan participated in a live broadcast and was sent to a secret military planet, but he died as soon as he got there… The military would definitely be furious and would definitely not allow Ming Qingyu to ascend the throne.",
        "Ming Qingyu might even be killed by someone in the military.",
        "That was exactly what he wanted to see.",
        "Why was Ming Qingyu the crown prince? ",
        "Convalescent planet.",
        "After Qi Shiyan figured out the various functions of the airship, he cleaned himself up first.",
        "Then, he taught Ah Zheng how to clean his body.",
        "Although Ah Zheng was slow to react, he learned it after being taught twice. ",
        "This whole process was a bit tormenting for him – he couldn’t help but want to touch Ming Zheng.",
        "Fortunately, he used his strong self-control to control himself and did not take the opportunity to hug Ming Zheng and kiss Ming Zheng’s whole body.",
        "Qi Shiyan gave himself a thumbs up. His willpower was really strong!",
        "The “bathroom” of the airship was very powerful. Not only were their bodies cleaned, but their clothes were also cleaned, giving off a pleasant smell. ",
        "Qi Shiyan felt extremely comfortable. He felt even more comfortable when he lay on the bed that was transformed from one of the airship’s seats.",
        "His previous accommodation conditions were very poor and the surrounding area was full of toxins.",
        "But this time, not only was there no poison around him, he could also sleep on a soft bed.",
        "Qi Shiyan asked the intelligent system to put the seats together to form a large bed, and slept on it while hugging Ming Zheng. ",
        "Before going to sleep, he gave Ming Zheng some meat, while he himself drank a bottle of nutrient solution.",
        "The energy required to restore his supernatural powers was a bit high, so he had to eat more.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Qingyu, Qi Jianuo, and many of their supporters did not sleep all night and kept attacking Qi Shiyan, but Qi Shiyan slept very well.",
        "He woke up in the morning light, but did not rush to get up. Instead, he stayed close to Ming Zheng and put his face against Ming Zheng’s. ",
        "Such intimate contact filled his body and mind, and Ming Zheng’s even breathing made him relax completely.",
        "He was very relaxed, but Ming Zheng was not.",
        "Ming Zheng never showed it, but Qi Shiyan could tell from some of his physical reactions that he was constantly in pain.",
        "Come to think of it, after being poisoned so severely that even his mind was not clear, how could Ming Zheng be unaffected and not feel any pain at all? ",
        "He didn’t show much of a reaction and was able to sleep as usual, probably because he was used to the pain.",
        "Qi Shiyan reached out and touched Ming Zheng’s face again.",
        "After a good sleep, he had recovered about one third of his supernatural powers.",
        "When he treated Ming Zheng yesterday, his supernatural powers had also recovered to about one third. ",
        "He could wait until his supernatural powers recovered a little more before eliminating the poison from Ming Zheng’s body, but he was reluctant to let Ming Zheng suffer.",
        "If he could eliminate more poison, the pain Ming Zheng suffered would be a little less.",
        "Qi Shiyan hugged him and continued to eliminate the poison from Ming Zheng’s body.",
        "On the spaceship outside the convalescent planet, Jiang Jin, who had already turned off the black screen mode of the live broadcast, was eating breakfast. ",
        "He didn’t sleep at all again last night.",
        "He was busy cursing people and also busy investigating Qi Shiyan’s affairs.",
        "He had already asked someone to bring back Qi Shiyan’s escape pod. The inside indeed contained poison.",
        "Dropping toxic substances into an important military area – based on this, he could even arrest Ming Qingyu. ",
        "He didn’t believe that after he caught Ming Qingyu, he would not be able to find out anything!",
        "After eating the specially prepared roasted meat, Jiang Jin looked up and saw Qi Shiyan helping Ming Zheng eliminate the poison from his body.",
        "",
        "His heartbeat quickened and his whole body became excited.",
        "The top military officials were as excited as Jiang Jin. ",
        "Yesterday, Jiang Jin compiled a report saying that Qi Shiyan might be able to help people eliminate the star worm poison.",
        "The bigwigs in the military had already read this report. Now that they saw Qi Shiyan starting to help “Ah Zheng” eliminate the poison again, they all paid great attention.",
        "In the live broadcast, Qi Shiyan hugged Ming Zheng. The scene looked very warm.",
        "But the barrage was not very friendly. “Qi Shiyan is so disgusting. Not long ago, he was still pestering the crown prince, and now he is hugging someone else.” ",
        "“He hasn’t broken off his engagement with the crown prince yet. This is cheating!”",
        "“He’s really full of lies! I even felt sorry for him before, but it turns out he was just deceiving people!”",
        "…",
        "At this time, Ming Zheng became clear-headed again. ",
        "“Ah Zheng, are you awake? Good morning!” Qi Shiyan looked happy.",
        "Ming Zheng was a little confused.",
        "He thought that he would never become clear-headed again, and would die unknowingly in a battle with the star worms, becoming dust in the sea of ​​stars.",
        "But since he met Qi Shiyan, he had become clear-headed several times. ",
        "This should be because Qi Shiyan used his mental power to help him suppress the poison. How high was Qi Shiyan’s mental power?",
        "The previous few times, he had a lot of things to deal with, so he didn’t ask about this matter, but this time, he took the time to ask. “Ah Yan, what is your mental power level?”",
        "Qi Shiyan didn’t want to lie to his future partner, so he said, “I’m not sure, but it must be above S-level, at least S+.”",
        "He was not sure about the exact level of his mental power, but he knew that it was stronger than Ming Qingyu’s mental power level. ",
        "Ming Qingyu was S-level, so he was at least S+. Maybe even SS or SSS.",
        "However, his mental power had not yet fully recovered. Right now, he was unable to exert such powerful strength.",
        "Please visit chrysanthemumgarden (dot) com",
        "“So high? Did it grow naturally or with the help of potions?” Ming Zheng continued to ask.",
        "Before, he thought Qi Shiyan came from a laboratory just like him. ",
        "But after chatting with Qi Shiyan yesterday, he realized that he had guessed wrong.",
        "Now, he wanted to know whether Qi Shiyan relied on potions to possess such high mental power.",
        "There was a huge difference between mental power built up by potions and mental power that grew naturally.",
        "Qi Shiyan said, “Of course it grew naturally! When I first activated my mental power, it was already S-level!” ",
        "Ming Qingyu’s mental power, which was S-level, was roughly the same as when he was a child in his previous life.",
        "Thinking of this, Qi Shiyan started to act pitiful again. “Ah Zheng, no one treated me well when I was a child. I even heard them say that if my mental power level was high, they would find a way to destroy my mental power. I could only pretend that my mental power level was very low. Then they used the excuse of buying me mental power enhancing potions and spent all my money. I didn’t drink even a single sip of those potions. They were all given to my cousin to drink. My cousin’s mental power level was very low at the beginning, but it was actually raised to A-level in the end!”",
        "The entire network knew that his mental power level was only C.",
        "But now his mental power level was very high…Qi Shiyan planned to find a reason for himself. ",
        "The original owner hadn’t heard the Qi family say that they would destroy his mental power, but the Qi family treated the original owner very badly. They were definitely afraid of the original owner’s revenge. If the original owner had really shown excellent talent in the test, the Qi family would most likely have taken action.",
        "There were potions in this world that could enhance mental power, and there were also potions that could destroy mental power.",
        "As soon as Qi Shiyan said this, the star network exploded again!",
        "And this was just the beginning. ",
        "Just after Qi Shiyan said this, many intimate photos and videos of Ming Qingyu and Qi Jianuo suddenly appeared on the star network.",
        "These videos and photos were examined and determined to have no signs of falsification.",
        "Before, the two of them both denied that they were together, but now, the evidence was out and there was no room for quibbling!",
        "*** ",
        "T/N: Netizens are dumb to believe only one side of the story. Qi Shiyan is revealing bits and pieces, but they have to remember he doesn’t know he’s being broadcasted nor does he know what anyone else is claiming or what evidence is being presented. He’s completely unable to defend himself or present his side of the story, whereas Ming Qingyu and Qi Jianuo can watch the live broadcast and always provide a response/explanation. Particularly regarding the purchasing of potions to enhance mental power… like wtf literally no one questions the fact that Qi Jianuo was only C-level originally, but miraculously is now A-level? They just believe the shit Qi Jianuo spoon feeds them.",
        "*白眼狼 (bai yan lang) – white eyed wolf. Slang for an ingrate/ungrateful person. Someone who bites the hand that feeds them.",
        ""
    ],
    "previous": "Ch20.1 - Super S-Level Mental Power",
    "next": "Ch21 - Unworthy of Being the Crown Prince"
}