{
    "title": "Ch20.1 - Super S-Level Mental Power",
    "content": [
        "Qi Shiyan looked at Ming Zheng and smiled.",
        "He knew that Ming Zheng wasn’t really agreeing with him. He just responded subconsciously. ",
        "Therefore, he would not do anything excessive to Ming Zheng.",
        "Some things should only be done after Ming Zheng really became his partner.\n",
        "",
        "But that didn’t stop him from being happy.",
        "At the beginning, the reason why he liked Ming Zheng so much was mainly because Ming Zheng was the first person he met after he came to this world. ",
        "But now, things had changed.\n\n",
        "At this moment, he sincerely and from the bottom of his heart liked Ming Zheng.",
        "“Ah Zheng, I really like you.” Qi Shiyan hugged Ming Zheng.",
        "Then, while praising Ming Zheng, he adjusted the seat of the airship and made a bed for Ming Zheng.\n\n ",
        "He also talked to the airship’s intelligent AI to learn about the airship’s functions.",
        "During this conversation, Qi Shiyan discovered that this airship had many more functions than the original owner’s previous airship.",
        "However, the original owner’s airship was an old airship lent to him by the Qi family. It only cost 200,000 star coins when it was purchased, so it was normal that it had few functions.\n\n",
        "“Ah Zheng, this airship also has a bathroom that can help people clean their bodies and clothes quickly without using water. It’s very high-end. Let’s take a shower.” Qi Shiyan said. ",
        "He and Ah Zheng walked in the forest for a long time and slept in a cave for a night. Right now, they were dirty and messy and needed to clean up.",
        "“This bathroom is amazing. I can wash my whole body clean by standing in it for two minutes,” Qi Shiyan looked at the instruction guide that the Starlight brought out and was full of admiration. “This airship must be very expensive. It might cost millions of star coins.”",
        "Ming Zheng couldn’t understand complicated words, so when he heard Qi Shiyan’s words, he could only nod his head.",
        "Netizens were amused. “This is Starlight! Starlight! How can a few million star coins be enough? It sells for billions!” ",
        "“Qi Shiyan is a little ignorant.”",
        "“He was always kept in isolation by the Qi family. So how could he learn these things?”",
        "“The matter of Qi Shiyan being kept in isolation has not been concluded yet, right? What he said may not be true.”",
        "“That’s right. Some people are so funny. Qi Shiyan only said a few words, but they want to convict the Qi family.” ",
        "…",
        "Jiang Jin frowned. “This guy Qi Shiyan is not only ignorant, but also has no vision.”",
        "Please visit chrysanthemumgarden (dot) com",
        "There were so many good things in his airship. The cost of the bathroom inside was more than several million.",
        "After complaining, Aiang Ain said, “Dlack out the live broadcast screen. They need to take a shower.” ",
        "The live broadcast device in Hi Shiyan’s communication terminal was intelligent, and would automatically turn the screen black when it encountered images that could not be broadcast.",
        "But he didn’t trust it very much, so he blacked out the screen of the live broadcast room in advance to avoid broadcasting images that were not suitable for broadcasting.",
        "However, he did not turn off the sound. After Qi Shiyan and Ming Zheng finished washing, he would turn on the live broadcast again.",
        "He had to ensure Ming Zheng’s safety. ",
        "As soon as the live broadcast went black, netizens were dumbfounded. “Why is it gone?”",
        "“I want to see them take a shower!”",
        "“Isn’t this device a little too smart? Why is the screen black when they haven’t even taken off their clothes yet?”",
        "“Don’t they have to show some skin before the screen goes black?” ",
        "“You guys are too perverted. I’m different from you guys. I only want to appreciate the internal structure of Starlight more. So why is the screen black?”",
        "…",
        "Netizens were not very happy, but the live broadcast still went black, with only Qi Shiyan’s voice coming out from time to time.",
        "Thus everyone’s attention returned to the star network. ",
        "For those who stood on Qi Shiyan’s side, their long-accumulated anger suddenly erupted.",
        "For a time, the star network was full of comments questioning Ming Qingyu and Qi Jianuo, and demanding that they give an explanation.",
        "Seeing this, Jiang Jin opened a side account* and followed the trend to curse people online.",
        "At first, he just cursed Ming Qingyu, but later he started to curse the entire imperial family. ",
        "He was the imperial family’s black fan.",
        "He felt disgusted and loathed the entire imperial family, except Ming Zheng, and wished that they would all die soon.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Zheng didn’t feel much because he went to the imperial palace, but after Jiang Jin left the laboratory, he watched his companions die one by one.",
        "That was really painful. ",
        "Jiang Jin cursed too harshly, so his side account was blocked.",
        "He was used to this, so he opened another side account and continued to curse people.",
        "It was at this time that Ming Qingyu and Qi Jianuo finally responded.",
        "Ming Qingyu once again issued a clarification announcement, clarifying two things. ",
        "First of all, the poison in the escape pod had nothing to do with him.",
        "Secondly, he had nothing to do with Qi Jianuo.",
        "At the end of the announcement, Ming Qingyu also expressed that he was very disappointed with Qi Shiyan.",
        "He genuinely liked Qi Shiyan, but Qi Shiyan had always been acting in front of him, pretending to be arrogant to whittle away his love. Now, Qi Shiyan was even more outrageous and even threw dirty water on him. ",
        "Ming Qingyu presented a hurt appearance and even took out a lot of evidence.",
        "This evidence included the messages Qi Shiyan sent him and a video of Qi Shiyan “going crazy” captured by the surveillance camera in his home.",
        "Qi Shiyan sent a lot of messages to Ming Qingyu, and if Ming Qingyu didn’t reply, Qi Shiyan would keep sending messages. “Brother Qingyu, why are you ignoring me?”",
        "“Brother Qingyu, I’m begging you to send me a message.” ",
        "“Brother Qingyu, where are you? What are you doing? Why aren’t you replying to my messages?”",
        "…",
        "In addition to sending messages, Qi Shiyan would also call Ming Qingyu, one after another, without stopping.",
        "Along with these things, Ming Qingyu provided an explanation. “Sometimes I am in a meeting or fighting on the front lines and cannot reply to him immediately, but he will keep calling and messaging me. His behavior made me feel suffocated. I couldn’t stand it anymore and wanted some peace and quiet, so I sent him to participate in the live broadcast.” ",
        "Ming Qingyu also posted several videos.",
        "In these videos, he was coaxing Qi Shiyan, while Qi Shiyan was crying and making a fuss, just like a naughty child.",
        "",
        "It would have been fine if Qi Shiyan was really a naughty child. Many people could accept a small child crying and making a fuss.",
        "But he was an adult! ",
        "Seeing him crying and making a fuss, people just felt it was an eyesore.",
        "Ming Qingyu also explained these videos. “Things were fine when I first met Qi Shiyan. In the past two years, he always lost control of his emotions and got angry in front of me. I was exhausted. Sometimes I had no choice but to ask Qi Jianuo to help appease him. That’s when I had some contact with Qi Jianuo, but I definitely didn’t cheat! I always wanted to get along well with Qi Shiyan, but Qi Shiyan never gave me this opportunity.”",
        "Whether it was the chat records or the videos, it could be seen that Qi Shiyan’s mental state was not normal.",
        "After seeing these things, netizens began to sympathize with Ming Qingyu. “Qi Shiyan is too suffocating.” ",
        "“Ordinary people really can’t stand a boyfriend like this!”",
        "“If I were the crown prince, I would also want to break up with him.”",
        "“Qi Shiyan has always been acting in front of His Highness and never tells His Highness anything. He himself is not sincere toward His Highness, so why require His Highness to be sincere toward him?”",
        "“Qi Shiyan’s behavior in the live broadcast is also suffocating. He keeps pestering Ah Zheng without pause. Ah Zheng’s mind isn’t clear so he might be able to accept it, but His Highness is the crown prince. He definitely can’t accept it.” ",
        "“If someone like this liked me, I would definitely stay as far away from him as possible.”",
        "…",
        "Many netizens spoke up for Ming Qingyu. Ming Qingyu’s subordinates even began to shift the blame to others, leading netizens to target the Qi family.",
        "“Qi Shiyan is indeed pitiful, but this is not the crown prince’s fault.” ",
        "“If you want to blame someone, blame the Qi family.”",
        "“That’s right! The crown prince has done a great job as a lover!”",
        "…",
        "At the same time, the Qi family also gave an explanation. ",
        "Qi Jianuo was an active user of Xingbo. He had already explained on Xingbo many times on behalf of the Qi family, saying that the Qi family did not abuse Qi Shiyan, and that the poison in Qi Shiyan’s escape pod had nothing to do with the Qi family.",
        "And now, he also began to present evidence.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Jianuo provided a lot of evidence, including videos of him playing with the young Qi Shiyan, videos of their family celebrating the young Qi Shiyan’s birthday, and a list detailing the financial support their family gave to Qi Yuncheng many years ago.",
        "This list was very long. ",
        "Qi Yuncheng was very talented and was specially recruited by a university based on his talent. His tuition fees were even waived.",
        "But because his family was too poor and he couldn’t afford a mecha, Qi Yuncheng didn’t have a good time in university.",
        "Qi Jianuo’s grandfather thought that Qi Yuncheng would be able to help the Qi family once he became successful, so he gave money to support Qi Yuncheng and even bought Qi Yuncheng a mecha.",
        "The money that the Qi family used to support Qi Yuncheng was an astronomical sum for ordinary people. ",
        "Netizens were stunned by the Qi family’s generosity.",
        "At this time, Qi Jianuo started a live broadcast.",
        "In the live broadcast, he was not as bright and lively as before, but looked very haggard. “I know many people don’t believe it, but I still want to explain that our family really did not abuse Shiyan, nor did we embezzle the property left to Shiyan by General Qi. We provided General Qi with financial aid for many years back then and have taken good care of Shiyan. When he was a child, because my family was very busy, it was indeed robots that took care of Shiyan most of the time, but the one who took care of Shiyan was a top-notch nanny robot that could interact with people. I believe that even if my parents took care of Shiyan personally, they couldn’t do it as well as a robot. We would also take time to accompany him every day.”",
        "Qi Jianuo’s eyes turned red as he spoke, and he added, “The money General Qi left behind was indeed spent, but it was not spent on us. Every star coin of the money has been recorded. Everyone can take a look.” ",
        "***",
        "T/N: *小号 (xiao hao) – literally small trumpet. This is Chinese internet slang for a side account."
    ],
    "previous": "Ch19.2 - Like",
    "next": "Ch20.2 - Super S-Level Mental Power"
}