{
    "title": "Ch21 - Unworthy of Being the Crown Prince",
    "content": [
        "Qi Shiyan’s live broadcast room was originally full of a foul atmosphere with a large group of people scolding him.",
        "But when Qi Shiyan said that his mental power level was at least S+, the barrage of comments suddenly went quiet. ",
        "S+ mental power was not something that just anyone could possess!",
        "Qi Shiyan’s mental power level was actually so high? They couldn’t tell at all!\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Soon, people started discussing again. “Is it true or false? Could Qi Shiyan be lying again?”",
        "“His Highness the Crown Prince is only S-level. Does he mean that his mental power is stronger than His Highness the Crown Prince? I am dying of laughter!” ",
        "“Qi Shiyan is such a boaster!”\n\n",
        "…",
        "Some people didn’t believe it, but some people did. “I have long felt that Qi Shiyan’s mental power level should be S-level. Sure enough, that’s the case!”",
        "“He uses his mental power anytime and anywhere. Ordinary people can’t do this.”\n\n ",
        "“The escape pod contained poison, but he was able to escape. This must have been due to his super high mental power.”",
        "…",
        "As everyone was discussing, they heard Qi Shiyan say that when he was young, his mental power level had already reached S-level.\n\n",
        "Qi Shiyan also said that he hadn’t drunk any of the potions purchased by the Qi family. Instead, they were all given to Qi Jianuo to drink! ",
        "“I have seen the potions that the Qi family bought with Qi Yuncheng’s money. Those potions help advance little by little. The initial potions are only suitable for people of D and C-level. As everyone knows, for people whose mental power is only C-level at the beginning, it is already very good if they can reach A-level in the end. It is impossible for them to reach S-level after adulthood. If Qi Shiyan really has S-level mental power, those potions couldn’t have been given to him to drink.”",
        "“Mental power level can easily be checked. Lying about this will easily be exposed. What Qi Shiyan said should be true. And if what he said is true, then what Qi Jianuo said is false.”",
        "“The Qi family is really interesting. They took Qi Yuncheng’s money and used it to buy potions for Qi Jianuo to drink, yet they still act like they were kind to Qi Shiyan.”",
        "“I was a good friend of General Qi. General Qi possessed S-level mental power without using any potions. Back then, it wasn’t just the Qi family that wanted to invest in him. His last name was Qi, so he took the resources given by the Qi family, but later, he paid them back double.” ",
        "…",
        "Those who stood on Qi Shiyan’s side all spoke out.",
        "At this time, someone suddenly posted on the barrage. “Guys, quickly go check it out! Someone posted intimate photos of Ming Qingyu and Qi Jianuo online!”",
        "“These two people kept saying they had nothing to do with each other, but it turns out they hooked up long ago!” ",
        "“I’m so stupid. I actually believed them!”",
        "“Based on the photos and videos, these two have been together for several years. Ming Qingyu acts like he loves Qi Shiyan very much while dating Qi Jianuo. It’s disgusting!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "The people in the live broadcast room all rushed to the star network, and discovered that the number one hot search* was “Ming Qingyu cheating”. ",
        "The nezt few hot searches were “Zing Hingyu and Hi Aianuo” and “Zing Hingyu and Hi Aianuo intimate photos”, etc. In short, they were all related to them.",
        "When clicking on the hot search, one could see photos of Zing Hingyu and Hi Aianuo kissing at a glance.",
        "If one scrolled further down, they could see intimate photos of the two wearing different clothes and in various poses. Some of the more ezplicit photos had been considerately censored.",
        "Netizens were stunned. “The backgrounds of these photos and videos are exactly the same as the ones Qi Shiyan took before. They’re from Ming Qingyu’s residence.” ",
        "“Good guy, Ming Qingyu kept saying that he had nothing to do with Qi Jianuo, but it turns out that the two of them hooked up long ago!”",
        "“In one of the photos, Ming Qingyu is wearing the clothes he wore when he got engaged to Qi Shiyan. This set of clothes was specially prepared by the imperial family for their engagement, and he never wore them again. In other words, on the day he got engaged to Qi Shiyan, he still took time out to have an affair with Qi Jianuo.”",
        "“Don’t just look at the photos. Go watch the videos! The conversation between the two people in the videos is too vicious!”",
        "“I want to apologize to Qi Shiyan. Everything he said in the live broadcast was true.” ",
        "…",
        "Jiang Jin had already clicked on a video.",
        "In the video, Qi Jianuo looked at Ming Qingyu with a worried look on his face. “Your Highness, Qi Shiyan seems to have noticed something and suspects that you have someone outside… Let’s meet less often.”",
        "Ming Qingyu said, “Don’t worry, I will take care of this matter. I have already guided him to suspect someone else. It’s that woman who has been pestering me time and again. You can talk to him when the time comes and show him the photos of that woman pestering me…” ",
        "After a few words, the two of them found a scapegoat and guided Qi Shiyan to target the person who pestered Ming Qingyu.",
        "The number of comments under this video was growing rapidly.",
        "“Oh my god, when Qi Shiyan kept saying others were mistresses online and led netizens to cyberbully others, it was actually these two who started it!”",
        "“According to what they said, that socialite who was cyberbullied was not completely innocent either.” ",
        "“Ming Qingyu was already engaged to Qi Shiyan at that time, yet this so-called socialite was still pestering Ming Qingyu. Although she didn’t succeed, she did intend to be a third party*.”",
        "“In this matter, the most innocent person is Qi Shiyan. He was isolated and helpless, and afraid of being killed, so he could only pretend to be crazy and stupid and follow the script arranged for him by Ming Qingyu and Qi Jianuo.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "After watching the video, Jiang Jin posted a comment below, cursing Ming Qingyu. ",
        "These people in the imperial family were so disgusting!",
        "Well, His Majesty didn’t count.",
        "Jiang Jin had suffered a lot, so although Qi Shiyan’s experience was tragic, it did not move him.",
        "After watching these videos, Lu Yuan felt extremely distressed. ",
        "What kind of life had Qi Shiyan been living over the years?",
        "They were Qi Shiyan’s elders and should have taken good care of Qi Shiyan, but in the end, they actually let Qi Shiyan suffer so much…",
        "Ming Qingyu had gone too far. He was not worthy of being the crown prince!",
        "The bigwigs in the military thought the same as Lu Yuan, and even ordinary people felt that Ming Qingyu was not worthy of being the crown prince. ",
        "“How can someone with such bad character be the crown prince?”",
        "“To be honest, if it weren’t for Qi Shiyan, who would know who Ming Qingyu is? Ming Qingyu rose to prominence with the help of Qi Shiyan, and then kicked Qi Shiyan away… Qi Shiyan is not a white-eyed wolf. It’s Ming Qingyu that is!”",
        "“I actually used to be a fan of such a person. It’s disgusting.”",
        "… ",
        "For a moment, only a very small number of people still stood on Ming Qingyu’s side, thinking that Qi Shiyan deserved it.",
        "Who knew whether they were mentally ill or had bad character.",
        "The only thing they could use to accuse Qi Shiyan now was that he had bullied his classmates*.",
        "However, at this moment, the matter was also reversed. ",
        "Some of Qi Shiyan’s classmates suddenly stood out to speak for Qi Shiyan.",
        "“Qi Shiyan didn’t bully Kane and the others at all. It was clearly them who bullied Qi Shiyan.”",
        "",
        "“Qi Shiyan was studying nursing well and had no contact with Kane and the others. It was them that took the initiative to rush up to Qi Shiyan and scold him, saying that Qi Shiyan was not worthy of studying at the Central Military Academy and was not worthy of being General Qi’s son.”",
        "“They also said that Qi Shiyan took away other people’s study opportunities… Qi Shiyan studied nursing. The nursing major at the Central Military Academy was originally established to take care of the children of martyrs. There’s no such thing as Qi Shiyan abusing his power to take away other people’s study opportunities.” ",
        "“Qi Shiyan did have an argument with Kane, but the two of them were in different majors and had no contact at all. Kane didn’t suffer any harm in the Central Military Academy at all. When he dropped out, his classmates were also puzzled as to why he did that.”",
        "“In fact, we did speak up for Qi Shiyan at that time, but unfortunately no one believed us.”",
        "“Kane was originally very poor, but after being ‘bullied’, he suddenly became rich. I don’t know who gave him the money.”",
        "“Who else could have given it to him? It was Ming Qingyu. He has always been thinking of ways to discredit Qi Shiyan.” ",
        "…",
        "Qi Shiyan’s classmates produced a lot of evidence, including the video of the conflict between Qi Shiyan and Kane and the others.",
        "In the video, Qi Shiyan was making a big fuss, while Kane and the others stood by and sneered.",
        "The person who broke down inside was obviously Qi Shiyan. ",
        "However, Kane and the others were indeed troubled by some people back then.",
        "Now, those people also stood up and explained what happened back then. “The Central Military Academy’s rules are very strict. We just mocked them a few times and didn’t dare to fight. We also couldn’t beat Kane and the others.”",
        "“You can’t just allow Kane and the others to scold us and not allow us to scold back, right?”",
        "“If this is bullying, then we were also bullied by them back then!” ",
        "“After the incident became a big deal, the school did not expel Qi Shiyan. This was not because the school favored him, but because bullying did not exist at all.”",
        "…",
        "In an instant, Qi Shiyan’s two biggest scandals were cleared up.",
        "As for other scandals such as his rude remarks to veteran soldiers, no one paid attention to them now. ",
        "People felt that Qi Shiyan definitely didn’t do it on purpose.",
        "“Qi Shiyan suffers from skin hunger syndrome. When he refused to shake hands with the veteran at the time, he was probably afraid that his illness would be discovered.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Qi Shiyan didn’t dare to get close to others before. It wasn’t until he was stranded on an undeveloped planet that he dared to show his true self.”",
        "“He is too pitiful. He has lived in a cage full of spikes since he was a child and dared not move at all. No wonder he finds everything he sees new these days.” ",
        "“The entire star network owes Qi Shiyan an apology!”",
        "“I will delete my previous comments immediately. I didn’t know anything at the time and said a lot of excessive things. I was wrong.”",
        "…",
        "Qi Shiyan’s live broadcast room was filled with “I’m sorry” for a while. ",
        "Qi Shiyan’s life, however, was not affected at all.",
        "He complained to Ming Zheng and after telling him about his miserable childhood, he looked at Ming Zheng pitifully.",
        "Ming Zheng couldn’t harden his heart toward Qi Shiyan, who kept confessing to him and saying sweet words.",
        "He was dying, and there was no one else around… Ming Zheng hugged Qi Shiyan and patted him on the back. “Don’t be sad…” ",
        "He was not very good at comforting people, so after saying this dryly, he stopped.",
        "After a pause, Ming Zheng spoke to the Starlight’s intelligent system again. “Xiao Xing, help me record another message for Old Three. Old Three, Ah Yan was bullied when he was a child. Please help me investigate clearly…”",
        "“Ah Zheng, I want you to help me investigate!” Qi Shiyan interrupted Ming Zheng’s words and rubbed hard in Ming Zheng’s arms.",
        "His future partner hugged him. How nice! ",
        "***",
        "T/N: Bonus chapter for Danypooh and Chibidere. Thanks for the ko-fis!",
        "*热搜 (re sou) – hot search. It means a trending search.",
        "*小三 (xiao san) – literally little three. It’s a derogatory term for a mistress/third party in a relationship. I usually translate this as mistress, but used third party here as I thought it sounded better. ",
        "*同学 (tong xue) – should have explained this earlier. I’m translating this as classmate, but schoolmate is technically more correct (the literal translation is “same school”, so someone who goes to the same school, i.e. a schoolmate). The original owner enrolled in the nursing major, while those he “bullied” were all in other, more popular majors (like mecha operation), so they are technically only schoolmates, not classmates.",
        ""
    ],
    "previous": "Ch20.2 - Super S-Level Mental Power",
    "next": "Ch22 - Eliminating Poison"
}