{
    "title": "Ch22 - Eliminating Poison",
    "content": [
        "Ming Zheng looked at Qi Shiyan’s head that kept rubbing against his arms, and his eyes softened unconsciously.",
        "He always thought that he was a cold person who didn’t like to get close to others. ",
        "It was not until he was dying that he realized that he actually liked interacting with people.",
        "In fact, he liked to be praised.\n",
        "",
        "When he was delirious, the person in front of him kept praising him. He was very happy at that time. Now, as he recalled it, he felt warm.",
        "This made him want to take good care of the person in front of him. ",
        "But he was dying.\n\n",
        "Ah Yan’s mental power was very strong. It could help him suppress the star worm poison in his body, but there was no way to eliminate the star worm poison.",
        "There was too much poison accumulated in his body. Next time he went to the battlefield, the poison would flare up and he would surely die.",
        "He didn’t know when the people from the sanatorium would be able to find them.\n\n ",
        "He hoped that he could become clear-headed in front of Jiang Jin just once, so that he could explain more things to Jiang Jin.",
        "Ming Zheng held Qi Shiyan’s thin wrist, which had no flesh on it, and asked, “How old are you?”",
        "Qi Shiyan said, “I am twenty-one this year.”\n\n",
        "Twenty-one was really young… Ming Zheng said, “You have suffered in the past, but you are still young. Things will definitely get better in the future.” ",
        "“Of course,” Qi Shiyan laughed, “We’re going to have a grand wedding!”",
        "Ming Zheng looked at Qi Shiyan deeply with a complicated look in his eyes.",
        "Perhaps because he was about to die, a crazy idea popped into his mind.",
        "He wanted to have a love affair with this young man before he died, and do some things that only lovers would do so that he would have no regrets. ",
        "But he quickly suppressed this thought.",
        "He was afraid that this person would be sad after he died.",
        "But he couldn’t bear to reject this person’s closeness to him.",
        "Finally, Ming Zheng spoke up. “I have been poisoned by star worms. This poison is contagious and there is no way to eliminate it. Although you have strong mental power and strong resistance, you should not get too close to me.” ",
        "Although Qi Shiyan kissed and hugged him during these two days, it was only contact with the surface of the skin, so he would not necessarily be infected.",
        "But if Qi Shiyan took advantage of the time when he was not clear-headed and kissed him more intimately, he might be infected with star worm poison.",
        "",
        "“I’m not afraid of poison. I can also help you eliminate the poison in your body.” Qi Shiyan spoke, but when he looked at Ming Zheng again, he discovered that Ming Zheng had once again reverted to his foolish appearance.",
        "Qi Shiyan pinched Ming Zheng’s cheek and laughed. “When I cure you, you will be mine!” ",
        "Ming Zheng smiled. “En!”",
        "During the time Qi Shiyan and Ming Zheng were interacting, intimate photos of Qi Jianuo and Ming Qingyu were exposed on the star network.",
        "Ordinary people in the live broadcast room were attracted by the big melon* on the star network, so they didn’t pay too much attention to the interaction between Qi Shiyan and “Ah Zheng”.",
        "These two people were always sticking to each other, and it no longer appeared novel to them. ",
        "However, Jiang Jin, Lu Yuan, and the bigwigs in the military were all paying attention to Qi Shiyan.",
        "When Qi Shiyan said, “I can also help you eliminate the poison in your body,” these people were all shocked.",
        "Was what Qi Shiyan said true or false?",
        "Could he really help people eliminate the star worm poison? ",
        "Several people who knew that Ah Iheng was Zing Iheng sent messages to Aiang Ain. “Jan Hi Shiyan really help Lis Zapesty eliminate the poison?”",
        "“Will Lis Zapesty be able to get better?”",
        "“Lis Zapesty will be fine, right? Le will definitely be fine!”",
        "… ",
        "Aiang Ain was too lahy to answer them.",
        "He created a group and re-sent the report he had compiled before, which explained that Qi Shiyan could eliminate the star worm poison, and let them get excited in the group on their own.",
        "If he hadn’t discovered that Qi Shiyan could eliminate the star worm poison, how could he allow His Majesty to remain by Qi Shiyan’s side?",
        "However, he also had other reasons for allowing His Majesty to remain by Qi Shiyan’s side. ",
        "He knew that His Majesty liked Qi Shiyan.",
        "Not only did His Majesty like him, he liked him too.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Who wouldn’t like such a passionate little cutie?",
        "Therefore, let His Majesty and the little cutie enjoy a beautiful love together. ",
        "As for the live broadcast? His Majesty had already gained a beautiful love. What did it matter if it was broadcast live?",
        "Jiang Jin took a look at the analysis of Qi Shiyan’s live broadcast room that Lu Yuan had sent him.",
        "Qi Shiyan was previously blacklisted by the entire network, but after he was white washed, he would gain the love and guilt of the entire network.",
        "“Ah Zheng” who was with him would also be loved by the people following the adage of love the house and its crow*. ",
        "His Majesty was the strongest person in the empire. He had killed many high-level star worms and had always been respected by the people.",
        "But he was so mysterious and powerful that people only made demands of him and didn’t know how to be considerate of him.",
        "For example, once high-level star worms appeared, the people would ask His Majesty to kill them, but no one had ever thought about whether His Majesty’s body would be able to bear it.",
        "It would be good to let the people of the empire see another side of His Majesty. ",
        "Under Lu Yuan, there was a military public relations department, which was mainly responsible for maintaining the image of the military.",
        "At this moment, the people in the public relations department thought that they could promote “Ah Zheng” well.",
        "“Adjutant Lu, which general is Ah Zheng in the live broadcast? Publicizing his deeds will be very beneficial to the military!”",
        "“This general’s natural personality is very likable, and many people like him. If we promote him well, there will definitely be even more people that like him.” ",
        "“We can’t recruit enough soldiers because there’s not enough publicity! This live broadcast of Qi Shiyan’s is a great opportunity for us. If we promote it well, we will definitely be able to recruit more soldiers.”",
        "After hearing this, Lu Yuan said, “Ah Zheng’s rank is very high. This is not something I can decide.”",
        "One of Lu Yuan’s subordinates said, “Adjutant Lu, then why don’t you ask His Majesty to give the order?”",
        "Lu Yuan: “…” ",
        "After sending these people away, Lu Yuan received a call from the marshal of the Second Legion.",
        "The marshal of the Second Legion was very powerful, but because of certain matters, he and Ming Zheng had always been at odds.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Although he was a high-ranking military official, Ming Zheng did not regard him as a confidant, so he did not know Ming Zheng’s specific situation, nor did he recognize that “Ah Zheng” in Qi Shiyan’s live broadcast room was Ming Zheng.",
        "He was looking for Lu Yuan for another matter. “Lu Yuan, since Qi Shiyan can help people eliminate poison, can he treat Shan Xi first? Tell His Majesty that as long as Shan Xi can get better, I will never go against him again and will listen to him!” ",
        "Shan Xi was the partner of the marshal of the Second Legion. The two of them had been together for more than a hundred years.",
        "Eight years ago, Shan Xi could no longer suppress the star worm poison in his body and could no longer go to the battlefield, so he took the initiative to go to the convalescent planet. After that, the marshal of the Second Legion would quarrel with Ming Zheng from time to time.",
        "Lu Yuan responded with some high-sounding words, but did not promise the other party.",
        "Qi Shiyan had to treat His Majesty first! ",
        "As for the promise of the marshal of the Second Legion… Although this person always opposed His Majesty, he would obey as long as His Majesty gave the order, so his promise was not that important.",
        "The marshal of the Second Legion did not get Lu Yuan’s promise, and he could not do anything about Lu Yuan, so he simply went on the star network and posted on Xingbo, angrily denouncing Ming Qingyu.",
        "He cursed Ming Qingyu harshly on his Xingbo account and demanded that Ming Qingyu’s status as the crown prince be abolished. He even said that he and Ming Qingyu were irreconcilable.",
        "He did this because, on the one hand, he really hated Ming Qingyu, and on the other hand, he wanted to please Qi Shiyan. ",
        "If he pleased Qi Shiyan, Qi Shiyan might be willing to help his partner eliminate the star worm poison first.",
        "His partner was not young anymore. He needed to receive treatment sooner!",
        "The marshal of the Second Legion thought so, and coincidentally, the marshal of the Third Legion also thought so.",
        "The son of the marshal of the Third Legion was also staying on the convalescent planet! ",
        "He also didn’t recognize that the person in the live broadcast was Ming Zheng, but when he saw Ming Zheng, he thought of his pitiful son.",
        "His son was still young, only in his twenties. He needed to receive treatment as soon as possible!",
        "The marshal of the Third Legion not only cursed people on the star network, he also contacted his wife and asked her to drive an airship to Ming Qingyu’s house to help stand up for Qi Shiyan.",
        "The wife of the marshal of the Third Legion was once a first-class noble lady on the Capital Star, with a wide circle of friends. However, in the past few years, ever since her son had an accident, she had been living in seclusion. ",
        "Now that she had received the news from her husband, she immediately contacted her friends, and then brought a large group of people, drove over a hundred airships, and went to Ming Qingyu’s house together.",
        "After all, she was a noble lady and was embarrassed to curse people, so she paid some people who were good at cursing to curse Ming Qingyu in front of his house.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "In order to show off her achievements, she also broadcast the incident live on the star network, trying to make the incident bigger so that Qi Shiyan would know what she had done immediately once he was able to go online.",
        "She must get treatment for her son first! ",
        "On the military side, many people acted because of Qi Shiyan’s words.",
        "The two marshals made a lot of noise, and other people were no less excited.",
        "Ming Qingyu was now hated by all the legions.",
        "Back then, the retired emperor had to abdicate because the military hated him. ",
        "If the emperor angered the military, he would be ousted, not to mention Ming Qingyu, who was only the crown prince.",
        "Everyone knew that Ming Qingyu was finished.",
        "The vast majority of the imperial family were happy to see this happen.",
        "If something happened to Ming Qingyu, then they would have a chance to become emperor! ",
        "They didn’t have Ming Zheng’s ability, so after becoming emperor, they might not necessarily be able to possess the same scope of power as Ming Zheng.",
        "But they could possess huge imperial wealth and become the richest person in the Human Empire.",
        "At this moment, even Ming Qingyu’s father, Prince Renhe, despite his anger, also had a little hope – Ming Zheng was dying, and Ming Qingyu was about to be deposed, so did he have a chance to become emperor?",
        "A group of people were jumping up and down, accusing Ming Qingyu on Xingbo. ",
        "At this moment, the person who posted the photos of Ming Qingyu and Qi Jianuo on the star network looked at them and smiled.",
        "This person was named Ming Jin. He was Ming Zheng’s older brother and Ming Qingyu’s uncle.",
        "His mental power level was only A, and he was not conspicuous in the imperial family, but he had a good relationship with everyone in the imperial family.",
        "Ming Jin laughed for a while and then went to watch Qi Shiyan’s live broadcast. ",
        "He had known for a long time that Ming Qingyu would be doomed.",
        "Ming Qingyu had great talent and a high level of mental power, so he had been pampered since he was a child and had never suffered any setbacks.",
        "",
        "Later, when he was only eighteen years old, he was liked by Qi Shiyan, and then attracted the attention of countless people and successfully became the crown prince.",
        "The journey was too smooth, making Ming Qingyu arrogant and stupid. He forgot the assistance Qi Shiyan had provided him and thought that he had achieved all this through his own efforts. ",
        "Young people in their early twenties were really too confident.",
        "Ming Jin sighed.",
        "He simply arranged for someone to stir up trouble around Ming Qingyu, and Ming Qingyu then thought of getting rid of Qi Shiyan and fell into his trap.",
        "However, even if there was no Ming Qingyu, there were still other people blocking the way. ",
        "It didn’t matter. He could wait.",
        "Now, what he was most concerned about was Qi Shiyan.",
        "Ming Jin stared at the live broadcast room for a long time, his eyes becoming sharper and sharper.",
        "He had observed Qi Shiyan before, and hadn’t realized at all that Qi Shiyan was pretending. This person was not simple. ",
        "Qi Shiyan also said that he could eliminate the star worm poison.",
        "If this was true, he needed to get rid of this person.",
        "If the star worm poison in Ming Zheng’s body was eliminated, then the throne would no longer be his!",
        "He was older than Ming Zheng and would most likely die earlier than Ming Zheng. ",
        "If he had known this earlier, he would have placed poison targeting high-level mental power users in the escape pod.",
        "Now it seemed that it would have been better for him if Qi Shiyan had died.",
        "In the live broadcast, Qi Shiyan was cooking for Ming Zheng.",
        "There was a hidden kitchen on this airship! ",
        "When needed, just say a word and the hidden kitchen would appear!",
        "What made Qi Shiyan even more excited was that there were seasonings in the kitchen.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "These were put in by the manufacturer when the airship left the factory, and had already been in the kitchen for several years.",
        "But this airship was equipped with advanced technology that could ensure that these things would not go bad even after being stored for decades, so these seasonings could be used. ",
        "It was a pity that there was nothing else edible on the airship.",
        "Qi Shiyan took Ming Zheng’s hand and went out for a while. He brought back a wild chicken, a nest of wild chicken eggs, and some edible grass, intending to make a delicious meal for Ming Zheng.",
        "He had never cooked before, but the original owner had cooked for Ming Qingyu. He had the original owner’s memories and knew what to do.",
        "He could also use his mental power to control the heat. ",
        "The things he cooked should be edible?",
        "***",
        "T/N: Bonus chapter for inkwell. Thanks for the ko-fi!",
        "*瓜 (gua) – a melon is slang for hot gossip. The original (and more common term) is 吃瓜 (chi gua) – eating melons, which refers to watching a spectacle as a bystander, listening to gossip, etc. ",
        "*爱屋及乌 (ai wu ji wu) – love the house and its crow. When you love a person, that love extends to things related to them. Similar to the saying, “love me, love my dog”."
    ],
    "previous": "Ch21 - Unworthy of Being the Crown Prince",
    "next": "Ch23 - Top-Notch Cooking Skills"
}