{
    "title": "Ch23 - Top-Notch Cooking Skills",
    "content": [
        "Before transmigrating, Qi Shiyan had never eaten normal food.",
        "In the later period, he had constant food poisoning from eating food that had been expired for ten or twenty years and contained toxins and radiation. ",
        "Therefore, he could eat any non-toxic leaf picked from the roadside with relish.",
        "He could actually eat things with poison, but right now, he wanted to save his supernatural powers to help Ming Zheng eliminate poison, so he wouldn’t eat them.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This situation made him wonder what ordinary people liked to eat.",
        "In order to avoid making mistakes, Qi Shiyan planned to stew the wild chicken, cook the wild grass in the chicken soup, and then scramble the eggs. ",
        "He cleaned the wild chicken, put it into a pot to stew, then heated oil in a pan and started to scramble the eggs.\n\n",
        "“It’s a pity that there is no network access here, Ah Zheng. If there was, I would definitely be able to cook delicious meals!” It would be great if he could watch other people’s cooking videos. He could use his mental power to replicate all their movements exactly.",
        "Ming Zheng stood by with his hand on Qi Shiyan’s neck, looking at Qi Shiyan curiously.",
        "Qi Shiyan was eating wild grass again!\n\n ",
        "Seeing Qi Shiyan eating so happily, he also wanted to try it, but when he thought of the unpalatable leaves he had eaten before, he gave up this idea.",
        "Qi Shiyan had already beaten the eggs and the oil in the pan had also heated up. He estimated that it was about ready, so he poured the egg liquid in.",
        "As soon as the egg liquid was poured in, Qi Shiyan smelled an enticing aroma.\n\n",
        "Scrambled eggs were so delicious? ",
        "Wasn’t this too fragrant?!",
        "The roasted rabbit and roasted deer meat that he roasted before were actually also very fragrant, but the meat of these two animals didn’t contain much fat, and he didn’t apply oil when roasting, so the fragrance could not be brought out.",
        "Now he used a little more oil to scramble the eggs and felt the beauty of oil for the first time.",
        "Scrambled eggs were simple to make and Qi Shiyan finished frying them quickly. ",
        "He didn’t put any seasoning in the scrambled eggs. He just poured a little soy sauce, picked up a piece of scrambled eggs and dipped it in the soy sauce.",
        "So delicious! So fragrant!",
        "The eggs were delicious and the soy sauce was delicious too!",
        "Qi Shiyan picked up a piece of egg with chopsticks and brought it to Ming Zheng’s mouth. “Ah Zheng, the eggs I scrambled are definitely the most delicious eggs in the world. Quickly try them.” ",
        "Ming Zheng opened his mouth and ate. Qi Shiyan asked, “How is it? Is it delicious?”",
        "“Delicious!” Ming Zheng nodded seriously and looked at Qi Shiyan with a smile.",
        "Please visit chrysanthemumgarden (dot) com",
        "These scrambled eggs were much more delicious than the roasted meat from before.",
        "“Scrambled eggs are really delicious. I’m going to scramble a hundred for myself at once in the future.” Qi Shiyan said. ",
        "Ming Zheng agreed. “En! One hundred!”",
        "The two of them shared a bowl of scrambled eggs, taking turns to eat. At this time, the chicken stewed by Qi Shiyan was ready to eat.",
        "The pot that came with this kitchen was a pressure cooker, which could stew chicken very quickly.",
        "As for the fact that chicken soup tasted better when simmered over low heat… Qi Shiyan didn’t care anyway. ",
        "After opening the pot, Qi Shiyan was intoxicated by the fragrance again.",
        "He was a great cook. This wild chicken smelled delicious.",
        "After taking the chicken out of the soup, Qi Shiyan continued to eat it with soy sauce.",
        "He held Ming Zheng in his arms, ate a bite himself, and then gave Ming Zheng a bite. He felt that this was the best day in the world. ",
        "After the chicken was eaten, there was still a pot of chicken soup left. Hi Shiyan put the wild grass he had brought back into the soup and cooked it.",
        "Le also found salt and ZSX and put some of each in.",
        "Wild grass soup was also delicious, much better than eating it raw!",
        "Qi Shiyan ate a piece of wild grass with chopsticks, and then picked up another piece for Ming Zheng. ",
        "Ming Zheng opened his mouth and ate, then covered his mouth, refusing to take a second bite. “I’m not hungry.”",
        "Qi Shiyan: “…” Don’t think he couldn’t tell that Ming Zheng disliked this pot of wild grass soup.",
        "But why? It was so delicious.",
        "Qi Shiyan held the pot of soup he cooked and ate it with relish. ",
        "This was obviously delicious!",
        "He was such a good cook and making meals was so simple.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Zheng looked at this scene and frowned unconsciously, with an expression as if he had eaten something disgusting.",
        "The people watching the live broadcast were dying of laughter. “Qi Shiyan put a bunch of miscellaneous wild grass together to cook. The resulting food must be unpalatable.” ",
        "“The disgust on Ah Zheng’s face can no longer be concealed!”",
        "“Qi Shiyan actually thinks his cooking is delicious. Is there something wrong with his taste buds?”",
        "“Now that you mention it… Did the Qi family not let Qi Shiyan eat before? Why does Qi Shiyan eat everything? His sense of taste also isn’t normal…”",
        "“Qi Shiyan is so miserable…” ",
        "…",
        "Many people who were watching the live broadcast had tears in their eyes as they commented.",
        "At this moment, many people online were sorting out Qi Shiyan’s life.",
        "Not long after he was born, both his parents died and he was sent to the Qi family. ",
        "The Qi family treated him with cold violence. As a child, he was powerless to resist and could only endure it silently.",
        "People with strong mental power were very sensitive. If they had S-level mental power, they would have even sharper ears and eyes. They could hear people talking from a long distance away.",
        "The Qi family probably didn’t know this. He heard them discussing things behind his back. He was afraid that he would be killed by the Qi family, so he could only hide his mental power.",
        "As for why he didn’t ask for help, although he appeared in public as a child, he only made brief appearances on important occasions. ",
        "In addition, every time he appeared, there would be a bunch of media surrounding him.",
        "Adults who were good at dealing with people could handle this situation with ease, but Qi Shiyan was obviously not such a person.",
        "Judging from some of the photos taken by the media when he was young, he was obviously frightened.",
        "The Qi family might have threatened him privately… ",
        "He could only keep pretending. Then finally, he grew up and could go to school to study.",
        "The story of how Ming Qingyu and Qi Shiyan met was something that Qi Shiyan had posted on Xingbo a long time ago. People studied his early Xingbo posts and realized his situation at that time.",
        "Please visit chrysanthemumgarden (dot) com",
        "He had never been in contact with people since he was a child, so after going to school, he couldn’t get along with others. Thus he had no friends.",
        "Later, Ming Qingyu helped him, so he had a good impression of Ming Qingyu, and maybe even regarded Ming Qingyu as his salvation. ",
        "As a result, Ming Qingyu only used him and did not love him, and even got entangled with Qi Jianuo.",
        "His mental power was very strong, even stronger than Ming Qingyu’s. He might have discovered Ming Qingyu and Qi Jianuo’s affair a long time ago…",
        "“Qi Shiyan is so pitiful.”",
        "“My heart hurts.” ",
        "“I gave my child a beating because he always scolded Yanyan* online in the past. I had to beat him.”",
        "“I rewatched the scene where Qi Shiyan came out of the escape pod several times. He was so excited at the time. Was it because he felt that he could finally get rid of everything on the Capital Star?”",
        "“We thought he would find it very difficult being stranded on an undeveloped planet, but from his perspective, it was like regaining his freedom…”",
        "… ",
        "In the live broadcast, Qi Shiyan had already finished a large pot of wild grass soup.",
        "After eating, he took Ming Zheng’s hand and said, “Ah Zheng, let’s go hunting again!”",
        "Although what he made was delicious, it was too little and not enough for him to eat.",
        "He wanted to go catch another big one. ",
        "Ming Zheng was willing to do anything as long as he could be with Qi Shiyan, and nodded happily.",
        "The two of them were very happy, but on the Capital Star, Qi Jianuo and Ming Qingyu were on the verge of collapse.",
        "Ming Qingyu’s house was surrounded, and the Qi family was the same.",
        "Qi Jianuo opened the protective cover of the house and asked his father with a pale face, “Dad, what should we do now?” ",
        "“There’s nothing we can do,” Father Qi said, “I didn’t expect his mental power to actually be so high.”",
        "The robot nanny who used to take care of Qi Shiyan had long been destroyed by Father Qi. No one could produce evidence of their family’s cold violence against Qi Shiyan.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But after the intimate photos of Qi Jianuo and Ming Qingyu were exposed, even without evidence, people would think that they did those things.",
        "Mother Qi’s eyes were red and swollen. She said to Father Qi, “It’s all your fault! He was just a child. At that time, I wanted to take good care of him, but you insisted on treating him like that…” ",
        "Father Qi said, “What’s the point of saying this now? When I used Qi Yuncheng’s money to buy potions for Jianuo to drink, I didn’t see you object!”",
        "Mother Qi was suddenly speechless.",
        "Before, she was very happy when she saw Ming Qingyu liked Qi Jianuo and thought that their family would produce an empress.",
        "What a great situation it was at that time! As long as Qi Shiyan gave way, her Jianuo could become the crown princess! ",
        "Who would have thought that in just a few days, such a good situation would disappear without a trace.",
        "Father Qi said again, “This is not right. How could this little beast hide so well? He was obviously very stupid when he was a child. The sensor device I placed next to him could only sense very weak mental power…”",
        "Qi Shiyan was very thin and weak when he was a child. His reactions were also slow.",
        "Those who sent Qi Shiyan to his home all said that Qi Shiyan’s talent shouldn’t be very good. ",
        "Later, he conducted some tests on Qi Shiyan, and the test results also confirmed this.",
        "He dared to treat Qi Shiyan like that and regard Qi Shiyan as a stepping stone for his son only after he was sure that Qi Shiyan had poor talent.",
        "Qi Shiyan was raised by him to be very lacking in love. He would subconsciously try to please them and was completely defenseless against them…",
        "Who would have thought that this was all Qi Shiyan pretending? ",
        "Why did Qi Shiyan pretend? If he had shown S-level mental power when he was young, they would have never dared to treat him badly!",
        "Father Qi couldn’t understand no matter how hard he thought about it. At this moment, there was movement outside.",
        "People from the Capital Star Police Department had arrived.",
        "Many people had reported them for child abuse. There were also people who had reported them for stealing other people’s property and trying to murder Qi Shiyan. Now, the police were here to ask them to cooperate with the investigation. ",
        "They did not attempt to murder Qi Shiyan. As for the matter of child abuse, the police might not be able to obtain any evidence.",
        "But even so, the Qi family was finished.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The Qi family was arrested by the police.",
        "Ming Qingyu was better off. After all, he was the crown prince and lived on the continent exclusive to the imperial family. It was not easy for the police to arrest him. ",
        "But he was blocked at the door by the wife of the marshal of the Third Legion and scolded.",
        "Speaking of which, the wife of the marshal of the Third Legion was also surnamed Ming. Her father was the younger brother of the retired emperor, so Ming Qingyu should call her aunt.",
        "Madam Ming was from a branch of the imperial family. Because her father had a bad relationship with the retired emperor and she herself had no ability, she had no standing in the imperial family at the beginning.",
        "But her husband became the marshal of the Third Legion eight years ago! ",
        "Many years ago, she insisted on marrying a military man with no background. At that time, many people in the imperial family laughed at her, but who would have thought that the star worms would come not long after.",
        "In the past, if one wanted to be promoted in the legion, their background was the main factor. But after the appearance of star worms, one’s combat strength became the key factor.",
        "The marshal of the Third Legion was named Lou Yuanjie. He was big and strong* and had a bad temper, but he was a good fighter and good at commanding combat operations.",
        "Over the years, many senior generals of the Third Legion had retired. Lou Yuanjie rose step by step and suddenly became a marshal. ",
        "With a legion marshal as her husband, Madam Ming’s status in the imperial family rose as well. At least, when she blocked Ming Qingyu’s door, no one dared to drive her away, not even Ming Qingyu.",
        "Madam Ming did not go up to curse people herself. She was holding a communication terminal and watching Qi Shiyan’s live broadcast.",
        "She cried while watching.",
        "She felt sorry for Qi Shiyan, thinking that Qi Shiyan had been wronged. She also felt sorry for “Ah Zheng”. ",
        "This “Ah Zheng” didn’t look very old, but after being poisoned, he actually became like this.",
        "Would her son become like this in the future?",
        "After her son went to the convalescent planet two years ago, she could only see her son in photos and videos and could not meet him face to face.",
        "Although her son told her everything was fine, she couldn’t help worrying. ",
        "She proposed more than once to take her son to the Capital Star to recuperate, but because the star worm poison was contagious, even her husband disagreed with her request.",
        "While Madam Ming was worrying about her son, at the sanatorium on the convalescent planet, the staff discovered something. “Where is Young General* Lou?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“I can’t find him!”",
        "“I just checked the surveillance videos. He stole an airship and ran away, saying he was going to find freedom.” ",
        "“Find freedom? The airship can’t fly out of the convalescent planet! Going to the forest and being a savage is his idea of freedom?”",
        "…",
        "This Young General Lou was the youngest of the poisoned people living in the sanatorium, and he had a very eccentric personality.",
        "Ordinary people really couldn’t do such a thing! ",
        "***",
        "T/N: *宴宴 (Yanyan) – repeats the last character of Qi Shiyan’s name. Several Chinese names are simply repeats of the same character. For those with two character names with different characters and those with single character first names, repeating a character is an affectionate way to refer to them.",
        "*In the raws, this was 五大三粗 (wu da san cu) – literally five big and three thick. This is an idiom to describe a big and burly person.  The “five big” refer to big hands, big feet, big ears, shoulder width, and hips, and the “three thick” refer to thick waist, thick legs, and thick neck.",
        "*It’s actually 小将军 (xiao jiang jun) – literally Little General in the raws, but I felt that sounded too diminutive in English, so I’m using Young General as his title. "
    ],
    "previous": "Ch22 - Eliminating Poison",
    "next": "Ch24 - Lou Jingyue"
}