{
    "title": "Ch24 - Lou Jingyue",
    "content": [
        "Deputy Director Zhao of the sanatorium had been very worried these days.",
        "First, His Majesty disappeared, and then after Director Jiang contacted Adjutant Lu, he took some people and left the convalescent planet. After leaving, they never returned! ",
        "Although Director Jiang had contacted him and told him that His Majesty was fine, Director Jiang was gone and a traitor had been found in the sanatorium… All this made Deputy Director Zhao very nervous. He was always worried that he would not be able to manage the sanatorium well.",
        "After all, there were a bunch of bigshots living in this sanatorium.\n",
        "",
        "On this side was a former admiral, on that side was a former lieutenant general, and the man lying drowsily on the sofa next to them was a former marshal!",
        "He respected these people from the bottom of his heart, but when it came to managing them, he felt uneasy. ",
        "These past few days, he prayed to the heavens every day, hoping that there would be no mistakes during his management of the sanatorium. Unfortunately, mistakes still occurred in the end.\n\n",
        "After His Majesty disappeared, Young General Lou also disappeared.",
        "Their sanatorium didn’t have many staff to begin with. Director Jiang had also taken some people away, so now they didn’t have enough staff to go out and look for people.",
        "Deputy Director Zhao was extremely anxious.\n\n ",
        "The former marshal of the Third Legion, who was lying on the sofa next to Deputy Director Zhao, said, “Xiao* Zhao, you don’t have to be so anxious. After all, there’s no use in being anxious.”",
        "Deputy Director Zhao: “…”",
        "The former marshal of the Third Legion continued, “His Majesty is gone. Compared with His Majesty, Xiao Lou’s escape is a small matter.”\n\n",
        "This was true, but Deputy Director Zhao became even more anxious when he thought of His Majesty being in some unknown place. ",
        "The former marshal of the Third Legion asked, “So what’s the situation with His Majesty? Jiang Jin said His Majesty is fine, but where is His Majesty?”",
        "Deputy Director Zhao said, “I don’t know either. In the past two days, Director Jiang has found many people to protect the convalescent planet, but I don’t know the specific situation.”",
        "After Director Jiang left the sanatorium, every time he contacted Director Jiang, Director Jiang’s reply was very slow.",
        "The former marshal of the Third Legion sighed. “Something may have happened outside.” ",
        "Deputy Director Zhao also felt that something must have happened outside, but everyone here was old, weak, and sick, and there was nothing they could do.",
        "Therefore, he decided to think about the matter at hand. “Why would Xiao Lou run away? If something happens to him outside, how can I explain it to Madam Ming?”",
        "Madam Ming had been relatively quiet in recent years, but in the past few years, she had been traveling around, publicizing the battle situation on the front lines on various planets and calling on high-level mental power users to go to the front lines to participate in the war.",
        "Her son and daughter, both in their early twenties, went to the battlefield. ",
        "Deputy Director Zhao admired this lady very much. He once patted his chest and assured Madam Ming that he would take good care of Xiao Lou.",
        "Xiao Lou’s actual name was Lou Jingyue. He possessed S-level mental power and was very talented.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The military originally wanted to train him well, but not long after he joined the army, he was ambushed by high-level star worms.",
        "He had a strong sense of combat awareness and severely injured a high-level star worm, but he was also poisoned by the star worm poison and could no longer use his mental power. ",
        "A genius fell from heaven just like that. Who knew how many people felt sorry for him.",
        "The former marshal of the Third Legion said, “Forget Xiao Lou wanting to run away. I want to run away too.”",
        "Deputy Director Zhao: “???” He took care of these people with all his heart. Why would they want to run away?",
        "If Lou Jingyue were here, he would definitely tell Deputy Director Zhao, “Being in the sanatorium is like being in prison. Who wouldn’t want to run away?” ",
        "The sanatorium rang a bell at 6 a.m. every morning to wake them up. After they washed up and did morning exercises, they ate breakfast at 7 a.m.",
        "After breakfast, they could read some news sent by the military. At 8 a.m., they would start to train their mental power to suppress the poison in their bodies.",
        "In the afternoon, they either received treatment or did something they enjoyed to distract themselves and keep themselves from becoming too nervous.",
        "Because of the poison, their hobbies couldn’t be intense activities like fighting, nor could they use their mental power. ",
        "Also, because the convalescent planet only had an internal network and couldn’t connect to the star network or even the military network, they couldn’t go online or play games.",
        "These lieutenant generals, admirals and marshals were all reclaiming land and farming!",
        "Lou Jingyue didn’t like farming. He thought that life in the sanatorium was too monotonous, with no star network access. He was also not allowed to do this or that. It was exactly like being in prison.",
        "No, prison might be more comfortable. ",
        "The imperial family had a imperial prison, which was used to detain imperial family members who had committed crimes and even some powerful and wealthy people. The prison was managed by the imperial family. For those living inside the prison, as long as they were willing to pay, they could live as comfortably as those outside.",
        "In the imperial prison, not only could one access the star network and handle work normally, they could even bring their family members in to live with them. This was outrageous.",
        "In addition, the food in the imperial prison was very good. As long as one was willing to pay, they could eat anything.",
        "But in the military sanatorium? The staff researched the most suitable food for poisoned people like them to eat, and then he had to eat some disgusting food every day. ",
        "Oou Aingyue’s mother was a member of the imperial family. Le had lived a very refined life since he was a child. Le was very picky about food and clothing. Le really couldn’t stand the living environment in the sanatorium.",
        "Dut he also knew that he could not go out, so even though his mother repeatedly suggested picking him up and taking him away, he never agreed.",
        "",
        "He knew that his parents wanted him to live on, and that many people were researching ways to eliminate the star worm poison in order to cure them… He had been trying hard to take care of himself and stay alive.",
        "But two days ago, he heard something. ",
        "A new patient ran away from their sanatorium!",
        "This opened the door to a new world for Lou Jingyue.",
        "Could he go play in the forest?",
        "He didn’t require going out every day. One or two days a week was enough. ",
        "When he was on the Capital Star, there were some people around him who liked to go hiking and mountain climbing on weekends.",
        "Now, he was also going to run into nature and start hiking!",
        "No, what he was going to do was much more advanced than hiking. He was going to survive in the wilderness.",
        "There were not many airships in the sanatorium. The airship that Lou Jingyue stole also belonged to Jiang Jin. ",
        "After all, Jiang Jin liked to collect limited edition airships.",
        "Thinking of this, Lou Jingyue admired the “senior” who ran out before him.",
        "This “senior” was the best! He actually stole Director Jiang’s favorite Starlight!",
        "That was the Starlight! He had always wanted one, but his family wouldn’t buy it for him! ",
        "After discovering that the director had such an airship, he wanted to admire it, but the director refused to let him.",
        "Lou Jingyue was afraid of being caught, so he tried to run further away. Because he was thinking about the Starlight, he also searched for signals of other airships in the process.",
        "After flying for a while, Lou Jingyue realized something big.",
        "He didn’t know how to cook. ",
        "When he came out, he brought some self-defense tools, but no food.",
        "They were not allowed to eat snacks in the sanatorium, and were only allowed to eat healthy meals and fruits.",
        "",
        "Therefore, even if he wanted to bring some food out, there was nothing to bring.",
        "At that time, he thought that there was no shortage of food in the forest, but now thinking back… there was no shortage of food in the forest, but he didn’t know what was edible and didn’t know how to cook. ",
        "So, what would he eat in the next little while?",
        "Did this mean that after he snuck out, he would have to starve for a day and then go back in shame?",
        "Just as Lou Jingyue was thinking this, his airship suddenly detected the signal of another airship.",
        "He found his senior who had snuck out! ",
        "At first, Lou Jingyue wanted to go directly there, but then he remembered that this senior had been kept in isolation since he came to the sanatorium, and he had never seen him before. He thought that there might be something wrong with his identity, so he did not directly go to find him, but planned to approach stealthily.",
        "He quietly stopped the airship two kilometers away from the Starlight, left the airship, and secretly walked in the direction of the Starlight.",
        "As soon as he approached, he smelled the aroma of roasted meat. Then, he heard a voice. “Ah Zheng, is the meat I roasted especially fragrant? I think my cooking skills are the best in the world!”",
        "“Ah Zheng, I will cook for you every day in the future!” ",
        "“Ah Zheng, quickly try this! This is the best roasted meat I have ever eaten!”",
        "…",
        "Lou Jingyue ran out in the morning and it was already dark now.",
        "He had been hungry all day and was starving. ",
        "The aroma of the roasted meat was already very tempting, and after hearing what the other party said… Lou Jingyue felt extremely greedy.",
        "He wanted to eat meat!",
        "Lou Jingyue approached slowly, and then he saw the Starlight he had coveted for a long time resting in the open space beside a stream.",
        "A canopy had been pulled out from the airship, and a fire had been lit underneath. Two people sat by the fire. ",
        "These two people were snuggling together and roasting meat together.",
        "One of them had red lips and white teeth. It was obvious at a glance that he had not been poisoned by star worm poison.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "As for the other one… that person’s entire face was blue and purple. It was obvious at a glance that he was severely poisoned.",
        "The senior who ran away must be the one who was severely poisoned. It turned out that he was so seriously poisoned. No wonder the people in the sanatorium kept him in isolation. Back then, he was curious and wanted to go and see, but they wouldn’t let him see. ",
        "Was it because they were afraid of scaring him?",
        "As for what was happening now… Lou Jingyue suspected that the “senior’s” lover secretly ran to this planet and snatched away the severely poisoned “senior”, wanting to spend his last moments together.",
        "His mother had always wanted to come and snatch him away.",
        "Seeing the person who was not poisoned take the “senior’s” hand and kiss it, and feed the “senior” roasted meat, Lou Jingyue became more and more certain of his guess. ",
        "The “senior” was poisoned so deeply that his mental power probably couldn’t be utilized at all. He definitely couldn’t escape from the sanatorium on his own. It was most likely that he had been snatched away.",
        "No wonder the sanatorium said they would look for him at first, but later stopped. They probably also knew the situation here.",
        "Lou Jingyue trusted the military very much. He felt that there was no danger on the convalescent planet, so he was not alert at all.",
        "But he felt that if he went out at this time, it would disturb other people’s two person world, which was not good. ",
        "But he was so hungry!",
        "If he just finished his meal and left, it shouldn’t be a problem, right?",
        "With this in mind, Lou Jingyue walked out and smiled at Qi Shiyan and Ming Zheng who were roasting meat. “Hello!”",
        "Qi Shiyan, who had already noticed him and had been waiting for him to come out, also smiled. “Hello.” ",
        "Another person had come! Another person!",
        "He could now raise one more person!",
        "Thinking of this, Qi Shiyan looked at Lou Jingyue with increasingly fiery eyes.",
        "This morning, after Qi Shiyan and Ming Zheng finished eating the wild chicken, they went out hunting. ",
        "He didn’t want to be separated from Ming Zheng, and kept holding Ming Zheng’s hand, so he could only use his mental power to hunt.",
        "Fortunately, his mental power was very strong. Qi Shiyan caught three rabbits one after another.",
        "Please visit chrysanthemumgarden (dot) com",
        "In addition to the three rabbits, he also collected some plants, including wild grasses and leaves.",
        "It was just… Ming Zheng said that he liked to eat meat and didn’t want to eat grass. ",
        "Not eating vegetables would lead to malnutrition! Qi Shiyan really wanted to educate Ming Zheng, but Ming Zheng was too cute, so he couldn’t bear to educate him.",
        "Ming Zheng liked to eat meat, so just let him eat meat. Once his cooking skills improved, he thought Ming Zheng should be willing to eat vegetables.",
        "After returning to the airship, Qi Shiyan stewed one of the rabbits.",
        "He wanted to stew them all together, but they wouldn’t all fit in the pot, so he only stewed one. ",
        "While stewing the rabbit, he studied the Starlight again.",
        "Starlight’s propulsion system was broken and its energy was running low, but it could store solar energy and repair itself.",
        "Starlight’s intelligent system said that Starlight’s signal system had been repaired and could release short-distance signals, so Qi Shiyan turned it on, hoping that the people from the sanatorium could find them quickly.",
        "The people from the sanatorium hadn’t found them yet, but his rabbit was done stewing. ",
        "Ming Zheng didn’t like rabbit boiled in plain water very much, but Qi Shiyan thought it was delicious and felt that his cooking skills were great!",
        "After eating the boiled rabbit, he used the rabbit broth to cook a pot of vegetables and ate it as well.",
        "Qi Shiyan was full for the time being, but Ming Zheng ate too little. He remembered that Ming Zheng liked to eat roasted meat before, so he planned to roast a rabbit for Ming Zheng to eat.",
        "This time, he was not roasting a bland rabbit. ",
        "He brushed the rabbit with oil and sprinkled it with salt.",
        "Qi Shiyan felt that the rabbit he roasted was so fragrant that he couldn’t help but praise his own cooking skills. As he was praising himself, he sensed someone approaching.",
        "He did not sense any ill will from the person, so he did not use his mental power to stop him, and allowed the other party to approach.",
        "Finally, the person came out. ",
        "It was a young man in casual clothes.",
        "In the interstellar era, life expectancy was very long and there were many ways to change one’s appearance, so a young appearance didn’t necessarily mean one was young.",
        "",
        "But when Qi Shiyan saw this person’s eyes, he felt that he should be very young.",
        "Half of this person’s face was blue and purple, just like Ah Zheng’s, so his original appearance could not be seen, but his expression was easy to understand. ",
        "Well, obviously he was hungry and greedy.",
        "Speaking of which, Ah Zheng was originally lured over because of the smell of his roasted rabbit. Now, another one had come.",
        "Today, the star network had been very lively.",
        "Qi Shiyan was whitewashed, the Qi family was arrested, and Ming Qingyu was blocked at the door and scolded… ",
        "Qi Shiyan’s live broadcast room was naturally also lively.",
        "But in the live broadcast room, all the abusive words had disappeared, and apologies emerged one after another. Some people were crying while watching the live broadcast. The live broadcast room recorded their crying and posted it in the barrage, causing a strange barrage of “Wuwu wawa” to appear.",
        "All this did not affect those who watched this live broadcast as a variety show.",
        "When Qi Shiyan ate the boiled rabbit, they were dumbfounded. “How can it be delicious when cooked like this?” ",
        "“It’s definitely not delicious. Xiao Guai is not very supportive.”",
        "“Qi Shiyan is hopeless. Not only did he eat the boiled rabbit with relish, but he also used the rabbit broth without skimming off the foam to boil a pot of messy wild grass and ate it all…”",
        "“I don’t have much to say. I just envy his stomach.”",
        "“Will he get sick from eating so much?” ",
        "“Responding to upstairs*, he won’t. I went to ask around, and I found out that using mental power consumes a lot of energy. People with high mental power levels will eat a lot if they use their mental power for a long time.”",
        "“So that’s how it is. So Qi Shiyan is so thin because he didn’t have enough to eat before? His mental power level has always been very high, and it consumes a lot of energy when he uses it. In order to hide his mental power level, he didn’t dare to eat too much… No wonder he wants to eat everything he sees. He must have starved before.”",
        "“Qi Shiyan is so pitiful.”",
        "“My heart hurts.” ",
        "…",
        "Then, Qi Shiyan started roasting a rabbit.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He had a very precise control of the heat and even brushed the rabbit with oil when roasting it. The roasted rabbit would definitely be tastier than the boiled rabbit.",
        "But he only added salt as seasoning, so it probably still wouldn’t taste very good. ",
        "People watching the live broadcast were helpless when they saw him constantly praising himself for how great his cooking skills were.",
        "“Is this what you call good cooking skills?”",
        "“Qi Shiyan is not only good at praising others, but also at praising himself!”",
        "“I’m laughing to death.” ",
        "“I suddenly feel that he is quite good this way. Living with him must be very happy.”",
        "“He is really gentle to Ah Zheng. I noticed that he fed Ah Zheng all the juicy and well-roasted meat.”",
        "…",
        "As everyone was talking, they noticed a new person had come into the live broadcast room. ",
        "There was actually a new person! So exciting!",
        "The audience watching the live broadcast looked at the newcomer curiously, wanting to know what they were doing there.",
        "Well, the newcomer’s eyes kept drifting toward the roasted rabbit. Had he been attracted by the roasted rabbit just like Ah Zheng?",
        "Were all the people on this planet short of food? ",
        "Capital Star, in front of Ming Qingyu’s house.",
        "Madam Ming had been here for most of the day and was a little tired.",
        "She planned to take people away, go back and rest a bit, then come back to curse again tomorrow.",
        "However, at this moment, she saw her son in Qi Shiyan’s live broadcast room. ",
        "No need to rest! Help her up. She could continue!",
        "She could even go up and curse people herself!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "***",
        "T/N: *Xiao (小), meaning small/little. Using xiao in front of someone’s name is an affectionate way to refer to them, usually used by elders for the younger generation. So Xiao Zhao (Little Zhao) refers to Deputy Director Zhao and Xiao Lou (Little Lou) to Young General Lou (Lou Jingyue). ",
        "*楼上 (lou shang) – upstairs. Posts in Chinese forums and other social media are referred to as floors. A post with several comments is referred to as a building. Upstairs refers to the previous poster."
    ],
    "previous": "Ch23 - Top-Notch Cooking Skills",
    "next": "Ch25 - Dog Food"
}