{
    "title": "Ch25 - Dog Food",
    "content": [
        "Lou Jingyue observed Qi Shiyan for a while. Seeing that Qi Shiyan was not angry that he had disturbed their two person world, he felt relieved and introduced himself. “My name is Lou Jingyue. What’s your name?”",
        "Qi Shiyan looked at Lou Jingyue intently, his expression a little excited. ",
        "This was the second person he met after living alone for a long time!",
        "If Ah Zheng hadn’t been there, he would have rushed over excitedly by now.\n",
        "",
        "Qi Shiyan said, “My name is Ah Yan. Are you from the sanatorium?”",
        "Lou Jingyue felt that Qi Shiyan’s eyes were a little strange. Wasn’t this person too enthusiastic toward him? ",
        "Could it be that this person recognized him and was his fan?\n\n",
        "Before he came to the convalescent planet, he liked to post about his daily life online, which was also a way to help promote the Third Legion. He really had a lot of fans at that time.",
        "When he was in the sanatorium, he watched the “Morning News” in the morning and the “Evening News” in the evening. All of this news was related to the military, so he knew all the high-ranking military officials very well.",
        "Lou Jingyue could be sure that there was no such person named “Ah Yan” among the high-ranking military officials, nor was there such a person among those in the empire who possessed S-level mental power.\n\n ",
        "In this case, it was normal that this person was his fan.",
        "Since he was his fan, it shouldn’t be a problem to give him some roasted rabbit, right?",
        "“Yes, I’m from the sanatorium.” Lou Jingyue said.\n\n",
        "Qi Shiyan asked, “Did you come to look for us?” ",
        "Lou Jingyue said, “No, I didn’t come to look for you. I escaped. Life in the sanatorium is simply not life fit for human beings, so I escaped.”",
        "Qi Shiyan, who had been looking at Lou Jingyue excitedly, was stunned.",
        "Madam Ming, who was about to roll up her sleeves and curse Ming Qingyu, was also stunned.",
        "The audience was also shocked. “Isn’t that a military sanatorium? They treat the patients there badly?” ",
        "“Lou Jingyue! My God, he is Lou Jingyue, my idol! How come he is disfigured? He also said he escaped. Was he actually being locked up?”",
        "“The blue and purple discoloration on Lou Jingyue’s face is the same as that on Ah Zheng’s face… Could the military be conducting some human experiments?”",
        "“Upstairs, you’re overthinking it. Lou Jingyue is the son of the marshal of the Third Legion. Even if the military is really conducting human experiments, they wouldn’t choose him.”",
        "“What on earth is going on?” ",
        "…",
        "Jiang Jin was speechless watching the live broadcast.",
        "",
        "The reputation of the sanatorium had been damaged!",
        "Jiang Jin already knew that Lou Jingyue had run away from the sanatorium. ",
        "He had some understanding of Lou Jingyue and knew that he just wanted to go out for some fresh air, so he appeased Deputy Director Zhao and told him to wait for Lou Jingyue to return to the sanatorium on his own.",
        "But he didn’t expect that Lou Jingyue to actually meet Qi Shiyan, appear in Qi Shiyan’s live broadcast room, and discredit the sanatorium in the live broadcast room.",
        "Jiang Jin snorted coldly and contacted Deputy Director Zhao. “Since Lou Jingyue doesn’t want to stay in the sanatorium, don’t let him come back. I’ll give you the remote access code to my airship, and you control my airship to return automatically. No, wait, it’s better not to return automatically. Just lock the airship so that it can’t fly.”",
        "If the airship returned automatically, Lou Jingyue would have no place to live. ",
        "So, just make sure his airship couldn’t fly.",
        "While the people watching the live broadcast had varying reactions, Qi Shiyan used his mental power to observe Lou Jingyue.",
        "Although Lou Jingyue complained about the sanatorium, his expression was relaxed when he complained. It didn’t seem like he had really been wronged in the sanatorium.",
        "He was in good spirits, chubby and healthy. Apart from being unable to use his mental power due to the poisoning, he had no other problems. ",
        "Qi Shiyan asked, “What’s wrong with the sanatorium?”",
        "Lou Jingyue said, “The sanatorium is not connected to the star network! Their food is terrible! I have to eat all kinds of tasteless food in the sanatorium every day. I feel like crying when I eat! Ah Yan, I haven’t eaten for a whole day. Can you give me some roasted rabbit?”",
        "Aust now, he heard this person say that the roasted meat he made was the most delicious roasted meat in the world.",
        "This person also said that his cooking skills were very good! ",
        "Although he couldn’t see what was special about the roasted rabbit, it should be delicious.",
        "Those great chefs had the ability to turn ordinary food into all kinds of delicacies.",
        "Lou Jingyue drooled at the sight of Qi Shiyan’s roasted rabbit.",
        "Those who were watching the live broadcast also realized at this time that the sanatorium should not have abused Lou Jingyue. ",
        "“Young General Lou used to like showing off his food on the star network. If there is nothing good to eat in the sanatorium, he would really find it hard to endure.”",
        "“The worst thing is not being connected to the star network! In any case, I can’t stand not being connected to the star network.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“It can be seen that the sanatorium is really not connected to the star network. Qi Shiyan’s live broadcast room is basically known to everyone who has access to the star network.”",
        "… ",
        "At the entrance of Ming Qingyu’s house, Madam Ming’s eyes were red. “My poor child, he is greedy for even a roasted rabbit. What did he eat before… He has lost weight…ahhh…”",
        "Madam Ming couldn’t continue speaking.",
        "She stared at her son in the live broadcast for a while, and suddenly realized that her son not only hadn’t lost weight, but had gained weight. She didn’t know if it was because of the angle, but she could even see a double chin.",
        "Lou Jingyue used to be very active. He was also keen on fighting, so he exercised a lot and ate a lot. ",
        "After being poisoned, his physical activity decreased drastically. If he wasn’t using his mental power to suppress the poison in his body every day, thus still consuming a lot of energy, he wouldn’t have only gained 20 catties, but might have become as fat as a ball.",
        "Lou Jingyue stared at the roasted rabbit in Qi Shiyan’s hands.",
        "Qi Shiyan couldn’t stand the look in his eyes and wanted to give him the roasted rabbit immediately.",
        "How could he bear to refuse someone who was talking to him and making a request of him? ",
        "But before Qi Shiyan could speak, Ming Zheng suddenly hugged Qi Shiyan and said, “It’s mine. Don’t give it to him!”",
        "After saying that, Ming Zheng grabbed the roasted rabbit and took a bite.",
        "Seeing this, Qi Shiyan didn’t care about Lou Jingyue anymore, and hurried to care about Ming Zheng. “Ah Zheng, why did you bite it directly? Is it hot? Did you burn your tongue?”",
        "He was very interested in the newcomer Lou Jingyue, but in his heart, Lou Jingyue could never compare to Ming Zheng. ",
        "Ming Zheng was his partner, and Lou Jingyue was just someone he wanted to raise!",
        "Speaking of which, the name Lou Jingyue sounded a little familiar.",
        "Qi Shiyan rummaged through the original owner’s memories and recalled Lou Jingyue’s background.",
        "Lou Jingyue – wasn’t this the genius son of Marshal Lou of the Third Legion, who had A-level mental power when he was young, and whose mental power naturally rose to S-level after he became an adult? And who was said to have at least S+ mental power in the future? ",
        "This person was four or five years older than the original owner. The original owner didn’t pay much attention to him, but Ming Qingyu was very jealous of him.",
        "Lou Jingyue was a young genius with an outstanding family background, but now Qi Shiyan only had Ming Zheng in his eyes.",
        "",
        "His Ah Zheng was the best!",
        "“I won’t give him any, not even a single bite. I’ll give it all to you. Be careful not to burn yourself.” Qi Shiyan coaxed Ming Zheng. ",
        "Ming Zheng looked at Lou Jingyue proudly.",
        "Lou Jingyue: “…” He shouldn’t have appeared here. He really did disturb his senior and his lover’s two person world.",
        "But this senior was really deeply poisoned and was now completely delirious…",
        "Qi Shiyan saw Ming Zheng’s proud look. ",
        "His heart melted from the cuteness. “Ah Zheng, you are so cute. How are you so cute? Ah Zheng, I really like you so much…”",
        "Was his Ah Zheng jealous just now?",
        "He even had a strong sense of possessiveness toward him!",
        "He really liked it so much! ",
        "“Ah Zheng, I love you the most. Don’t worry, the rabbits I roasted are all yours. I won’t give them to him.” Qi Shiyan said again.",
        "“En.” Ah Zheng was very happy.",
        "“Ah Zheng, open your mouth and let me see if you’ve been burned.”",
        "Ming Zheng opened his mouth. Qi Shiyan took a look and felt relieved. “Ah Zheng, you haven’t been burned. That’s great!” ",
        "After saying that, he grabbed Ming Zheng’s hand and kissed it.",
        "Lou Jingyue: Who was he? Where was he? What was he doing?",
        "The people watching the live broadcast were dying of laughter. “I suddenly feel sorry for Lou Jingyue.”",
        "“Single dogs are getting hit hard.” ",
        "“My family’s Jingyue just wanted to eat some meat. Why are you treating him like this?!”",
        "“I suddenly realized that Qi Shiyan really loves Ah Zheng. I thought he was sticking to Ah Zheng just because of his skin hunger syndrome. I thought that after Lou Jingyue came, he would do the same thing to Lou Jingyue…”",
        "Please visit chrysanthemumgarden (dot) com",
        "“His aesthetics are really not normal.”",
        "“But he has good character, unlike Ming Qingyu!” ",
        "…",
        "Qi Shiyan held Ming Zheng in his arms and used a knife to slice off meat from the roasted rabbit for Ming Zheng to eat. He then said to Lou Jingyue, “I can’t give you any roasted rabbit, but you can go hunting yourself and come back and roast the prey here, or you can go back to the sanatorium to eat.”",
        "“I’ll go hunting myself.” Lou Jingyue said.",
        "He had managed to sneak out with great difficulty and didn’t want to go back in disgrace so soon. ",
        "After hunting, he would ask Ah Yan, who was a good cook, to teach him how to roast the meat. The roasted meat should be delicious, right?",
        "His learning ability was still quite good!",
        "It was already dark, but Lou Jingyue was not afraid.",
        "In order to suppress the poison in his body, he couldn’t use all of his mental power. Right now, the amount of mental power he could exert was probably barely B-level. ",
        "But this was enough for him to avoid the unknown dangers in the forest.",
        "As for how to hunt… his mother had prepared a lot of self-defense items for him. With these things, he could completely walk around in the forest with ease.",
        "Lou Jingyue left, and Qi Shiyan and Ming Zheng continued to eat the roasted meat happily. They also roasted the remaining rabbits.",
        "Qi Shiyan’s supernatural powers had recovered a little. He thought about it and took advantage of Lou Jingyue’s absence to hug Ming Zheng and help Ming Zheng eliminate the poison. ",
        "When Ming Zheng became clear-headed again, he felt that something wasn’t right.",
        "Ah Yan’s mental power was very strong. It wasn’t surprising that he could help him suppress the poison, but it was still a bit abnormal that he could help him become clear-headed again and again.",
        "But this matter only briefly turned over in his mind, and then he thought of another matter.",
        "Lou Jingyue came, and he showed a very childish side of himself in front of Lou Jingyue. ",
        "Ming Zheng suddenly froze.",
        "Qi Shiyan greeted Ming Zheng happily. “Ah Zheng! You’re clear-headed again!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng hummed, and thinking that Lou Jingyue had seen everything, including Qi Shiyan coaxing him, his face unconsciously became blank.",
        "Fortunately, Lou Jingyue didn’t know his identity. ",
        "“Ah Zheng, can we trust that Lou Jingyue?” Qi Shiyan asked.",
        "Ming Zheng said, “Young General Lou can be trusted.”",
        "“That’s good.” Qi Shiyan was in a good mood. At the same time, he did not forget to confess again, “Ah Zheng, I like you. I like you the most!”",
        "When Ming Zheng heard Qi Shiyan’s words, he suddenly thought of something. ",
        "Qi Shiyan liked him the first time he saw him. It should be due to the fledgling complex. If after coming to this planet, Qi Shiyan met Lou Jingyue instead of him first, who would Qi Shiyan like?",
        "Qi Shiyan was very excited when he saw Lou Jingyue. Even though he himself hadn’t eaten his fill yet, he planned to give the roasted rabbit to Lou Jingyue…",
        "Ming Zheng wanted to ask clearly, but asking like this made it sound like he was jealous…so he didn’t say anything in the end.",
        "There were still many high-level star worms out there. He would have to go to the battlefield again sooner or later. Even if Qi Shiyan could help him suppress the poison, he would die sooner or later. ",
        "Qi Shiyan should like another person instead.",
        "Ming Zheng said, “We have only known each other for a few days, yet you’re saying this.”",
        "Qi Shiyan said, “Although we have only known each other for a few days, I really like you!”",
        "If the first person he met after arriving on this planet was Lou Jingyue, although he would also be excited, he would definitely not have the same liking for him as he did toward Ming Zheng right now. ",
        "If he stuck to Lou Jingyue right from the start, Lou Jingyue would definitely be unhappy about it.",
        "Lou Jingyue would not tolerate his bad habits like Ah Zheng did.",
        "Qi Shiyan’s eyes were so sincere that Ming Zheng felt like he was going to be addicted to them and unable to extricate himself.",
        "“Ah Zheng, when will you become my partner?” ",
        "Ming Zheng said again, “Wait until I get better.”",
        "“Okay,” Qi Shiyan agreed happily, “Ah Zheng, can we follow Lou Jingyue to the sanatorium? Are there a lot of people in the sanatorium?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Realizing that there should be a lot of people in the sanatorium, Qi Shiyan became excited again.",
        "Ming Zheng suddenly didn’t want to go to the sanatorium. ",
        "But he still said, “Yes, there are many people in the sanatorium. They all used to be high-ranking military officials. When the time comes, you should get along well with them.”",
        "“I will,” Qi Shiyan asked Ming Zheng, “Ah Zheng, are you also a high-ranking military official?”",
        "Ming Zheng said, “I can’t be considered one.”",
        "He was the emperor and not considered a high-ranking military official. ",
        "Qi Shiyan felt that Ming Zheng looked like a military man, but if Ming Zheng said he was not, then so be it. He didn’t care.",
        "He actually wanted Ming Zheng to not be a high-ranking military official. It would be best if Ming Zheng could belong to him alone.",
        "“No matter what, Ah Zheng, you are the best in my heart!” Qi Shiyan continued while kissing his hand.",
        "Ming Zheng smiled, then became dazed again. He grabbed Qi Shiyan’s hand and kissed it with a smile. ",
        "Qi Shiyan felt a little regretful and a little happy, but Jiang Jin, who had been timing with a stopwatch, was very excited.",
        "Each time His Majesty became clear-headed again, the amount of time he remained clear-headed was longer than the previous time!",
        "The poison in His Majesty’s body should be becoming less and less!",
        "At this time, Lou Jingyue hunted a wild boar. ",
        "The wild boar was a bit big, but fortunately his physical strength had not deteriorated.",
        "He carried the wild boar on his back and walked toward the direction where the Starlight was parked, panting.",
        "Roasted wild boar should taste better than roasted rabbit, right? He was really very hungry now and wanted to eat very, very much!",
        "*** ",
        "T/N: I feel like everyone already knows this, but just in case, dog food is Chinese slang for the PDA of couples.",
        "Read more BL at chrysanthemumgarden (dot) com"
    ],
    "previous": "Ch24 - Lou Jingyue",
    "next": "Ch26 - Accepting A Younger Brother"
}