{
    "title": "Ch26 - Accepting A Younger Brother",
    "content": [
        "After Qi Shiyan had been intimate with Ming Zheng for a while, he found a pair of small scissors from the airship and cut Ming Zheng’s nails.",
        "Ming Zheng’s nails were a little long, probably because they hadn’t been trimmed for a long time. ",
        "Qi Shiyan didn’t have much free time before, but now that he had time, he helped Ming Zheng cut his nails with great interest.",
        "“Ah Zheng, your nails look so good and your fingers are also beautiful.” After cutting a nail, Qi Shiyan kissed Ming Zheng’s finger.\n",
        "",
        "Ming Zheng was particularly happy and looked at Qi Shiyan with satisfaction.",
        "Qi Shiyan said, “After I finish cutting your nails, I’ll clean your ears. Just now, on the airship, I saw an ear pick with a light in the tool kit.” ",
        "Having Ming Zheng lean on his legs, and then helping Ming Zheng clean his ears…it was a wonderful thought.\n\n",
        "He liked this kind of interaction!",
        "After helping Ming Zheng cut his fingernails and kissing each of his fingers, Qi Shiyan pulled him to boil a pot of water and then soaked his feet with him.",
        "The basin used for foot soaking was a folding basin found on the airship. When folded, it was only the size of a ping-pong ball. When unfolded, it was a very large basin, which was big enough for two people to soak their feet together.\n\n ",
        "After soaking their feet, he could also help Ming Zheng trim his toenails.",
        "Qi Shiyan stepped on Ming Zheng’s feet, held Ming Zheng’s hand, and then used his mental power to wrap Ming Zheng up, feeling Ming Zheng’s breathing and heartbeat…",
        "This was the wonderful life he had always dreamed of.\n\n",
        "When Lou Jingyue came back carrying the wild boar with great effort, he saw the young couple soaking their feet together affectionately next to the Starlight. ",
        "He was too embarrassed to disturb them.",
        "However, after rubbing his belly, Lou Jingyue still stepped forward shamelessly. “Ah Yan, I’m back from hunting!”",
        "Qi Shiyan saw the wild boar that Lou Jingyue brought back and was a little envious. “You are really amazing. You caught such a big wild boar.”",
        "This wild boar was estimated to weigh more than 200 catties, much larger than the sika deer he had caught before! ",
        "There was so much meat! He wanted to eat it!",
        "Lou Jingyue was full of energy and was very pleasing to look at.",
        "However, at this moment, Ming Zheng lifted his feet out of the water and stepped down hard again.",
        "Water splashed everywhere, and Qi Shiyan’s foot was also stepped on “ruthlessly”. ",
        "Qi Shiyan immediately hugged Ming Zheng to comfort him, and then looked at Lou Jingyue with a cold face. “Since you have caught the prey, go deal with it.”",
        "“Deal with it? How to deal with it?” Young Master Lou, who had never cooked before, looked confused.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan used his mental power to observe the wild boar. “This wild boar has very thick skin. Just skin it and remove the internal organs. You go to the waterside to deal with it.”",
        "Although Young Master Lou had no experience, he was not stupid. After thinking it over for a while, he started to take action. ",
        "Qi Shiyan couldn’t bear to watch the way he handled the wild boar. “Lou Jingyue, when you handle the wild boar, you can use your mental power to observe the wild boar first and judge the most appropriate place to cut.”",
        "When Lou Jingyue was peeling the wild boar skin, he actually took a knife and cut off palm-sized pieces of wild boar skin one by one.",
        "This young master really didn’t know how to work!",
        "“If you hadn’t said it, I wouldn’t have thought that I could use mental power to deal with prey!” Lou Jingyue said. He had been learning how to use mental power to kill star worms since he was a child, and had never thought that he could also use mental power to deal with prey. ",
        "While Lou Jingyue continued to be busy, Ming Zheng stepped on Qi Shiyan again.",
        "“Ah Zheng, I just wanted to teach him how to deal with prey. Don’t be angry.” Qi Shiyan grabbed Ming Zheng’s hand and kissed it, then grabbed Ming Zheng’s feet and helped him cut his toenails.",
        "Ming Zheng didn’t like Lou Jingyue, but when he saw that Qi Shiyan’s attention was all on him, he instantly became happy and watched Qi Shiyan cut his nails.",
        "Lou Jingyue stood by the stream, watching the young couple flirting, and suddenly felt a little sorry for himself. ",
        "People watching the live broadcast also felt sorry for him. “Young General Lou has been stunned silly.”",
        "“He’s grunting and groaning as he processes the prey, while others are having a sweet time. It makes me sad just thinking about it.”",
        "“He needs to learn how to ship CPs as soon as possible, then he’ll find it sweet!”",
        "“Aaaaah! So sweet! When Qi Shiyan pays more attention to Xiao Lou, Ah Zheng gets jealous and steps on Qi Shiyan’s feet. So cute!” ",
        "“Did you notice Qi Shiyan’s expression after he was stepped on? He looked quite perverted, as if he wanted Ah Zheng to step on him a few more times.”",
        "“Qi Shiyan’s behavior is that of a pervert and a little bit abnormal, but he is handsome and has clear eyes, which makes it hard for people to hate him.”",
        "“Isn’t Qi Shiyan just a little clingy? I can accept it!”",
        "… ",
        "Madam Ming waited for a long time before she saw her son come back, and then she fell silent.",
        "Zadam Zing’s hobby was cooking, and she occasionally read some articles on delicious food. She thought that the wild boar caught by her son would not be delicious.",
        "Please visit chrysanthemumgarden (dot) com",
        "Why would her son catch such a thing?!",
        "Dut her son was a little fat, so it was fine if he skipped a couple of meals. ",
        "Madam Ming had a wide circle of friends. After she came to Ming Qingyu’s door to block people, people kept sending her some of Ming Qingyu’s black materials.",
        "Without hesitation, she began to expose the truth.",
        "“Ming Qingyu, how could I have a junior like you? You’ve really brought shame to our Ming family! I didn’t expect that Qi Shiyan’s bullying of classmates was actually fabricated by you. Not only did you give those people a lot of money, you also used Qi Yuncheng’s name to arrange them into the army… Your behavior is too disgusting! It’s clearly destroying the bridge after crossing the river*! Those who support Ming Qingyu, you all should be careful. Ming Qingyu can kick Qi Shiyan away after using him, and he can also kick you away after using you!”",
        "“Qi Shiyan was sick, but you still let him attend that event and then let the media deliberately take negative photos of him. Ming Qingyu, you really have insidious means!” ",
        "“Ming Qingyu, you are so shameless. Of your military achievements, less than one tenth were earned by yourself. The rest are from your guards. And you actually still dare to brag, saying that you are better than my son. When my son was still in school, he went to the battlefield during the holidays and killed more star worms than you have killed in your entire life!”",
        "Madam Ming went all out and found various videos as evidence, causing Ming Qingyu to die again and again.",
        "Ming Qingyu hid in his house, feeling numb all over.",
        "But faced with this situation, he was helpless and could only lash out at his subordinates. “Who on earth installed surveillance cameras in my house?! Why are there surveillance cameras in my house?!” ",
        "He and Qi Jianuo were very careful. They wouldn’t have any intimate contact when they were outside, or even at the Qi family. They would only be affectionate when they were at his house.",
        "He firmly believed that his house was safe.",
        "But it turned out that his house was monitored by someone with surveillance cameras and he knew nothing about it!",
        "Ming Qingyu always thought that he was very capable and a child of destiny, but at this moment, his confidence was completely shattered. ",
        "Seeing how angry Ming Qingyu was, Ming Qingyu’s subordinate said, “Your Highness, we checked carefully and found more than ten cameras in the gifts Qi Shiyan gave you.”",
        "Ming Qingyu’s expression froze.",
        "That person continued, “Your Highness, Qi Shiyan’s mental power is very strong, stronger than yours. He must have discovered that you and Qi Jianuo were together a long time ago…”",
        "Ordinary people couldn’t enter Ming Qingyu’s house, but Qi Shiyan was Ming Qingyu’s fiancé. No one would stop him from going in and out. ",
        "Qi Shiyan was also keen on giving gifts to Ming Qingyu. Ming Qingyu didn’t take those things seriously, but he wouldn’t throw them away on purpose.",
        "Who would have thought that these things were actually equipped with hidden high-tech cameras?",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Qingyu almost vomited blood when he saw Qi Shiyan cutting Ah Zheng’s toenails in the live broadcast.",
        "Qi Shiyan didn’t know that there were actually hidden cameras installed in the gifts that the original owner gave to Ming Qingyu. ",
        "Even the original owner himself didn’t know.",
        "He didn’t have much money, but still wanted to give Ming Qingyu gifts, so he would consult the people around him. Some of the gifts were found for him by people around him. After he got them, he would immediately give them to Ming Qingyu.",
        "From the beginning to the end, he had no idea that Ming Jin had tampered with those gifts.",
        "In fact, several of the surveillance cameras were prepared by Ming Jin for Qi Shiyan. Unexpectedly, Qi Shiyan gave all those good things to Ming Qingyu and did not keep any for himself. ",
        "So Ming Qingyu found more than ten cameras in his house.",
        "At this moment, Ming Qingyu felt that Qi Shiyan was scheming and shrewd. Ming Jin thought the same.",
        "They all thought that they had fooled Qi Shiyan, but what happened? They were deceived by Qi Shiyan!",
        "In the live broadcast, after struggling for a while, Lou Jingyue suddenly realized that he could not eat a whole wild boar. ",
        "So he didn’t have to process and clean the whole wild boar.",
        "Realizing this, Lou Jingyue cut off one of the wild boar’s hind legs and came to the fireside.",
        "Qi Shiyan concentrated on giving Ming Zheng a pedicure without even looking up. “The seasoning is on the side. Roast it yourself and eat it. I promised Ah Zheng that I wouldn’t help you roast the meat.”",
        "Lou Jingyue really wanted to try Qi Shiyan’s cooking skills, but Qi Shiyan was helping someone cut their toenails! ",
        "Even if Qi Shiyan wanted to help him roast meat now, he wouldn’t be willing.",
        "“I’ll roast it myself! How do you roast meat?” Lou Jingyue asked.",
        "Qi Shiyan said, “Put it directly on the fire. Remember to use your mental power to pay attention to the heat to avoid burning it.”",
        "“Can you use mental power to control the heat?” Lou Jingyue was very surprised. ",
        "However, he now understood why Qi Shiyan’s cooking skills were so good.",
        "Qi Shiyan used his mental power to assist in cooking, so how could the food he made not be delicious?",
        "",
        "After learning the secret of roasted meat, Lou Jingyue flipped through the seasonings that Qi Shiyan had placed on the side, and then discovered that there were very few seasonings.",
        "There was only a bottle of oil, a bottle of salt, a bottle of MSG and a bottle of soy sauce. ",
        "When the airship left the factory, the seasonings prepared by the manufacturer wouldn’t be very abundant.",
        "With so few things, how could the roasted meat taste good?",
        "Lou Jingyue remembered that the roasted meat he used to eat was sprinkled with a lot of seasonings.",
        "But he didn’t know what those seasonings were, and he didn’t have any right now… He followed Qi Shiyan’s instructions, rubbed some oil on the boar leg, sprinkled some salt, and started roasting. ",
        "The smell of roasted boar didn’t smell very good to him. It had a strong gamey smell.",
        "But some meat just didn’t smell good, but still tasted good.",
        "Lou Jingyue was very hungry. When he saw that the outer layer of the boar leg was cooked, he took it off the fire, cut off a piece with a knife and stuffed it into his mouth.",
        "The meat he roasted himself must be delicious! ",
        "So what if those people in the sanatorium didn’t give him roasted meat? He roasted it himself!",
        "Lou Jingyue thought a lot, but the next second, his expression froze.",
        "He had never eaten such disgusting meat in his life!",
        "The taste of this meat was disgusting and the texture was terrible! ",
        "Lou Jingyue opened his mouth and spat out the piece of meat in his mouth. “This meat is so disgusting!”",
        "His face was distorted and he looked like he was doubting life, which made everyone who was watching the live broadcast laugh.",
        "“Hahahaha, I’m laughing to death!”",
        "“I’ve wanted to say this for a long time. Wild boars don’t taste good!” ",
        "“Forget wild boars not being tasty. Even domestic pigs taste bad if they are not castrated.”",
        "“This kind of large wild animal must have very thick muscle fibers. Not only is it unpalatable, but the texture should also be terrible.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "Qi Shiyan looked at Lou Jingyue with dissatisfaction. ",
        "He didn’t like people who wasted food.",
        "When he cooked the boiled rabbit earlier today, he even cooked the rabbit’s internal organs, so nothing was wasted!",
        "Maybe that was why Ming Zheng didn’t want to eat the boiled rabbit.",
        "“Ah Yan, this wild boar has a gamey flavor. Do you know how to get rid of it?” ",
        "Qi Shiyan said, “I don’t know.”",
        "Lou Jingyue said, “I can’t eat this meat. I’ll go catch something else to eat. How do I catch a rabbit?”",
        "Qi Shiyan said, “You can use your mental power to find the rabbit’s tracks.”",
        "“Understood. I’m going to catch a rabbit.” Lou Jingyue said. ",
        "Qi Shiyan asked him, “You don’t want your wild boar anymore?”",
        "Lou Jingyue nodded affirmatively. “I don’t want it. This wild boar is even more unpalatable than the pig food in the sanatorium!”",
        "Qi Shiyan suddenly really wanted to try the food in the sanatorium.",
        "But he couldn’t try it at the moment…Qi Shiyan planned to take some wild boar meat to eat. ",
        "Lou Jingyue was too picky. This wild boar leg smelled so fragrant!",
        "Lou Jingyue only cut off a piece of meat from the wild boar leg to eat. He didn’t bite the wild boar leg directly, so it was very clean.",
        "Qi Shiyan washed his hands, picked up the wild boar leg and continued to roast it. When it was cooked, he used a knife to cut a piece of meat and eat it.",
        "This wild boar meat was clearly very delicious! ",
        "It was also chewy and worked the facial muscles.",
        "Lou Jingyue wandered around outside in the dark for a long time and finally caught a rabbit and brought it back, where he saw Qi Shiyan eating the roasted boar leg.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He ate with gusto. “Ah Zheng, the boar meat is so delicious!”",
        "“I was originally full, but now I can eat another leg!” ",
        "“My cooking skills are truly the best in the world!”",
        "…",
        "Lou Jingyue was shocked. He looked at Qi Shiyan blankly, wondering whether what Qi Shiyan said was true or false.",
        "It was already dark, but there were lights on inside the Starlight and a fire outside, so he could clearly see Qi Shiyan’s expression. ",
        "Qi Shiyan’s expression was sincere when he spoke.",
        "The way he ate the wild boar meat was as if he was eating some delicacy.",
        "This person’s cooking skills were so good that he could magically transform unpalatable boar meat into something extremely delicious?",
        "Seeing Qi Shiyan eating so happily, Lou Jingyue was particularly greedy. “Ah Yan, can you give me some of this roasted boar leg?” ",
        "Qi Shiyan said, “No, Ah Zheng won’t let me roast meat for you.”",
        "Lou Jingyue asked, “Then how do you roast meat?”",
        "“Just like I told you before. Use your mental power to control the heat.” Qi Shiyan said with a smile.",
        "He knew that the taste of the wild boar meat he roasted should be no different from that roasted by Lou Jingyue. ",
        "But he didn’t want to explain. Young General Lou’s envious look was quite interesting.",
        "“Using mental power to control the heat won’t make the meat taste better, right?” Lou Jingyue wondered. He did the same thing, but the wild boar meat still tasted terrible.",
        "Qi Shiyan said, “That’s because your mental power is too weak, and you are not proficient in using it.”",
        "Hearing Qi Shiyan say this, Lou Jingyue was unhappy. “Although I can’t use all my mental power now, my mental power is not weak. I can also use my mental power to perform various delicate operations!” ",
        "In terms of mental power, he believed that no one in the younger generation could compare to him.",
        "Well, his sister was stronger than him, but his sister was older than him and couldn’t be considered the younger generation!",
        "",
        "Qi Shiyan said, “Your mental power is obviously very weak.”",
        "“Before I was poisoned, my mental power was S-level. It was S-level, not S-. I was still very young at that time. If I hadn’t been poisoned, I would have reached S+ mental power sooner or later in my life. Maybe I could even break through to SS-level!” Lou Jingyue said loudly. ",
        "He was very confident in his mental power!",
        "He was just unlucky and was poisoned by the star worm poison… Thinking of his current situation, Lou Jingyue felt depressed.",
        "Wait, wait!",
        "Lou Jingyue suddenly thought of something. When Ah Yan first saw him, he was very excited and enthusiastic toward him. Why would he belittle him now? ",
        "Was it to get his attention?",
        "As soon as Lou Jingyue thought of this, he was suppressed by Qi Shiyan’s mental power and fell to the ground.",
        "Lou Jingyue: “!!!”",
        "Qi Shiyan used his mental power to help Lou Jingyue seal the poison in his body. ",
        "He squeezed together the little bit of poison in Lou Jingyue’s body, which was at most one twentieth of the poison in Ah Zheng’s body, and sealed it with his mental power, allowing Lou Jingyue to release all his mental power.",
        "Although his seal would at most last for one day, it could allow Lou Jingyue to sleep well for a night.",
        "Unfortunately, his family’s Ah Zheng was too deeply poisoned and he could not help him the same way.",
        "Lou Jingyue lay on the ground, dumbfounded. ",
        "God, this was the first time in his life that he had come into contact with such strong mental power!",
        "He was poisoned, but at this moment, the poison could no longer affect him!",
        "Ah Yan was too awesome! No, why should he call the other party Ah Yan? He wasn’t worthy!",
        "At this time, Qi Shiyan asked, “Isn’t your mental power weak?” ",
        "Lou Jingyue climbed up and immediately said, “Weak! I’m too weak! Brother Yan, you are the strongest!”",
        "Brother Yan’s mental power was so strong that it was only natural that the roasted meat made by the other party using their mental power tasted better than his!",
        "",
        "“En. Then help me clean the rest of the wild boar, put the meat into my airship, then go pick up some firewood and come back.” Qi Shiyan said.",
        "He didn’t originally plan to do this, but now that the situation had come to this, he decided to subdue Lou Jingyue and have Lou Jingyue help him with some work. ",
        "***",
        "T/N: Bonus chapter for Hammy. Thanks for the ko-fi!",
        "The chapter title uses 小弟 (xiao di). 弟弟 (didi) or just 弟 (di) on its own means younger brother. 小 (xiao) means small or little, so a direct translation is something like ”little younger brother”, which sounds awkward, so I just kept it as younger brother. In this context, 小弟 (xiao di, younger brother) means lackey/follower. It’s often used in the context of gangs in China where the boss and other high ranking mafia members call those under them younger brothers. It can also be used in the context of business for the boss to address those “younger brothers” that follow him to make a living.",
        "*过河拆桥 (guo he chai qiao) – destroying the bridge after crossing the river. An idiom that means to abandon one’s benefactor after achieving one’s goal. "
    ],
    "previous": "Ch25 - Dog Food",
    "next": "Ch27 - Doubt"
}