{
    "title": "Ch27 - Doubt",
    "content": [
        "Qi Shiyan really enjoyed working. He especially liked to process prey.",
        "This was all meat! Non-toxic meat! ",
        "He loved these delicious foods!",
        "But he loved his family’s Ah Zheng more.\n",
        "",
        "He wanted to stick to his family’s Ah Zheng all the time.",
        "But if this happened, it would be inconvenient to do the work… He could only reluctantly give such an interesting job as processing prey to Lou Jingyue. ",
        "“Brother Yan, don’t worry. I will definitely help you get things done well!” Lou Jingyue promised, patting his chest.\n\n",
        "Qi Shiyan hummed, then thinking that Lou Jingyue hadn’t eaten yet, he said, “Roast your rabbit first.”",
        "He had a good impression of Lou Jingyue and couldn’t bear to see him go hungry.",
        "This guy was chubby, with all that flesh on his body. So likable!\n\n ",
        "In his previous life, he was so hungry that he was skin and bones, so he liked chubby people very much.",
        "Lou Jingyue was very moved when he heard Qi Shiyan say this.",
        "The boss was such a good person. He even remembered that he hadn’t eaten yet.\n\n",
        "The boss also had a good temper. At the beginning, he called the boss “Ah Yan” all the time, but the boss actually didn’t get angry at all. ",
        "The boss was very kind to him! He even helped him suppress the poison in his body.",
        "He had never felt so relaxed since being poisoned.",
        "Lou Jingyue went to the stream to deal with the rabbit. While doing so, he took out his communication terminal, adjusted it to selfie mode, and looked at his face.",
        "After the poison was suppressed, the discoloration on his face disappeared without a trace. ",
        "Lou Jingyue stared at his own appearance using the selfie mode for a long time and couldn’t help but say, “I’m so handsome!”",
        "He was so handsome, so handsome!",
        "Lou Jingyue was a little excited as he hadn’t seen his true appearance for a long time.",
        "People watching the live broadcast: “I didn’t expect Lou Jingyue to be such a person in private…” ",
        "“The way he calls ‘Brother Yan’ is so servile*!”",
        "“The filter is broken. Xiao Lou, I have changed your classification from male god to sand sculpture*.”",
        "",
        "“Did you guys notice? Young General Lou’s selfie mode has a face-slimming function…”",
        "“Young Master Lou, wake up, you are not handsome now! You are a little fat!” ",
        "…",
        "A lot of Ming Qingyu’s black materials had been exposed. Madam Ming, who was sitting in her airship drinking water and resting, looked at her son in the live broadcast and felt a little conflicted.",
        "Before, half of her son’s face was blue and purple and swollen, so the round face could be explained as swelling.",
        "But now her son’s face was no longer blue and purple or swollen, and looked white and tender. ",
        "The whiteness gave the appearance of fat. Ler son was really fat.",
        "Thus it was duite good to eat some unpalatable roasted rabbit.",
        "In the Third Oegion, Zarshal Oou had pust finished a battle when he learned about his son‘s situation from his subordinates.",
        "Le was in a good mood. “As ezpected of my son. Le is so good at running. Le actually ran straight to Hi Shiyan!” ",
        "After saying this, Marshal Lou sighed again. “If I knew earlier that Qi Shiyan was so powerful, I would have had Jingyue get engaged to him. If Jingyue had a fiancé like Qi Shiyan, he wouldn’t have had to suffer in the sanatorium for two years.”",
        "Marshal Lou’s subordinates: “…” The Marshal, looking at his son’s chubby face, how could he say the word “suffer” so naturally?",
        "Speaking of which, in their legion, many people who used to regard Lou Jingyue as their idol had had their filters broken.",
        "Who would have thought that Young General Lou, who always behaved maturely and steadily, would act so incomprehensibly in private? ",
        "Young General Lou’s muscles were also gone…",
        "However, Qi Shiyan was really powerful. Just now, he used his mental power to help Young General Lou suppress the poison in his body, right?",
        "The military was very concerned about the sudden disappearance of the discoloration on Lou Jingyue’s face.",
        "And through the reactions of Qi Shiyan and Lou Jingyue, they deduced that Qi Shiyan had used his mental power to help Lou Jingyue suppress the poison in his body. ",
        "Just as Qi Shiyan said, his mental power was much stronger than Ming Qingyu’s and should have reached SS-level.",
        "The military knew what was going on, but ordinary audience members didn’t.",
        "Please visit chrysanthemumgarden (dot) com",
        "They were very curious. “Why did Lou Jingyue’s attitude toward Qi Shiyan suddenly change?”",
        "“Why is the discoloration on Lou Jingyue’s face gone?” ",
        "“There has been no news about Lou Jingyue in the past two years. What happened to him? And what’s going on with the military sanatorium?”",
        "“The more I watch this live broadcast, the more confused I become.”",
        "…",
        "The military had not made the matter of the star worm poison public before, fearing that it would cause panic among the people and that they would guess the situation of His Majesty. ",
        "In the past, people were puzzled as to why His Majesty always wore a mask. After knowing the existence of star worm poison, they would definitely think that His Majesty had been poisoned.",
        "There was no cure for star worm poison, and His Majesty probably wouldn’t live long. If this news spread, the people of the empire would probably be in turmoil.",
        "But the military also knew that this matter would be made public sooner or later.",
        "Making it public now was quite appropriate. ",
        "The military media released all the information related to star worm poison that had been compiled long ago.",
        "The people of the empire finally understood what the military sanatorium was for.",
        "“Ah Zheng told Qi Shiyan that there are many former high-ranking military officials in the military sanatorium…are they all poisoned with star worm poison?”",
        "“I noticed a long time ago that many S-level warriors disappear with no news after a battle, but they aren’t on the list of casualties. It turns out they were poisoned.” ",
        "“It’s not easy for them.”",
        "“I haven’t paid attention to the news from the front lines for a long time. I should go and take a look.”",
        "“Wuwuwu, my heart hurts for Ah Zheng. Judging from his appearance, he must be seriously poisoned and in great pain.”",
        "“This also proves that Ah Zheng is a hero! He must have gone through a terrible battle.” ",
        "“So who exactly is Ah Zheng?”",
        "…",
        "Read more BL at chrysanthemumgarden (dot) com",
        "People sent messages to the military media and some high-ranking military officials who had Xingbo accounts, asking about Ah Zheng’s identity.",
        "But these people didn’t know Ah Zheng’s identity, so they couldn’t answer. ",
        "Most of the military personnel who were watching the live broadcast thought, as Ming Qingyu did, that Ah Zheng must be an A-level soldier who had just joined the army not long ago and had the bad luck to run into a high-level star worm, causing him to be severely poisoned.",
        "But some high-ranking military officials also came up with a terrible guess.",
        "At first, they also thought that “Ah Zheng” was an A-level soldier that they didn’t know.",
        "A-level mental power was not low, but it was difficult to use it to resist the star worm poison. ",
        "If Lou Jingyue’s mental power level was A, then after being poisoned, his appearance would be like Ah Zheng’s.",
        "However, Qi Shiyan helped Lou Jingyue suppress the poison.",
        "Qi Shiyan’s mental power was very high and could completely suppress the poison in Lou Jingyue’s body. If Ah Zheng was an A-level soldier, then Qi Shiyan should also be able to completely suppress the poison in Ah Zheng’s body.",
        "But even though he liked Ah Zheng very much, he didn’t do this. ",
        "Was this because there was too much poison in Ah Zheng’s body and he couldn’t suppress it?",
        "Lou Jingyue’s poisoning was not serious. There were many people on the convalescent planet who were more seriously poisoned than him.",
        "But to render Qi Shiyan unable to completely suppress the poison, there was probably only that person…",
        "Ah Zheng, Ming Zheng… ",
        "This shouldn’t be possible, right?",
        "His Majesty was not such a person!",
        "Those who had doubts in their hearts stared at the live broadcast room, and then they saw “Ah Zheng” in the live broadcast pull Qi Shiyan’s head toward him with an angry look because Qi Shiyan said a few more words to Lou Jingyue.",
        "This was definitely not His Majesty. ",
        "His Majesty had always been cold and aloof. He would never act like this!",
        "In the live broadcast, Qi Shiyan spoke to Lou Jingyue because Lou Jingyue wanted to throw away the rabbit’s internal organs.",
        "",
        "Qi Shiyan thought this was being too wasteful. “Xiao Lou, don’t throw away the internal organs. They are also food! Let’s do this – you throw away the intestines, and I will cook the rest tomorrow.”",
        "Lou Jingyue picked up the discarded internal organs and asked again. “Brother Yan, how do you cook using your mental power? Can you tell me in detail?” ",
        "“You won’t be able to learn even if I tell you in detail.” Qi Shiyan joked.",
        "He actually didn’t have any cooking secrets at all. The reason why he enjoyed eating the wild boar leg so much was that the food he had eaten before was a thousand times more disgusting than the wild boar leg.",
        "Lou Jingyue looked regretful. “Brother Yan, I really want to try your cooking.”",
        "“Don’t think about it. I only cook for Ah Zheng.” Qi Shiyan had just finished speaking when Ah Zheng turned his head toward him. ",
        "When he saw Ah Zheng, he forgot about Lou Jingyue and spoke to Ah Zheng affectionately, coaxing him and asking him not to be angry.",
        "Lou Jingyue: “…”",
        "Lou Jingyue roasted his rabbit with scant seasoning.",
        "Rabbit meat didn’t have the gamey taste of wild boar meat, but it was very dry and not tasty at all. ",
        "The more Lou Jingyue ate, the more it tasted like wax. He suddenly missed the food in the sanatorium.",
        "Although the food the sanatorium gave him was too healthy, it tasted much better than the roasted rabbit he made himself…",
        "“Brother Yan, do you plan to keep living in the wilderness?” Lou Jingyue asked.",
        "“No, we were planning to go to the sanatorium,” Qi Shiyan said. “But Ah Zheng’s airship is broken, so we can’t go back.” ",
        "Lou Jingyue: “…” This airship didn’t belong to Ah Zheng, it obviously belonged to Director Jiang!",
        "Qi Shiyan asked, “Xiao Lou, how did you get here?”",
        "“I came here by airship. My airship is fine and doesn’t have any problems. Brother Yan, you guys can go back with me!” Lou Jingyue suggested.",
        "Qi Shiyan agreed. “Okay, but let’s leave tomorrow. I need to rest.” His mental power was exhausted. He was very tired and needed a good night’s rest. ",
        "Lou Jingyue also thought it was a good idea to leave tomorrow.",
        "It wasn’t easy for him to escape. He had to at least spend the night outside.",
        "",
        "After eating the roasted rabbit, Lou Jingyue first helped Qi Shiyan process the rest of the wild boar, and then helped Qi Shiyan pack up other things. After he was done, he returned to his airship to sleep.",
        "This time he snuck out, met a big boss, and made roasted meat by himself, which was quite interesting, but Lou Jingyue missed the sanatorium a little. ",
        "Fortunately, he could go back tomorrow.",
        "The next time he came out, he would definitely go to the kitchen of the sanatorium and steal some ingredients and seasonings to bring out.",
        "He didn’t have the cooking skills of the big boss, but maybe he could make do with some seasoning?",
        "For example, some hot pot soup bases could make all the food cooked in them taste good. ",
        "Climbing into the airship he had stolen, Lou Jingyue sat in the driver’s seat, intending to drive the airship to the Starlight’s side.",
        "Tonight, he was going to sleep next to Brother Yan!",
        "But he couldn’t start the airship.",
        "What was going on? Was the airship broken? ",
        "If the airship was broken, then how would he get back?",
        "Lou Jingyue was extremely anxious. Everything was fine when he came here, so why couldn’t he go back?",
        "***",
        "T/N: *狗腿 (goi tui) – dog legs. Slang for running dog, lackey, etc. Someone who is overly servile to others. ",
        "*沙雕 (sha diao) – sand sculpture. Slang for idiot (in a funny way)."
    ],
    "previous": "Ch26 - Accepting A Younger Brother",
    "next": "Ch28 - Countdown of Ten Days"
}