{
    "title": "Ch28 - Countdown of Ten Days",
    "content": [
        "After Lou Jingyue left, Qi Shiyan returned to the airship with Ming Zheng.",
        "The seats of the airship had long been put together to form a large bed. Qi Shiyan lay on it, not wanting to move at all. ",
        "He used up a lot of mental power, which consumed a lot.",
        "His body was too weak, so he couldn’t use all of his mental power. After using a large amount of mental power, he would become weak.\n",
        "",
        "Fortunately, he ate an extra wild boar leg at night. After a good night’s sleep, he should be able to recover.",
        "Ming Zheng noticed Qi Shiyan’s weakness. He sat beside Qi Shiyan, looked at him worriedly, and even took Qi Shiyan’s hand and kissed it. “Be good, don’t feel uncomfortable.” ",
        "Qi Shiyan was instantly revived with full health.\n\n",
        "He had coaxed Ming Zheng like this before, and now Ming Zheng coaxed him like this too!",
        "This was great. His future partner was so nice!",
        "Qi Shiyan hugged Ming Zheng and said, “Ah Zheng, let’s go take a shower and then go to sleep.”\n\n ",
        "The live broadcast screen went black at the right time.",
        "The audience was speechless. “Isn’t this live broadcast too sensitive?”",
        "“They haven’t even taken off their clothes yet. Why aren’t they letting me watch?!”\n\n",
        "“Since they won’t let me watch, I’ll just make it up in my head!” ",
        "…",
        "Although the live broadcast screen was black, the sound was still there. From the sound, it seemed that the two of them took turns taking a shower.",
        "When they finished washing, the screen finally lit up.",
        "Qi Shiyan was dressed neatly. He hugged Ming Zheng and said to him, “Ah Zheng, what story do you want to hear today?” ",
        "“I want to hear them all.” Ming Zheng said. His mind seemed to be shrouded in a thick fog and he could not remember many things.",
        "But he vaguely felt that no one except Ah Yan had ever told him stories.",
        "No matter what Ah Yan said, he liked to listen.",
        "Qi Shiyan dug out a story that the original owner had heard many times and told it to Ming Zheng. While telling the story, he also interacted with Ming Zheng. “Ah Zheng, who do you think did the right thing, Honghong or Lanlan?” ",
        "“Ah Zheng, the prince and princess lived happily ever after. We will be the same!”",
        "“Ah Zheng, after we leave this planet and I get back the money my father left me, I will take you to eat the delicacies mentioned in the story.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Later, Qi Shiyan stopped telling stories and started talking about other things. “Ah Zheng, there are many delicious foods on the Capital Star. I will take you to try them all when the time comes.”",
        "The original owner had eaten a lot of delicious food when he was on the Capital Star. ",
        "It was a pity that the original owner was on a diet and didn’t dare to eat too much. If it were him, he would definitely eat a lot.",
        "“Ah Zheng, the pork from the Capital Star is so delicious. I’ve been to Jingtian Pavilion before and had the stewed pig’s trotters there. They were so delicious… Do you know Jingtian Pavilion? It’s owned by the mother of that guy Xiao Lou who came today. We can have him treat us.”",
        "Ah Zheng said with dissatisfaction, “I don’t like him.”",
        "“Then the two of us will go eat without him and just let him pay.” Qi Shiyan said. ",
        "Only then did Ah Zheng nod with satisfaction.",
        "Madam Ming was helpless as she watched.",
        "She glanced at the door of Ming Qingyu’s house and said to the people around her, “I won’t leave today. I’ll sleep in the airship. You guys go grab some takeout from Jingtian Pavilion and send it to me. There must be stewed pig’s trotters.”",
        "She was so excited by what she heard that she wanted to eat stewed pig’s trotters. ",
        "In the past, she would never eat this kind of thing at night, but now that her son was ezpected to recover, she could definitely eat pig’s trotters to celebrate.",
        "Anyway, she wouldn’t become fatter than her son.",
        "Zadam Zing wanted to eat stewed pig’s trotters, but almost didn’t get to eat it.",
        "Because many people who watched the live broadcast went to buy stewed pig’s trotters as soon as possible, Jingtian Pavilion’s orders were booked up to a month later. ",
        "“I’m eating the stewed pig’s trotters from Jingtian Pavilion. They’re so delicious!”",
        "“I’m going to eat pig’s trotters tomorrow too!”",
        "“Qi Shiyan poisoned people late at night!”",
        "“Qi Shiyan is really quite good. Although he is always clinging to Ah Zheng because of his skin hunger syndrome, he has a sense of proportion. He will only kiss his hand at most and won’t do anything more excessive.” ",
        "“In fact, I think even if he did something more excessive, Ah Zheng wouldn’t object. It’s obvious that Ah Zheng likes him back.”",
        "“Who wouldn’t like such a handsome guy?”",
        "",
        "…",
        "Qi Shiyan and Ming Zheng slowly fell asleep. ",
        "Lou Jingyue tried hard to repair the airship, but failed.",
        "The airship’s system had crashed!",
        "There were no problems with other parts of the airship, but the operating system just wouldn’t start.",
        "In this case, even if he dismantled the airship and reassembled it, the airship wouldn’t be fixed. ",
        "After struggling for a long time without any success, Lou Jingyue went back to find Qi Shiyan and Ming Zheng.",
        "But the lights in the Starlight had dimmed. Qi Shiyan and Ming Zheng had already gone to bed.",
        "Lou Jingyue could only return to his own airship and take a nap.",
        "After the entire airship operating system became unusable, he could no longer use his voice to control the airship’s seats, which could be converted into beds. The airship also could not be operated manually. ",
        "He curled up in the seat and slept very uncomfortably.",
        "That still would have been fine, but the next day, just after dawn, he was woken up on time by his biological clock.",
        "He hadn’t gotten enough sleep. His biological clock was so annoying!",
        "Lou Jingyue could feel that the mental power seal that the boss used to help him seal the poison in his body would not last long. ",
        "But this was enough.",
        "He went out and caught several rabbits before coming to the Starlight’s side.",
        "Although rabbit meat was not tasty, it was still edible. He planned to continue eating rabbit today.",
        "Qi Shiyan woke up a little late today. ",
        "He had used up all of his supernatural powers and mental power last night, so he needed a long rest.",
        "Because of this, when he woke up in the morning, Ming Zheng was already awake and was staring at him.",
        "",
        "Seeing that he was awake, Ming Zheng smiled widely. “Ah Yan, good morning!”",
        "“Good morning.” Qi Shiyan hugged Ming Zheng and used his supernatural powers again. ",
        "Not long after, Ming Zheng became clear-headed.",
        "After Ming Zheng became clear-headed, he suddenly didn’t want to go back to the sanatorium.",
        "Yesterday, because of Lou Jingyue, he did a lot of childish things.",
        "No, it wasn’t because of Lou Jingyue. He was just jealous. ",
        "If he were clear-headed, he would definitely be able to control his emotions, but when he was not clear-headed, his reactions were all instinctive.",
        "At that time, he didn’t like Qi Shiyan paying attention to Lou Jingyue.",
        "If they went to the sanatorium, would he always be jealous?",
        "In the sanatorium, many people knew his identity… ",
        "“Ah Zheng, I love you.” Qi Shiyan confessed again. Seeing Ming Zheng’s heartbeat quicken because of his confession, he was in a particularly good mood.",
        "None of his previous dolls would respond to him.",
        "“Ah Zheng, I calculated that if I work harder, you will be my partner in another ten days,” Qi Shiyan was very happy, “Then I can kiss you whenever I want.”",
        "The first time he met Ming Zheng, if the poison in Ming Zheng’s body was counted as 100, if his supernatural powers fully recovered, he could eliminate about 6% of the poison. ",
        "However, his supernatural powers had never fully recovered.",
        "The first time, he only helped Ming Zheng eliminate about 1% of the poison. The second time, he helped Ming Zheng eliminate about 2% of the poison.",
        "After that, he helped Ming Zheng eliminate the poison once every twelve hours.",
        "Just twelve hours were not enough for him to recover all his supernatural powers, so each time, he could only help Ming Zheng eliminate about 3% of the poison. ",
        "However, the recovery speed of his supernatural powers was accelerating. After they arrived at the sanatorium and had no shortage of food, he should be able to help Ming Zheng eliminate about 8% of the poison in a day.",
        "Qi Shiyan calculated carefully and discovered that in another ten days, he would have a partner.",
        "",
        "This was good news and should be shared with Ming Zheng.",
        "Ming Zheng was stunned. “What did you say?” ",
        "Qi Shiyan said, “I help you eliminate poison every day. In another ten days, you should be able to recover.”",
        "Ming Zheng looked confused.",
        "Qi Shiyan reminded him, “I told you before that I can eliminate the star worm poison.”",
        "Ming Zheng recalled for a bit and discovered that such a conversation had indeed happened. ",
        "However, when Qi Shiyan said this, he could no longer resist the poison and soon became dazed.",
        "He thought he had heard it wrong.",
        "Ming Zheng thought that he was able to become clear-headed because Qi Shiyan used his mental power to help him suppress the poison. But it turned out that Qi Shiyan was actually eliminating the poison from his body?",
        "Thinking of this, Ming Zheng checked his body carefully. ",
        "He was clear-headed for a short time each time, and he was so deeply poisoned that he had not noticed that his condition was improving.",
        "But now, when he checked carefully, he found that the poison in his body was indeed less, and had probably returned to the state from more than a year ago.",
        "At that time, he could occasionally become clear-headed.",
        "Qi Shiyan could actually help people eliminate the star worm poison! ",
        "This was amazing!",
        "If he could even eliminate the star worm poison in his body, Qi Shiyan could definitely eliminate the star worm poison in other people’s bodies.",
        "Could all the people in the sanatorium be cured?",
        "Ming Zheng was a little excited, and then he thought of something else. ",
        "When Qi Shiyan helped people eliminate poison, did he need to hug them?",
        "Wasn’t this a bit bad?",
        "",
        "Wait, wait, Qi Shiyan had been helping him eliminate the poison. In another ten days, the poison in his body would be completely eliminated. Would he then reveal his original appearance?",
        "At that time, would Qi Shiyan be frightened? ",
        "“Ah Zheng, I’m really looking forward to seeing what you’ll look like in ten days!” Qi Shiyan hugged Ming Zheng. He felt that his family’s Ah Zheng would definitely be very handsome after eliminating all the poison from his body.",
        "Ming Zheng hugged Qi Shiyan back, his hands shaking a little.",
        "He could actually recover… This was something he had never dared to imagine.",
        "If he could recover, he wanted to be with Qi Shiyan. ",
        "At the beginning of his life, he lived in a laboratory, and his life was completely controlled by others.",
        "Later, when he returned to the imperial family, still no one cared about him or loved him.",
        "At the age of eighteen, he went to the battlefield, carrying the expectations of the people of the entire empire.",
        "He pretty much had never lived for himself. ",
        "This was the first time he liked someone and wanted so badly to be with another person!",
        "He wouldn’t let go.",
        "Even if the love this person had for him was only because of the fledgling complex.",
        "Ming Zheng hugged Qi Shiyan tightly. “Ah Yan…” ",
        "He called out, but didn’t say much.",
        "He had never said the word ”love” to anyone…",
        "“Ah Zheng, when are we getting married?” Qi Shiyan asked again.",
        "Ming Zheng: “…” Was this all that was in this person’s mind? ",
        "Ming Zheng was confused, but he couldn’t say more. He soon became a “little fool” again.",
        "Qi Shiyan pinched his face and chuckled.",
        "Please visit chrysanthemumgarden (dot) com",
        "He really liked Ah Zheng’s pure and innocent look. He guessed that Ah Zheng would probably mostly be like this until the poison in his body was completely eliminated.",
        "Ah Zheng had been poisoned for a long time, and both his body and mental power had suffered great damage. ",
        "He was still not clear-headed, but in fact his body was slowly recovering.",
        "When Ming Zheng was pinched on the face by Qi Shiyan, he followed suit and reached out his hand to pinch Qi Shiyan’s face.",
        "The two of them were pinching each other and being very affectionate. Outside, Lou Jingyue who was still waiting for the door of the airship to open, felt a little aggrieved.",
        "On the star network, ordinary people were still relatively calm. ",
        "They just learned what star worm poison was yesterday. Now that they heard that Qi Shiyan could help treat people, they didn’t think it was a big deal.",
        "But the people in the military had already exploded.",
        "Star worm poison could actually be eliminated?!"
    ],
    "previous": "Ch27 - Doubt",
    "next": "Ch29 - Grudge Against The Imperial Family"
}