{
    "title": "Ch29 - Grudge Against The Imperial Family",
    "content": [
        "Jiang Jin had already guessed that Qi Shiyan could help people eliminate the star worm poison.",
        "His Majesty’s condition was too severe. If he was just using mental power to suppress the poison, it would not allow His Majesty to regain clear-headedness. What was more, the amount of time His Majesty could remain clear-headed was getting longer and longer every day. ",
        "But he hadn’t expected that Qi Shiyan would be able to eliminate all the poison in His Majesty’s body in just ten days.",
        "Once the poison in His Majesty’s body was eliminated, there would be nothing to fear from the star worms!\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ten days, just ten days!",
        "Jiang Jin was handling official business, but accidentally broke the computer in his hands into two pieces. ",
        "He came to his senses, immediately took out his communication terminal and contacted the marshals of several legions.\n\n",
        "As soon as this live broadcast started, the convalescent planet should have been targeted.",
        "Although he had not discovered any star worms nearby so far, he felt that the star worms would come here sooner or later.",
        "He was here and needed reinforcements.\n\n ",
        "He believed that many people would be willing to come and help.",
        "Jiang Jin was very excited, and so was Lu Yuan.",
        "He had been on the front lines and was very busy, but despite his busy schedule, he had not forgotten to watch the live broadcast.\n\n",
        "Today, when he heard Qi Shiyan’s words, his eyes suddenly became red. ",
        "His hands shook uncontrollably and he could no longer handle the work at hand.",
        "Those military commanders were all asking each other, “Can Qi Shiyan really help people eliminate the star worm poison?”",
        "“If this is true, can my old leader come back?”",
        "“Over the years, many people have been forced to leave the battlefield because of star worm poison. Now, can they come back?” ",
        "“I’ve also been poisoned, and I can only suppress it. If Qi Shiyan can cure me, then he will be my benefactor!”",
        "They were originally very concerned about the identity of “Ah Zheng”, but now they had no time to think about this.",
        "While chatting with each other, someone mentioned, “Qi Shiyan’s live broadcast has only been going on for a few days? Why do I feel like it has been going on for a long, long time?”",
        "Yeah… the live broadcast had only been going on for a few days. Why did it seem like a long time had passed? ",
        "In the live broadcast, Qi Shiyan and Ming Zheng finally opened the door of the Starlight and came outside.",
        "They immediately saw Lou Jingyue waiting outside.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Lou Jingyue was a little excited when he saw them. “Brother Yan, I have collected enough firewood and leveled the land near the airship.”",
        "Qi Shiyan also noticed this and was very satisfied. “You did a good job, but aren’t we going back to the sanatorium? We don’t need to collect firewood anymore.” ",
        "Lou Jingyue’s expression froze, and then he said, “Brother Yan, I’m sorry, my airship is also broken, so we can’t go back to the sanatorium for the time being…”",
        "“What’s wrong with your airship?” Qi Shiyan asked. As far as he knew, airships in this era didn’t break down easily.",
        "Oou Aingyue said, “I don’t know either. I don’t have the authority to check.”",
        "Hi Shiyan didn’t understand. Oou Aingyue coughed lightly and said, “This airship is not mine. I stole it.” ",
        "Hi Shiyan: “…” Le was the dignified son of a marshal, yet he stole an airship?",
        "“Drother Tan, it must be that guy Yld Aiang who wants to make me suffer. Le locked the airship remotely and prevented me from using it! Le is such a petty person!”",
        "“Who is Old Jiang?” Qi Shiyan asked.",
        "“Director Jiang! Brother Yan, didn’t you steal your Starlight from him?” Lou Jingyue pointed at the Starlight and said, “Starlight can traverse the universe. It’s not that easy to break. It must have also been locked by him and that’s why you can’t start it.” ",
        "This was the first time Qi Shiyan had heard of Director Jiang. He also didn’t steal this airship.",
        "The Starlight was not locked, and the Starlight’s intelligent system had always regarded Ah Zheng as its master. This airship should not have been stolen by Ah Zheng.",
        "However, Qi Shiyan did not explain to Lou Jingyue. He just planned to wait until the next time Ah Zheng became clear-headed and then ask him what was going on.",
        "Ah Zheng and Director Jiang should have a good relationship. As for Lou Jingyue… Director Jiang must have something against him and deliberately made him suffer outside. ",
        "Lou Jingyue was still complaining. “Old Jiang is really too much. I just wanted to borrow his airship for a while, but he actually locked all the permissions… Next time I’ll put ghost pepper* in his soup!”",
        "Jiang Jin: “Haha.” The person who had put ghost pepper in his food had been found!",
        "Jiang Jin had a light diet and couldn’t eat spicy food, but half a year ago, someone added chili powder made from ghost pepper to his tomato soup…",
        "He had originally wanted to give Lou Jingyue some permissions so that he could sleep more comfortably at night, but now… no need for that. ",
        "Madam Ming: “…” Why was her son talking nonsense?!",
        "Only the netizens who were watching the live broadcast were laughing and very happy. “Lou Jingyue is really interesting.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“The dignified son of a marshal actually stole an airship!”",
        "“Call the police, call the police! Uncle police, come and catch the thief!” ",
        "…",
        "Lou Jingyue had some opinions about Jiang Jin. Everyone in the sanatorium took good care of him. Only Jiang Jin always had a bad attitude toward him.",
        "After Jiang Jin discovered his treasured collection of various cards that he had collected since childhood, he laughed at him and said that the autographed photo of His Majesty that he had bought with great difficulty was fake. He also said that he was too stupid to actually be cheated by others.",
        "It was too much! ",
        "However, Lou Jingyue did not complain for too long. He quickly took the seasonings and roasted a rabbit for himself.",
        "He got up early in the morning and did a lot of work, so he was already hungry.",
        "Seeing this, Qi Shiyan cut a large piece of meat from the belly of the wild boar, took out a frying pan, and started frying the boar belly.",
        "He thought fatty meat was the most delicious. Yesterday, he was already drooling over the boar belly. ",
        "As for the gamey taste of wild boar meat… Qi Shiyan himself didn’t care, but he was afraid that Ming Zheng wouldn’t like it.",
        "So, he fried two slices of boar belly first, tasted one slice himself, and when he found it was not particularly bad, he passed the remaining slice to Ming Zheng. “Ah Zheng, try this meat and see if you like it. If you don’t like it, I’ll roast a rabbit for you.”",
        "Lou Jingyue caught more than one rabbit, so he could ask him for one.",
        "Ming Zheng ate the boar belly and said, “I like it!” ",
        "The boar belly wasn’t actually very tasty, but it was fried by Qi Shiyan, so he liked it.",
        "“It’s good that you like it. Let’s eat boar belly this morning.” Qi Shiyan said, picking up the knife and cutting the boar belly into slices of equal thickness.",
        "While he was frying the meat, he paid close attention to the heat, so each piece of boar belly was fried just right.",
        "Lou Jingyue saw this from the side and was extremely envious. ",
        "The fried boar belly slices smelled very nice. Although there was a bit of a gamey smell, seeing how happy the boss was while eating it, the taste must be very good!",
        "Lou Jingyue couldn’t help but ask, “Brother Yan, can you let me have a taste of these meat slices?”",
        "",
        "Qi Shiyan said, “No.”",
        "If Lou Jingyue ate these meat slices, he would definitely spit them out. What a waste! ",
        "It was better for him to eat them himself.",
        "Lou Jingyue was very disappointed and asked again, “Brother Yan, which legion are you from?”",
        "Qi Shiyan said, “I am not part of the military.”",
        "Lou Jingyue was familiar with those people with strong mental power in each legion, but he had never seen Qi Shiyan among them. ",
        "Qi Shiyan was as thin as a bamboo pole and didn’t look like a member of the military.",
        "He had thought before that Qi Shiyan might not be part of the military, and now it had been confirmed.",
        "“What about your lover?” Lou Jingyue asked again.",
        "Qi Shiyan said, “He is not part of the military either.” ",
        "Lou Jingyue was a little surprised.",
        "These two people were not part of the military. Could they be from the imperial family?",
        "The imperial family had its own armed forces. Some imperial family members were even surrounded by S-level guards.",
        "He had heard that the boss of the Chaotic Zone of the empire used to belong to the imperial family’s secret armed forces. ",
        "However, for some unknown reason, he rebelled against the imperial family and hated them to his core.",
        "“Brother Yan, what do you think of the imperial family?” Lou Jingyue asked.",
        "Qi Shiyan said, “The imperial family? I think they are just a bunch of parasites.”",
        "He had no affection for the imperial family at all. ",
        "The members of the imperial family weren’t all bad, but there were a lot of bad eggs among them.",
        "The scary thing was that because they were members of the imperial family, even if they committed crimes, they would not receive the punishment they deserved.",
        "",
        "For example, Ming Qingyu had an uncle who kept many young and beautiful men and women on a spaceship for his pleasure, some of whom were forced.",
        "However, after the matter was exposed, he only spent a few months in the imperial prison. ",
        "Qi Shiyan thought about this and said, “I think the imperial family should not exist. It’s already the interstellar era. Why do we still need an imperial family? Shouldn’t everyone be equal?”",
        "After that, Qi Shiyan said, “Take Ming Qingyu for example. What the hell is he? How did he become the crown prince?”",
        "Lou Jingyue’s mother was also a member of the imperial family, so he was suddenly a little embarrassed.",
        "Qi Shiyan also remembered this matter and said, “Of course, your mother is fine.” ",
        "The original owner had no conflict with Madam Ming, so he also had no ill feelings toward her.",
        "Lou Jingyue said, “His Majesty is also very good. He has done a lot for the empire!”",
        "“That’s true, but he has poor vision.” Qi Shiyan said.",
        "When the original owner and Ming Qingyu got engaged, the original owner and the emperor had met once in a video call. ",
        "The emperor was very indifferent at the time. He didn’t even look at the original owner and didn’t speak to him. Then he made Ming Qingyu the crown prince.",
        "According to Ming Qingyu, the emperor particularly valued him and always treated Ming Qingyu better than others.",
        "After Ming Qingyu became the crown prince, the emperor often gave Ming Qingyu guidance, taught him many things, and cultivated him carefully.",
        "The original owner had also seen the emperor giving gifts to Ming Qingyu more than once. ",
        "Although the emperor was very capable in combat, his vision was really poor.",
        "Lou Jingyue was a fan of the emperor.",
        "Hearing Qi Shiyan say that the emperor had poor vision, Lou Jingyue was a little unhappy and couldn’t help but ask, “Brother Yan, do you have a grudge against the imperial family? So you are prejudiced against His Majesty?”",
        "Qi Shiyan said, “I guess so.” ",
        "He definitely wanted to take revenge on Ming Qingyu, but the current emperor seemed to think highly of Ming Qingyu.",
        "In the future, it was unknown whether they would stand on opposite sides.",
        "",
        "Speaking of which, the original owner didn’t receive much education when he was a child. After he grew up, he didn’t understand anything about the war and only cared about Ming Qingyu.",
        "Ming Qingyu had no ability, but he was praised so highly. Was it the same for the emperor? ",
        "After all, Ming Qingyu said every day that he would be as powerful as the emperor in the future.",
        "The original owner had never seen the emperor’s combat videos. Qi Shiyan’s understanding of the emperor came from Ming Qingyu’s narration.",
        "It was difficult for him to respect the person who regarded Ming Qingyu as his successor.",
        "*** ",
        "T/N: Lol this is gonna be a hilarious misunderstanding.",
        "*From Wikipedia: “The ghost pepper, also known as bhüt jolokia, is an interspecific hybrid chili pepper cultivated in Northeast India. It is a hybrid of Capsicum chinense and Capsicum frutescens. In 2007, Guinness World Records certified that the ghost pepper was the world’s hottest chili pepper, 170 times hotter than Tabasco sauce.”"
    ],
    "previous": "Ch28 - Countdown of Ten Days",
    "next": "Ch30 - Conjecture"
}