{
    "title": "Ch3 - Appearance",
    "content": [
        "Qi Shiyan touched his face and felt uncomfortable.",
        "The high-tech product used by the original owner to change his own face was called a “face-changing mask” by the interstellar people. ",
        "This thing was a bit like the human skin mask described in the novel that Qi Shiyan had read before, but it was much easier to use than a human skin mask.",
        "After putting the face-changing mask on one’s face, one could set their appearance within a certain range without worrying about it falling off. It could completely transform a living person.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Qingyu didn’t like the original owner, and the original owner could also vaguely sense it. In order to make Ming Qingyu like him more, he tried hard to mold himself into the appearance that Ming Qingyu liked.",
        "At the beginning of their engagement, Ming Qingyu said that he liked people with delicate looks and a petite figure. The examples Ming Qingyu used were the celebrity and socialite who were scolded as mistresses by the original owner at the beginning. ",
        "Both of them were petite girls with faces only the size of a palm. Their appearances were completely different from the original owner.\n\n",
        "So the original owner starved himself every day, made himself thin, and used a face-changing mask to change his appearance.",
        "The high-tech products in the interstellar era were really amazing. After the original owner put on this face-changing mask, his appearance changed a lot!",
        "Unfortunately, the bone structure couldn’t be changed. The original owner always felt that his face was too big and too ugly, and he felt very inferior because of this.\n\n ",
        "Qi Shiyan was speechless.",
        "The original owner’s face was not big at all! He was very tall, about the same height as Ming Qingyu. In this case, if his face was really the same size as those petite girls, it would be a terrifying proportion of a big body with a small head!",
        "The original owner’s current head-to-body ratio was obviously perfect!\n\n",
        "Qi Shiyan also felt that the original owner’s original face was better looking than the one displayed using the face-changing mask. ",
        "The original owner looked like his father, with a big frame and handsome appearance. He was actually a handsome guy, but he insisted on dressing himself to be petite and feminine, which made him look weird.",
        "On the star network, many people said that the original owner was ugly. The more they said it, the more the original owner tortured himself. The more he tortured himself, the uglier he became.",
        "Fortunately, out of fear of being scolded by the media, the original owner did not go for plastic surgery, but just used a face-changing mask to change his appearance in various ways.",
        "Qi Shiyan was extremely grateful for this and planned to throw away the mask. ",
        "Wearing a mask was too uncomfortable. He wanted to use his real skin to face the sunlight!",
        "When Qi Shiyan touched his face, people on the star network started to laugh at him again. “Qi Shiyan is really ugly.”",
        "“He also has a particularly bad temperament.”",
        "“He has been sucking blood from General Qi. If it weren’t for General Qi, how could he go to the Central Military Academy to study? He also couldn’t have become the future crown princess.” ",
        "“His Highness the Crown Prince was deceived by him!”",
        "“It is said that Qi Shiyan has been wearing a face-changing mask. He is so ugly even with the mask on. His real appearance must be too ugly to be seen by others.”",
        "",
        "…",
        "As netizens were talking, they saw Qi Shiyan in the live broadcast starting to pull at his face. ",
        "“Wait! Is Qi Shiyan going to take off the face-changing mask?”",
        "“The media keeps an eye on Qi Shiyan every day, but they have never captured Qi Shiyan’s true appearance. Now we are going to see it?”",
        "“I didn’t expect to see Qi Shiyan’s true face in this live broadcast. It’s worth it, really worth it!”",
        "“Qi Shiyan should die. So many people are suffering at the border, and yet he spends millions on a face-changing mask…” ",
        "…",
        "While the people in the live broadcast room were shouting, Qi Shiyan had already torn off the mask that the original owner had been wearing.",
        "This thing was given to him by Qi Jianuo.",
        "The original owner’s parents left him a huge fortune, but the original owner himself had little money on hand. ",
        "He was very poor and could not afford a face-changing mask that cost several million, so Qi Jianuo gave him one.",
        "Qi Shiyan felt that Qi Jianuo had bad intentions.",
        "When the original owner hadn’t messed with his face according to Ming Qingyu’s so-called preferences, his appearance was better than Qi Jianuo’s.",
        "Qi Jianuo clearly intended to make the original owner look ugly. ",
        "It was also abnormal that the original owner was so poor.",
        "The Qi family said that the assets left to the original owner by his parents were used to buy potions that could enhance the original owner’s mental power. The original owner did drink a lot of so-called potions that could enhance the original owner’s mental power.",
        "Dut Hi Shiyan felt that the potions that the original owner drank were most likely fake.",
        "Zental power would grow stronger as a person grew older. When a person was still a child, using potions that nourished mental power could help the mental power develop better. ",
        "When Hi Aianuo first took a mental power test at the age of ten, his mental power level was J, but now it was already A.",
        "The original owner was born with a deficiency. When he first had his mental power tested at the age of ten, his level was D. Now it was C.",
        "",
        "If the original owner had really drunk so many potions, how could it still be at C-level?",
        "Potions that nourished and enhanced mental power were most effective on people with low-level mental power. ",
        "It was actually not difficult to improve a person’s mental power from D-level to B-level. However, it was really difficult to improve it from B-level to A-level.",
        "The children of wealthy people in the empire could almost all reach B-level of mental power, but not many could reach A-level of mental power.",
        "The Qi family spent all the assets left to the original owner by his parents to buy potions for the original owner to drink. If those potions were real, the original owner’s mental power would definitely reach B-level.",
        "There were no traces of potions in the original owner’s body at all. For him to upgrade from D-level to C-level, it seemed his mental power grew naturally as he grew older. ",
        "The Qi family clearly used the excuse of buying potions to transfer the original owner’s property.",
        "Of course, the potions might really have been purchased, but it was hard to say who used them in the end.",
        "Qi Jianuo’s mental power was only C-level at the beginning, not much better than the original owner. It was easy for him to upgrade to B-level, but it would require a lot of resources to upgrade to A-level.",
        "The potions that the Qi family bought with the original owner’s money were most likely given to Qi Jianuo to drink. ",
        "Qi Shiyan took off his mask and scooped up the stream water with both hands again.",
        "But this time, he didn’t scoop it to drink, but to wash his face.",
        "It was so comfortable, really so comfortable!",
        "When the cold stream water touched his face, Qi Shiyan felt all the pores in his body opening up. ",
        "And when he did this, the barrage stopped.",
        "The audience who were watching the live broadcast by setting the camera to follow his face were speechless for a moment.",
        "Was Qi Shiyan actually so handsome?",
        "His skin was snow-white, without a single blemish. ",
        "His facial features were also very handsome, very much like General Qi from many years ago.",
        "His eyes were even more bewitching.",
        "",
        "How to describe it? If one had to say, it would be that there was light in his eyes.",
        "He looked very happy, with a smile on his face and sparkling eyes. People who saw him couldn’t help but be infected by him and want to smile as well. ",
        "After a while, the people watching the live broadcast started to speak up. “Does Qi Shiyan look like this?”",
        "“He looks a lot like General Qi.”",
        "“If he looks like this, why would he need to wear a face-changing mask?”",
        "“Fuck, too handsome!” ",
        "…",
        "When posting barrages in the interstellar era, one could just say it aloud with their mouth.",
        "So for a moment, dense barrages of comments covered Qi Shiyan’s face.",
        "This made those who wanted to appreciate Qi Shiyan’s appearance rush to change the barrage display percentage, or put the barrage in the corner to avoid it covering the screen. ",
        "Qi Shiyan had always had a bad reputation on the star network, and there were still many people scolding him, but most people at this moment felt that he was very handsome!",
        "Qi Shiyan also thought he was very handsome.",
        "He looked at his face using the selfie mode on the communication terminal. The more he looked, the more satisfied he became.",
        "The interstellar era was so good! There were all kinds of advanced technology. The original owner always wore a mask and was never exposed to the sun, so this face had no blemishes at all. ",
        "Too handsome, really too handsome!",
        "In his previous life, he was known as the most handsome man in the world, but he still couldn’t compare to the original owner.",
        "After the asteroid hit the planet where he lived, the planet was filled with radiation.",
        "Radiation could damage human genes and cause mutations. ",
        "From childhood to adulthood, everyone around Qi Shiyan was ugly.",
        "Because of exposure to radiation, their faces were covered with pustules. There were also some who had severely mutated and no longer looked like human beings.",
        "",
        "His appearance at that time was just that of an ordinary person before the apocalypse, but he was not afraid of radiation and always maintained his human appearance. Wasn’t he the most handsome man in the world?",
        "His current body was even more amazing! ",
        "If placed before the apocalypse, this body would have made him a top handsome man who could have made his debut there.",
        "Qi Shiyan was extremely satisfied with his current appearance.",
        "“I’m so handsome!” Qi Shiyan took a selfie of himself using the communication terminal, then stood up and left the stream.",
        "The audience who saw this scene were a little puzzled. “Qi Shiyan thinks he is handsome? Then why does he still wear a face changing mask?” ",
        "“Before, I always thought Qi Shiyan’s strange reaction was because he was scared silly, but looking at his appearance now, he doesn’t seem to be crazy.”",
        "“Is this person really Qi Shiyan?”",
        "…",
        "Some viewers felt something was wrong, but some people continued to insult Qi Shiyan. ",
        "There were also some people who suspected that Qi Shiyan had a split personality. Now that he was in danger, his second personality had come out.",
        "“No matter what, the disgusting things Qi Shiyan did in the past were not fake.”",
        "“Those who admire Qi Shiyan all have distorted values*.”",
        "“Why doesn’t Qi Shiyan just die?” ",
        "…",
        "While people online were talking non-stop, Ming Qingyu watched the live broadcast and felt a little uneasy.",
        "He was the one who planned the live broadcast that Qi Shiyan was participating in.",
        "The previous emperor, now the retired emperor*, was Ming Qingyu’s grandfather. ",
        "And the current emperor was Ming Qingyu’s uncle.",
        "More than 20 years ago, star worms attacked the Human Empire. Humanity was steadily losing ground. At that time, many people thought that human civilization would be destroyed.",
        "",
        "The members of the imperial family had always had a high level of mental power. They were in charge of the First Legion, which held the strongest military power. The people hoped that the imperial family could lead the First Legion and drive away the invaders like the founding emperor of the empire.",
        "But the empire had been at peace for many years. Not only had the combat power of the First Legion declined, but the imperial family had also become useless. ",
        "The retired emperor, whose mental power level had reached S-level, went to the front lines with Ming Qingyu’s father, the eldest prince at the time, whose mental power had also reached S-level. Not long after, they were defeated and the two fled back to the Capital Star together.",
        "The retired emperor, who was frightened by the star worms, used the excuse of his health being poor to pass the throne to the current emperor, Ming Zheng, who was only eighteen years old at the time. He told Ming Zheng to go fight on the front lines, while he himself became the retired emperor.",
        "Ming Zheng was the person with the strongest mental power in the Human Empire.",
        "Qi Yuncheng, who died together with a high-level star worm, had the same mental power level as the retired emperor. Both of them were S-level. When Ming Zheng was eighteen years old, his mental power level had already reached SS-level. ",
        "Twenty years had passed, and Ming Zheng’s current mental power level had reached SSS-level.",
        "A total of six high-level star worms died at his hands. He was the person with the most brilliant military record in the entire empire and the person most admired by the people of the empire.",
        "When the retired emperor passed the throne to Ming Zheng, his intention was to let Ming Zheng go to the front lines while he would take power in the rear.",
        "But Ming Zheng was so outstanding that he quickly took control of the military power. As time went by, the power of the empire fell into Ming Zheng’s hands. ",
        "Now, Ming Zheng had become an emperor with real power in charge of the imperial family and the military.",
        "If there had not been the incident of the star worms, after the death of the retired emperor, Ming Qingyu’s father should have inherited the throne. Then the throne would pass to Ming Qingyu.",
        "But as Ming Zheng’s power grew, even Ming Qingyu’s father was not taken seriously, let alone Ming Qingyu.",
        "Ming Qingyu, the favorite grandson of the retired emperor, could only find ways to please his uncle, the emperor, and the people in the military. ",
        "He discovered that people in the military and even his uncle, the emperor, had a good impression of Qi Yuncheng, so he approached Qi Shiyan and got engaged to him.",
        "He made the right move.",
        "After he got engaged to Qi Shiyan, he learned that Emperor Ming Zheng was not only seriously injured due to years of fighting on the front lines, but he was also poisoned by star worms and was dying. No one could cure him.",
        "The empire needed an heir. ",
        "He possessed S-level talent and was Qi Shiyan’s fiancé, which brought him into his uncle’s sight.",
        "His uncle made him the crown prince.",
        "",
        "The fact that he could become the crown prince was related to Qi Shiyan, but he didn’t want to spend his whole life with Qi Shiyan.",
        "Qi Shiyan was stupid and had an unpleasant personality. He really hated this person. He liked the simple and kind-hearted Qi Jianuo. ",
        "So, he began to plot to discredit Qi Shiyan.",
        "At first, he didn’t dare to act too obviously, but later, when he learned that his uncle’s condition was getting worse and worse to the point that he rarely saw people, he became bolder and bolder.",
        "Two months ago, when he learned that his uncle was seriously ill and delirious* and could no longer handle political affairs, he planned this live broadcast.",
        "He understood Qi Shiyan. ",
        "After being sent to an undeveloped planet by the escape pod, Qi Shiyan would definitely collapse and behave in a disgraceful manner.",
        "He wanted everyone in the world to see this scene.",
        "In addition, the planet he chose was a convalescent planet for soldiers injured on the front lines.",
        "In the interstellar era, most injuries could be healed by lying down in a medical cabin. Even if an arm was lost, it could be regrown. ",
        "Normally speaking, injured soldiers didn’t need to stay on the convalescent planet.",
        "But star worms were different.",
        "Star worms carried poison*. If someone was injured while fighting with star worms, they would be invaded by the star worms’ poison.",
        "The medical cabin couldn’t treat this kind of poison. ",
        "When the imperial soldiers were poisoned by this kind of poison, at first certain parts of their bodies were invaded by poison and turned black and purple. When the situation became serious, the poison entered the brain, causing them to lose their minds and start killing indiscriminately.",
        "After being poisoned, if one didn’t want the poison to enter the brain, they had to use their mental power to suppress the poison. If one could no longer use their mental power, they naturally couldn’t go to the battlefield anymore.",
        "Those who were “recuperating” on this planet were all soldiers who had been infected with star worm poison.",
        "Ordinary people didn’t know about this at all, but Ming Qingyu knew. He also knew that the people on this planet had their faces disfigured due to the poison and looked terrible. ",
        "Qi Shiyan was timid and afraid of such people.",
        "After the live broadcast staff notified the people in the sanatorium and the sanatorium sent people to pick up Qi Shiyan, Qi Shiyan would most likely be terrified by the imperial heroes living in the sanatorium.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ordinary soldiers wouldn’t fight star worms face to face. Those who had been poisoned by star worms were all very powerful warriors before, with mental power levels of at least A+. Many of them were even S-level masters.",
        "Qi Shiyan’s previous disrespect to veterans disgusted the entire public. Now that he was disrespecting the heroes in the sanatorium, his reputation would definitely plummet. ",
        "People in the military would also lose their favor toward Qi Shiyan.",
        "In this way, he wouldn’t have to worry about anyone investigating Qi Shiyan’s past, and he could also cancel the engagement with Qi Shiyan in a logical manner.",
        "Ming Qingyu even hoped that Qi Shiyan would die on this planet, preferably by being killed by some crazy soldier. This way, he would save himself a lot of trouble.",
        "However, when the live broadcast began, Qi Shiyan’s reaction was a little strange. ",
        "He thought that Qi Shiyan would keep hiding in the escape pod and crying until people from the sanatorium found him.",
        "As a result, Qi Shiyan left the escape pod, and his subsequent behavior was even more bizarre.",
        "However, the plan had already been implemented, so he had no choice but to continue.",
        "Qi Shiyan still looked a little abnormal now, so he probably didn’t need to worry. ",
        "***",
        "T/N: *This was distorted/incorrect three views in the raws, but I changed it to distorted values for better flow. Three views (三观 san guan) is Chinese slang for the three fundamental views/values of a person. The three views are world view, values and outlook on life.",
        "*太上皇 (tai shang huang) – a title given to a retired emperor who has abdicated. A direct translation is something like “Supreme/Grand Emperor”, but I’m using retired emperor for simplicity.",
        "*神志不清 (shen zhi bu qing) – these words come up a lot in this novel and I struggled to find a good translation. It literally means your mind is not clear. I will be using delirious or not clear-headed. ",
        "*毒 (du) – poison/toxin and 毒素 (du su) – toxins, are both used in the text to describe the star worm poison, but the use of singular and plural was driving me nuts, so to make it easier to read, I will only be using poison to describe the star worm poison."
    ],
    "previous": "Ch2 - Live Broadcast",
    "next": "Ch4 - Qi Jianuo"
}