{
    "title": "Ch30 - Conjecture",
    "content": [
        "Qi Shiyan’s understanding of the imperial family, the military, and the entire Human Empire all came from the memories of the original owner of this body.",
        "The original owner’s parents both died on the battlefield. They became heroes of the empire, but from the original owner’s perspective, he lost his parents in this battle. ",
        "When he was a child, he kept crying for his parents, but no one came to coax him. He longed for company, but only had cold robots to accompany him. He couldn’t control his emotions, and was accused of bringing shame to his parents…",
        "The original owner hated war so much that he never took the initiative to care about the situation on the battlefield, so he didn’t know much about what was happening on the front lines.\n",
        "",
        "It was not until Ming Qingyu also went to the battlefield that he paid some attention to the war between the Human Empire and the star worms.",
        "The original owner was completely devoted to Ming Qingyu. He not only tried to please Ming Qingyu, but also tried to please the guards around Ming Qingyu. ",
        "This allowed him to discover that Ming Qingyu’s military achievements were exaggerated.\n\n",
        "After studying these memories, Qi Shiyan felt that Ming Qingyu’s military achievements were at least 90% false.",
        "One had to know that the guards around Ming Qingyu were much more powerful than Ming Qingyu in battle.",
        "Qi Shiyan also learned from the original owner’s memories how those people in the imperial family raised their mental power to S-level when their mental power level was very low at the beginning.\n\n ",
        "In short, most of the glamor and splendor that the imperial family members showed to the public was fake.",
        "Qi Shiyan felt that the imperial family was a huge counterfeiting factory.",
        "In this case, the emperor’s military achievements might not be entirely true either.\n\n",
        "The imperial family was the largest capitalist and landlord in the empire. The military’s advanced weapons all came from the Imperial Research Institute, and the huge military expenditures of the First Legion were also paid for by the imperial family. ",
        "Under such circumstances, it was easy for the emperor to ask the military to make him an invincible god of war.",
        "It was impossible for the emperor to really take the lead in battles.",
        "If he really wanted to lead by example, would he choose a guy like Ming Qingyu as his successor?",
        "Would Ming Qingyu keep saying every day that he would do better than the emperor in the future? ",
        "Also, Ming Qingyu treated the original owner so badly. The emperor, as the person in charge of the imperial family, could not have been completely unaware of this.",
        "But he didn’t do anything about it.",
        "The original owner’s parents died for the empire, but unfortunately the emperor did not take the original owner to heart.",
        "Qi Shiyan had no good feelings toward the emperor. ",
        "In fact, he also had prejudices against Lou Jingyue.",
        "People on the star network described Lou Jingyue as being very strong, but after he met this person, he found that Lou Jingyue was not strong at all, and was much weaker than his family’s Ah Zheng.",
        "",
        "The reason why Lou Jingyue was so famous should be related to his identity.",
        "With a mother born into the imperial family and a father who was a marshal, how could Lou Jingyue not be famous? ",
        "However, he really liked living people, and Lou Jingyue was likable overall, so he didn’t hate Lou Jingyue at all. He even wanted to touch Lou Jingyue’s head and pinch Lou Jingyue’s face.",
        "Forget it, he better not do this. Ah Zheng would be jealous.",
        "Lou Jingyue looked at Qi Shiyan with a tangled face. “Brother Yan, what is your grudge against the imperial family? Brother Yan, let me tell you, His Majesty is really good. I have collected a complete set of His Majesty’s photos. When we go to the sanatorium, I can show them to you.”",
        "The so-called complete set of photos of His Majesty was actually a collection of various photos of His Majesty collected by someone. These photos were edited and made into a non-profit photo collection for internal circulation only. ",
        "Qi Shiyan refused. “I am not interested in the emperor.”",
        "In the original owner’s memories, during the video meeting, the emperor had a cold face and was not friendly to him. He didn’t expect him to actually pose for photos in private.",
        "As expected of the imperial family.",
        "Lou Jingyue was very unhappy, but he couldn’t beat Qi Shiyan, so he didn’t dare to confront Qi Shiyan. ",
        "At the same time, he began to doubt Qi Shiyan’s identity.",
        "Could Qi Shiyan be from the Chaotic Zone?",
        "The so-called Chaotic Zone actually covered several planets.",
        "It was located on the edge of the empire, where there were resource planets that had been exploited by the empire, as well as habitable planets that had been abandoned by the empire after being invaded by star worms. ",
        "It was said that the boss of the Chaotic Zone had strength that was second only to the emperor, and that he had a grudge against the imperial family.",
        "Lou Jingyue suspected that Qi Shiyan was that boss of the Chaotic Zone, otherwise it didn’t make sense that he was so strong.",
        "Qi Shiyan didn’t know about Lou Jingyue’s suspicion, nor did he know that he was actually very strong.",
        "He did not have a clear understanding of his own strength and the strength of others. ",
        "He knew that he was better than Ming Qingyu and Lou Jingyue, but he thought that Ming Qingyu and Lou Jingyue were both fakes who were hyped up.",
        "In his opinion, a true warrior like the original owner’s father should be stronger than Lou Jingyue, and might even be as strong as Ah Zheng.",
        "",
        "As for Ah Zheng’s identity, Qi Shiyan actually had some guesses.",
        "Le felt that his Ah Iheng should be the emperor’s bodyguard, or perhaps even the emperor’s substitute. ",
        "Mor ezample, at a critical moment, the substitute would get into the emperor’s mecha to help the emperor go kill star worms, and then all the credit for the victory would go to the emperor.",
        "Before meeting Lou Jingyue, Qi Shiyan had suspected that his Ah Zheng was a high-ranking military official, but Ah Zheng denied it.",
        "After meeting Lou Jingyue, he was also certain that Ah Zheng should not be a high-ranking military official.",
        "Firstly, Lou Jingyue didn’t recognize Ah Zheng, and secondly… there was something wrong with Ah Zheng’s body. ",
        "He used his supernatural powers to help Ah Zheng eliminate the poison in his body, and also used his mental power to keep an eye on Ah Zheng at all times, thus he knew Ah Zheng’s body very well.",
        "Ah Zheng had many wounds on his body, many of which were old wounds. Some of them were probably from when he was young.",
        "Ah Zheng had also been operated on so that he was unable to have offspring.",
        "Ah Zheng’s body even had some traces of having been experimented on. ",
        "His supernatural powers were too special.",
        "When he was young, many people actually wanted to study him. They hoped that through him, they could develop methods to deal with the apocalypse.",
        "He was experimented on for a while, but fortunately he was rescued not long after.",
        "But Ah Zheng must have been experimented on for a long time and undergone modifications to make him suitable for fighting star worms. ",
        "People in this era all lived very long lives, but Ah Zheng’s life span had been overdrawn due to his body modifications.",
        "Of course, now that he was here, he would help make up for it.",
        "At the beginning, Qi Shiyan thought that in order to deal with the star worms, many people on the front lines might have undergone modifications.",
        "The result? Lou Jingyue’s body was completely natural and had not undergone any modifications. ",
        "His Ah Zheng must come from a poor background.",
        "Thinking of this, Qi Shiyan felt even more distressed for his Ah Zheng. “My family’s Ah Zheng is the best! Right, Ah Zheng?”",
        "",
        "Ming Zheng vaguely felt that something was wrong, but Qi Shiyan praised him!",
        "He nodded happily. ",
        "Jiang Jin, who was watching the live broadcast: “…” Since Qi Shiyan said that he wasn’t interested in His Majesty, why didn’t he let His Majesty go?",
        "Lu Yuan: “…” His Majesty had taken a liking to Qi Shiyan, yet now Qi Shiyan was saying that His Majesty had poor vision?",
        "In short, those who knew Ming Zheng’s identity were speechless.",
        "But they were not angry. It was normal for Qi Shiyan to have complaints about the imperial family after being treated like that by Ming Qingyu. ",
        "They also knew very well that when Qi Shiyan said that the emperor had poor vision, he was probably referring to the fact that the emperor chose Ming Qingyu as his heir.",
        "But at that time, His Majesty’s condition was already very bad. It was not so much that His Majesty chose Ming Qingyu as his heir, but rather that they chose him and His Majesty nodded.",
        "Of course they knew that Ming Qingyu was not outstanding.",
        "But there were no other outstanding people in the imperial family! ",
        "What was more, Ming Qingyu was young and easy to control.",
        "If something happened to His Majesty, the front lines would probably be in chaos for a while. Under such circumstances, it was better for Ming Qingyu to be the emperor than those cunning people to be the emperor.",
        "They were actually very afraid that the retired emperor would come out and compete for the throne.",
        "Although the retired emperor had a bad reputation, he had after all once been the emperor and had a lot of power in his hands. ",
        "When His Majesty first ascended the throne, he was completely sidelined by the retired emperor. If it weren’t for his Majesty being so powerful, it would have been impossible for him to seize control of real power.",
        "But even though His Majesty had taken away most of the power belonging to the emperor from the retired emperor, the retired emperor still hid a portion of the imperial property and power and did not hand them over to His Majesty.",
        "In addition, the other members of the imperial family all supported the retired emperor, and His Majesty had always stayed at the front lines…",
        "Sometimes, His Majesty was constrained and restricted by the imperial family when doing things. ",
        "If the retired emperor were allowed to ascend the throne again, they would definitely not be able to fight the war with peace of mind, but if Ming Qingyu and the retired emperor were allowed to check and balance each other, their situation would be much better.",
        "But now, they no longer needed Ming Qingyu.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Since His Majesty could get better, what did they need a crown prince for?",
        "“Once His Majesty becomes clear-headed permanently, he will definitely depose Ming Qingyu. By then, Qi Shiyan will no longer be able to say that His Majesty has poor vision.” ",
        "“I think His Majesty‘s vision is very good. Look, he fell in love with Qi Shiyan at first sight.”",
        "“Xiao Lou said that he has a photo collection of His Majesty. What is that? I want it too.”",
        "…",
        "High-ranking military officials were discussing, and ordinary people were saying all kinds of things. ",
        "“Qi Shiyan said it well! The imperial family is a bunch of parasites!”",
        "“The imperial family shouldn’t exist!”",
        "“Why shouldn’t the imperial family exist? It’s all thanks to His Majesty that the empire has not been conquered by star worms.”",
        "“That’s right! If it weren’t for His Majesty, Qi Shiyan might have been eaten by star worms a long time ago. His attitude toward His Majesty is so bad, which is a bit too much.” ",
        "“Qi Shiyan didn’t say anything overboard, right? He just said that His Majesty has poor vision! He was almost killed by Ming Qingyu, yet he is not allowed to complain?”",
        "“That’s right! Qi Shiyan has suffered so much. What’s wrong with him complaining a few times?”",
        "…",
        "There were all kinds of things being said online, but Qi Shiyan was still leisurely frying the meat slices. ",
        "Lou Jingyue took a bite of his dry roasted rabbit and glanced at Qi Shiyan.",
        "He had a lot to say, but he didn’t know what to say.",
        "The other party had a grudge against the imperial family, so it was indeed too much to expect the other party to respect His Majesty like he did…",
        "Qi Shiyan was too lazy to talk to Lou Jingyue. ",
        "Lou Jingyue was only slightly poisoned by star worm poison, was able to come to the sanatorium to recuperate, and was fed and well-nourished until he became fat.",
        "What about his Ah Zheng?",
        "",
        "The reason why Ah Zheng was poisoned so deeply was obviously because he continued to fight after being poisoned, resulting in repeated poisoning.",
        "Ah Zheng was so pitiful. ",
        "Qi Shiyan ate for a long time before he felt full.",
        "He kissed Ah Zheng’s hand and planned to take Ah Zheng for a walk nearby to help digest their meal and collect some edible plants along the way.",
        "Eating only meat was a bit oily, so he wanted to eat some vegetables.",
        "Some wild vegetables tasted very good and could be used to wrap roasted meat. ",
        "Qi Shiyan took Ming Zheng’s hand and walked into the forest.",
        "He didn’t say much in front of Lou Jingyue, but when Lou Jingyue couldn’t hear him and Ming Zheng talking, he immediately said to Ming Zheng, “Ah Zheng, in my heart, you are the best. That emperor, crown prince and so on can’t even measure up to one of your fingers!”",
        "His family’s Ah Zheng was very jealous, but he was engaged to Ming Qingyu.",
        "Although the two of them hadn’t gotten a marriage certificate and there was no legal relationship, it was still quite troublesome since they had held an engagement banquet. ",
        "Qi Shiyan felt that he needed to let his Ah Zheng know that he had no affection for Ming Qingyu at all.",
        "Qi Shiyan also wanted to brainwash Ming Zheng and make him hate the imperial family.",
        "His family’s Ah Zheng had been experimented on since he was a child and was so well-behaved. It was very likely that he was a guard who had been trained and brainwashed by the imperial family since childhood.",
        "On his original planet, he had read a lot of novels. In those novels, the imperial family always had shadow guards. His Ah Zheng might be a shadow guard. ",
        "He didn’t want his partner to be loyal to the imperial family!",
        "“Ah Zheng, let me tell you, the people in the imperial family are really not good people. Do you know Ming Qingyu? His military exploits are all fake!”",
        "“There is also Prince Renhe. When he learned that a ten year old girl had reached A-level mental power, he brought her to his side to groom her. Then, when her mental power reached S-level, he immediately made her his lover… At that time, the girl was only eighteen years old. Prince Renhe was older than the girl’s father. Prince Renhe also already had a wife…”",
        "“Do you know Princess Consort Kana? She has always suffered from domestic violence. She is so pitiful. But she dares not resist because she is afraid that her child will be harmed.” ",
        "“Before, a member of the imperial family committed a crime and was said to be serving his sentence in the imperial prison. As a result, he still participated in the imperial family’s activities.”",
        "…",
        "",
        "Qi Shiyan began to expose the imperial family’s dirty laundry.",
        "Audience: “I am too full from eating melons.” ",
        "“Yesterday, Madam Ming exposed a heap of information, and today, Qi Shiyan exposed another heap of information.”",
        "“No wonder Qi Shiyan said that the imperial family is a bunch of parasites. It’s true!”",
        "“The imperial family should not exist.”",
        "… ",
        "However, some people were dissatisfied with Qi Shiyan saying that “Ah Zheng” was better than the emperor. “It’s normal for Qi Shiyan to hate Ming Qingyu, but he insists on involving His Majesty, which is too much.”",
        "“His Majesty has contributed so much to the empire. Qi Shiyan should show him some respect!”",
        "“His Majesty went to the front lines as soon as he came of age. Those who curse the imperial family should not involve His Majesty!”",
        "… ",
        "However, while some people spoke up for the emperor, others found fault with him. “Did the imperial family’s water army* come to whitewash?”",
        "“The videos of Ming Zheng’s battles against star worms look very impressive, but who knows if the guy in the mecha is someone else?”",
        "“Ming Qingyu’s military exploits are fake, and Ming Zheng’s military exploits may also be fake.”",
        "… ",
        "The imperial family had always had some opinions about Ming Zheng. Over the years, a lot of negative information about Ming Zheng had been posted online.",
        "Although Ming Zheng was a hero in the eyes of many people, there were also some people who were always tirelessly trying to discredit him.",
        "At this time, the water army hired by some members of the imperial family also entered the fray.",
        "In order to avoid drawing public attention to themselves, they had the water army do everything possible to discredit Ming Zheng. ",
        "However, because Jiang Jin’s management was strict, the live broadcast room was still very clean.",
        "There were more and more people shipping CP.",
        "",
        "“Qi Shiyan actually thinks Ah Zheng is better than His Majesty. He really loves Ah Zheng.”",
        "“Qi Shiyan is so amazing, I think only His Majesty is worthy of him, but he only likes Ah Zheng.” ",
        "“I don’t understand, but I give my blessings.”",
        "…",
        "Qi Shiyan took Ah Zheng for a walk outside and collected a lot of plants.",
        "He also picked a few flowers and put them on Ah Zheng’s clothes. “Ah Zheng, you are the best looking person in the world!” ",
        "Ah Zheng was delighted and suddenly said, “You are the best looking.”",
        "“Ah Zheng is the best looking.”",
        "“You are the best looking!”",
        "Qi Shiyan was delighted by Ah Zheng’s praise and suddenly said, “I love you the most.” ",
        "Ah Zheng learned subconsciously. “I love you the most.”",
        "“Yes, you love me the most.” Qi Shiyan was very happy and kissed Ah Zheng’s hand.",
        "Ah Zheng was also happy and kissed Qi Shiyan’s hand.",
        "The two of them returned to the Starlight in a sticky manner, with pink bubbles seemingly coming out of their bodies. ",
        "Lou Jingyue: “…” Single dogs were so miserable!",
        "Qi Shiyan brought back a lot of plants, and then he started to roast meat again. After roasting, he would occasionally feed Ming Zheng a bite, and eat the rest himself.",
        "Lou Jingyue was a talkative person and couldn’t help asking, “Brother Yan, why do you eat so much?”",
        "Qi Shiyan said, “My mental power is strong, so I consume a lot. Xiao Lou, I really envy you. Your mental power is very weak, so you don’t have to eat a lot every day like me.” ",
        "Lou Jingyue: “…” This was definitely not true envy. This was clearly mocking him!",
        "This was too much!",
        "Please visit chrysanthemumgarden (dot) com",
        "With the wild boar provided by Lou Jingyue, Qi Shiyan had no shortage of meat to eat, so he happily accompanied Ming Zheng for the entire day.",
        "By evening, his supernatural powers had recovered to a large extent and he was able to help his Ah Zheng eliminate poison again. ",
        "The mental power that Qi Shiyan had left in Lou Jingyue’s body had already dissipated, so the poison that had been sealed in Lou Jingyue was free again.",
        "At this moment, Lou Jingyue’s face was blue and purple again.",
        "But the blue and purple area was much smaller compared to Ah Zheng.",
        "He didn’t know when Ah Zheng’s skin would revert to normal. ",
        "Qi Shiyan hugged Ming Zheng and helped him eliminate the poison, and then discovered that the skin behind Ming Zheng’s ears had returned to normal.",
        "This was really good news.",
        "Qi Shiyan was in a good mood, but Ming Zheng, who had just become clear-headed, was a little dazed.",
        "Ah Yan had a grudge against the imperial family? ",
        "***",
        "T/N: Wow super long chapter. Not only translating, even editing took forever.",
        "*水军 (shui jun) – literally water army. Internet water armies mean a group of users paid to post comments with a specific goal (e.g. to mislead the public, blacken a certain celebrity, hype up certain topics, etc.)."
    ],
    "previous": "Ch29 - Grudge Against The Imperial Family",
    "next": "Ch31 - High-Level Star Worm"
}