{
    "title": "Ch31 - High-Level Star Worm",
    "content": [
        "Although Ming Zheng had become clear-headed several times now, the amount of time he was clear-headed was not long each time.",
        "In addition, when they first met, he thought he would die sooner or later, so he did not tell Qi Shiyan his identity. ",
        "He didn’t want Qi Shiyan to be afraid of him or alienate him because of his identity.",
        "But this morning, when he learned that he could recover, he began to consider telling Qi Shiyan his identity.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "However, before he could say anything, he learned that Qi Shiyan had a grudge against the imperial family.",
        "Recalling Qi Shiyan’s expression when he spoke, Ming Zheng could be sure that what Qi Shiyan said was true. ",
        "“Ah Zheng, your skin here has returned to normal!” Qi Shiyan reached out and touched the skin behind Ming Zheng’s ear.\n\n",
        "Ming Zheng’s body trembled slightly. He kind of wanted to stick to Qi Shiyan’s hand.",
        "However, he restrained himself and looked at Qi Shiyan again. “Ah Yan, you have a grudge against the imperial family.”",
        "Qi Shiyan nodded affirmatively.\n\n ",
        "Ming Zheng asked, “Can you tell me what the grudge is?”",
        "Qi Shiyan said, “I can’t tell you for now… Ah Zheng, are you related to the imperial family?”",
        "Ming Zheng didn’t say anything.\n\n",
        "Qi Shiyan saw that Ming Zheng didn’t want to talk, so he asked again, “Ah Zheng, what do you think of Ming Qingyu?” ",
        "Ming Zheng said, “I don’t have much impression of him. I just know that he doesn’t really have any ability.”",
        "He really didn’t have much of an impression of Ming Qingyu. In fact, he had never even met this nephew.",
        "After deciding to make the other party the crown prince, he originally planned to meet with the other party through video, but his condition at the time wasn’t good, so in the end, he could only ask Old Four to put on a face-changing mask and meet the other party on his behalf.",
        "After that, Ming Qingyu asked him some questions from time to time, but he similarly didn’t have the energy to answer them, so he asked Lu Yuan to answer for him. ",
        "“He indeed has no real ability.” Qi Shiyan laughed and asked, “Ah Zheng, do you think the imperial family should exist?”",
        "Ming Zheng said, “I think there is no need for the imperial family to exist.”",
        "Ming Zheng had been observing Qi Shiyan the whole time. Through this, he realized that Qi Shiyan’s enemy should be Ming Qingyu.",
        "Before being chosen by him to be the crown prince, Ming Qingyu was very low-key, but he had been a bit high-profile in recent years. ",
        "Did Ming Qingyu do something that hurt Ah Yan?",
        "Ming Zheng felt a little guilty.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "As for the imperial family, he actually felt the same as Qi Shiyan. He thought that the imperial family was a parasite of the empire and there was no need for its existence.",
        "If he hadn’t been poisoned with star worm poison, and he was given enough time, he would definitely find a way to reduce the imperial family’s privileges. ",
        "But now, they were facing a powerful enemy.",
        "Resisting the invasion of star worms had already consumed all his energy. He had no time to fight to the death with the imperial family.",
        "“We have the same idea.” Qi Shiyan hugged Ming Zheng.",
        "He could sense that Ah Zheng had no good feelings toward the imperial family or Ming Qingyu. ",
        "However, his Ah Zheng should have some relationship with the imperial family. He was most likely a guard next to the emperor.",
        "Qi Shiyan carefully looked through the original owner’s memories and suddenly remembered something.",
        "Zing Hingyu once said angrily, “It’s pust a thing from the laboratory. A dog nezt to my uncle really thinks he is something!”",
        "The original owner didn’t know who Zing Hingyu was talking about, nor did he care, but Hi Shiyan felt that the person Zing Hingyu was talking about was most likely his Ah Iheng. ",
        "Ming Zheng was a little amused and helpless when he saw that Qi Shiyan looked like he had found a confidant.",
        "After thinking for a while, he asked, “Ah Yan, what do you think of His Majesty?”",
        "Qi Shiyan saw Ming Zheng’s expression and knew that Ming Zheng didn’t want him to have conflicts with the emperor, so he said, “I don’t know His Majesty, but I have no grudge against him.”",
        "The emperor had always stayed on the front lines, which was better than those imperial family members in the Capital Star who spent their days eating, drinking and having fun. ",
        "Moreover, the emperor was less than 40 years old. Everything his Ah Zheng experienced in his childhood should have nothing to do with the emperor.",
        "Hearing this, Ming Zheng breathed a sigh of relief. It was good that Qi Shiyan’s enemy was not him.",
        "However, Qi Shiyan had complaints about the imperial family, so it would be best to take it slow in explaining his identity to Qi Shiyan.",
        "“Let’s not talk about the imperial family anymore. Ah Zheng, you said before that you like me the most. Can I become your partner in advance?” Qi Shiyan asked. ",
        "Ming Zheng said, “Let’s talk about it after I get better.”",
        "Qi Shiyan said, “Then I will wait. Ah Zheng, you must keep your promise and not abandon me.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng looked at Qi Shiyan deeply.",
        "He would definitely keep his word. He was just afraid that Qi Shiyan would regret it. ",
        "Qi Shiyan was too young, and he spoke sweet words without hesitation. Who knew how much truth there was in them?",
        "However, at this moment, Ming Zheng was more worried about the situation outside.",
        "After he disappeared, Jiang Jin actually didn’t come to find him despite so much time having passed.",
        "Something must have happened outside. It should be that the star worms had launched another attack. Maybe this convalescent planet had been targeted. ",
        "That was why Jiang Jin didn’t come to find him.",
        "But now, the amount of time he was clear-headed was too little and he had no way to contact Jiang Jin, so he couldn’t do anything.",
        "However, if they really encountered a critical situation, Jiang Jin and Lu Yuan would definitely come to find him and send him to the battlefield.",
        "This was what they had agreed on long ago. ",
        "Ming Zheng’s mind was covered with fog again.",
        "Qi Shiyan had brought Ming Zheng to the airship before giving him treatment.",
        "As for Lou Jingyue, he was outside alone, roasting a rabbit.",
        "For three meals today, Lou Jingyue had eaten rabbit. ",
        "Only then did he realize that he had been unaware of the blessings he had before.",
        "The food in the sanatorium was still delicious, but the meat he roasted himself was really bad.",
        "He now ate roasted rabbit simply to stay alive.",
        "Why wouldn’t his Brother Yan give him a piece of roasted meat? ",
        "Lou Jingyue eagerly watched as the door of the airship opened, and then he saw his Brother Yan coming out with his boyfriend named “Ah Zheng”.",
        "Throughout the day, Lou Jingyue had never seen the two of them separate!",
        "Please visit chrysanthemumgarden (dot) com",
        "This was too lovey-dovey. When his dad came home occasionally, he was also lovey-dovey with his mom, but even those two wouldn’t act like this.",
        "Lou Jingyue was just thinking about this when he saw Qi Shiyan and Ming Zheng starting to roast meat again. ",
        "How could they eat so much?",
        "The audience noticed Lou Jingyue’s expression and laughed. “Xiao Lou’s expression is so interesting!”",
        "“He’s been grumbling all day today, hahahaha.”",
        "“The funniest thing is that he has always been craving the meat that Qi Shiyan roasted… Research shows that mental power cannot remove the gamey taste of wild boar meat, so the wild boar meat that Qi Shiyan eats is actually no different from what he ate at the beginning.” ",
        "“I really want Qi Shiyan to give him a bite of roasted meat, so that he can know how bad Qi Shiyan’s roasted meat tastes!”",
        "…",
        "The regular audience members were happily watching the fun, but those with ulterior motives couldn’t sit still.",
        "Especially those imperial family members. ",
        "After being exposed by Madam Ming and Qi Shiyan one after another, they were overwhelmed and hated Ming Qingyu at the same time.",
        "If Ming Qingyu had treated Qi Shiyan well, how could Qi Shiyan blab out everything they had done?",
        "Prince Renhe originally wanted to help his son, but in the live broadcast, Qi Shiyan mentioned a lot of bad things he had done. He couldn’t even take care of himself and didn’t care about Ming Qingyu.",
        "He had no shortage of sons, and what was more, Ming Qingyu could no longer become the emperor. ",
        "Those from the military had already cut off all ties with Ming Qingyu. Without the support of the military, it would be a dream for Ming Qingyu to ascend the throne in this lifetime.",
        "However, the person Prince Renhe hated the most was Qi Shiyan.",
        "He negotiated with the military several times, trying to get them to stop the live broadcast, but unfortunately the military ignored him.",
        "He could only hire a water army to attack Qi Shiyan and “Ah Zheng” online. ",
        "Compared to Prince Renhe, Ming Jin did a lot more.",
        "He wanted to bring Ming Qingyu down. This matter had already been successful.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But he never expected that Qi Shiyan could actually help people eliminate star worm poison.",
        "Qi Shiyan couldn’t be allowed to live! ",
        "Ming Zheng couldn’t be allowed to live either!",
        "Ming Jin took a look at the information his subordinates had collected for him.",
        "Now, everyone in the imperial family thought that “Ah Zheng” was one of the three children who came out of the laboratory and were taken away from the imperial family by Ming Zheng.",
        "The mental power of those three children had all reached S-level. It was said that they had been hiding their identities and staying by Ming Zheng’s side to help Ming Zheng with various matters. ",
        "It wouldn’t be surprising if Ah Zheng was one of them.",
        "But he felt that this person was not one of those three children.",
        "This Ah Zheng was most likely Ming Zheng.",
        "Ming Jin replayed the live broadcast and became more certain of this matter. ",
        "It was no big deal if Qi Shiyan and Ming Zheng were affectionate, but if Qi Shiyan cured Ming Zheng, then what was the point of him?",
        "In particular, he could see that Ming Zheng was sincere when he said that the imperial family had no reason to exist.",
        "They must die.",
        "Why were those star worms so slow to take action? ",
        "The star worms were not slow in taking action.",
        "The star worms were a peculiar race.",
        "They respected the star worm Queen Mother, and no matter whether they were high-level star worms, intermediate-level star worms or low-level star worms, they couldn’t disobey the orders of the star worm Queen Mother.",
        "They also had a special way of communicating. ",
        "As soon as Qi Shiyan’s live broadcast began, the star worm Queen Mother had already received the news. She immediately realized that those who were poisoned by the star worm poison were hiding on the convalescent planet.",
        "The star worm Queen Mother launched a new wave of attacks to attract the attention of the military. She also sent a high-level star worm that was good at hiding to go to that planet to gather information.",
        "Please visit chrysanthemumgarden (dot) com",
        "Later, realizing that the situation was not right, she arranged for other high-level star worms to go to the convalescent planet.",
        "However, it took time to get there. Therefore, right now, only the first high-level star worm that was good at hiding had come to the vicinity of the convalescent planet. ",
        "The Human Empire had many devices for detecting star worms.",
        "The energy reaction in the body of a high-level star worm was very big, and thus they were easier to detect.",
        "This high-level star worm was good at hiding, but it still couldn’t avoid detection.",
        "In order to successfully enter the convalescent planet, it vomited out its own internal organs and put itself into a low-energy dormant state. ",
        "Afterward, it avoided Jiang Jin’s spaceship, landed on the convalescent planet, and slowly approached Qi Shiyan and the others.",
        "Qi Shiyan was currently eating wild boar meat.",
        "He gave the meat that didn’t have such a strong gamey taste to his Ah Zheng, and ate the meat that wasn’t so tasty himself.",
        "Anyway, he wasn’t picky. ",
        "While eating meat, Qi Shiyan would occasionally gnaw on some wild grass, or put the wild grass in a pot and stir-fry it with lard.",
        "If the grass tasted good, he would give it to Ming Zheng, and if the grass tasted bad, he would eat it himself.",
        "No matter how bad it tasted, he loved to eat it.",
        "However, after eating too much, Qi Shiyan still wanted to switch up the flavor. ",
        "Thinking of this, he looked at Lou Jingyue. “Xiao Lou.”",
        "“Brother Yan, what instructions do you have?” Lou Jingyue asked immediately.",
        "Qi Shiyan said, “Xiao Lou, deer meat is better than rabbit meat. You can go catch a deer tomorrow and roast it to eat. Catch one for me as well.”",
        "“Brother Yan, when you are roasting meat, can you help me roast some as well?” Lou Jingyue asked. ",
        "Qi Shiyan said, “No.”",
        "Lou Jingyue was very disappointed. “Brother Yan, you are so strong. Why are you still being controlled by your partner? You should be tougher!”",
        "",
        "Qi Shiyan said, “I just like being controlled by him… Wait, prey is coming!”",
        "Qi Shiyan suddenly sensed something approaching. ",
        "That thing gave him a sense of danger. It should be a powerful prey.",
        "He didn’t know if it would taste good or not."
    ],
    "previous": "Ch30 - Conjecture",
    "next": "Ch32 - Very Delicious"
}