{
    "title": "Ch32 - Very Delicious",
    "content": [
        "Toward Qi Shiyan, Lou Jingyue had the feeling of hating iron for not becoming steel*.",
        "How could Qi Shiyan, a big boss with such strong mental power, be a love-brained fool? ",
        "Wasn’t “Ah Zheng” just jealous? Qi Shiyan actually didn’t even dare to give him meat to eat. How could a real man be like this?",
        "Lou Jingyue kept complaining in his heart, and at the same time, he drooled while looking at the roasted meat in Qi Shiyan’s hand.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "But he forgot that a real man wouldn’t constantly be thinking about eating a bite of someone else’s roasted meat all day long.",
        "At this moment, Lou Jingyue noticed that Qi Shiyan suddenly stopped moving. ",
        "He was even more anxious than Qi Shiyan. “Brother Yan, your meat is going to burn!”\n\n",
        "Qi Shiyan ignored Lou Jingyue. He was concentrating on the prey that was suddenly approaching.",
        "The prey in this forest were very smart. When he took Ah Zheng out hunting before, there would inevitably be some noise as they walked forward, and then those prey would all quickly run away.",
        "If he was alone, he could chase them, but he was holding Ah Zheng’s hand, so he could only watch helplessly as the prey ran away.\n\n ",
        "Now it was great. Prey had delivered itself to their doorstep.",
        "Qi Shiyan was a little excited. He stuffed the almost burnt meat into his mouth and then used all his mental power.",
        "He had previously speculated that Lou Jingyue’s abilities were probably exaggerated.\n\n",
        "Look now. Lou Jingyue kept saying that he was very powerful, but it turned out that his mental power was about the same as a prey that came to their doorstep. ",
        "The mental power of this prey was really quite strong, but not as strong as his. Moreover, this prey should be seriously injured and was very weak.",
        "In short, it was easier to kill than imagined.",
        "After Qi Shiyan finished killing it, he looked at Lou Jingyue and said, “Xiao Lou, a very ferocious prey was just lurking nearby. Fortunately, I discovered it in time and killed it… It’s over there. Go over there and help me bring my prey back.”",
        "It was dark now, and it was pitch black outside, except for the area where the Starlight was parked, which was still very bright. ",
        "Lou Jingyue looked in the direction Qi Shiyan pointed, but didn’t see anything, nor could he sense anything.",
        "But he trusted Qi Shiyan very much. “Okay, I’ll go right away!”",
        "The people watching the live broadcast laughed when they saw this. “Young General Lou has become a complete lackey.”",
        "“Qi Shiyan has made Young General Lou run around in circles all day.” ",
        "“If this continues, Young General Lou, who doesn’t know how to do anything, will be trained to be a qualified nanny sooner or later.”",
        "“Qi Shiyan’s life is quite comfortable. All he does all day is eat and spend time with Ah Zheng.”",
        "",
        "…",
        "Some people were also curious about what prey Qi Shiyan had killed. ",
        "“Qi Shiyan said that there was a very ferocious prey nearby… Could it be that he killed a tiger?”",
        "“No, tigers are so cute. Don’t kill them!”",
        "“I suddenly realized that Qi Shiyan is quite good at joking. He deliberately lied to Young General Lou before, making him think that the roasted meat he makes is delicious. Now he’s killed a prey and says that the prey is very ferocious.”",
        "“Yes, but don’t all the animals on this planet appear like little cuties in front of him? The tiger before was so well-behaved that its name was Xiao Guai.” ",
        "…",
        "The comments were pust beginning when suddenly, from the darkness in the distance, there was a cry of surprise. Then, Oou Aingyue rushed out. “Star worms are coming! It’s a star worm!”",
        "“Is that a star worm? Wiao Oou, why are you so anzious? Isn’t it dead?”",
        "Oou Aingyue heaved a sigh of relief. “Gead?” ",
        "“It’s dead. I just killed it.”",
        "“So it’s dead. No wonder it didn’t come to chase me. That star worm looked a bit like a high-level star worm to me. It almost scared me to death.” Lou Jingyue said.",
        "He had fought against high-level star worms, but he had a mecha at that time!",
        "Now he saw a high-level star worm with empty hands. The fact that he was not scared to death was already a sign of his strong heart. ",
        "Qi Shiyan used his mental power to comfort him. “I didn’t expect that thing to be a star worm. It looks different from the star worms I’ve seen before.”",
        "Lou Jingyue explained, “There are many types of star worms. New breeds of star worms also appear from time to time. I don’t think anyone in this world can recognize all of them. In fact, I’ve never seen that star worm before, but it looked a bit like a high-level star worm.”",
        "“It shouldn’t be a high-level star worm. High-level star worms aren’t so weak.” Qi Shiyan said.",
        "Lou Jingyue said, “I’ll go take another look.” ",
        "Lou Jingyue plunged into the darkness.",
        "Everyone watching the live broadcast was stunned. “A star worm? The prey Qi Shiyan was talking about is a star worm?”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Lou Jingyue shouldn’t have seen it wrong.”",
        "“Wasn’t it said that the convalescent planet is very safe? How could there be star worms?” ",
        "…",
        "Jiang Jin was also surprised. He jumped up from his seat with a look of disbelief on his face. “How could there be star worms?”",
        "He was prepared for the star worms to launch a sneak attack on the convalescent planet. He also wanted to take this opportunity to kill a few high-level star worms.",
        "But he didn’t plan to let the star worms enter the convalescent planet. ",
        "He had set up a lot of detection devices outside, hoping to block the star worms outside the convalescent planet. Who would have thought that when he wasn’t paying attention, star worms had already entered the convalescent planet.",
        "Fortunately, the one that snuck into the convalescent planet should be an intermediate-level star worm, and Qi Shiyan killed the star worm easily.",
        "With His Majesty here, even if high-level star worms came, they could be killed. But His Majesty was delirious right now and might not be able to distinguish between friend and foe during combat. That would be terrible!",
        "Jiang Jin took a deep breath and immediately called the Capital Star. “Have the information and evidence been sorted out? Arrest Ming Qingyu immediately for leaking military secrets.” ",
        "The imperial family had many privileges. It was very difficult to arrest a member of the imperial family even if they committed a crime.",
        "In the past, there was a case where a member of the imperial family suddenly killed someone in public and the evidence was solid. As a result, the person was not arrested until a month later.",
        "Ming Qingyu was now charged with many crimes, such as attempting to murder Qi Shiyan. But he firmly denied all charges, so it was difficult for them to arrest him.",
        "Even if they found evidence, Ming Qingyu could refuse to accept the interrogation and wait for the trial to start at home. ",
        "However, the situation was different when it came to leaking military secrets.",
        "Ming Qingyu would definitely be arrested!",
        "After Jiang Jin finished doing this, he continued to watch the live broadcast. Then he saw Lou Jingyue dragging a big guy out from the nearby forest.",
        "That thing was several times bigger than a wild boar, and Lou Jingyue was panting as he dragged it. ",
        "It was soft and looked a bit like a sea cucumber. Even though it was obviously dead, its skin could actually still change color, like a chameleon.",
        "“Brother Yan, this is the first time I’ve seen this kind of star worm!” Lou Jingyue was a little excited. “Let’s hand it over to the research institute. The institute will give us contribution points!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The people watching the live broadcast were also very excited. “It’s really a star worm!”",
        "“This star worm is definitely something I have never seen before.” ",
        "“Qi Shiyan is really amazing. He killed a star worm without anyone even realizing it was there.”",
        "…",
        "Qi Shiyan stared at the star worm for a while, and suddenly asked, “Is this star worm delicious?”",
        "Lou Jingyue was extremely shocked. “Brother Yan, star worms are poisonous. They can’t be eaten!” ",
        "High-level star worms contained star worm poison, which was untreatable. Everyone was afraid of them and no one would eat them.",
        "Low-level and intermediate-level star worms generally didn’t have such high-level poison in their bodies, but they did have other kinds of poison and also couldn’t be eaten.",
        "Qi Shiyan said, “I took a look, and there are many places in its body that contain poison, including a poison sac, but there seems to be no poison in its flesh.”",
        "“Even if there’s no poison, it’s still a star worm! Brother Yan, this thing is so disgusting. Do you really want to eat it?” Lou Jingyue asked with a conflicted expression. ",
        "Qi Shiyan said, “Such a big piece of meat should not be wasted. There’s nothing wrong with trying it.”",
        "Lou Jingyue: “…”",
        "Qi Shiyan added, “Don’t worry, I won’t have you eat it. Just help me deal with it.”",
        "Lou Jingyue wanted to continue persuading him. “Brother Yan…” ",
        "Qi Shiyan said, “Go and deal with it quickly.”",
        "Lou Jingyue could only go deal with the star worm.",
        "While dealing with it, he discovered that the skin of this star worm was a bit thick.",
        "Fortunately, when he left the sanatorium, he took a lot of expensive equipment with him. He was able to barely break through the star worm’s defensive skin with his particle knife. ",
        "Lou Jingyue worked hard while occasionally letting out grunts.",
        "The top military officials focused the live broadcast camera on this star worm, but the more they watched, the more they felt something was wrong.",
        "Please visit chrysanthemumgarden (dot) com",
        "Wait, wait, this star worm didn’t seem to be an intermediate-level star worm.",
        "Why did it look so much like the highly hidden high-level star worm “color-changing worm” that they had encountered before but had never been able to kill? ",
        "Lou Jingyue also said, “Brother Yan, this star worm is very similar to the dreaded color-changing worm. The color-changing worm is very good at hiding, and can often bypass the military’s detection equipment and attack us. However, the color-changing worm is much larger than this, and the color-changing worm is a high-level star worm, which is very difficult to kill. When His Majesty encountered the color-changing worm before, he unfortunately wasn’t able to kill it.”",
        "“Then it should be a low-end version of the color-changing worm. Maybe it’s an intermediate-level star worm born from the color-changing worm and another star worm.” Qi Shiyan said.",
        "The star worm Queen Mother would give birth to star worms, and star worms and star worms could also reproduce together.",
        "So there were a lot of strange star worms. ",
        "Ming Zheng was sitting nearby, tilting his head to look at the big star worm. He felt that it looked somewhat familiar.",
        "“Ah! It has a wound here!” Lou Jingyue suddenly discovered that there was an old wound on the star worm.",
        "He used his knife to cut at the wound and found that it took much less effort.",
        "So he began to dissect the worm along the wound. ",
        "At this moment, Lu Yuan was going crazy. “This is a color-changing worm! The same color-changing worm that His Majesty encountered before! This wound was left by His Majesty!”",
        "“High-level star worms have actually appeared on the convalescent planet!”",
        "“How could a high-level star worm die just like that?!”",
        "… ",
        "Qi Shiyan didn’t know that Lu Yuan was going crazy.",
        "Seeing that Lou Jingyue had already cut open a large area of ​​the star worm’s skin, revealing the snow-white flesh inside, he said, “Cut a piece of meat for me to taste first.”",
        "Lou Jingyue asked, “Brother Yan, do you really want to eat?”",
        "“En, I’ll try it.” Qi Shiyan said. ",
        "Lou Jingyue hesitated for a moment, but finally cut off a palm-sized piece of meat and placed it in front of Qi Shiyan.",
        "Qi Shiyan had been frying wild boar meat in a frying pan, so there was a lot of lard in the pan.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He put the piece of meat in the lard, and soon, a tempting aroma wafted out.",
        "Qi Shiyan couldn’t help swallowing his saliva. He had never smelled such a fragrant smell! ",
        "This piece of meat was not thick and cooked quickly. Qi Shiyan picked it up with chopsticks and took a small bite.",
        "He wanted to see if the meat was poisonous.",
        "The meat was not poisonous and contained a large amount of energy.",
        "Most importantly, it was really delicious! ",
        "What the hell was that wild boar meat he had eaten before?!",
        "This meat was what was considered really delicious!",
        "The lard even ruined its delicious taste!",
        "Star worms were actually so delicious?! ",
        "Qi Shiyan was very excited. “It’s delicious, so delicious! Xiao Lou, cut me another piece of meat, and then quickly process the whole thing. Don’t waste the internal organs and other parts!”",
        "Lou Jingyue: “…” He even had to process the internal organs of the star worm? He didn’t want to do this!",
        "What shocked him the most was that Qi Shiyan actually ate star worm meat.",
        "As expected of someone from the Chaotic Zone. He even dared to eat star worm meat. ",
        "However, after the star worm meat was fried, it smelled really delicious and he also wanted to have a bite.",
        "Shaking the terrible thoughts from his mind, Lou Jingyue cut a piece of meat for Qi Shiyan and started to process the rest of the star worm.",
        "Then he discovered that this star worm had no internal organs.",
        "This saved him a lot of trouble. This star worm was pretty good. ",
        "***",
        "T/N: *恨铁不成钢 (hen tie bu cheng gang) – hating iron for not becoming steel. An idiom that means to feel resentful toward someone for failing to meet expectations.",
        "Please visit chrysanthemumgarden (dot) com"
    ],
    "previous": "Ch31 - High-Level Star Worm",
    "next": "Ch33 - Countdown Three Days"
}