{
    "title": "Ch33 - Countdown Three Days",
    "content": [
        "The first piece of star worm meat was not big, so Qi Shiyan did not share it with Ming Zheng, and instead ate it in two or three bites himself.",
        "After eating, his face was full of emotion. ",
        "This star worm was really great!!",
        "Not only did it taste good, but because it was rich in energy, it could also quickly restore his supernatural powers.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Not long ago, Qi Shiyan had just helped Ming Zheng eliminate some poison, thus using up almost all of his body’s supernatural powers.",
        "But now, he could clearly feel that the supernatural powers in his body were recovering rapidly. ",
        "Qi Shiyan looked at the star worm being dismembered by Lou Jingyue not far away, his eyes sparkling.\n\n",
        "The audience in the live broadcast room couldn’t help but shudder after seeing Qi Shiyan’s eyes. “Aren’t Qi Shiyan’s eyes a little too hot?”",
        "“Judging by his appearance, it seems star worms are delicious?”",
        "“He thinks everything he eats is delicious. I’m curious, are star worms really edible?”\n\n ",
        "“I’ve studied star worms. Star worms can’t be eaten! They’re poisonous!”",
        "“Then how come Qi Shiyan can eat them?”",
        "…\n\n",
        "The military was also a little overwhelmed. ",
        "They had just confirmed that the star worm killed by Qi Shiyan was the color-changing worm recorded in their files.",
        "This high-level star worm was good at hiding and was also very fast. Although its combat power was not high, it was very difficult to deal with.",
        "Before, only His Majesty had injured this star worm when he went crazy and launched indiscriminate attacks.",
        "Unexpectedly, such a powerful high-level star worm was actually killed by Qi Shiyan so easily. ",
        "This was shocking enough for them, but then something even more shocking happened.",
        "Qi Shiyan actually ate star worm meat.",
        "Lu Yuan started to go crazy again. “Why does he eat everything?”",
        "“How come he even eats star worm meat?!” ",
        "“Is he that greedy? Star worm meat is poisonous!”",
        "…",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Next to Lu Yuan, a tall man with a stern face said, “Star worm meat may not be poisonous.”",
        "Lu Yuan finally calmed down a little, and immediately contacted a researcher he knew who specialized in studying star worms, asking if star worm meat could be eaten. ",
        "There were all kinds of low-level and intermediate-level star worms. Some star worms had no meat at all, some star worms stunk all over, and some star worms had poisonous flesh…",
        "Basically, they were all inedible, and no one would ever think of eating them.",
        "As for high-level star worms, there were not many research samples.",
        "“Adjutant Lu, the star worm poison of high-level star worms is mainly contained in their poison sacs. Fighting them causes poisoning because their poison sacs release poison during battle. When they die, their poison sacs will shatter, and their entire bodies will become poisonous, making them inedible.” The researcher from the research institute replied. ",
        "“Now that Qi Shiyan has eaten it, will anything go wrong?”",
        "“Adjutant Lu, don’t worry. Qi Shiyan used his mental power to directly kill the high-level star worm. There was no fight between the two sides. The poison sac of the high-level star worm should not have been broken. In other words, the meat they’re eating should not contain poison.”",
        "Lu Yuan breathed a sigh of relief when he heard this.",
        "As long as it wasn’t poisonous! ",
        "However, was star worm meat really that delicious?",
        "Hi Shiyan actually ate until tears welled up in his eyes and looked happy to the point that he looked like he was about to ascend to heaven.",
        "Hi Shiyan was indeed very happy.",
        "After eating the star worm meat, he felt full of energy and felt better than ever. ",
        "“Xiao Lou, help me wash the frying pan.” Qi Shiyan shouted.",
        "The lard in the frying pan was not worthy of his star worm meat!",
        "Lou Jingyue didn’t want to wash it. “Why do you make me do all the work?”",
        "Qi Shiyan said, “If it weren’t for me, you might have been killed by the star worm just now.” ",
        "Lou Jingyue wanted to say that he was very powerful, but he quickly realized that the mental power he could mobilize now was only B-level.",
        "This star worm had been lurking nearby and he hadn’t noticed it at all!",
        "Please visit chrysanthemumgarden (dot) com",
        "If Qi Shiyan hadn’t taken action, he might really have been eaten by this star worm.",
        "Lou Jingyue left the half-processed star worm corpse behind and went to help Qi Shiyan wash the frying pan. ",
        "As for Qi Shiyan, he cut the piece of star worm meat that Lou Jingyue gave him into thick slices the size of steaks, preparing to fry them later.",
        "“Ah Zheng, this star worm meat is very delicious and good for your health. You should eat more later.” Qi Shiyan said.",
        "Ming Zheng nodded obediently, his face full of anticipation.",
        "The fried meat just now smelled particularly delicious and he wanted to eat it too. ",
        "Lou Jingyue quickly washed the frying pan, handed it to Qi Shiyan, and then went back to work on processing the star worm.",
        "He hated the star worms to his core and always wanted to kill them all, but in this life, he no longer had the chance to go to the battlefield.",
        "Now, it felt pretty good to extract the tendons and peel the skin off a star worm.",
        "Qi Shiyan heated the pan, poured in some vegetable oil, and then put the star worm meat slices in. ",
        "The tempting fragrance wafted out immediately.",
        "Without the strange smell of lard, this star worm meat was really fragrant!",
        "After the meat was fried, Qi Shiyan put it on a plate and cut it into pieces. Then he picked up a piece of meat with chopsticks and delivered it to Ming Zheng’s mouth.",
        "Ming Zheng opened his mouth and ate the piece of meat with an expression of disbelief on his face. ",
        "“Ah Zheng, is this meat very delicious?”",
        "“Ah Zheng, this is the most delicious meat I have ever eaten. I must find a way to get more star worms to eat in the future!”",
        "“Ah Zheng, this meat is good for your health. You should eat more.”",
        "… ",
        "Qi Shiyan had long discovered that Ming Zheng’s body was seriously deficient.",
        "Star worm meat was rich in energy and was beneficial for Ming Zheng.",
        "",
        "Ming Zheng nodded repeatedly, his eyes fixed on the star worm meat. “It’s really, really delicious!”",
        "“Yeah, it’s really delicious!” Qi Shiyan said with a smile. ",
        "The two of them ate happily, taking turns eating. Not far away, Lou Jingyue smelled the fragrance wafting in the air, and felt uncomfortable as if his heart was being tormented.",
        "He had been eating tasteless rabbit meat for two days!",
        "He had always thought that star worms were disgusting and didn’t want to eat star worm meat.",
        "But Brother Yan was eating so happily… ",
        "“Brother Yan, can you give me some to try?”",
        "Qi Shiyan said, “No, if you want to eat it, go and roast it yourself.”",
        "“Brother Yan, you are too ruthless.”",
        "“It’s enough that I am affectionate toward my family’s Ah Zheng.” Qi Shiyan said. ",
        "When Ming Zheng heard this, he looked at Lou Jingyue triumphantly.",
        "Lou Jingyue felt that Ming Zheng’s smug look was particularly annoying.",
        "Ah, he would also find a boyfriend one day!",
        "Wait, he didn’t like men. He should find a girlfriend. ",
        "Lou Jingyue cut a piece of star worm meat and planned to roast it and eat it himself.",
        "Qi Shiyan saw this and said, “Don’t roast it directly. Cook it in some water. This meat is not suitable for roasting.”",
        "“Isn’t this meat delicious if it’s roasted?” Lou Jingyue went to get another frying pan. “Then I’ll fry it too.”",
        "Qi Shiyan said, “You can’t.” ",
        "Lou Jingyue was puzzled. “Why?”",
        "Qi Shiyan sighed. “There is not much oil left. I can’t give you any.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lou Jingyue couldn’t help but complain. “Brother Yan, aren’t you too stingy?”",
        "Qi Shiyan said, “If you think I’m stingy, don’t use my pot and salt.” ",
        "Lou Jingyue immediately said, “Brother Yan, you are generous. You are the most generous!”",
        "Lou Jingyue took the pot and left. As for Qi Shiyan, his Ah Zheng pinched his cheek.",
        "Qi Shiyan pretended to feel pain on his face. “It hurts! It hurts! Ah Zheng, I was wrong. I shouldn’t have talked to others.”",
        "He was really wronged. He didn’t even call Lou Jingyue over to touch his head or anything, but his partner was still jealous. ",
        "But he really liked Ming Zheng’s jealous look. It was a happy thing to be regarded as extremely important by others.",
        "Qi Shiyan grabbed Ming Zheng’s hand and kissed it.",
        "Ming Zheng was happy again. He looked eagerly at the star worm meat in front of him, waiting for Qi Shiyan to feed him.",
        "On the other side, Lou Jingyue boiled a pot of water, added salt and MSG, and then cut a piece of star worm meat and threw it in. ",
        "After cooking the meat for a while, he estimated it was done cooking, so he took it out and ate it.",
        "So tender! There was also a special flavor. The taste was really good.",
        "Lou Jingyue threw a lot of meat into the pot and continued eating.",
        "As he ate, he said in confusion. “Brother Yan, I don’t know what’s going on. This star worm meat tastes better and better the more I eat, and it seems like I can’t stop.” ",
        "“That’s how it is.” Qi Shiyan said.",
        "“It won’t make people addicted to eating it, right?” Lou Jingyue was a little worried.",
        "Qi Shiyan said, “You’re overthinking it. You can’t stop eating it because it’s rich in energy. You’ve been poisoned by star worm poison and your body is deficient. Star worm meat can help replenish your body, so your body automatically craves it.”",
        "This was just Qi Shiyan’s speculation, but he felt that his speculation was correct. ",
        "Anyway, there was nothing addictive in star worm meat.",
        "Thinking of this, Qi Shiyan said, “I don’t know when another star worm will come…”",
        "Please visit chrysanthemumgarden (dot) com",
        "Lou Jingyue also said, “Yes!” This star worm was really big, several times the size of a wild boar. In addition, the Starlight had a preservation function, so this star worm should be able to be eaten for several days.",
        "But it couldn’t withstand Qi Shiyan’s ability to eat! ",
        "Lou Jingyue felt that if Qi Shiyan continued to eat at this pace, the star worm would be completely eaten up in less than two days.",
        "Qi Shiyan was obviously very thin. How could he eat so much? This wasn’t scientific!",
        "The audience was also curious about how Qi Shiyan could eat so much.",
        "“Has anyone calculated how much Qi Shiyan has eaten today?” ",
        "“It’s not much, just half a wild boar. En, that’s all.”",
        "“Help! He ate half a wild boar and now he’s eating so much star worm meat. Is his stomach connected to the sea?”",
        "“People with strong mental power are so awesome? Why can’t my mental power be stronger? If my mental power was strong enough, I could eat more.”",
        "… ",
        "The ordinary audience’s focus was all on trivial matters, but Jiang Jin and various military personnel were discussing what to do next.",
        "A high-level star worm actually appeared on the convalescent planet. This was too dangerous!",
        "Should they take His Majesty and Qi Shiyan away? Or should they send people to protect His Majesty?",
        "However, at this moment, the star worm’s offensive against the Human Empire suddenly intensified. ",
        "Traces of star worms also appeared near the convalescent planet. Fortunately, for the time being, only low-level and intermediate-level star worms attacked the fleet near the convalescent planet. So far, no high-level star worms had appeared.",
        "There were not many high-level star worms and they usually stayed by the side of the star worm Queen Mother. If they wanted to come over, it would take time.",
        "So now, did they need to stop the live broadcast and transfer the people away from the convalescent planet?",
        "“This live broadcast can boost military morale and also let the public know the situation on the front lines. I suggest keeping it,” Jiang Jin said. ",
        "The fact that Qi Shiyan helped His Majesty eliminate the star worm poison and the fact that he ate star worm meat had greatly boosted the morale of the army.",
        "Now, who knew how many soldiers and generals were rejoicing.",
        "",
        "In addition, this live broadcast also allowed the public to understand the situation on the front lines.",
        "The Human Empire was too large. Most of the habitable planets in the empire, including the Capital Star, had never been attacked by star worms. ",
        "The people on those planets had no understanding of the war on the front lines and were unwilling to join in the fighting.",
        "The vast majority of the soldiers and generals now fighting on the front lines came from planets that were once invaded by star worms.",
        "Jiang Jin had always felt that the people should be informed of the battle situation on the front lines and know what His Majesty and the front line generals had paid.",
        "The discussion did not last long, and soon everyone was busy fighting. ",
        "Only after fighting for a period of time and then being relieved by other soldiers and generals would they have time to watch the live broadcast.",
        "It was already dark, and Qi Shiyan had already eaten a lot of star worm meat.",
        "He had been using his supernatural powers since he was born. Before, he just felt that his supernatural powers were not enough, but now, he felt that his supernatural powers were full to the point of overflowing.",
        "The effect of this star worm meat was so great that after he ate it, all his supernatural powers were restored in just two hours. ",
        "His body was actually also deficient, but now, those deficiencies were being healed by the energy brought by the star worm meat.",
        "Qi Shiyan’s organs were working rapidly to digest the abundant energy in his body, and he inevitably felt a little excited.",
        "“Ah Zheng, this star worm meat is amazing. I think I can cure you in another three days.” Qi Shiyan grabbed Ming Zheng’s hand and kissed it.",
        "Lou Jingyue was eating star worm meat nearby, and was stunned when he heard this. “Brother Yan, what did you say?” ",
        "***",
        "T/N: Bonus chapter for a and Danypooh. Thanks for the ko-fis!"
    ],
    "previous": "Ch32 - Very Delicious",
    "next": "Ch34 - Confession Successful"
}