{
    "title": "Ch34 - Confession Successful",
    "content": [
        "In three days, Qi Shiyan could cure Ming Zheng? What?",
        "Lou Jingyue had spent a lot of time with Qi Shiyan and Ming Zheng in the past two days. He could see that Ming Zheng was very well taken care of. Apart from the poisoning, he had no other health problems. ",
        "What Qi Shiyan meant was that he could help Ming Zheng eliminate the poison in his body?",
        "Impossible, absolutely impossible!\n",
        "",
        "The military had spent so much money on research, and His Majesty had even spent all the dividends given to him by the imperial family every year, but they still couldn’t figure out a way to eliminate the star worm poison.",
        "Even if Qi Shiyan’s mental power was very strong, he should only be able to suppress the star worm poison, and shouldn’t be able to eliminate it. ",
        "Qi Shiyan turned his head when he heard Lou Jingyue’s words. “I said I could cure my family’s Ah Zheng within three days. Alas, Ah Zheng is too deeply poisoned, so the treatment is taking a long time.”\n\n",
        "Lou Jingyue’s expression was dull. “Brother Yan, you can’t say such nonsense.”",
        "“I’m not talking nonsense,” Qi Shiyan said, “I’m going to sleep now. You should go back and rest too.”",
        "Ming Zheng ate too much energy-rich star worm meat and felt a little drowsy, so he leaned on Qi Shiyan.\n\n ",
        "Qi Shiyan planned to take him to rest and also help him eliminate the poison.",
        "This time, his supernatural powers had completely recovered, so he would definitely be able to help his Ah Zheng eliminate a lot of poison!",
        "“Brother Yan, wait a minute, Brother Yan, can you really help people eliminate the star worm poison?” Lou Jingyue rushed toward Qi Shiyan without thinking.\n\n",
        "He used to be a favored child of heaven, but ever since he was poisoned by the star worm poison, his mental power dropped to B. In fact, it was even difficult for him to maintain it at B. ",
        "If the sanatorium hadn’t been taking good care of him, his mental power would have long dropped to C and his body would have collapsed.",
        "Now, although he was still alive and well, he knew that his body would slowly deteriorate sooner or later.",
        "In the sanatorium, there were several people on the verge of death, including the partner of the marshal of the Second Legion.",
        "If Qi Shiyan really had a way to eliminate the star worm poison… ",
        "Before Lou Jingyue could pounce on Qi Shiyan, he was kicked away by Ming Zheng.",
        "Qi Shiyan felt a little regretful. He originally wanted to take action himself. He planned to put his hand on Lou Jingyue’s face and pinch his chubby face.",
        "It looked like it would feel good to pinch.",
        "But it didn’t matter if he didn’t get to pinch. His partner’s face must feel better to pinch. ",
        "“Yes.” Qi Shiyan answered lazily.",
        "Lou Jingyue, who was kicked away by Ming Zheng, rolled over and got up. “Brother Yan, Brother Yan, you are my god! Brother Yan, can you help treat me?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Of course Qi Shiyan could help treat Lou Jingyue.",
        "He said this in front of Lou Jingyue because he planned to treat Lou Jingyue after helping his family’s Ah Zheng eliminate the star worm poison. ",
        "Since he used the original owner’s body, he must help avenge the original owner.",
        "But the original owner’s enemy was Ming Qingyu, and behind Ming Qingyu stood the entire imperial family…it would not be easy to avenge this grudge.",
        "He had to seek external aid.",
        "Lou Jingyue’s marshal father was a very good external aid. ",
        "If he helped Lou Jingyue eliminate the star worm poison, Marshal Lou would definitely stand on his side.",
        "In addition to Lou Jingyue, he would also help treat the people in the sanatorium.",
        "Those were all high-ranking military generals. Sven if they had retreated from the battlefield due to poisoning, they should still have some connections.",
        "They were also very strong. ",
        "With their help, it would be much easier for him to seek revenge on Zing Hingyu.",
        "“It depends on your performance.” Hi Shiyan said.",
        "“Brother Yan, I will definitely perform well! If you tell me to go east, I will never go west!” Lou Jingyue patted his chest and promised.",
        "“Okay, let’s go and rest first.” Qi Shiyan hugged his future partner and entered the airship. ",
        "Lou Jingyue sat down on the ground, a little dazed.",
        "Could Brother Yan really cure him?",
        "The door of the Starlight was closed, and only Lou Jingyue was left outside.",
        "Lou Jingyue originally should have gone back to his airship to sleep, but he was so excited. How could he sleep? ",
        "Plus, today he encountered a star worm…",
        "Everyone in the military knew that when they discovered a star worm in a place, it meant that there was a group of star worms hidden in that place.",
        "",
        "If he wasn’t poisoned, he would have dared to go anywhere, but he was poisoned.",
        "Lou Jingyue didn’t dare to stray too far away from the Starlight. He gritted his teeth and simply lay down next to the airship to sleep. ",
        "Qi Shiyan, who sensed this with his mental power: “…”",
        "Forget it. The Starlight had good sound insulation anyway. No sound from inside would be transmitted out at all. If Lou Jingyue wanted to sleep outside, then he could sleep outside. It didn’t affect him.",
        "Qi Shiyan hugged Ming Zheng, and his supernatural powers entered Ming Zheng’s body.",
        "In the apocalypse, toxins were everywhere around him. At that time, his supernatural powers were constantly automatically operating, never fully recovering. ",
        "This was the first time that Qi Shiyan had fully recovered all of his supernatural powers. It was also the first time that he was using all of his supernatural powers to treat someone.",
        "He felt particularly good – wherever his supernatural powers passed, all the poison in Ming Zheng’s body disappeared!",
        "He could even guide the energy in Ming Zheng’s body to help repair Ming Zheng’s body.",
        "While Qi Shiyan and Ming Zheng were hugging each other, people online were still making fun of Lou Jingyue. ",
        "“Young General Lou’s image has been completely destroyed!”",
        "“My impression of Young General Lou has been shattered. What happened to him? He was actually kicked flying by Ah Zheng.”",
        "“He should have been unprepared…”",
        "“Don’t expect too much from him. He’s just a chubby little foodie. Look carefully. He’s so cute!” ",
        "…",
        "Those who knew something about the star worm poison were speechless when they saw that netizens only cared about these things. “Why are you guys only paying attention to these things? The point is not Lou Jingyue’s reaction, but that Qi Shiyan can actually eliminate the star worm poison!”",
        "“How does Qi Shiyan do it?”",
        "“The Qi family and the imperial family have really done a lot of harm to the people! If it weren’t for them, Qi Shiyan’s abilities might have been discovered earlier and more people could have been saved!” ",
        "…",
        "These people tried hard to educate the public about how amazing Qi Shiyan was for being able to eliminate the star worm poison, but unfortunately the public didn’t understand at all.",
        "",
        "They were more curious about what Ah Zheng would look like after being healed.",
        "Those in the military were excited again. ",
        "Jiang Jin couldn’t help but burst into laughter.",
        "It would only take three days. Just three days! And His Majesty could recover!",
        "Once His Majesty recovered, what would they still have to fear from the star worms?",
        "Even if he had to exert all his efforts, he would help His Majesty stop the star worms and give His Majesty three days. ",
        "In the Third Legion, Marshal Lou had just finished a battle.",
        "As soon as he returned to the barracks, he turned on the live broadcast and saw Lou Jingyue calling out in a flattering manner, “Brother Yan.”",
        "His son was really good! This was a great reaction!",
        "But he should flatter a little more! ",
        "A powerful person like Qi Shiyan should be flattered well!",
        "On the Capital Star, Madam Ming had already returned home because not long ago, Ming Qingyu was arrested by the military. The reason for his arrest was that he leaked military secrets.",
        "This person was now completely finished.",
        "She could finally go home and watch the live broadcast comfortably in bed. ",
        "Madam Ming was particularly fond of Qi Shiyan. At this moment, she saw Qi Shiyan smiling broadly at “Ah Zheng”.",
        "“Ah Zheng” was clear-headed again.",
        "This “Ah Zheng” was so lucky. Alas, why didn’t her son escape from the sanatorium earlier?",
        "If her son had escaped from the sanatorium earlier and met Qi Shiyan earlier, he might have become Qi Shiyan’s partner. ",
        "Madam Ming was thinking this when her expression suddenly froze.",
        "This time, Qi Shiyan should have helped “Ah Zheng” eliminate a lot of poison, so normal skin had appeared on Ah Zheng’s neck and behind his ears.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The key point was not this. The key point was that there was a scar on his chin.",
        "Madam Ming had a very good relationship with her husband and often went to the front lines to visit her husband and children. ",
        "She had known about the star worm poison for a long time. She also knew that His Majesty had been poisoned by the star worm poison.",
        "Seven years ago, she had even met His Majesty.",
        "His Majesty always wore a mask in front of outsiders, but he took off the mask when he was in front of her.",
        "When His Majesty was first brought back to the palace by the retired emperor, everyone in the palace looked down on him as an “illegitimate child” and treated him very badly. She couldn’t bear to watch, so she helped him a few times. ",
        "Therefore, His Majesty had always been very kind to her and treated her as an elder.",
        "His Majesty at that time looked exactly like Ah Zheng now. Even the scar on his chin was exactly the same.",
        "At the same time, the First Legion.",
        "Several generals who had just retreated from the front lines were gathered together, talking and watching the live broadcast. ",
        "“Why don’t the marshal and others take Qi Shiyan away from the convalescent planet?”",
        "“That’s right! Qi Shiyan has such ability. He should treat His Majesty first!”",
        "“Qi Shiyan really shouldn’t vent his anger on His Majesty because of Ming Qingyu.”",
        "“That Ah Zheng actually thinks that the imperial family shouldn’t exist. Haha, if it weren’t for His Majesty, he might have been killed by star worms long ago!” ",
        "…",
        "Recently, there had been a lot of negative information about His Majesty on the star network. Some people even said that His Majesty’s military achievements were fake.",
        "They knew that this was done by the imperial family to divert people’s attention, but they were still very angry.",
        "They became even angrier when they saw some people saying that a warrior like Ah Zheng was more worthy of admiration than His Majesty. ",
        "This Ah Zheng was always acting like a spoiled child and getting jealous. He only knew how to monopolize Qi Shiyan and kick Young General Lou. He couldn’t even compare to His Majesty’s finger.",
        "As they were denouncing “Ah Zheng”, they saw Qi Shiyan treating Ah Zheng again.",
        "",
        "This Ah Zheng’s chin looked a little familiar…",
        "In the live broadcast. ",
        "Qi Shiyan put his face against Ming Zheng’s chin and said to Ming Zheng, “Ah Zheng, how do you feel? Star worm meat is rich in energy and can help me recover quickly. You will get better soon. Are you happy?”",
        "Ming Zheng already knew what had happened in the previous two or three hours.",
        "Star worms had actually appeared. The convalescent planet was very dangerous now!",
        "Fortunately, Qi Shiyan came up with the idea of eating star worm meat, which sped up his recovery. ",
        "However, under the current circumstances, his identity would soon be exposed.",
        "Once the star worm poison in his body was eliminated, Qi Shiyan would be able to see his face.",
        "Everyone in the Human Empire knew him, so there was no way Qi Shiyan wouldn’t recognize him.",
        "“I’m very happy.” Ming Zheng said. ",
        "Qi Shiyan smiled and asked, “Then do you want to become my partner sooner?”",
        "These past few days, Qi Shiyan kept saying, “I like you” and had confessed his feelings countless times.",
        "Now, he confessed again out of habit.",
        "But Qi Shiyan didn’t think Ming Zheng would agree. ",
        "Ming Zheng should like him, but they had known each other for too short a time and hadn’t spent much time together when Ming Zheng was clear-headed.",
        "He was ready to continue pursuing Ming Zheng after Ming Zheng recovered.",
        "“Okay.” Ming Zheng agreed.",
        "Qi Shiyan was stunned. ",
        "Ming Zheng looked at him intently. “Ah Yan, I liked you the first time I saw you.”",
        "He was telling the truth. He fell in love with this person at first sight.",
        "",
        "Then, it got deeper and deeper.",
        "He had wanted to accept Qi Shiyan’s confession for a long time, but he had always refused before because he had thought that he would die. ",
        "But now, he wouldn’t die."
    ],
    "previous": "Ch33 - Countdown Three Days",
    "next": "Ch35 - Kissing"
}