{
    "title": "Ch35 - Kissing",
    "content": [
        "When Qi Shiyan heard Ming Zheng’s words, he was stunned.",
        "When Ming Zheng was a fool, he would also tell him that he liked him, but he knew very well that he should not take it seriously. ",
        "But things were different now.",
        "Ming Zheng was clear-headed right now, and his eyes were full of determination.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Qi Shiyan hugged Ming Zheng. “Ah Zheng, I’m so happy. I also fell in love with you at first sight! The first time I saw you, I really, really liked you!”",
        "Ming Zheng sighed secretly and hugged Qi Shiyan back. ",
        "He didn’t know whether Qi Shiyan would break up with him after knowing his identity.\n\n",
        "But right now, he wanted to follow his heart and agree to the confession of the man in front of him.",
        "“Ah Zheng, can I kiss you?” Qi Shiyan asked again.",
        "Ming Zheng felt helpless. He touched Qi Shiyan’s hair and said, “You still want to kiss me when I’m like this?”\n\n ",
        "“You look very good like this.” Qi Shiyan said.",
        "“What kind of aesthetics do you have? You are the one who is truly good-looking,” Ming Zheng said helplessly, “Even Lou Jingyue’s face is better than mine.”",
        "“How could that be? Lou Jingyue is not even as good as one of your fingers.”\n\n",
        "Ming Zheng laughed, and then was kissed on the lips by Qi Shiyan. ",
        "Then, Qi Shiyan began to kiss his left cheek, then his right cheek, and then his forehead and chin.",
        "After kissing one by one like this, Qi Shiyan started to kiss all the same areas again.",
        "Ming Zheng thought Qi Shiyan would give him a passionate kiss, but he didn’t expect these kinds of “kisses”. He was a little unable to react.",
        "The barrage was also helpless. “This kind of kissing is like that of a child. Qi Shiyan, you are an adult. You should give a passionate kiss!” ",
        "“I was very excited to see Qi Shiyan’s successful confession, but now seeing Qi Shiyan kiss the person like this after confessing, I can’t get excited anymore.”",
        "“They are finally together! No, I can’t say finally. These two have only known each other for a few days. It should be said that they had a flash romance.”",
        "…",
        "However, among the blessings, there were also some discordant voices. ",
        "“Although I know that Ah Zheng was disfigured by the star worm poison, I’m still a little uncomfortable with him talking about love with Qi Shiyan with such a face.”",
        "“I think there’s something wrong with this Ah Zheng. He refused before, but now that Qi Shiyan can cure him, he says that he fell in love with Qi Shiyan at first sight.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Qi Shiyan is so good to Ah Zheng, taking care of him in every way, but I have never seen Ah Zheng do anything for Qi Shiyan.”",
        "“It’s good that Qi Shiyan doesn’t like Ming Qingyu, but I don’t understand why he likes Ah Zheng. I really think Ah Zheng is not worthy of him.” ",
        "…",
        "Qi Shiyan had been whitewashed, so right now, he was the most likable beautiful, strong and tragic* person among the people.",
        "Most people who watched the live broadcast liked him very much. Those who didn’t like him didn’t dare to speak.",
        "But “Ah Zheng” was different. ",
        "In fact, ever since “Ah Zheng” appeared, some people had always disliked him. After all, he was too ugly.",
        "At first, people pust called him ugly guy.",
        "Oater, no one attacked him because they learned that he had been poisoned by star worm poison and that he was a frontline soldier who had fought on the battlefield.",
        "Dut they still didn’t like him, and even thought that Hi Shiyan had poor vision and abnormal aesthetics for liking such a person. ",
        "In addition, during this period, some imperial family members hired water armies to attack Ah Zheng, making people dislike this person more and more.",
        "“Lou Jingyue is much better. Why does Qi Shiyan like this person?”",
        "“This person kicked Lou Jingyue before!”",
        "“Qi Shiyan is so powerful. He is not worthy of Qi Shiyan at all.” ",
        "…",
        "After Qi Shiyan kissed a few times, he changed the kissing method.",
        "He started from Ming Zheng’s forehead and kissed his way down inch by inch, intending to kiss every inch of skin on Ming Zheng’s face.",
        "Ming Zheng felt helpless, yet happy. ",
        "He liked the feeling of being cherished.",
        "However, it was still a bit strange to be kissed like this by someone much younger than him.",
        "",
        "“Ah Yan…” Ming Zheng said, “Let’s talk.”",
        "Qi Shiyan reluctantly let go of Ming Zheng. “You speak.” ",
        "Ming Zheng said, “Star worms have appeared on the convalescent planet. Something must have happened. You have to be more careful next time.”",
        "“Okay.”",
        "Ming Zheng added, “I should be able to remain clear-headed for longer periods now. Tomorrow, during the day, you help me eliminate the poison from my body and I’ll repair the airship. We need to repair the airship as soon as possible and rush back to the sanatorium.”",
        "Ming Zheng recognized the star worm that Qi Shiyan ate. ",
        "This was a high-level star worm that he had fought before and which was very good at hiding.",
        "Qi Shiyan killed such a high-level star worm, which surprised him a little, but he was still worried about their safety.",
        "They had to return to the sanatorium as soon as possible!",
        "His mecha was in the sanatorium. He also had to protect the people in the sanatorium. ",
        "“You know how to repair airships?” Qi Shiyan asked curiously.",
        "“Yes.” Ming Zheng said.",
        "People with strong mental power also had strong learning ability and could learn things quickly.",
        "Repairing things was his hobby and he had studied it for many years. ",
        "For those who were suffering from star worm poison, if they focused all their attention on the star worm poison and their own physical pain, they would become more and more miserable.",
        "It was best to do something else to distract themselves.",
        "When his mind was restless, he would repair things.",
        "Many of the airship’s functions were damaged, but he should be able to fix them. ",
        "“Ah Zheng, you are amazing!” Qi Shiyan admired him very much. “I am so lucky to have a partner like you!”",
        "Ming Zheng felt a little embarrassed by the praise. “After all, I am much older than you, so I have learned a little more.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Ah Zheng, how old are you this year?” Qi Shiyan suddenly realized that he had never asked Ming Zheng his age.",
        "He knew very little about Ah Zheng’s situation. After all, Ah Zheng was not clear-hesded most of the time. ",
        "Ming Zheng was silent for a moment before he said, “I’m almost forty.”",
        "To be exact, he was thirty-eight years old this year.",
        "The average life expectancy was now 200 years old. People with strong mental power and good maintenance could live to 300 years old. Thirty-eight years old was not considered old.",
        "But he had asked Qi Shiyan’s age before. Qi Shiyan was only twenty-one. ",
        "When he went to the battlefield for the first time, Qi Shiyan was still an infant.",
        "Qi Shiyan smiled and said, “That’s good! Older people know how to take care of others!”",
        "Ming Zheng didn’t know whether to laugh or cry*.",
        "Qi Shiyan kissed Ming Zheng’s face again. “Can you tell me about your past?” ",
        "Ming Zheng rarely spoke to anyone about his past, but he didn’t want to lie to Qi Shiyan.",
        "After thinking for a while, he said, “Ah Yan, I have something to tell you. After you hear it, you can reconsider our relationship.”",
        "“Our relationship doesn’t need to be reconsidered,” Qi Shiyan was sure, “You have already agreed to my confession. You can’t reject me again!”",
        "Ming Zheng said, “Ah Yan, I was born in a laboratory and my genes have been modified. The offspring of experimental subjects like me may have genetic abnormalities or genetic mutations, so I am not allowed to have offspring.” ",
        "Humans had been studying genes for a long time.",
        "Before the Human Empire entered the interstellar era, some scientists tampered with the genes of babies.",
        "This led to tragic consequences – the offspring of children whose genes had been tampered with had genetic problems.",
        "This problem was getting more serious with each generation. When the problem erupted, hundreds of people suffered genetic collapse and some also suffered genetic mutations. ",
        "Later, this group of people were not allowed to have offspring. At the same time, the empire enacted laws that people whose genes had been altered could not have offspring.",
        "“This is no big deal. Although I like children, we can adopt or just open an orphanage!” Qi Shiyan became a little excited when mentioning an orphanage.",
        "",
        "Being the director of an orphanage was definitely his preferred job.",
        "If there were a group of children sitting in a row, waiting for him to feed them…it made him happy just thinking about it! ",
        "Ming Zheng’s breathing became a little rapid.",
        "Qi Shiyan’s answer hit his heart.",
        "He still had other things to say, but at this moment, he had that familiar feeling again.",
        "Ming Zheng’s eyes became dazed again and he smiled sweetly at Qi Shiyan. ",
        "How could Qi Shiyan endure this?",
        "He hugged Ming Zheng and began to kiss his face inch by inch.",
        "Ming Zheng was a little confused, but he didn’t hate Qi Shiyan kissing him, so he didn’t refuse and let Qi Shiyan kiss him.",
        "At this time, the barrage started arguing again. “Ah Zheng actually came from a laboratory?” ",
        "“I’ve already said it. He’s not worthy of Qi Shiyan!”",
        "“Qi Shiyan is so good. He is even worthy of His Majesty. Why does he have to be with Ah Zheng?”",
        "“Exactly!”",
        "… ",
        "The military’s propaganda in recent years had been very effective. The person the military promoted the most was Ming Zheng.",
        "In the Human Empire, the person with the most fans was definitely Ming Zheng.",
        "“His Majesty has been fighting star worms for so many years, and must have also been poisoned by star worm poison. I think Qi Shiyan should first help His Majesty eliminate the poison.”",
        "“His Majesty has always been wearing a mask the past several years. He must have been poisoned. What’s wrong with the military? Why don’t they take Qi Shiyan to the front lines to help His Majesty eliminate the poison?” ",
        "“Lou Jingyue should educate Qi Shiyan more about His Majesty! His Majesty is really a very good person.”",
        "“I am a frontline soldier, and I want to say that His Majesty is the best in the world!”",
        "Please visit chrysanthemumgarden (dot) com",
        "…",
        "The few who knew the identity of “Ah Zheng” and the few who guessed the identity of “Ah Zheng”: “…” ",
        "His Majesty’s identity couldn’t be hidden for much longer.",
        "Who knew what these netizens would think at that time.",
        "No one knew what netizens thought.",
        "The sanatorium lost people again that night. ",
        "Several people whose bodies were almost unable to continue suppressing the star worm poison stole an airship, left the sanatorium, and decided to go on a spontaneous trip.",
        "There were many guards in the sanatorium and the security had been very strict recently, so the airship was discovered as soon as it moved.",
        "But those people on the airship were all severely poisoned. If they were not careful, the poison would flare up and they would die.",
        "What if they went up to stop them and the people on the airship had a flare up? ",
        "The guards of the sanatorium didn’t dare to stop them.",
        "Deputy Director Zhao was furious when he saw this situation.",
        "These people stole Director Jiang’s airship and ran away.",
        "Why did Director Jiang collect so many airships? ",
        "***",
        "T/N: This story is meant to be light hearted and the live broadcast is supposed to come across as funny, but obviously it’s deeply unethical. No one should be filmed and broadcast without their knowledge and consent. It’s even worse in this chapter because Ming Zheng is baring his scars (his past in the laboratory) to Qi Shiyan and has no idea the entire empire is watching.",
        "*美强惨 (mei qiang can) – literally beautiful, strong and miserable/tragic. A common way to describe a popular type of character setting in novels, shows, etc.",
        "*哭笑不得 (ku xiao bu de) – not knowing whether to laugh or cry. An idiom that expresses a feeling of helplessness, not knowing how to react to a particular situation. "
    ],
    "previous": "Ch34 - Confession Successful",
    "next": "Ch36 - Rebellion Being Live Broadcast"
}