{
    "title": "Ch36 - Rebellion Being Live Broadcast",
    "content": [
        "There were three people who left the sanatorium on the airship this time.",
        "The identities of these three people were all extraordinary. ",
        "One of them was the former Marshal of the Third Legion, Ke Lun, one was a former General of the Second Legion and also the partner of the Marshal of the Second Legion, Shan Xi, and the last one was once the strongest fighter of the Spearhead Troops, Lei Yin, known as the Mecha Witch.",
        "The Spearhead Troops were independent of the various legions and were often assigned to perform various dangerous and special tasks.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "On the battlefield, they would be assigned to assassinate high-level star worms.",
        "Speaking of which, when His Majesty first went to the battlefield twenty years ago, he joined the Spearhead Troops. ",
        "At that time, he led the Spearhead Troops and saved many people, which made the people in the military completely submit to him.\n\n",
        "These three people had very high levels of mental power, all reaching SS-level.",
        "However, their mental power grew through long-term resistance against the star worm poison.",
        "Having been poisoned by the star worm poison, they had to use part of their mental power to suppress the poison, which meant that they couldn’t use all of their mental power, nor could they take mental power level tests.\n\n ",
        "Therefore, their external mental power level was only S+.",
        "However, for them who were dying, their mental power level was of no significance.",
        "Setting the airship to autopilot, the former Marshal of the Third Legion, Ke Lun, said, “We finally escaped!”\n\n",
        "Marshal Ke Lun had lived in the sanatorium for more than ten years. The only exercise he did every day was growing vegetables. He was fatter than Lou Jingyue and his face was purple and dark. ",
        "Shan Xi said, “We should have run away a long time ago. I’m going to get moldy staying in the sanatorium every day.”",
        "Lei Yin looked at the two “old men” around her who were already over a hundred years old, and said, “Don’t forget our business. We have to quickly go and find His Majesty.”",
        "This time they came out not only to escape from the sanatorium, but mainly to find His Majesty.",
        "The first person the sanatorium lost was His Majesty. Lou Jingyue didn’t know about this, but the three of them all knew it. ",
        "This was not the first time His Majesty had come to the sanatorium.",
        "In the past, His Majesty had also come to the sanatorium to recuperate, and had asked them for methods to suppress the star worm poison. He also took away some toxic medicine that could fight poison with poison, allowing His Majesty to remain clear-headed while poisoned.",
        "When His Majesty came to the sanatorium this time, they were all very concerned about His Majesty’s condition, but they didn’t expect His Majesty to actually be lost.",
        "What was even more unexpected to them was that the sanatorium actually didn’t go to look for His Majesty. ",
        "Something must have happened outside… They decided to go look for His Majesty themselves.",
        "Anyway, their bodies couldn’t hold on any longer, so just make use of them as waste.",
        "",
        "Marshal Ke Lun said, “I intervened in the interrogation of the traitor. His Majesty is in that direction.”",
        "He pointed in a direction, and just as he finished speaking, he found that his old friend Shan Xi beside him had become foolish. ",
        "Affected by the poison, Shan Xi suddenly became a fool and started crying. “Wa, it hurts so much. I feel uncomfortable! Heng gege*, Heng gege, save me!”",
        "Marshal Ke Lun: “…” Shan Xi was such an annoying guy!",
        "Immediately afterward, Lei Yin’s face turned cold and she looked around vigilantly. “Where is this? What do you want to do? Let me go, or I will beat you to death!”",
        "Marshal Ke Lun pressed a button on the airship, confining the two people to their seats, and sighed. ",
        "He shouldn’t have brought these two burdens with him.",
        "Marshal Ke Lun was also seriously poisoned, but it was mainly his body that was failing. His mind was still clear.",
        "He felt that the two people around him were too noisy, making him dizzy and his head buzz.",
        "However, the drugs that could keep them clear-headed were all toxic. It was better not to give them any if possible. Everything could wait until after they found His Majesty. ",
        "The airship moved forward in the night.",
        "Shan Xi kept crying and shouting in pain, while Lei Yin kept baring her teeth and claws, looking for someone to settle the score with.",
        "Ke Oun put earplugs in his ears and snored loudly.",
        "Yn the other side, Hi Shiyan, who had slept for a while, opened his eyes, hugged Zing Iheng beside him, and continued to help Zing Iheng eliminate the poison in his body. ",
        "Le fried a lot of star worm meat and set it aside. Le had eaten a few pieces before going to bed.",
        "So, after three hours of sleep, his supernatural powers had recovered!",
        "Qi Shiyan used all of his recovered supernatural powers on Ming Zheng.",
        "Being poisoned was very uncomfortable. He hoped that Ming Zheng could recover soon. ",
        "During the process of eliminating the poison, Ming Zheng moved and seemed to be about to wake up.",
        "Qi Shiyan used his mental power to comfort him and hummed a lullaby. Soon, Ming Zheng fell asleep again.",
        "Please visit chrysanthemumgarden (dot) com",
        "He held Ming Zheng in his arms, with his mouth against Ming Zheng’s face, and then fell asleep contentedly.",
        "At around 1 a.m. in the morning, Qi Shiyan treated Ming Zheng once, and at 5 a.m. in the morning, he treated Ming Zheng again. ",
        "During the second treatment, Ming Zheng woke up even though Qi Shiyan tried his best to comfort him.",
        "Starlight had excellent sound insulation and the airship was silent.",
        "They hugged each other, as if there were only the two of them in the whole world.",
        "Qi Shiyan kissed the face of the person next to him and asked, “Ah Zheng, did you come from one of the imperial family’s laboratories?” ",
        "“Yes.” Ming Zheng said.",
        "“Did you have a hard time when you were a child?”",
        "“No, probably about the same as you.” Ming Zheng smiled.",
        "Qi Shiyan hugged him and said, “Don’t worry, we will get better and better in the future.” ",
        "“I think so too.” Ming Zheng said and smiled.",
        "Before, he had no expectations for the future.",
        "Only the responsibility of protecting the empire kept him going.",
        "But now things were different. ",
        "His body was recovering at a rapid speed.",
        "He also had some beautiful hopes and dreams for his future.",
        "Thinking of this, Ming Zheng asked, “Ah Yan, do you have a grudge against Ming Qingyu?”",
        "Qi Shiyan said, “Yes.” ",
        "Ming Zheng said, “Ah Yan, let’s overthrow the imperial family together.”",
        "He had always had the idea of ​​overthrowing the imperial family. As far as he knew, his biological father had not stopped various human experiments.",
        "",
        "Before, they wanted him to provide his genes to cultivate clones of him.",
        "He really felt that the imperial family should not exist. ",
        "Qi Shiyan immediately agreed. “Okay!”",
        "Ming Zheng asked, “Ah Yan, is it harmful to your health when you help people eliminate poison?”",
        "“No.”",
        "“Then when you go to the sanatorium, you can help treat the people there. There is a man named Shan Xi, who is the partner of the Marshal of the Second Legion. The Marshal of the Second Legion loves him very much. As long as you cure him, the Second Legion will definitely stand on our side.” ",
        "Qi Shiyan said, “I will definitely cure him!”",
        "“There is also Lou Jingyue outside. If you cure him, the Third Legion will stand on our side,” Ming Zheng said. “There is also a man named Ke Lun and a woman named Lei Yin in the sanatorium. They can also help us.”",
        "Qi Shiyan could help people eliminate the star worm poison. He could use this to make Qi Shiyan a treasure of the military.",
        "Ming Zheng thought so and told Qi Shiyan about Ke Lun and Lei Yin’s situations. He also picked out the people who were severely poisoned in the sanatorium and introduced them one by one. ",
        "Anyway, they were all big shots.",
        "“I will cure them all, and then we will overthrow the imperial family together.” Qi Shiyan was very excited.",
        "To help people eliminate poison, he must have contact with the other person. Hugging was not necessary, but holding hands was necessary.",
        "By then, Ming Zheng should be clear-headed all the time and wouldn’t be jealous. ",
        "Therefore, he could touch the hands of everyone in the sanatorium!",
        "It was so wonderful!",
        "There were so many people and he could touch all their hands!",
        "The two of them were lying in bed excitedly discussing how to overthrow the imperial family, but the people watching the live broadcast were dumbfounded. ",
        "Lu Yuan had been busy with logistics behind the scenes. After sitting for a long time he felt sore in his back and waist, so he decided to go for a walk outside and eat in the dining hall along the way.",
        "As soon as he arrived at the entrance of the dining hall, he heard someone scolding His Majesty.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Isn’t this Ah Zheng going too far? He actually instigated Qi Shiyan to overthrow the imperial family!”",
        "“Qi Shiyan is being misled by him!” ",
        "“He is scheming against everyone in the sanatorium!”",
        "“He said he’s not from the military. Then who is he? How did he end up on the convalescent planet?”",
        "“Isn’t this live broadcast controlled by the military? Why aren’t they arresting that Ah Zheng?”",
        "… ",
        "The soldiers on the spaceship were very angry.",
        "The military expenses of their First Legion were all paid by the imperial family. His Majesty was also very good to them.",
        "They supported the imperial family and had always hoped that His Majesty would have a child to inherit the throne.",
        "What was wrong with this Ah Zheng? He actually said in the live broadcast that he wanted to overthrow the imperial family! ",
        "Qi Shiyan had not received much education, was young and didn’t understand many things. He was also a love brain* and was really persuaded by that Ah Zheng.",
        "When Lu Yuan heard these words, he quickly asked, “What are you guys talking about?”",
        "These people immediately showed Lu Yuan the live broadcast replay.",
        "In the live broadcast, Ming Zheng’s skin below his nose had returned to normal. ",
        "He was giving Qi Shiyan suggestions and teaching him how to overthrow the imperial family.",
        "Lu Yuan: “…” Why was His Majesty rebelling?",
        "Lu Yuan was just staring blankly when he received a call from the Marshal of the Second Legion. “Lu Yuan, what’s going on over there?”",
        "The Marshal of the Second Legion was named Duan Heng. ",
        "Marshal Duan was dumbfounded when watching the live broadcast. That Ah Zheng said that as long as Qi Shiyan could cure Shan Xi, the Second Legion would listen to Qi Shiyan… What the hell was this?",
        "Even if he was willing to listen to Qi Shiyan, the Second Legion would not listen to Qi Shiyan. After all, Qi Shiyan could not pay the military expenses of the Second Legion.",
        "",
        "“Hurry up and find a way to arrest that Ah Zheng. Qi Shiyan is a love brain and hasn’t had much contact with people. Be careful of that Ah Zheng taking advantage of him!”",
        "Lu Yuan sighed. “Ah Zheng can’t be arrested.” ",
        "“Why not?” Duan Heng asked, “Lu Yuan, aren’t you afraid that I will really stand on his and Qi Shiyan’s side and overthrow the imperial family?”",
        "Lu Yuan said, “It’s not impossible.”",
        "Duan Heng was stunned. “Lu Yuan, you betrayed His Majesty? Are you worthy of His Majesty?”",
        "Lu Yuan took a deep breath and said, “Marshal Duan, take a closer look at Ah Zheng’s face and think about his name.” ",
        "Duan Heng: “…” This lower half of the face, and this voice…",
        "Wait, this guy was a bit similar to Ming Zheng, who once beat him until his nose was bruised and his face was swollen.",
        "Duan Heng had always thought that Qi Shiyan was a love brain, but now, he felt that Ming Zheng was the real love brain. “He is Ming Zheng? Is he crazy? In order to please Qi Shiyan, he even gave up the imperial family? This is really crazy! I will take screenshots of all the scenes of him being jealous and acting like a spoiled child. Every time I see him in the future, I will laugh at him!”",
        "Lu Yuan was speechless. ",
        "Duan Heng added, “Tell him that as long as Qi Shiyan can cure Shan Xi, I will help Qi Shiyan overthrow the imperial family! I will keep my word!”",
        "After saying that, Duan Heng hung up the phone.",
        "On the other side, Marshal Lou was also dumbfounded when he saw this situation.",
        "Who was this Ah Zheng? ",
        "However, no matter who Ah Zheng was, he would never confront the imperial family just because Qi Shiyan cured Lou Jingyue.",
        "His wife was a member of the imperial family. He also held great respect for His Majesty.",
        "Marshal Lou contacted Madam Ming immediately and wanted to tell her his decision.",
        "As a result, as soon as Madam Ming answered the phone, she said, “Don’t worry, Old Lou, I will withdraw from the imperial family and will not affect everyone’s plan to overthrow the imperial family.” ",
        "“Madam! I know you value Jingyue, but we were able to stop the star worms all these years thanks to His Majesty. His Majesty also saved me before…”",
        "“So you should listen to His Majesty.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Huh?” Marshal Lou was puzzled.",
        "Madam Ming said, “You can’t tell? Ah Zheng is His Majesty. He didn’t even try to hide it and just said his real name.” ",
        "Marshal Lou’s voice trembled. “Ah Zheng is His Majesty?”",
        "Before, he had thought that if his son could work harder and win Qi Shiyan’s favor, he could marry Qi Shiyan and bring him home.",
        "When Ah Zheng kicked his son yesterday, he hoped even more that his son could dig Ah Zheng’s corner*.",
        "As a result, Ah Zheng was His Majesty? ",
        "His Majesty was actually this kind of person?",
        "The military reacted strongly, and so did netizens. “What’s wrong with this Ah Zheng? Does he know what he is saying?”",
        "“His Majesty protects the empire, yet this guy wants to overthrow the imperial family?”",
        "“I told you this guy is not a good thing!” ",
        "“Qi Shiyan was deceived by Ming Qingyu before, and now he is being deceived by this Ah Zheng!”",
        "…",
        "The public was outraged. At this time, Ming Zheng was confused again.",
        "Qi Shiyan took out the star worm meat and pointed to his mouth. “Ah Zheng, if you kiss me, I will give you a piece of meat.” ",
        "Upon hearing this, Ming Zheng kissed Qi Shiyan seriously, then opened his mouth and waited for Qi Shiyan to feed him.",
        "***",
        "T/N: *Usually, when it’s just 哥 (ge) in the raws, I translate it as “brother” (哥, ge, means older brother in Chinese for those who don’t know). But 哥哥 (gege) is usually used by children or in a cutesy way by adults and there’s no good way to convey that in English, so when it’s 哥哥 (gege), I’m going to keep it in pinyin.",
        "*恋爱脑 (lian ai nao) – literally love brain. Chinese internet slang for someone whose head is only full of love and their lover and nothing else. ",
        "*Digging someone’s corner is Chinese slang for poaching their lover.",
        ""
    ],
    "previous": "Ch35 - Kissing",
    "next": "Ch37 - People Are Coming Again"
}