{
    "title": "Ch37 - People Are Coming Again",
    "content": [
        "Qi Shiyan really liked this sweet Ming Zheng in front of him.",
        "He cut a piece of star worm meat and fed it to Ming Zheng. “Is it delicious?” ",
        "Ming Zheng said without hesitation, “Delicious!”",
        "After saying that, he happily kissed Qi Shiyan again. “I want more!”\n",
        "",
        "When one’s partner wanted to eat, one definitely had to feed him!",
        "Qi Shiyan cut another piece of fried star worm meat for Ming Zheng to eat. ",
        "Ming Zheng ate happily and continued kissing Qi Shiyan.\n\n",
        "Qi Shiyan had been kissing him since last night. After being kissed so many times by Qi Shiyan, he learned to imitate him.",
        "The two of them took turns eating all the star worm meat that Qi Shiyan had fried yesterday.",
        "After eating, Qi Shiyan looked at the sky outside and said to Ming Zheng, “Ah Zheng, let’s go outside. I’ll go fry some more star worm meat.”\n\n ",
        "After all the trouble, it was already dawn, so they decided to get up.",
        "“En.” Ming Zheng agreed, then pulled Qi Shiyan to the storage area of ​​the airship and took out a large piece of star worm meat.",
        "Yesterday, all the processed star worm meat was placed here for preservation.\n\n",
        "The two held hands and opened the door of the Starlight, and then saw Lou Jingyue lying next to the door of the airship and snoring. He was awakened by the noise of them opening the door and suddenly woke up. ",
        "Lou Jingyue had been very excited yesterday after he heard Qi Shiyan say that he could eliminate the star worm poison.",
        "He had studied hard and trained diligently since he was young, all in order to be able to go to the battlefield to kill star worms. As a result, not long after he went to the battlefield, he was poisoned and had to leave the battlefield.",
        "All this was extremely mentally painful to him.",
        "If he could get better, as long as Qi Shiyan’s request was not illegal or criminal, he could agree to anything! ",
        "However, after Qi Shiyan went back to rest yesterday, Lou Jingyue became suspicious again.",
        "Did Qi Shiyan really have this ability?",
        "He tossed and turned that night and didn’t fall asleep until the second half of the night. Now he was awakened again.",
        "Then he saw Ming Zheng’s white chin. ",
        "White chin!",
        "His Brother Yan’s boyfriend’s face was always blue and purple before. He could sense that the star worm poison in the other party’s body was much more serious than his.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But now, after one night, this person’s appearance had changed.",
        "Brother Yan said that he could cure this person within three days. It was true! ",
        "Lou Jingyue hugged Qi Shiyan’s legs and said, “Brother Yan! Brother Yan, please treat me while you’re at it! When I get better, I’ll be your younger brother and I’ll do whatever you say!”",
        "Qi Shiyan agreed. “Then I will treat you after I cure Ah Zheng.”",
        "Ming Zheng was very dissatisfied. “Ah Yan, Ah Yan! Kick him away!”",
        "Ming Zheng looked at Lou Jingyue with dissatisfaction and stretched out his foot again, wanting to kick Lou Jingyue away. ",
        "Without hesitation, Lou Jingyue let go of Qi Shiyan’s legs and hid away.",
        "After dodging, seeing Ming Zheng still looking at him angrily, Lou Jingyue hurriedly said, “Brother Zheng, I like women. I don’t like men! I won’t steal Brother Yan from you!”",
        "Unfortunately, the Ming Zheng right now couldn’t understand.",
        "He hugged Qi Shiyan and kissed him on the face. “This is mine!” ",
        "Lou Jingyue said, “Yes, yours, yours.”",
        "Ming Zheng was satisfied.",
        "Qi Shiyan thought Ming Zheng’s jealous look was adorable, so he kissed Ming Zheng on the face. “Ah Zheng, I am yours, and you are mine too.”",
        "Ming Zheng nodded happily. ",
        "Lou Jingyue: “…” These two people were even more lovey-dovey than yesterday!",
        "However, when he saw Ming Zheng’s clean chin, Lou Jingyue felt very excited.",
        "Le ran around, chopping wood and boiling water, trying his best to ensure Hi Shiyan and Zing Iheng lived comfortably.",
        "Hi Shiyan was very satisfied with this. Le got ready and continued to fry the star worm meat. ",
        "Star worm meat was rich in energy. Zing Iheng had already eaten some and couldn’t eat any more. Le needed to digest slowly. Dut Hi Shiyan ate a lot.",
        "At this time, more and more people were denouncing “Ah Zheng” on the star network.",
        "",
        "The video in which Ming Zheng explained to Qi Shiyan the situation of those people in the sanatorium, saying that as long as Qi Shiyan could cure Shan Xi and Lou Jingyue, he would get the support of the Second Legion and Third Legion, was posted everywhere. Many people also asked about this matter under the official accounts of the Second Legion and Third Legion, hoping that the Second Legion and Third Legion could give an explanation and promise not to stand on “Ah Zheng” and Qi Shiyan’s side, and promise not to betray His Majesty.",
        "Marshal Duan and Marshal Lou: “…” If they didn’t stand on “Ah Zheng’s” side, they would be betraying His Majesty! ",
        "It was His Majesty who wanted to rebel. What did it have to do with them?",
        "Some people who originally guessed that “Ah Zheng” was His Majesty began to hesitate.",
        "This person shouldn’t be His Majesty? The imperial family’s assets had always been managed by the emperor. As the emperor, His Majesty shouldn’t want to overthrow the imperial family.",
        "What was more, “Ah Zheng” had said that he was born in a laboratory. ",
        "He couldn’t be His Majesty.",
        "Very few people knew that Ming Zheng was born in a laboratory.",
        "The retired emperor concealed this news very well. Even the members of the imperial family only thought that Ming Zheng was the retired emperor’s illegitimate son. They didn’t know that Ming Zheng was brought out from a laboratory by the retired emperor.",
        "Qi Shiyan didn’t know about what was happening on the star network. ",
        "He ate a lot of star worm meat. In just two hours, his supernatural powers were fully restored.",
        "He didn’t delay and helped Ming Zheng eliminate the poison directly.",
        "As soon as Ming Zheng became clear-headed, he remembered the matter of him kissing Qi Shiyan for a few pieces of star worm meat.",
        "Forget it. He had done even more embarrassing things before. Kissing Qi Shiyan was no big deal. ",
        "It was fine as long as Qi Shiyan didn’t find it eye-catching.",
        "“Ah Zheng, how do you feel?” Qi Shiyan asked.",
        "Ming Zheng said, “I feel good. I’m going to go fix the airship.”",
        "After Ming Zheng finished speaking, he immediately entered the Starlight. ",
        "He walked too fast and quickly separated from Qi Shiyan.",
        "This was the first time that Qi Shiyan had been apart from Ming Zheng since he had met Ming Zheng.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "However, after sticking with Ming Zheng for several days and successfully confessing his feelings, Qi Shiyan wouldn’t feel uncomfortable if they suddenly separated for a while.",
        "He followed Ming Zheng. While Ming Zheng was busy, he pinched Ming Zheng’s earlobe, touched the back of Ming Zheng’s neck, and then touched Ming Zheng’s head. ",
        "Anyway, there were constant small actions.",
        "Ming Zheng took a deep breath, trying to clear his mind and focus.",
        "He was very experienced and could repair mechas and battleships, so repairing an airship was naturally a piece of cake for him.",
        "After a quick inspection, he found the tool kit on the airship and started repairing it. ",
        "He didn’t know how long he could remain clear-headed, so it would be better to fix it quickly.",
        "“Brother Zheng, are you clear-headed?” Lou Jingyue saw Ming Zheng repairing the airship and came over curiously.",
        "Ming Zheng recognized Lou Jingyue. Thinking about how he had been jealous of Lou Jingyue and kicked him before, he felt a little guilty toward Lou Jingyue, so his attitude was good. “En.”",
        "“Brother Zheng, I didn’t expect you to know how to repair airships! You’re amazing!” Lou Jingyue said. ",
        "“It’s not difficult to repair an airship.”",
        "“Brother Zheng, what did you do before?” Lou Jingyue asked.",
        "Ming Zheng felt that Lou Jingyue talked too much and came too close.",
        "Qi Shiyan had no reaction at all? He looked at Qi Shiyan, and then saw Qi Shiyan looking at Lou Jingyue with a smile, as if he liked Lou Jingyue very much. ",
        "It suddenly occurred to him that Qi Shiyan had skin hunger syndrome.",
        "Maybe at this moment, Qi Shiyan wanted to touch Lou Jingyue.",
        "Qi Shiyan did have the thought of ​​touching Lou Jingyue. The chattering Lou Jingyue was quite interesting to him.",
        "But he wouldn’t actually touch Lou Jingyue, lest his partner get angry. ",
        "Lou Jingyue didn’t notice this. He asked again, “Brother Zheng, have you ever killed a high-level star worm?”",
        "Ming Zheng suddenly said, “Lou Jingyue, Ah Yan can help you eliminate the poison, but there’s a condition.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“What’s the condition?” Lou Jingyue asked.",
        "Ming Zheng said, “Help us overthrow the imperial family.” ",
        "“What?” Lou Jingyue was shocked.",
        "“We want to overthrow the imperial family. You have to help us persuade Marshal Lou.”",
        "“I won’t do such a thing!” Lou Jingyue refused without thinking.",
        "“Then stay further away.” Ming Zheng said. ",
        "Lou Jingyue’s expression changed again and again. He left Qi Shiyan and Ming Zheng and ran away from the Starlight.",
        "Qi Shiyan was a little puzzled. “Will there be any problems if we tell him this?”",
        "They wanted to overthrow the imperial family, which should be a very secret matter? Why did Ming Zheng tell Lou Jingyue directly?",
        "“It’s okay. The sanatorium is not connected to the star network, so the news cannot be transmitted out.” Ming Zheng said, feeling a little regretful. ",
        "Just now, he suddenly found Lou Jingyue displeasing to the eye, so he wanted to frighten Lou Jingyue.",
        "He thought he would only be jealous when he was not clear-headed, but he didn’t expect that he would still be jealous when he was clear-headed.",
        "But it was good that Lou Jingyue left. Now he could work with peace of mind.",
        "As for the matter of him wanting to overthrow the imperial family being told to others…all the people in the sanatorium were his people, so it didn’t matter if the news got out. ",
        "Qi Shiyan didn’t know much about the sanatorium, but he felt that Ming Zheng’s choice would not be wrong. Since that was the case, he would listen to Ming Zheng.",
        "Thinking of this, he pinched Ming Zheng’s face again.",
        "At this moment, a sound suddenly came from outside. Qi Shiyan and Ming Zheng went out together and saw an airship appear in the open space in front of them.",
        "“Is it someone from the sanatorium?” Qi Shiyan looked at Ming Zheng. ",
        "“It should be.” Ming Zheng said.",
        "After the two finished talking, the door of the airship opened and the former Marshal of the Third Legion, Ke Lun, came down from it.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ke Lun saw Ming Zheng at a glance and was so shocked that he was speechless.",
        "The lower half of Ming Zheng’s face was clean. Was the star worm poison under control? ",
        "No, getting the star worm poison under control wouldn’t lead to this outcome. The only explanation was that part of the star worm poison in His Majesty’s body had been eliminated!",
        "“Ke Lun, do you remember me? I’m Ah Zheng.” Ming Zheng spoke.",
        "Ke Lun didn’t understand why Ming Zheng said this, but since he could become a marshal, he was naturally very smart.",
        "Seeing that there was a person present who he did not recognize, Ke Lun immediately guessed that Ming Zheng wanted to hide his identity. “Of course I remember! Has the star worm poison in your body been suppressed or eliminated?” ",
        "When asking this question, Ke Lun’s voice trembled.",
        "They all hoped that His Majesty would recover.",
        "“Ah Yan helped me eliminate some of the star worm poison,” Ming Zheng said, “Ke Lun, you are seriously poisoned. You can ask Ah Yan to help you eliminate the poison as well.”",
        "Ke Lun’s condition was very serious. As for himself, his life was no longer in danger. ",
        "Ming Zheng hoped that Qi Shiyan could first help Ke Lun eliminate the poison.",
        "“Good, good.” Ke Lun was very excited.",
        "At this moment, Lou Jingyue rushed out. “Grandpa* Ke Lun! They can help to eliminate the star worm poison, but there’s a condition!”",
        "Ke Lun was very familiar with Lou Jingyue and had always treated Lou Jingyue as his grandson. ",
        "Hearing Lou Jingyue’s words, he immediately asked, “What’s the condition?”",
        "Lou Jingyue said, “They want to overthrow the imperial family! They want us to help! His Majesty is so good, but they actually want to overthrow the imperial family! Anyway, I will never agree!”",
        "Ming Zheng was silent for a moment, then said, “Yes, if you want Ah Yan to help you eliminate the poison, there is a condition. That is, you have to join us and overthrow the imperial family with us.”",
        "Ke Lun was a little dumbfounded. What did His Majesty say? He wanted to overthrow the imperial family? ",
        "“Ke Lun, do you agree?” Ming Zheng asked.",
        "After hearing the name “Ke Lun”, the people in the barrage knew that this newcomer was the former Marshal of the Third Legion.",
        "",
        "“His Majesty has saved Marshal Ke Lun before. Marshal Ke Lun will definitely not agree!”",
        "“Everyone knows that Marshal Ke Lun is a die-hard fan of His Majesty!” ",
        "“Marshal Ke Lun, arrest them!”",
        "…",
        "The barrage was scrolling rapidly with comments when Marshal Ke Lun quickly agreed. “I agree!”",
        "“Grandpa Ke Lun, they want to overthrow the imperial family!” Lou Jingyue said. ",
        "Ke Lun said, “Isn’t it just overthrowing the imperial family? I agree! As long as you can help me eliminate the star worm poison, I will help you overthrow the imperial family!”",
        "Although he didn’t know why His Majesty wanted to overthrow the imperial family, he would definitely agree to His Majesty’s request.",
        "Lou Jingyue looked at Ke Lun in shock, as if he was looking at a traitor.",
        "Qi Shiyan was very happy. ",
        "He could sense that Ke Lun was sincere.",
        "Things were progressing very smoothly, which was really good.",
        "As for the star network… Anyway, the audience who saw this scene were all dumbfounded. “Did I hear wrong?”",
        "“Marshal Ke Lun, are you worthy of His Majesty?” ",
        "“Wasn’t this promise too quick?”",
        "“I didn’t expect Ke Lun to be greedy for life and fearful of death!”",
        "…",
        "Ming Zheng was not surprised at all by this situation. ",
        "When he was in the Spearhead Troops, he had worked with Marshal Ke Lun. The two of them had always had a good relationship.",
        "“It’s settled then.” Ming Zheng spoke. As soon as he finished speaking, he had a familiar feeling.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He was about to become delirious again…",
        "Ming Zheng covered his head and fell toward Qi Shiyan. ",
        "Qi Shiyan hugged Ming Zheng skillfully.",
        "When Ke Lun saw Qi Shiyan hugging Ming Zheng, his pupils shuddered and he felt it was a little unbelievable.",
        "His Majesty had always disliked touching others, but now he was actually leaning on someone?",
        "The key point was, this person actually hugged His Majesty. Wasn’t he too bold? ",
        "While Ke Lun was in disbelief, Ming Zheng had already become confused again.",
        "He turned into a sweet little cutie again, and when he saw Qi Shiyan’s face right in front of him, he kissed it without thinking.",
        "After the kiss, he felt it was not enough, so he kissed again with a smack sound!",
        "Former Marshal Ke Lun stood there, his hands shaking even more violently than before. ",
        "Was this person really His Majesty?",
        "***",
        "T/N: Bonus chapter for Mei-jie and Ko-fi Supporter. Thanks for the ko-fis!",
        "*Not actually his grandfather. In Chinese, it’s common to address people not related to you as Aunt, Uncle, Grandma, Grandpa, etc. "
    ],
    "previous": "Ch36 - Rebellion Being Live Broadcast",
    "next": "Ch38 - Preparing To Go Public"
}