{
    "title": "Ch38 - Preparing To Go Public",
    "content": [
        "Ke Lun was shocked.",
        "He had met His Majesty many times when His Majesty was in the sanatorium. ",
        "When His Majesty was in his delirious state due to the poison, he always sat alone without saying a word, not at all as noisy as Shan Xi and Lei Yin.",
        "At that time, he admired His Majesty very much and felt that His Majesty had amazing willpower. Even when he was delirious, he was still able to maintain his decency.\n",
        "",
        "But what was he seeing now? He saw His Majesty kissing someone!",
        "Ke Lun stared at Ming Zheng blankly, and then he saw Qi Shiyan also kissed Ming Zheng. ",
        "Taking a deep breath, Ke Lun accepted the situation.\n\n",
        "Actually, this was nothing. It was just that His Majesty had fallen in love.",
        "Ke Lun accepted the reality, immediately put his mood in order, and looked at Qi Shiyan with a smile. “Hello, my name is Ke Lun. What’s your name?”",
        "Marshal Ke Lun was already over 180 years old.\n\n ",
        "He had met countless people and interacted with countless people, thus he was particularly good at reading people.",
        "He could tell at a glance whether a person was good or bad, loyal or treacherous.",
        "Just now, he had been observing Qi Shiyan and had formed a preliminary impression of Qi Shiyan – this was a simple young man with unknown origins.\n\n",
        "If he thought about it carefully, if this person wasn’t like this, His Majesty wouldn’t like him. ",
        "His Majesty had never even spared a glance for those who approached him with ulterior motives.",
        "“You can just call me Ah Yan.” Qi Shiyan looked at the airship. “Is there anyone else on the airship?”",
        "“Yes, yes, I almost forgot about them, but they are delirious right now, so let them stay in there.” Ke Lun said.",
        "Upon hearing this, Qi Shiyan looked inside the airship curiously, and then saw two people tied up in the back seats of the airship. ",
        "One of them was a man who was tall and robust. This person was crying.",
        "There was also a woman who was cursing and shouting at people to let her go.",
        "However, the faces of these two people could not be seen clearly. After all, they were both poisoned.",
        "“Are they not in their right minds like Ah Zheng?” Qi Shiyan asked. ",
        "“Yes,” Ke Lun said.",
        "These people were quite pitiful. Qi Shiyan invited Ke Lun, “Marshal Ke Lun, I caught a star worm yesterday. Star worm meat is rich in energy and is good for the human body. Do you want to eat some?”",
        "Please visit chrysanthemumgarden (dot) com",
        "He used his mental power to check the conditions of the three people.",
        "Ke Lun was old and his body was about to collapse. As for the other two people, their conditions were slightly better than Ah Zheng’s when he first met him. Their mental power was weaker than his and Ah Zheng’s, but stronger than Lou Jingyue’s. ",
        "Therefore, the little bit of poison in Lou Jingyue was really nothing.",
        "Lou Jingyue’s mental power was also nothing.",
        "He knew that Lou Jingyue was not as powerful as people said on the star network.",
        "“Star worm meat?” Ke Lun was shocked again. ",
        "Qi Shiyan took Marshal Ke Lun to the grill and cut a piece of fried star worm meat for him.",
        "As he did this, he glanced at Ming Zheng.",
        "Ming Zheng had previously not allowed Qi Shiyan to give any meat to Lou Jingyue to eat, but he did not stop him this time.",
        "Qi Shiyan thought about it and understood the reason. ",
        "Marshal Ke Lun was very old, his face was completely disfigured, and he was very fat, so Ming Zheng wouldn’t get jealous.",
        "His partner was so good and wouldn’t randomly get jealous.",
        "Qi Shiyan took a bite of star worm meat in front of Ke Lun. “Marshal Ke Lun, don’t worry, this meat is not poisonous.”",
        "Ke Oun was still a little hesitant when he saw Lis Zapesty kiss Hi Shiyan. “I want to eat too!” ",
        "Hi Shiyan immediately cut a piece of star worm meat and gave it to Zing Iheng. “Ah Iheng, eat. Go you want more?”",
        "Zing Iheng didn’t answer and kissed Hi Shiyan again.",
        "This meant he wanted more! Qi Shiyan started feeding him meat again.",
        "Marshal Ke Lun felt his teeth aching from the sweetness. ",
        "However, this situation also proved that star worm meat was indeed non-toxic.",
        "Marshal Ke Lun took a bite of meat. Soon after he finished eating, he felt that his tired body, which seemed to be on the verge of collapse at any time, seemed to be getting better.",
        "",
        "The effect was immediate!",
        "“I didn’t expect star worm meat to have such an effect!” If he had known this earlier, he would definitely eat it every day. ",
        "With this in mind, Marshal Ke Lun asked, “Ah Yan, can we give some of this star worm meat to Shan Xi and Lei Yin to eat?”",
        "The people in the airship were Shan Xi and Lei Yin?",
        "Ah Zheng had said that as long as Shan Xi was cured, they would be able to gain the support of the Second Legion. After Lei Yin was cured, the Spearhead Troops would also be in his pocket…",
        "Wasn’t his luck too good? ",
        "He had just discussed the rebellion with Ah Zheng yesterday, and today, these people came to the door.",
        "“Of course you can give them some.” Qi Shiyan said.",
        "Marshal Ke Lun was very happy. He took a piece of star worm meat and fed it to the two tied up people.",
        "Although Shan Xi and Lei Yin were noisy, they had gotten along with Marshal Ke Lun for many years and were very familiar with him. ",
        "Now Marshal Ke Lun fed them food, and they ate it directly since they were starving.",
        "But Shan Xi cried while eating. “Where’s Brother* Heng? Where’s my Brother Heng?”",
        "Lei Yin took a bite and said, “Even if you give me something delicious, I won’t listen to you. Let me go!”",
        "Qi Shiyan came over to watch the fun and asked curiously, “Marshal Ke Lun, the ‘Brother Heng’ that General Shan mentioned is the Marshal of the Second Legion?” ",
        "The original owner really didn’t understand the military situation. He only knew that the Marshal of the Second Legion was surnamed Duan, but he didn’t know the other party’s name.",
        "There were many people like him.",
        "For example, Marshal Ke Lun. Not many young people today knew him.",
        "“If it’s not Duan Heng, who else could it be? This Shan Xi is so powerful in combat, but I didn’t expect that after he lost his mind, he became like a different person, always crying.” Marshal Ke Lun was helpless. ",
        "“Is General Shan very powerful in combat?” Qi Shiyan was a little curious.",
        "Marshal Ke Lun said, “Very strong. Very strong.”",
        "",
        "He introduced Shan Xi to Qi Shiyan.",
        "When Shan Xi was still in the Second Legion, he was the strongest individual soldier in the Second Legion. ",
        "The reason why he was not a marshal was that becoming a marshal required more than just combat capability.",
        "What a marshal needed most was a sense of the overall situation and command ability.",
        "Duan Heng’s mental power was only A+, and his combat strength was only average, but his command talent was among the best in the military. In the battles he commanded, he could always minimize the losses.",
        "Shan Xi was the opposite. He had poor command ability, but very strong combat ability. His mental power reached S+ very early. ",
        "The two had a very good relationship, but unfortunately Shan Xi was poisoned by star worm poison when fighting against high-level star worms.",
        "Duan Heng wanted to personally take care of Shan Xi and wanted Shan Xi to stay in the Second Legion, but Shan Xi felt that if he stayed in the Second Legion, it would affect Duan Heng’s ability to command and take up Duan Heng’s energy.",
        "He didn’t want to die in front of Duan Heng, so he took the initiative to come to the convalescent planet.",
        "Ke Lun had always admired Shan Xi, but he didn’t expect that Shan Xi would cry “wuwu” whenever he was delirious. ",
        "While Marshal Ke Lun introduced Shan Xi to Qi Shiyan, netizens were also looking up Shan Xi’s information.",
        "Many people didn’t know much about Shan Xi before, but now they knew.",
        "“General Shan was so handsome a hundred years ago! He was also the first place winner of the mecha competition at that time!”",
        "“General Shan’s look when fighting is also too handsome!” ",
        "“General Shan is so strong! My God, he killed more than one high-level star worm!”",
        "“The General Shan in the videos and the information is completely different from the General Shan now.”",
        "“Marshal Duan and General Shan have a very good relationship. After Qi Shiyan cures General Shan, will Marshal Duan stand on their side?”",
        "… ",
        "At the same time, there was also a group of people who were very conflicted.",
        "“I am a fan of General Shan. I always thought that it should be General Shan who protected the weak Marshal Duan. I didn’t expect General Shan to be like this.”",
        "",
        "“I must have seen it wrong, General Shan is not like this!”",
        "“Shouldn’t it be General Shan who carried Marshal Duan like a princess? Why is it General Shan who is crying for Marshal Duan?” ",
        "…",
        "Duan Heng: “…” He was not weak! He would not be carried like a princess!",
        "In fact, even he didn’t know that Shan Xi would be like this.",
        "Seeing Shan Xi’s pitiful appearance, Duan Heng felt extremely distressed and wanted to run to the convalescent planet immediately to comfort his partner. ",
        "Wait, wait, Shan Xi loved face the most. Now that him acting like this had been broadcast live and known to the whole network, would he be angry in the future? Would he feel ashamed to face people?",
        "Fortunately, there was His Majesty standing in front. His Majesty had lost much more face than Shan Xi!",
        "Lu Yuan had a similar thought.",
        "Fortunately, there was General Shan standing in front. Even if His Majesty lost face, there was someone to accompany him. ",
        "Thinking of this, Lu Yuan asked Jiang Jin. “Do you really want to reveal His Majesty’s identity to the public?”",
        "Jiang Jin said, “Of course we have to make it public. We can’t let His Majesty get scolded. After making His Majesty’s identity public, we can also get everyone to support His Majesty’s great cause. Isn’t that good?”",
        "Lu Yuan: “…” His Majesty’s great cause was to rebel against himself. Was this really good?",
        "“If we don’t clarify, the soldiers will be dissatisfied. It’s better to clarify.” Jiang Jin was a little excited. ",
        "He hated the imperial family.",
        "Ming Zheng said in the live broadcast that he wanted to overthrow the imperial family. He was so happy!",
        "He wanted to guide public opinion and make everyone support Ming Zheng!",
        "Right now, there were many people on the star network who were scolding “Ah Zheng”, but he believed that once those people knew “Ah Zheng’s” true identity, they would stop scolding him. ",
        "His Majesty was so cute. He just wanted to rebel against himself. What was wrong with that?",
        "“Then let’s clarify. I’ll make a plan.” Lu Yuan said.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Jiang Jin agreed.",
        "Not only did they need to make a plan, but also, given His Majesty’s identity, they needed to notify some people in advance. ",
        "Only in this way could the entire military work together to help His Majesty clarify the matter.",
        "In the First Legion, some generals were cursing. “This Ah Zheng is going too far!”",
        "“Marshal Ke Lun is greedy for life and fearful of death. He has betrayed His Majesty!”",
        "“Hmph, even if the whole world is against His Majesty, I will still stand by His Majesty!” ",
        "…",
        "As they were talking, they received a call from Lu Yuan.",
        "Then, several people were petrified.",
        "They silently deleted their previous posts online, cursing “Ah Zheng”. “No wonder Marshal Ke Lun agreed so quickly. He must have recognized him.” ",
        "“No wonder he’s called Ah Zheng…”",
        "“I will support His Majesty in overthrowing the imperial family!”",
        "As they were talking, one of them said, “It’s okay that General Shan loves to cry, but why is His Majesty such a love brain? He keeps kissing Qi Shiyan! He kissed him again!”",
        "“It’s a bit painful for me to watch His Majesty being abducted.” ",
        "“Actually, Qi Shiyan is pretty good too.”",
        "“This is quite good… From today on, I am a CP fan of His Majesty and Qi Shiyan!”",
        "“Lou Jingyue is really blind. He didn’t even recognize His Majesty!”",
        "… ",
        "Lou Jingyue, who was considered to be blind, was very angry at the moment.",
        "How could Marshal Ke Lun do this?! He had misjudged him!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Although he was furious, Lou Jingyue did not leave.",
        "He had to stay here to protect the delirious General Shan and General Lei. ",
        "These two had a very good relationship with His Majesty. They would definitely not betray His Majesty. He didn’t know if they would be targeted by Ke Lun and the others because of this.",
        "After Qi Shiyan listened to Marshal Ke Lun introduce Shan Xi, he also listened to Marshal Ke Lun introduce Lei Yin.",
        "Then, he asked about the situation in the sanatorium. After all, Ah Zheng had always wanted to go to the sanatorium.",
        "“The sanatorium is doing well. We haven’t encountered any star worms.” Marshal Ke Lun talked about the situation in the sanatorium. ",
        "Qi Shiyan had some yearning for the sanatorium.",
        "After he came to this world, he had always lived in the forest. The sanatorium was a small human society.",
        "He wanted to enter human society!",
        "“Marshal Ke Lun, since your airship is fine, we will take your airship to the sanatorium the next time Ah Zheng is clear-headed.” ",
        "“Okay.” Marshal Ke Lun agreed. “When the time comes, I will give General Shan and General Lei some medicine to make them clear-headed.”",
        "He wanted to tell these two people about His Majesty’s situation so that they could be at ease.",
        "“Okay.” Qi Shiyan agreed and looked at Marshal Ke Lun. “Marshal Ke Lun, give me your hand. I will help you check your physical condition.”",
        "Marshal Ke Lun nodded and extended a hand toward Qi Shiyan. ",
        "Qi Shiyan grabbed Marshal Ke Lun’s hand, a little excited.",
        "This was the second person he touched after many years!",
        "This warm, chubby, callused, and blue and purple hand was so cute!",
        "Qi Shiyan touched his hand twice, and the next second, Ming Zheng snatched his hand away and said angrily, “You can’t touch others!” ",
        "Qi Shiyan quickly comforted him. “Okay, okay, I won’t touch others. I will only touch you from now on.”",
        "Marshal Ke Lun: Who was he? Where was he? What was he doing?",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Why would this kid want to touch an old man’s hand?! And His Majesty was actually jealous!",
        "*** ",
        "T/N: Bonus chapter for BLreader. Thanks for the ko-fi!",
        "*As mentioned in Chapter 36, when Shan Xi says 恒哥 (Heng ge), I will translate it in English as Brother Heng, but when he’s speaking in a more cutesy manner and says 恒哥哥 (Heng gege), I will keep it in pinyin."
    ],
    "previous": "Ch37 - People Are Coming Again",
    "next": "Ch39 - Ah Zheng’s Identity"
}