{
    "title": "Ch39 - Ah Zheng’s Identity",
    "content": [
        "The audience watching the live broadcast also laughed to death when they saw this scene. “Qi Shiyan actually touched Marshal Ke Lun’s hand!”",
        "“Marshal Ke Lun: I am so old. Why are there still people teasing me?” ",
        "“Thinking about it carefully, Qi Shiyan is really quite good. He didn’t touch Lou Jingyue’s hand and only touched Marshal Ke Lun’s hand. He is very sensible.”",
        "“Qi Shiyan: Young people’s hands can’t be touched carelessly, but touching an old person’s hand should be okay, right?”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Ah Zheng: You are also not allowed to touch an old person’s hand! Hahahaha, Ah Zheng is the reincarnation of a vinegar spirit*!”",
        "… ",
        "However, those who had just learned “Ah Zheng’s” identity were now bewildered.\n\n",
        "Why was His Majesty even jealous of Marshal Ke Lun?",
        "Convalescent planet.",
        "Qi Shiyan’s eyes were clean and pure. Marshal Ke Lun was very sure that the other party had no strange thoughts about him.\n\n ",
        "No normal person would have any thoughts about a fat old man who was disfigured and dying.",
        "He didn’t know why Qi Shiyan touched him.",
        "Well, the way Qi Shiyan touched him just now was actually similar to the way some people touched a pet, but he was obviously a person…\n\n",
        "Marshal Ke Lun was extremely embarrassed when he saw Qi Shiyan coaxing His Majesty in front of him. ",
        "Qi Shiyan was very calm. He had lived in a special environment since he was a child. The original owner of this body was a person who was scolded and blackened by the entire network all day long. All this made him not care much about other people’s opinions.",
        "After coaxing Ming Zheng, Qi Shiyan looked at Marshal Ke Lun and said, “Marshal Ke Lun, please stretch out a finger.”",
        "He couldn’t touch, but he still had to check.",
        "Marshal Ke Lun saw regret in Qi Shiyan’s eyes. ",
        "He silently stretched out a finger, which was then held by Qi Shiyan.",
        "Qi Shiyan used his mental power and supernatural powers to carefully examine Marshal Ke Lun’s body. “Marshal Ke Lun, there isn’t much poison in your body. The main problem is that your body is severely deficient. In the next few days, you should eat more star worm meat to nourish your body.”",
        "“Okay, I’ll eat more.” Marshal Ke Lun immediately agreed.",
        "After he ate the star worm meat, he realized how delicious it was and he wanted to eat more! ",
        "After examining Marshal Ke Lun’s body, Qi Shiyan went to examine Shan Xi and Lei Yin who were tied up.",
        "The situation of these two people was a little more serious than that of Marshal Ke Lun, but as long as they didn’t use their mental power, there wouldn’t be any problems in the short term.",
        "",
        "During the examination, Qi Shiyan behaved well and did not touch anyone. After all, his partner was watching him closely.",
        "After the examination, he started chatting with Marshal Ke Lun. ",
        "He loved to chat!",
        "Before, when he chatted with Lou Jingyue, his family’s Ah Zheng would be unhappy. Now, when he chatted with Marshal Ke Lun, his family’s Ah Zheng didn’t stop him, so he could chat to his heart’s content.",
        "Qi Shiyan asked Marshal Ke Lun about the sanatorium.",
        "Marshal Ke Lun did not hide anything and answered all his questions. However, after answering, he also asked about Qi Shiyan’s situation out of curiosity. ",
        "Qi Shiyan didn’t say anything.",
        "He knew himself very well.",
        "He had never interacted with others and couldn’t lie. If he talked too much, he would easily reveal everything about himself, and even say things that he shouldn’t say.",
        "It was better for him not to say anything. ",
        "Now, he had to pretend to be a mysterious and powerful man and not let anyone know that he was the crown prince’s fiancé.",
        "The original owner’s reputation wasn’t very good.",
        "Thinking of the original owner’s previous experience, Qi Shiyan began to imagine himself conquering a bunch of bigshots here, and then returning to the Capital Star for revenge.",
        "This was how those feel good* novels he had read in the library when he was bored were written. ",
        "Two hours later, after chatting and eating, Hi Shiyan felt that his supernatural powers had recovered.",
        "Le also discovered that his supernatural powers were a little stronger than before.",
        "Le didn’t know if this was due to the star worm meat.",
        "Why didn’t a second star worm come to the door? ",
        "“I’m going to help Ah Zheng eliminate the poison,” Qi Shiyan said to Marshal Ke Lun, “Ah Zheng will become clear-headed soon.”",
        "“I’ll go give medicine to General Shan and General Lei.” Marshal Ke Lun said.",
        "",
        "Upon hearing this, Lou Jingyue, who was sitting on the ground nearby, immediately stood up, his eyes shining with excitement.",
        "When General Shan and General Lei became clear-headed, he would file a complaint! ",
        "While Qi Shiyan helped Ming Zheng eliminate the poison, Marshal Ke Lun entered the airship, closed the door and fed medicine to Shan Xi and Lei Yin.",
        "They were said to be fed medicine, but in addition to taking special medicine, the two were also given injections.",
        "Only in this way could they become clear-headed as soon as possible.",
        "When Shan Xi and Lei Yin’s minds cleared, Marshal Ke Lun said, “We have found His Majesty. His Majesty is hiding his identity. Don’t expose him.” ",
        "When Marshal Ke Lun chatted with Qi Shiyan before, he wanted to find out more about Qi Shiyan’s background.",
        "As a result, Qi Shiyan was very careful with what he said and didn’t reveal any useful information to him.",
        "This Qi Shiyan looked young and simple, but he was definitely an intelligent person.",
        "However, there should be something wrong with his identity. He probably had a grudge against the imperial family. ",
        "Otherwise, there was no need for His Majesty to conceal his identity.",
        "Marshal Ke Lun felt that it was not good for His Majesty to hide his identity and fall in love with Qi Shiyan. This was deceiving the other party, a young man.",
        "But this was His Majesty, and this young man could cure them!",
        "As soon as Shan Xi and Lei Yin become clear-headed, they heard Marshal Ke Lun say this. Although the two of them didn’t know the ins and outs of the matter, they both nodded and agreed. ",
        "Marshal Ke Lun then let them go and took them off the airship.",
        "As soon as the two got off the airship, they saw Ming Zheng.",
        "The area above Ming Zheng’s nose was still blue and purple, but one could already make out his original appearance.",
        "He looked very healthy. One could tell at a glance that he had had a good time these past few days. ",
        "The star worm poison in his body had been suppressed!",
        "Shan Xi and Lei Yin were both stunned.",
        "",
        "“General Shan, General Lei.” Ming Zheng greeted his old comrades.",
        "Shan Xi and Lei Yin finally came to their senses. ",
        "Shan Xi asked in a trembling voice. “You, the star worm poison in your body…”",
        "“Ah Yan helped me eliminate some of the star worm poison.” Ming Zheng looked at Qi Shiyan.",
        "After he became clear-headed, he naturally remembered everything he had done before.",
        "He felt a little embarrassed when he thought of how he was even jealous of Marshal Ke Lun. ",
        "But now that things had come to this, there was no point in worrying about it, so he might as well just accept it.",
        "Shan Xi immediately looked at Qi Shiyan. “Can you help people eliminate the star worm poison?”",
        "Qi Shiyan was very sure. “Yes.”",
        "Shan Xi’s eyes lit up. ",
        "He didn’t want to die. He wanted to live!",
        "He couldn’t wait to ask Qi Shiyan if he could help him eliminate the star worm poison.",
        "But before he could open his mouth, a person jumped out from the side.",
        "Lou Jingyue rushed out in a hurry. “General Shan, if you want him to help eliminate the poison, you must join them and overthrow the imperial family with them!” ",
        "Shan Xi was stunned.",
        "Ming Zheng said, “What he said is true. If you want Ah Yan to help you eliminate the star worm poison, you must join us and overthrow the imperial family with us. Are you willing?”",
        "He really wanted to overthrow the imperial family, so it was good to take this opportunity to find some allies.",
        "Without waiting for Shan Xi and Lei Yin to speak, Lou Jingyue spoke first. “General Shan, General Lei, don’t agree!” ",
        "However, Shan Xi and Lei Yin looked at each other and said without hesitation. “We are willing.”",
        "Although they didn’t know why His Majesty wanted to do this, this was His Majesty’s wish and they were willing to agree.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Lou Jingyue was dumbfounded. “General Shan, General Lei, why are you guys doing this? Are you worthy of His Majesty?”",
        "Lou Jingyue was very anxious, and his words came out like a roar. ",
        "Many people watching the live broadcast shouted the same thing as Lou Jingyue. “General Shan! Are you worthy of His Majesty?”",
        "“General Lei, didn’t you say before that the person you respect most is His Majesty?”",
        "“How could they do this?! Didn’t they agree a little too quickly?”",
        "“I’m going to stop being a fan of General Shan and General Lei!” ",
        "…",
        "In the end, people naturally began to denounce “Ah Zheng”.",
        "“Who the hell is this Ah Zheng?”",
        "“His Majesty has been on the front lines for so many years and has saved so many people. How could they betray His Majesty?” ",
        "“Qi Shiyan is young and doesn’t understand anything, so he was deceived by him!”",
        "“Now everything they’re doing is being broadcast live. The imperial family won’t let them go!”",
        "“They will be wanted by the imperial family!”",
        "… ",
        "Many people on the star network were worried about Qi Shiyan, fearing that if he continued like this, he would become a wanted criminal.",
        "Qi Shiyan’s life before was too miserable. If he became a wanted criminal in the future…",
        "He had strong mental power and could help people eliminate star worm poison. He originally could have lived a happy life, but now he might become a wanted criminal because of “Ah Zheng”… How could this be?!",
        "This Ah Zheng was not worthy of Qi Shiyan’s love! ",
        "Outside the convalescent planet, the new recruits Jiang Jin had brought in to protect the convalescent planet started to make a fuss, hoping that their commander would lead them to capture “Ah Zheng”.",
        "Countless people gathered under the official account of the Second Legion, demanding that Marshal Duan issue a statement saying that he would not support “Ah Zheng” just because of Shan Xi.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "However, at this moment, various official military accounts posted the same content at the same time.",
        "This was a long article with the title: “Regarding the incident in which His Majesty the Emperor accidentally entered Qi Shiyan’s live broadcast room, we issue the following explanation.” ",
        "When people saw this headline, they were a little confused. “Did I read it wrong?”",
        "“His Majesty has entered Qi Shiyan’s live broadcast room?”",
        "“What’s going on?”",
        "… ",
        "They clicked in with doubts, and then saw a series of Ming Zheng’s photos.",
        "At the beginning, Ming Zheng was only eighteen years old, young and handsome, with even a bit of childishness on his face.",
        "Next came Ming Zheng when he was twenty years old. He had a determined look on his face and blue and purple spots on his forehead.",
        "Then there was Ming Zheng at the age of twenty-two, Ming Zheng at the age of twenty-four, Ming Zheng at the age of twenty-six… ",
        "As time went by, the blue and purple patches on his face became larger and larger.",
        "There were some simple explanations between these photos, such as on a certain day of a certain month of a certain year, Ming Zheng participated in a certain battle and achieved certain results.",
        "He killed many star worms, and the poisoning of his body became more and more serious.",
        "Finally, three years ago, the blue and purple discoloration covered his entire face… ",
        "He looked exactly like “Ah Zheng” when he first appeared.",
        "His Majesty’s experience was really touching. Many people’s eyes turned red as they read.",
        "His Majesty had really suffered too much. When he went to the battlefield, he was only eighteen years old, younger than Qi Shiyan was now!",
        "But after reading to the end, they realized something and were dumbfounded. ",
        "It seemed that Ah Zheng, whom they had been boycotting, was His Majesty!",
        "His Majesty was very pitiful, but these days, His Majesty was jealous, acted coquettishly and kissed Qi Shiyan on the live broadcast… It was strangely cute.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Many people laughed and cried.",
        "And below, there was something else. ",
        "There were not only photos here, but also some videos and written explanations.",
        "Among them was an article that explained the situation three years ago.",
        "Three years ago, His Majesty became seriously ill. In order to maintain the stability of the empire, Ming Qingyu was chosen as the crown prince.",
        "It wasn’t that His Majesty didn’t care about Qi Shiyan being bullied, but that His Majesty didn’t know about it. ",
        "Of course, this article also contained recent events, such as Ming Zheng instructing the people around him to throw him out when they encountered a high-level star worm, so that he could self-destruct and die together with the high-level star worm.",
        "Then, the military sent him to the convalescent planet, but they unexpectedly encountered a traitor. His Majesty was lured onto an airship by the traitor and left the sanatorium…",
        "The military also said that they did not disclose His Majesty’s condition before to avoid causing unrest.",
        "But now that His Majesty’s condition had improved, thus stabilizing military morale, they made His Majesty’s condition public. ",
        "“So… Ah Zheng is His Majesty?”",
        "“That’s not Ah Zheng (阿正). That’s obviously Ah Zheng (阿诤*)!”",
        "“His Majesty really knows how to play…”",
        "“No wonder Marshal Ke Lun and General Shan agreed immediately. It turns out it was because it was His Majesty who asked them to rebel.” ",
        "“Both Marshal Ke Lun and General Shan were shocked after hearing what His Majesty said. Now I am also shocked.”",
        "“Marshal Ke Lun: Why does His Majesty want to rebel?”",
        "“I feel a little uncomfortable right now. My impression of His Majesty is completely shattered.”",
        "“This is impossible! This is absolutely impossible! That jealous Ah Zheng cannot possibly be His Majesty!” ",
        "“I am a fan of His Majesty. I took screenshots of many of Ah Zheng’s black moments and even made a set of emoticons… Wuwu, I’m sorry to His Majesty…”",
        "***",
        "Please visit chrysanthemumgarden (dot) com",
        "T/N: *醋精 (cu jing) – vinegar spirit. Hope everyone gets this reference. Jealousy/being jealous in Chinese is 吃醋 (chi cu) – literally eating vinegar, so calling him the reincarnation of a vinegar spirit is just a way to say he is very jealous.",
        "*爽文 (shuang wen) – you’ve probably come across this term before if you can read Chinese webnovels in their raw form. 爽文 (shuang wen) is often mtl-ed as “cool” text, but 爽 (shuang)  means more feel good/instant gratification. It describes novels that give readers a feeling of gratification – basically every novel with the protagonist counterattacking, face slapping, etc. is a shuang wen (文 means text/novel). This novel is a shuang wen. ",
        "*Just a reminder, netizens use 阿正 (Ah Zheng), a different “Zheng” than his name, which is 明诤 (Ming Zheng) when referring to Ming Zheng. I left a note on this in Chapter 16, but in case anyone’s forgotten, in Chapter 15 where Qi Shiyan and Ming Zheng introduce themselves, Ming Zheng introduced himself as 阿诤 (Ah Zheng), using the same “Zheng” as his real name, but because they sound similar (although not exact –  正 and 诤 are both spelled “Zheng” in English, but they have different tones), netizens misheard and thought it was 阿正 and have been using 阿正 since."
    ],
    "previous": "Ch38 - Preparing To Go Public",
    "next": "Ch40 - Mecha"
}