{
    "title": "Ch4 - Qi Jianuo",
    "content": [
        "While Ming Qingyu was feeling uneasy, Qi Jianuo was also feeling uneasy when he saw the handsome Qi Shiyan in the live broadcast.",
        "He knew that there was something fishy about this live broadcast, and he also knew that this was a trap set by Ming Qingyu for Qi Shiyan. ",
        "After Qi Shiyan signed the live broadcast contract, Ming Qingyu told him that they would be able to be together for real soon.",
        "Because of this, he had been following the live broadcast since it started.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He was extremely excited when he saw the organizer of the live broadcast let Qi Shiyan enter the escape pod under the pretext that there was a problem with the spaceship, and then sent the escape pod to a primitive forest.",
        "He knew Qi Shiyan very well. He knew that Qi Shiyan’s following performance would be very bad. ",
        "Qi Shiyan’s reputation had been very bad in the past two years, but his parents were heroes after all.\n\n",
        "Those young people hated Qi Shiyan, but those older people who had experienced twenty years of war, especially those who had been rescued by Qi Yuncheng, still stood by Qi Shiyan.",
        "After all, Qi Shiyan had never done anything illegal or criminal. In addition, since the stuff online was a mix of truth and lies, many older people didn’t believe what they saw on the star network.",
        "However, if Qi Shiyan performed particularly poorly in this live broadcast and did not show the slightest bit of Qi Yuncheng’s demeanor, those people would be extremely disappointed in Qi Shiyan even if they still revered Qi Yuncheng.\n\n ",
        "Like Ming Qingyu, Qi Jianuo felt that Qi Shiyan would collapse after landing on the planet and would not dare to leave the escape pod.",
        "Qi Shiyan might have to stay in the escape pod even for eating, drinking, defecating and urinating.",
        "The latest live broadcast device on Qi Shiyan’s body would automatically block the scene of him going to the toilet, but even so, he would still make a fool of himself.\n\n",
        "Qi Jianuo was waiting to see him humiliated, but what Qi Jianuo didn’t expect was that Qi Shiyan’s reaction was different than expected. ",
        "How could Qi Shiyan become like this?",
        "Could it be that the way Qi Shiyan behaved in front of him before was all fake?",
        "That was impossible. He definitely hadn’t been pretending. No one could pretend since childhood!",
        "Did Qi Shiyan really develop a second personality? ",
        "No matter what, in this situation, as a good brother who loved Qi Shiyan, he had to respond.",
        "Qi Jianuo opened his real-name star network account and posted a message on Xingbo*.",
        "This Xingbo post was very long. He first condemned the behavior of the program team and accused them of sending Qi Shiyan to a dangerous primitive forest.",
        "Then, he called on netizens not to speak ill of Qi Shiyan. ",
        "Finally, he expressed his concern for Qi Shiyan.",
        "As soon as Qi Jianuo posted this Xingbo post, countless people left comments. “Jianuo, you are so kind.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“You’ve been bullied by Qi Shiyan since you were a child, yet you still care about him.”",
        "“Jianuo, don’t worry about Qi Shiyan. He will only cause trouble for you!” ",
        "…",
        "Qi Jianuo was four years older than Qi Shiyan and two years older than Ming Qingyu.",
        "He was recognized as Qi Shiyan’s good brother.",
        "After Qi Shiyan’s parents passed away and he moved into the Qi family, Qi Jianuo’s Xingbo began to update Qi Shiyan’s daily life. At that time, almost all those who admired Qi Yuncheng and cared about Qi Shiyan were attracted to Qi Jianuo’s Xingbo. ",
        "They watched Qi Shiyan grow up little by little on Qi Jianuo’s Xingbo.",
        "Qi Jianuo fed Qi Shiyan, told Qi Shiyan stories, and took Qi Shiyan to play… The loving appearance of the two brothers attracted countless people’s love.",
        "Qi Shiyan in Qi Jianuo’s Xingbo was very cute.",
        "But the Qi Shiyan captured by the media was not like this. The Qi Shiyan captured by the media had a very bad temper. He would give Qi Jianuo the cold shoulder and completely ignore Qi Jianuo’s words. ",
        "The way the two got along, it would be more accurate to say that Qi Jianuo was Qi Shiyan’s servant rather than being Qi Shiyan’s brother.",
        "When Hi Shiyan was young, no one said anything, but as Hi Shiyan grew up, he still acted like this, and everyone became dissatisfied with him.",
        "Zany people who were originally fans of Hi Shiyan began to sympathihe with Hi Aianuo.",
        "Lowever, at that time, Hi Shiyan was not yet an adult, so not many people attacked Hi Shiyan. ",
        "When Qi Shiyan came of age and got engaged to Ming Qingyu, his black materials started to emerge one after another, and more and more people began to dislike Qi Shiyan.",
        "While people hated Qi Shiyan, they also sympathized with Qi Jianuo.",
        "Qi Jianuo was a talented, famous musician and also passionate about charity.",
        "He went to the front lines every year to perform for the soldiers on the front lines on a voluntary basis. He also went to orphanages regularly every month to deliver supplies. He also regularly organized various charity events. He was very kind. ",
        "He was very busy, with activities one after another, but even though he was so busy, he still had to help Qi Shiyan clean up messes from time to time.",
        "Not long ago, when he was attending an event, Qi Shiyan got drunk and started arguing with someone at a bar. He had no choice but to leave the event and rush over to take Qi Shiyan home.",
        "",
        "It would be fine if Qi Shiyan respected Qi Jianuo, but Qi Shiyan didn’t take Qi Jianuo, or even Qi Jianuo’s parents, seriously!",
        "Qi Jianuo was so pitiful. ",
        "He was too kind. Even though Qi Shiyan caused him so much trouble, he still cared about Qi Shiyan.",
        "It was very lively under Qi Jianuo’s Xingbo.",
        "Not only did his post fail to help Qi Shiyan, it also made some people more dissatisfied with Qi Shiyan. “Qi Shiyan is really a troublemaker. Why would he go participate in a live broadcast when everything is fine?”",
        "“He’s also stupid. There’s a trap in the live broadcasting platform’s contract, but he actually couldn’t tell at all.” ",
        "“Jianuo is at the front lines performing for charity. When something like this happens, he can’t work properly.”",
        "…",
        "The excitement outside had nothing to do with Qi Shiyan.",
        "Qi Shiyan walked happily in the forest, getting farther and farther away from the escape pod. ",
        "After being stranded on an undeveloped planet, the right thing to do was to stay in the escape pod and wait for rescue.",
        "But the oxygen stored in the escape pod had been poisoned and killed the original owner, which meant that someone wanted to kill the original owner.",
        "Maybe the person who wanted to kill the original owner would arrive earlier than the people who wanted to save the original owner.",
        "Under such circumstances, he must be as far away from the escape pod as possible. ",
        "Of course, Qi Shiyan dared to do this because he had something to rely on.",
        "On his planet, humans awakened their mental powers and supernatural powers while being harmed by radiation and toxins.",
        "Those who took care of him in the apocalypse all had strong mental power. His mental power was the strongest among them.",
        "When he transmigrated to this world, he not only brought his ability to purify toxins and radiation, but also brought his mental power! ",
        "His body was a little weak, and he couldn’t exert his full fighting power now, but there was absolutely no problem for him to survive in this forest.",
        "He really loved this forest!",
        "Please visit chrysanthemumgarden (dot) com",
        "There were no walking paths in the primitive forest, so Qi Shiyan walked very slowly. As he walked, he touched here and there, with a smile on his face all the time.",
        "He had only seen flowers, plants and trees in videos and photos before, but now that he saw them with his own eyes, he loved them indescribably. ",
        "If it wasn’t for wanting to leave the area where the escape pod was as soon as possible, he really wanted to find a tree to climb up and lie down to bask in the sun.",
        "Qi Shiyan just kept walking in the forest, and more and more people came to watch the live broadcast.",
        "“Is this Qi Shiyan’s live broadcast? Did I come to the wrong place?”",
        "“Where is Qi Shiyan?” ",
        "“How is it possible that this person is Qi Shiyan?”",
        "“Isn’t Qi Shiyan a mysophobic crybaby?”",
        "“If he lands in a primitive forest, he will starve to death, right?”",
        "… ",
        "As these people were talking, they saw Qi Shiyan, who had mysophobia, pluck a handful of young leaves from the bush next to him and stuff them into his mouth.",
        "The leaves tasted bitter and were not delicious, but they weren’t poisonous!",
        "Not poisonous!",
        "He could even taste the flavor! ",
        "In his previous life, he lived in the apocalypse, and all the food Qi Shiyan ate had been contaminated by radiation, leaving a disgusting taste of decay.",
        "Later, his senses of taste and smell gradually failed in the overly harsh environment.",
        "This body of his was different.",
        "This body’s sense of taste was very sensitive and he could easily taste the original flavor of food. ",
        "He never thought that ordinary grass and leaves would be so delicious. He didn’t know how delicious the legendary meat and fruits would be.",
        "After all, he only ate canned food in his previous life, and it was canned food that had gone bad.",
        "",
        "Qi Shiyan felt that he was like a mouse that had fallen into a rice vat and was extremely happy.",
        "People watching the live broadcast couldn’t understand. ",
        "“Is this person really Qi Shiyan? Has he been replaced?”",
        "“He found a substitute?”",
        "“It’s not a substitute. Nowadays, identity testing looks at genes, not faces. But Qi Shiyan looks like he might have mental problems or a split personality.”",
        "“Looking at it this way, it really seems to be true. Did this personality of his just appear? Everything he sees seems new to him.” ",
        "“I also think he should have a split personality. This personality of his is much more likable than his main personality.”",
        "“Like a little elf in the forest.”",
        "“I’m going to become his fan!”",
        "… ",
        "As everyone was talking, some face fans* actually appeared.",
        "But the majority were still Qi Shiyan’s black fans*.",
        "“Qi Shiyan is really too weak. After encountering such a small thing, he split into a new personality.”",
        "“I said he has mental problems, and it turns out he does.” ",
        "“A person with such mental problems is not worthy of being the future crown princess!”",
        "“Qi Shiyan is really not worthy of His Highness the Crown Prince.”",
        "“Don’t worry, His Highness the Crown Prince will be able to get rid of him soon! Qi Shiyan can split out a new personality, but his strength cannot grow! He is a C-level loser who can’t even pass the self-defense course for the nursing major, yet he actually dares to leave the escape pod and walk around… Although there are no dangerous creatures on this planet, there are still predators. I’m afraid it won’t be long before he is bitten to death.”",
        "“It would be best if Qi Shiyan died, then His Highness the Crown Prince won’t be dragged down by him.” ",
        "“I really hope a dangerous animal suddenly appears and eats him.”",
        "“I really can’t accept him becoming the empress in the future!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "…",
        "The founding emperor of the Human Empire was a brave and warlike man. ",
        "He fought against other civilizations in the interstellar, allowing human civilization to continue and also earning himself a lot of wealth.",
        "The imperial family owned a lot of private planets!",
        "Today, the convalescent planet under Qi Shiyan’s feet was one of the private planets owned by the imperial family.",
        "The imperial family was also very wealthy. The military expenses of the First Legion, which was under the control of the imperial family, were entirely paid by the imperial family, and only the imperial family could command it. ",
        "When the empire was at war, the imperial family must fight.",
        "Therefore, more than 20 years ago, when the star worms launched a massive attack on the Human Empire and the empire was facing a crisis, the retired emperor and Ming Qingyu’s father, two S-level powerhouses, went to the front lines to fight the star worms at the call of the people.",
        "As a result, the two were defeated by the star worms, who also crossed their defense lines and entered the empire.",
        "Not only that, but in order to cover up their own mistakes, they described the star worms as being extremely terrifying, as if they were invincible. ",
        "During that time, the entire empire was filled with a mood of despair. The wealthy people in the empire purchased a large number of warships and supplies, intending to escape to other civilizations to avoid becoming food for the star worms.",
        "However, the rich could escape, but what about ordinary people?",
        "Interstellar travel consumed a lot of energy and was expensive. Although most ordinary people could see the outside world through the star network, they would never leave their home planet in their lifetime.",
        "They couldn’t escape. ",
        "At that time, the civilians of the Human Empire thought they were going to die.",
        "Every day, there were even many people who committed suicide out of despair.",
        "It was at this time that Qi Yuncheng beat back the star worms. He also used the method of mutual destruction to kill a high-level star worm that was considered invincible to humans at that time.",
        "One had to know that the S-level retired emperor, his eldest son who was also S-level, and several S-level nobles fought against a high-level star worm, but they were all defeated. An S-level guard even died! ",
        "Qi Yuncheng was only one person, but he actually killed a high-level star worm.",
        "Were high-level star worms too powerful?",
        "",
        "No, it was obvious that the retired emperor and the others were too weak!",
        "The prestige of the imperial family plummeted instantly, and the retired emperor urgently passed the throne to his youngest son, Ming Zheng. Ming Zheng, who was only 18 years old at the time, went to the front lines… ",
        "Ming Zheng’s performance was truly exceptional, allowing the imperial family to regain its prestige.",
        "But other members of the imperial family except Ming Zheng were still not well liked.",
        "It was not until Ming Qingyu got engaged to Qi Shiyan and became the crown prince that people began to pay attention to Ming Qingyu.",
        "As a result, compared with Qi Shiyan, Ming Qingyu actually appeared to be extremely outstanding. ",
        "In addition, Ming Qingyu was different from his father and grandfather. After graduating from the military academy, he went to the front lines and made many contributions, making the public like him more.",
        "Now, they actually felt that Qi Shiyan was not worthy of Ming Qingyu, and even hoped that Qi Shiyan would encounter danger and die soon.",
        "Coincidentally, at this moment, a tiger appeared in front of Qi Shiyan.",
        "*** ",
        "T/N: Lol what the heck – Qi Jianuo obviously has white lotus (Chinese term for someone that pretends to be pure and innocent, but is actually vicious and scheming) practically stamped on his face, but people actually think he’s so “kind” and “pitiful”.",
        "*星博 (Xingbo) – the interstellar version of Weibo, which is a Chinese social media platform used for micro-blogging.",
        "*颜粉 (yan fen) – literally face fans. Chinese slang for fans that like a celebrity just for their looks.",
        "*黑粉 (hei fen) – literally black fans. Chinese internet slang for haters, anti-fans, etc. "
    ],
    "previous": "Ch3 - Appearance",
    "next": "Ch5 - Questioning"
}