{
    "title": "Ch40 - Mecha",
    "content": [
        "The star network exploded again.",
        "In Qi Shiyan’s live broadcast room, the jealous Ah Zheng who stuck to Qi Shiyan all day long and wanted to overthrow the imperial family was actually His Majesty! ",
        "“I thought before that what Ah Zheng said about falling in love with Qi Shiyan at first sight was fake, but now looking back at the live broadcast, I think it’s true. His Majesty is really good to Qi Shiyan. At the beginning, he was clear-headed for very short periods of time and probably didn’t think he would survive, but he still tried hard to help plan for Qi Shiyan and said that he would leave his money to Qi Shiyan.”",
        "“Yes, he is His Majesty! He asked Starlight to record such last words. Even if he died, Qi Shiyan would definitely still be well taken care of by others.”\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“It can be seen that His Majesty likes Qi Shiyan very much. The two of them are also very compatible.”",
        "“Wuwuwu, His Majesty is so adorable! He’s so sweet!” ",
        "“This is the first time I’ve seen someone say that His Majesty is sweet, but His Majesty is really sweet…”\n\n",
        "“His Majesty can act like a spoiled child, get jealous, and use kisses in exchange for meat.”",
        "“I really want to raise someone like His Majesty!”",
        "“Before, I was jealous of Ah Zheng for having Qi Shiyan’s love. Now I am jealous of Qi Shiyan for being able to raise His Majesty!”\n\n ",
        "“How could His Majesty be such a love brain? His head is filled with love!”",
        "…",
        "There were originally people on the star network who supported the CP of Qi Shiyan and “Ah Zheng”. Now that Ah Zheng’s identity had been revealed, there was an endless stream of people supporting them.\n\n",
        "“After my fiancé broke off the engagement, I got together with his uncle… This plot is a bit exciting.” ",
        "“If I can’t be the crown princess, I’ll be the empress!”",
        "“Upstairs, the other party doesn’t want to be the empress. The other party wants to overthrow the imperial family.”",
        "“Wake up, it’s not Qi Shiyan who wants to overthrow the imperial family, it’s His Majesty! It was His Majesty who proposed it first.”",
        "“His Majesty, the love brain: Since Ah Yan has a grudge against the imperial family, just overthrow the imperial family!” ",
        "“Hahahaha! His Majesty probably didn’t dare to reveal his true identity because he heard Qi Shiyan say that he has a grudge against the imperial family, but he can’t hide it for much longer!”",
        "“Yes, according to the current progress, the poison will soon be completely eliminated. I don’t know how His Majesty will respond when the time comes.”",
        "“His Majesty still doesn’t know that Qi Shiyan is his nephew’s fiancé! Qi Shiyan previously always wore a face-changing mask, and since the convalescent planet isn’t connected to the star network, no one knows his identity there.”",
        "“It’s too much. These two are going to make me laugh to death!” ",
        "…",
        "People were talking and laughing, and no one mentioned the matter of overthrowing the imperial family.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "No, some people still mentioned it.",
        "“Hehe, Qi Shiyan might be the top (gong). In that case, even if he can’t overthrow the imperial family, he can at least overthrow the emperor…” ",
        "“Qi Shiyan has thin arms and legs. If he can top him, it should be because His Majesty loves him dearly, right?”",
        "“Not necessarily. His Majesty is so cute…”",
        "…",
        "In short, at this moment, countless people started to eat candy*. ",
        "Lis Zapesty’s emoticons also spread throughout the entire star network.",
        "There were all kinds of messy emoticons like “I’m pealous”, “Jome over here again and I’ll kick you”, “Kiss and be given meat to eat”, and so on.",
        "A frontline soldier felt tangled as he deleted the bad words he had previously posted on the star network about Lis Zapesty.",
        "Should they really use these emoticons? ",
        "Alas, His Majesty’s reputation had been damaged!",
        "On the convalescent planet, Lou Jingyue was still angry. “How could you guys do this?! General Lei, His Majesty saved you before!”",
        "When Lei Yin hadn’t lost her mind, she was a cold-faced queen who was not good at speaking.",
        "At Lou Jingyue’s age, he could even be her son… ",
        "Lei Yin didn’t know what to say.",
        "She wanted to tell Lou Jingyue His Majesty’s identity, but His Majesty wouldn’t let her, so she could only remain silent.",
        "Marshal Ke Lun comforted Lou Jingyue. “Xiao Yue*, don’t be so angry. People must look out for themselves, otherwise heaven and earth will unite to destroy them*. There is no other way if we want to survive!”",
        "Lou Jingyue said, “Even if you want to survive, you must still uphold your morals!” ",
        "“We have our own considerations. If his condition was for us to surrender to the star worms, we would never agree to it no matter what.” Marshal Ke Lun said.",
        "Shan Xi and Lei Yin nodded.",
        "Please visit chrysanthemumgarden (dot) com",
        "Lou Jingyue was stunned.",
        "Qi Shiyan spoke up at this time. “Don’t pay attention to him. Let’s discuss what to do next… Ah Zheng, Marshal Ke Lun has an airship. Should we take the airship to the sanatorium?” ",
        "Ming Zheng said, “Since everything is fine at the sanatorium, we don’t have to rush to go back.”",
        "It was better to wait until all the star worm poison in his body had been eliminated before taking Qi Shiyan back to the sanatorium.",
        "When he was not clear-headed, his behavior was a little abnormal. Letting the people present know about it was bad enough. He didn’t want the people in the sanatorium to know.",
        "“Yes, we will go back later. You cure Ah Zheng first! Then we will have Ah Zheng as a living signboard, and we will have evidence to persuade the people in the sanatorium to accept your treatment and join you to overthrow the imperial family.” Marshal Ke Lun helped Ming Zheng persuade Qi Shiyan. ",
        "It would be so embarrassing if His Majesty were to be jealous of him in front of everyone in the sanatorium after returning!",
        "Just wait until His Majesty got better before going back.",
        "After all, when he came out this time, he had brought His Majesty’s mecha with him.",
        "Marshal Ke Lun secretly gave Ming Zheng a space button equipped with a mecha. ",
        "Qi Shiyan was very perceptive and noticed it immediately. “What is this? A space button?”",
        "Marshal Ke Lun said, “This is Ah Zheng’s mecha.”",
        "He was a little worried when he said this, afraid that Qi Shiyan would notice something was wrong.",
        "His Majesty’s space button was different from others. After all, it contained the only SSS-class mecha in the entire empire, the “Dawn”. ",
        "However, Qi Shiyan did not recognize it. After all, the original owner never paid attention to these things. Moreover, although there were differences between different space buttons, the differences were not big.",
        "Qi Shiyan took a look at the space button and thought it was a bit old, so he said, “Ah Zheng, when we leave here, I will find someone to make you a new mecha, which will definitely be better than the Dawn.”",
        "After Marshal Ke Lun took out the Dawn, the mecha enthusiasts who were watching the live broadcast went crazy.",
        "“Aaaaaah! I saw the Dawn up close!” ",
        "“I even saw His Majesty up close!”",
        "“Wuwuwu, no regrets in this life!”",
        "Please visit chrysanthemumgarden (dot) com",
        "…",
        "As they were talking, they heard Qi Shiyan say that he wanted to find someone to make a better mecha for Ming Zheng than the Dawn. ",
        "Everyone: “…” The Dawn had been with His Majesty for more than ten years. Don’t abandon it!",
        "“Let’s go eat something together! I’ll cook.” Qi Shiyan said.",
        "Marshal Ke Lun nodded repeatedly. “Okay, okay! I brought a lot of food this time. We can eat together.”",
        "He had seen how Qi Shiyan fried star worm meat. Qi Shiyan did not add anything except salt. He must lack seasoning. ",
        "Fortunately, he brought a lot of delicious food over, including a whole box of self-heating food.",
        "Marshal Ke Lun brought out his collection.",
        "When Lou Jingyue saw these things, he was shocked. “Isn’t it forbidden to bring junk food to the convalescent planet? How could you have these things?”",
        "Did Marshal Ke Lun and the others secretly eat good things behind his back? ",
        "No wonder Marshal Ke Lun was so fat!",
        "Marshal Ke Lun said, “You are not allowed to bring these things to the convalescent planet, but as a former marshal, if I couldn’t even smuggle these over, then I would have lived the past over one hundred years of my life in vain.”",
        "Deputy Director Zhao didn’t dare to stop him from eating snacks secretly. Well, Deputy Director Zhao also didn’t know that he was eating snacks secretly.",
        "Lou Jingyue: “…” Unfair! ",
        "When Qi Shiyan saw the huge pile of food, his mouth watered uncontrollably.",
        "These things looked delicious!",
        "He looked at Marshal Ke Lun with shining eyes. “Can I eat all these things?”",
        "“Of course.” Marshal Ke Lun said, “Eat as much as you want. If it’s all eaten, I can just have someone bring over some more.” ",
        "“Thank you, Marshal Ke Lun. You are a very good person!” Qi Shiyan grabbed Marshal Ke Lun’s hand and took the opportunity to touch it a few times.",
        "General Lei was of the opposite sex, General Shan had a partner, and Lou Jingyue was the main object of jealousy for his family’s Ah Zheng.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Touching Marshal Ke Lun was the safest option.",
        "Marshal Ke Lun was speechless at Qi Shiyan’s actions. ",
        "Ming Zheng could only help explain. “Ah Yan has skin hunger syndrome.” When he was clear-headed, he wouldn’t get jealous.",
        "So that was the case! Marshal Ke Lun was relieved. He knew that he shouldn’t have the charm to seduce the future empress.",
        "After Qi Shiyan touched Marshal Ke Lun, he immediately opened a self-heating hot pot.",
        "He couldn’t wait for it to heat up on its own, so he simply boiled a pot of water and threw in all the ingredients. ",
        "After the water boiled, he took a bite hastily and was amazed.",
        "How could there be such delicious food in this world?!",
        "Although star worm meat was delicious, this kind of food that stimulated the taste buds was just as delicious.",
        "At this time, Ming Zheng, who had been clear-headed for a while, became confused again. ",
        "He was originally sitting next to Qi Shiyan, so now he skillfully got into Qi Shiyan’s arms and kissed Qi Shiyan on the mouth. “I want to eat too!”",
        "Shan Xi and Lei Yin, who were still clear-headed: “…” Could they see this without paying?",
        "On the star network, the audience also went crazy. “Ahhh! Your Majesty, please be more reserved!”",
        "“I don’t know whether I should blame His Majesty for abducting Qi Shiyan, or blame Qi Shiyan for abducting His Majesty!” ",
        "“Qi Shiyan is too much. He actually tricked a 38-year-old child into kissing him!”",
        "“Show us a passionate kiss. Don’t be so pure!”",
        "…",
        "At this time, Qi Shiyan hurriedly fed Ming Zheng a mouthful of meat, and then invited Shan Xi and the others to eat together. “Everyone, let’s eat together. I have star worm meat here. It will definitely taste good if you put it in the hot pot.” ",
        "Shan Xi and the others all sat down. Only Lou Jingyue was excluded. However, it was he who took the initiative not to get close to Qi Shiyan. He even secretly glared at Qi Shiyan.",
        "Qi Shiyan didn’t care at all.",
        "Please visit chrysanthemumgarden (dot) com",
        "He was happy to have more people around him, and now this person was always staring at him and paying attention to him. How great was that?",
        "He even wanted to touch Lou Jingyue’s head. ",
        "Marshal Ke Lun was not in a hurry to eat. He asked, “Ah Yan, do you have a grudge against the imperial family? What’s the grudge?”",
        "Qi Shiyan said, “It’s nothing. It’s just that I was almost killed by them.”",
        "Marshal Ke Lun was shocked.",
        "There was actually someone from the imperial family who almost killed Qi Shiyan. ",
        "Qi Shiyan must hate the imperial family very much, and might even take his anger out on His Majesty.",
        "Then what would His Majesty do?",
        "Marshal Ke Lun looked at Ming Zheng, then quickly turned away.",
        "His Majesty right now was a little unbearable to look at! ",
        "***",
        "T/N: *Eating 糖 (tang), meaning candy/sugar, is internet slang for being fed sweet moments by your CP. It’s similar to eating dog food, but candy is used more often by fans of a CP and dog food used more generally in real life and by single dogs (single people).",
        "*Xiao Yue (小越) – Little Yue. An affectionate way to address Lou Jingyue.",
        "*人不为己天诛地灭 – one must look out for oneself as heaven and earth will unite to destroy them. An idiom that basically means every man for himself. "
    ],
    "previous": "Ch39 - Ah Zheng’s Identity",
    "next": "Ch41 - Handsome Face"
}