{
    "title": "Ch41 - Handsome Face",
    "content": [
        "Marshal Ke Lun brought out not only convenience foods, but also a variety of snacks.",
        "Qi Shiyan had never eaten snacks in his life. ",
        "All the food that Marshal Ke Lun brought out was very delicious to him, and he wanted to eat all of it.",
        "He did eat a little bit of everything. He didn’t only eat by himself, but also fed some to Ming Zheng.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "“Ah Zheng, is it delicious?”",
        "“Delicious.” Ming Zheng also liked these foods, and his eyes sparkled when he ate them. ",
        "These things were things he had never eaten before.\n\n",
        "When he was a child, he couldn’t eat them. Later on, he had too many things to do and had no time to care about the things he ate.",
        "For him, it was already very good if he didn’t have to drink nutrient solution.",
        "Now that he suddenly had such delicious food to eat, he was very happy.\n\n ",
        "The people watching the live broadcast were very moved when they saw Ming Zheng like this. “His Majesty is so cute!”",
        "“Qi Shiyan thinks everything he eats is delicious, and His Majesty is the same.”",
        "“Lou Jingyue is the pickiest eater. His Majesty just doesn’t eat grass. He is really easy to raise.”\n\n",
        "“Has His Majesty never eaten anything good before?” ",
        "“It is said that in the army, many people drink nutrient solution every day to save trouble. His Majesty is probably the same, so he doesn’t like to drink nutrient solution.”",
        "“Speaking of which, His Majesty said before that he came out of a laboratory. Is this true or false?”",
        "“It should be fake. His Majesty can’t have come from a laboratory. He must have lied to Qi Shiyan.”",
        "… ",
        "Those who had been paying close attention to the star network and watching the live broadcast were the first to know Ming Zheng’s identity.",
        "And now, some people who didn’t pay much attention to the star network also learned about this matter.",
        "The Capital Star, where the retired emperor resided.",
        "The retired emperor didn’t watch much of Qi Shiyan’s live broadcast, but he arranged people to follow it throughout. ",
        "This live broadcast triggered a lot of things, but he never intervened.",
        "It was a good thing for him that something happened to Ming Qingyu.",
        "",
        "Twenty years ago, when he passed the throne to Ming Zheng, he only wanted Ming Zheng to be a knife in his hands and had no intention of handing over the power of the emperor to Ming Zheng.",
        "But what he never imagined was that Ming Zheng was so powerful that he not only got the support of the military, but also took away most of the imperial authority from him. ",
        "Of course he was dissatisfied.",
        "He had known about Ming Zheng’s health problems for a long time, and was planning to become emperor again after Ming Zheng’s death. In this case, it would be completely to his benefit if Ming Qingyu got into trouble.",
        "As for the extraordinary mental power displayed by Qi Shiyan in the live broadcast… Qi Shiyan was just a person whose mental power was slightly stronger than others. He had seen many people like this and didn’t take them seriously.",
        "The guards around him all had S-level mental power, and the strongest among them even had SS-level mental power, but these people still had to bow down to him when they saw him. ",
        "But he never imagined that Qi Shiyan could actually help people eliminate the star worm poison.",
        "He also never imagined that the “Ah Zheng” beside Qi Shiyan was actually Ming Zheng.",
        "Zing Iheng had said that he was from a laboratory and that he wanted to overthrow the imperial family. The people on the star network did not take it seriously and thought that Zing Iheng was deceiving Hi Shiyan.",
        "Dut the retired emperor knew that what Zing Iheng said was true. ",
        "With Ming Zheng’s current military achievements, even if he wasn’t the emperor, he could still control the military and continue to be the most powerful person in the entire empire.",
        "Ming Zheng also couldn’t have offspring, unlike them who wanted to leave the throne to their descendants.",
        "Under such circumstances, overthrowing the imperial family would only bring benefits and no harm to Ming Zheng.",
        "The retired emperor was so angry that he wanted to kill Ming Zheng, but he no longer had the ability to do so. ",
        "Capital Star, military prison.",
        "After Ming Qingyu was brought here, he was investigated.",
        "Today, the military found out that it was Ming Qingyu’s subordinate who poisoned Qi Shiyan’s escape pod.",
        "Now, that subordinate had also been arrested. ",
        "However, Ming Qingyu’s subordinate said that he only poisoned the escape pod because he had received Ming Qingyu’s order, but Ming Qingyu said that he had never issued such an order.",
        "According to the lie detector results, neither of them was lying.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Was there someone else involved here?",
        "At this time, Ah Zheng’s identity was revealed by the military. ",
        "Ming Qingyu was being held in a military detention room.",
        "He was the only one here and no one talked to him, but he could check some news online through the smart screen in the detention room.",
        "This smart screen was monitored and could only be used to browse information. It couldn’t send messages. It was particularly low-end to interstellar people.",
        "Ming Qingyu didn’t like this thing, but it was the only thing he had available now. ",
        "This was how he learned about Ah Zheng’s identity.",
        "The person who was intimate with Qi Shiyan was actually Ming Zheng!",
        "Ming Zheng appeared to be dignified on the surface, but he was actually like this in private!",
        "Ming Qingyu really wanted to curse Ming Zheng, but he had no way to post online, nor did he dare to curse in the military prison, so he could only curse him in his heart. ",
        "In the live broadcast, Qi Shiyan’s complexion improved a lot and his appearance also became more outstanding because of eating star worm meat.",
        "Ming Qingyu felt extremely regretful when he saw Qi Shiyan like this.",
        "Although Qi Shiyan lied to him, he must have liked him a little at the beginning.",
        "If he had treated Qi Shiyan well, the two of them might have been married by now. ",
        "If he had a crown princess who had strong mental power and could eliminate star worm poison, he would have become emperor sooner or later.",
        "He should have had a bright future, but unfortunately, he ruined it himself.",
        "Qi Shiyan used the hot pot soup base to cook the star worm meat and ate it. He was sweating profusely and his supernatural powers also recovered.",
        "He looked at Shan Xi and the others. “I will eliminate the poison for my Ah Zheng first. When Ah Zheng is well, I will help you guys eliminate the poison. Is that okay?” ",
        "“Of course.” Shan Xi and the other two all agreed.",
        "Perhaps because of eating the star worm meat, their physical conditions improved a little. Two hours had passed, and neither Shan Xi nor Lei Yin had become delirious again.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Their health was indeed very bad, but now there was hope and they could hold on a little longer. They were willing to let His Majesty receive treatment first.",
        "Seeing this, Qi Shiyan began to eliminate the poison from Ming Zheng’s body. ",
        "While doing this, he kept staring at Ming Zheng’s face.",
        "The blue and purple patches on Ming Zheng’s face were slowly fading away, revealing a handsome face.",
        "He knew that based on his family’s Ah Zheng’s facial structure, he must be a handsome guy.",
        "After this treatment, his family’s Ah Zheng should not become delirious again. Not only that, the poison in Ah Zheng’s body should be completely eliminated by tomorrow morning. ",
        "The time was much shorter than the three days he had initially estimated.",
        "Qi Shiyan was looking forward to seeing Ming Zheng’s true appearance.",
        "However, when he looked at Ming Zheng at this moment, he felt that this person looked a little familiar.",
        "When Ming Zheng became clear-headed again, he saw Shan Xi and Lei Yin in front of him and felt extremely embarrassed. ",
        "The way he acted before was really embarrassing.",
        "Fortunately, the only people who saw were the few people in front of him.",
        "“Ah Zheng, you will no longer become delirious again in the future.” Qi Shiyan said.",
        "Ming Zheng was somewhat surprised. “Really?” ",
        "“Of course it’s true.” Qi Shiyan laughed.",
        "He was actually a little disappointed that he could no longer see Ming Zheng’s cute appearance.",
        "But he also really liked Ming Zheng as he was now.",
        "Most importantly, he hoped that Ming Zheng could be healthy. ",
        "“Ah Yan, thank you very much.” Ming Zheng took a deep breath and felt like he had been reborn.",
        "“We are partners. You don’t have to say thank you to me.” Qi Shiyan grabbed Ming Zheng’s hand and kissed it.",
        "",
        "Ming Zheng stared at Qi Shiyan for a moment, then said, “Then I won’t say it in the future.”",
        "At this time, Qi Shiyan kissed Ming Zheng on the face. “Ah Zheng, you are so good looking now!” ",
        "Ming Zheng was stunned for a moment, then subconsciously went inside the airship and looked at himself in the mirror.",
        "With one glance, he was shocked. The skin under his eyes had completely returned to normal.",
        "Now he looked like he was wearing an ugly mask that only covered the upper half of his face.",
        "The current him no longer resembled the terrifying appearance he had at the beginning. ",
        "Ah Yan thought that he was good-looking?",
        "In fact, it wasn’t just Qi Shiyan who thought that Ming Zheng was good-looking. Netizens also thought so. “Ahhhh! His Majesty is so handsome!”",
        "“I am a little disappointed that we won’t be able to see His Majesty being jealous anymore, but His Majesty’s handsome face has healed the pain in my heart.”",
        "“When His Majesty fully recovers, he will definitely be very handsome!” ",
        "“I thought Qi Shiyan loved ugliness, so he liked the disfigured Ah Zheng. Now it seems that Qi Shiyan’s aesthetic taste is normal.”",
        "“I also thought Qi Shiyan’s aesthetic taste was abnormal before, but fortunately, there is nothing wrong with his aesthetic taste!”",
        "…",
        "At this moment, Qi Shiyan spoke. “Ah Zheng, I think you look a little familiar, but I can’t remember who you look like at the moment.” ",
        "Ming Zheng froze when he heard this, and the barrage started to flash rapidly. “He looks like His Majesty! He looks like His Majesty!”",
        "“His Majesty has really changed in appearance today. No wonder the military was in such a hurry to announce his identity. After all, given the current situation, even if they didn’t announce it, we could still recognize him!”",
        "“His Majesty looks very worried. His vest* is finally coming off!”",
        "“Your Majesty, quickly tell Qi Shiyan that you are his fiancé’s uncle!” ",
        "“I really want to see His Majesty exposed in front of Qi Shiyan!”",
        "…",
        "",
        "At this moment, Ming Zheng said, “I look like His Majesty.”",
        "Qi Shiyan thought about it for a moment and realized that it was true. ",
        "His partner looked a bit like His Majesty.",
        "Although he didn’t care much about military affairs, he had seen photos of the emperor.",
        "The emperor and his Ah Zheng were about 70-80% alike.",
        "Ming Zheng said, “Ah Yan, I am a product from a laboratory and the emperor’s substitute, so I look very similar to him.” ",
        "Ming Zheng didn’t want to deceive Qi Shiyan.",
        "But he had concealed his identity before, and said that he wanted to overthrow the imperial family together with Qi Shiyan.",
        "If Qi Shiyan discovered his true identity at this time, wouldn’t Qi Shiyan feel deceived and become irreconcilable with him?",
        "Ming Zheng knew that he shouldn’t do this, but he lied subconsciously. ",
        "What a coincidence. This was what Qi Shiyan had guessed before.",
        "He believed Ming Zheng’s words and felt sorry for him. “Ah Zheng…”",
        "Ming Zheng added, “Ah Yan, over the years, I have been his assistant and his substitute. Many of his military merits were won by me, so Marshal Ke Lun and the others recognized me and agreed to join me in overthrowing the imperial family.”",
        "As he said this, Ming Zheng almost even believed it himself. ",
        "Marshal Ke Lun, Shan Xi and Lei Yin, who had heard the whole story, were dumbfounded. Not only was His Majesty rebelling against himself, but now he was even slandering himself?!",
        "The people watching the live broadcast were even more shocked. “What did I just see? I saw His Majesty pour a large basin of dirty water on his own head in order not to reveal his identity!”",
        "“If the military hadn’t disclosed Ah Zheng’s identity, I might have believed it.”",
        "“Me too……” ",
        "“What the hell? His Majesty actually said that he is his own substitute.”",
        "“What kind of weird substitute plotline is this?!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“His Majesty is a love brain and can’t be saved…”",
        "“I am my own substitute. As expected of His Majesty, his brain works quickly.” ",
        "***",
        "T/N: *Vest – Chinese slang for alternate/cover identity."
    ],
    "previous": "Ch40 - Mecha",
    "next": "Ch42 - Sanatorium"
}