{
    "title": "Ch42 - Sanatorium",
    "content": [
        "The audience was watching the fun and laughing, but Qi Shiyan just felt heartbroken.",
        "His Ah Zheng was so pitiful! ",
        "He was so strong and had made so many military achievements, but no one knew of his existence. From the beginning to the end, he was just a substitute hiding in the dark.",
        "Qi Shiyan was about to comfort Ming Zheng when Lou Jingyue, who had been glaring at them from the side, suddenly said, “This is impossible!”\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Lou Jingyue particularly admired His Majesty, the emperor. In his heart, His Majesty was the most perfect person in the world.",
        "Now, this man named “Ah Zheng” actually framed His Majesty, saying that His Majesty’s military achievements were fake… He couldn’t tolerate it. ",
        "“You’re talking nonsense! His Majesty is so strong, he wouldn’t look for a substitute to help him fight! He always leads the troops himself!” Lou Jingyue said, “I have personally seen His Majesty’s heroic appearance on the battlefield. His Majesty is the most powerful and perfect person in the world!”\n\n",
        "Ming Zheng looked at Lou Jingyue and said, “You met His Majesty at the No. 7 Nebula checkpoint, right? After the battle, you secretly went to see His Majesty and asked for His Majesty’s contact information, but His Majesty didn’t give it to you.”",
        "“How do you know?” Lou Jingyue was shocked.",
        "The information about that battle was public knowledge in the military, so it was not surprising that this person knew that he had met His Majesty in that battle.\n\n ",
        "But no one knew about the matter of him privately going to His Majesty to ask for his contact information.",
        "This was a secret he kept in his heart!",
        "Ming Zheng said, “I was the one who participated in that battle. Although I rejected you that day, I also encouraged you and said that you would definitely grow into a bright new star in the military.”\n\n",
        "He didn’t give Lou Jingyue his contact information that day because he didn’t have the energy to deal with such an enthusiastic young man at the time. ",
        "But he knew Lou Jingyue’s identity and his talent, so he encouraged Lou Jingyue with a few words.",
        "Lou Jingyue was petrified.",
        "This was what His Majesty had said to him at the time.",
        "No, that wasn’t His Majesty. That was “Ah Zheng”. ",
        "Lou Jingyue immediately looked at Marshal Ke Lun. “Grandpa Ke Lun, is what he said true?”",
        "Marshal Ke Lun glanced at Ming Zheng and said to Lou Jingyue. “Anyway, he was the one who fought alongside me and saved me.”",
        "Shan Xi also said, “The person who fought alongside me was also him.”",
        "Lei Yin even said, “Back then in the Spearhead Troops, I went through life and death with him.” ",
        "Lou Jingyue felt as if his faith had collapsed.",
        "His Majesty whom he admired so much actually found a substitute to go to the battlefield in his place!",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Someone like that was not worthy of being his idol.",
        "Wait, wait, if those battles were all fought by the person in front of him, then his idol was not His Majesty at all, but the person in front of him. ",
        "Lou Jingyue looked at Ming Zheng carefully and discovered that the lower half of Ming Zheng’s face was exactly the same as His Majesty’s.",
        "There was also Ming Zheng’s voice… When he interacted with Ming Zheng before, Ming Zheng was always delirious, and his voice was slightly different from now, so he hadn’t noticed anything wrong.",
        "But Ming Zheng’s voice now was the same as His Majesty’s!",
        "Lou Jingyue said, “You are actually His Majesty.” ",
        "Ming Zheng shook his head. “I am not His Majesty. I am His Majesty’s substitute.”",
        "Lou Jingyue was a little excited. “But those achievements were all made by you. In this case, you are His Majesty and my idol! It is you who protected the empire! The imperial family is really too much, and the emperor is also too much. I will definitely convince my father to overthrow the imperial family with you! Brother Zheng, from now on, if you tell me to go east, I will never go west. I will listen to you in everything!”",
        "Oou Aingyue looked at Zing Iheng ezcitedly.",
        "Hi Shiyan was a little unhappy. “What if I tell you to go east and Ah Iheng tells you to go west?” ",
        "Oou Aingyue: “…”",
        "At this time, the people watching the live broadcast were almost dying of laughter.",
        "“Toung Xeneral Oou is too naive and is being fooled by everyone.”",
        "“Help! Why do I want to laugh whenever I see Young General Lou’s face?” ",
        "“Young General Lou makes his debut as a comedian.”",
        "“Don’t be like this. Young General Lou is actually quite pitiful. Hahahaha.”",
        "…",
        "Some people also brought up other topics. “I believe everything His Majesty said.” ",
        "“The filter is broken, really broken. Not only is His Majesty acting like a spoiled child, he’s actually lying! He’s no longer the cold and indifferent emperor that I remember!”",
        "“Ah Zheng, you are the emperor! After you realized that you like Qi Shiyan, you should have taken him by force and locked him up! How could you do this?!”",
        "",
        "“Although it’s not good for His Majesty to deceive Qi Shiyan, His Majesty is such a love brain that I feel embarrassed to blame him.”",
        "“After telling a lie, you can only cover it up with more lies. What will His Majesty do next?” ",
        "“What else can he do? Go back to the sanatorium and lead the people there to rebel together.”",
        "“What kind of live broadcast am I watching? It includes survival in the wilderness, grudges among affluent families, and interactions between couples. And now, it has turned into a comedy live broadcast.”",
        "“The military has lost all shame. The live broadcast has come to this point, yet the military actually hasn’t stopped it!”",
        "“So who is in charge of this live broadcast? Does he have a grudge against His Majesty?” ",
        "…",
        "Jiang Jin: “…” He had no grudge against Ming Zheng, but he wanted to see Ming Zheng make a fool of himself.",
        "He had never expected Ming Zheng to have such a day! It was so interesting!",
        "The military generals and soldiers were very conflicted at the moment. ",
        "His Majesty had changed, completely different from the impression of him in their imaginations.",
        "But for some reason, they didn’t hate His Majesty like this at all, but actually liked him very much.",
        "An older general said, “His Majesty is not even forty yet. He is still very young.”",
        "Another person said, “Yes, His Majesty is younger than my son.” ",
        "“He just doesn’t want Qi Shiyan to hate him. In fact, he hasn’t really done anything wrong.”",
        "Everyone looked at each other and continued watching the live broadcast.",
        "Seeing that His Majesty was getting better and even beginning to fall in love, they were somehow more motivated to fight.",
        "In the past, it was His Majesty who protected them. Now, it was them who would protect His Majesty. ",
        "Convalescent planet.",
        "Qi Shiyan started eating again.",
        "",
        "As for Lou Jingyue, he began to revolve around Ming Zheng.",
        "He went from being Qi Shiyan’s bootlicker to Ming Zheng’s bootlicker. ",
        "Qi Shiyan suddenly understood why Ming Zheng kicked Lou Jingyue away before.",
        "The way Lou Jingyue kept getting close to Ming Zheng really made him deserve a beating.",
        "“Brother Zheng, I’ve watched the battle video of you killing two high-level star worms at once eight years ago over and over again. There’s a move in it that I’ve always wanted to learn, but can’t…”",
        "“Brother Zheng, you were also the one who commanded the battle on Storm Star, right? You are so awesome!” ",
        "“Brother Zheng…”",
        "As they chatted, Lou Jingyue said, “Brother Zheng, all the military achievements were earned by you. The emperor is really useless.”",
        "His words were full of disdain for the emperor.",
        "After hearing this, Qi Shiyan also said, “All the people in the imperial family are like this. Ming Qingyu’s military achievements were earned by his guards. There was once a time when he discovered that one of his guards was too close to the people of the Second Legion during a battle. He was afraid that someone would notice something was wrong, so he killed that guard.” ",
        "“Did you know that guard?” Ming Zheng noticed that Qi Shiyan’s mood was a bit off.",
        "Qi Shiyan said, “I knew him. That guard was quite good.”",
        "Many people around Ming Qingyu did not take the original owner seriously, but that guard had always been very respectful to the original owner.",
        "“Ming Qingyu is a piece of trash! When I leave here, I will beat him up!” Lou Jingyue said angrily. ",
        "“Let’s go together then!” Qi Shiyan said.",
        "As they were chatting, the medicine in Shan Xi’s body that helped him suppress the star worm poison lost its effect.",
        "Shan Xi instantly became confused.",
        "“Where is Brother Heng? Wuwuwu, Brother Heng, where are you?” Shan Xi started crying like a child. ",
        "Shan Xi was sitting next to Qi Shiyan. Qi Shiyan couldn’t help but pat his head when he saw this. “Xixi*, be good and don’t cry. Your Brother Heng will come to see you soon.”",
        "Although Shan Xi was tall and strong and already over a hundred years old, he cried like a child!",
        "Please visit chrysanthemumgarden (dot) com",
        "Qi Shiyan liked children!",
        "He always wanted to coax children before, but never had a chance. Now he could coax Shan Xi. ",
        "Thinking of this, Qi Shiyan also used some of his supernatural powers.",
        "After being poisoned by star worm poison, one would feel very uncomfortable.",
        "That was why Shan Xi cried and called for Duan Heng.",
        "But after Qi Shiyan touched his head, Shan Xi didn’t feel so uncomfortable anymore. He stopped crying and asked Qi Shiyan, “Really?” ",
        "“Really!” Qi Shiyan said.",
        "“Then I’ll wait for Heng gege.” Shan Xi looked at Qi Shiyan eagerly. “Gege, who are you?”",
        "“My name is Ah Yan.” Qi Shiyan said.",
        "Shan Xi smiled at Qi Shiyan. “Ah Yan gege, hello.” ",
        "Qi Shiyan touched his head again. “Hello to you too.”",
        "Ke Lun was shocked that Qi Shiyan could actually calm Shan Xi down!",
        "Ming Zheng remained silent.",
        "Why was he clear-headed right now? If he wasn’t clear-headed, he could throw a tantrum and tell Qi Shiyan to stop touching Shan Xi. ",
        "Qi Shiyan seemed to really like those people who were not in their right minds. Now that he had reverted back to his original appearance, would Qi Shiyan not like him as much as before?",
        "He also deceived Qi Shiyan.",
        "Qi Shiyan had a grudge against the imperial family, so he hid his identity and asked Qi Shiyan to help him eliminate the poison.",
        "He also asked Qi Shiyan to help other people in the sanatorium eliminate the poison… ",
        "When Qi Shiyan found out his true identity one day, he would definitely be very angry and might even break up with him.",
        "Ming Zheng took a deep breath, stopped thinking about this, and talked about something else. “Let’s go back to the sanatorium.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Didn’t we agree that we would wait until all the poison in your body is eliminated before going back?” Qi Shiyan asked.",
        "Ming Zheng said, “General Shan and General Lei need people to take care of them, and I am now completely clear-headed, so we can go back.” ",
        "When they arrived at the sanatorium, there would be people to take care of Shan Xi and Lei Yin, and Qi Shiyan would not need to coax them.",
        "Qi Shiyan didn’t know what Ming Zheng was thinking, but he felt that what Ming Zheng said was right.",
        "In that case, they might as well go to the sanatorium.",
        "He really wanted to go to the sanatorium, where there were lots of people! People! ",
        "The group boarded the airship that Marshal Ke Lun stole from Jiang Jin.",
        "As soon as he went up, Lou Jingyue said to Ming Zheng. “Brother Zheng, I have a lot of connections in the sanatorium. I will help you persuade them to join us and overthrow the imperial family together with us! If Director Jiang and Deputy Director Zhao are unwilling, I will catch them and tie them up!”",
        "“Do you have the ability to catch people?” Qi Shiyan asked.",
        "Lou Jingyue stopped talking. ",
        "Qi Shiyan held Ming Zheng’s hand and said, “Don’t worry, Ah Zheng. If someone wants to harm you, I will definitely beat that person up!”",
        "Ming Zheng smiled and said, “I believe you.”",
        "His Ah Yan was really strong.",
        "He didn’t know what his previous identity was. Unfortunately, after he asked, Ah Yan refused to tell him. ",
        "But Ah Yan was very familiar with the imperial family, so he must have some connection to the imperial family.",
        "The airship quickly arrived at the sanatorium.",
        "When Qi Shiyan saw the sanatorium building complex, he trembled with excitement.",
        "Ming Zheng thought he was scared, so he held his hand to comfort him. ",
        "At this time, Lou Jingyue had already rushed out first. “Everyone! Let’s overthrow the imperial family together!”",
        "He had to help his idol overthrow the imperial family!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "***",
        "T/N: *希希 (Xixi) – repeating the character of Shan Xi’s name. Repeating a character of someone’s name in Chinese is an affectionate way to refer to them. "
    ],
    "previous": "Ch41 - Handsome Face",
    "next": "Ch43 - Speech"
}