{
    "title": "Ch43 - Speech",
    "content": [
        "There were thousands of patients living in the sanatorium.",
        "There were also thousands of people responsible for taking care of and protecting these people. ",
        "There were more than ten thousand people in total in the entire sanatorium.",
        "There were dormitory buildings, a dining hall, various activity rooms, and fields cultivated by the patients. It looked like a small town.\n",
        "",
        "Seeing the airship approaching, many people came out of their rooms to watch the excitement.",
        "Several people ran away from the sanatorium one after another, and everyone in the sanatorium knew about it. Now, those people had returned? ",
        "Deputy Director Zhao also ran out. He saw at a glance that the airship that returned was the one that Marshal Ke Lun had driven away.\n\n",
        "Marshal Ke Lun was still reliable. He knew how to come back after going out.",
        "As for that guy Lou Jingyue, who knew where he ran off to.",
        "Seeing the airship land, Deputy Director Zhao hurried to meet it, and then he saw Lou Jingyue rushing out, saying that he wanted to overthrow the imperial family.\n\n ",
        "Deputy Director Zhao almost choked. Was this kid crazy? Why was he talking nonsense here?!",
        "“Lou Jingyue, what nonsense are you talking about?” Deputy Director Zhao was furious.",
        "Lou Jingyue didn’t answer. Right now, he only wanted to help his idol take back everything that belonged to him.\n\n",
        "He turned around, climbed onto the airship, and began his speech. “Everyone! Fellow patients! I have something shocking to tell you! In the past twenty years, the emperor has barely been on the battlefield. It has always been his substitute who has been helping him kill star worms!” ",
        "Deputy Director Zhao was speechless. What the hell was this guy Lou Jingyue talking about?!",
        "When did His Majesty get a substitute? He had always gone to the battlefield himself!",
        "If not for this, His Majesty would not have been poisoned so seriously.",
        "Could it be that this child met someone with ulterior motives and was brainwashed? ",
        "“Come down here right now and stop talking nonsense!” Deputy Director Zhao said.",
        "If Lou Jingyue didn’t have a special identity and wasn’t also a patient, he would definitely take action directly.",
        "Lou Jingyue said, “I won’t come down. I need to speak up for Brother Zheng!”",
        "After that, Lou Jingyue continued his “speech”. “Everyone, as you know, I used to be a fan of His Majesty, but I never expected that all the achievements of His Majesty, whom I was a fan of, were actually achieved by his substitute!” ",
        "Deputy Director Zhao was already thinking about taking action.",
        "But at this time, Ming Zheng and the others also got off the airship.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Deputy Director Zhao saw Ming Zheng at a glance. His eyes widened in shock, his lips trembled and he couldn’t speak.",
        "Deputy Director Zhao was actually also poisoned by star worm poison, but the poisoning was relatively mild. ",
        "Before he was poisoned, he was Ming Zheng’s assistant.",
        "He was very familiar with Ming Zheng, and would be able to recognize him even if he turned into ashes.",
        "The person in front of him was definitely His Majesty, His Majesty!",
        "Deputy Director Zhao no longer cared about Lou Jingyue. All he had in his eyes was Ming Zheng. ",
        "Everyone in the sanatorium ran out at this moment. Many of them knew Ming Zheng. At this moment, they looked at Lou Jingyue and then at Ming Zheng, feeling a little confused.",
        "Ming Zheng hadn’t expected Lou Jingyue to actually do such a thing.",
        "He was extremely embarrassed and also a little worried – Qi Shiyan, who was beside him, had been shaking the whole time.",
        "There were so many strangers here, and Oou Aingyue even climbed on top of the airship to give a speech, attracting everyone around them… Was Hi Shiyan scared? ",
        "“Ah Tan, don’t be afraid.” Zing Iheng comforted Hi Shiyan.",
        "Hi Shiyan held Zing Iheng’s hand tightly, then let go. “I’m not afraid.”",
        "After saying that, Qi Shiyan clapped his hands vigorously, supporting Lou Jingyue with excitement. “Well said!”",
        "My god, this place was heaven! ",
        "So many people! And a normal human society!",
        "He really liked this place! He also liked Lou Jingyue’s speech!",
        "A speech, it was a speech!",
        "From Qi Shiyan’s perspective, Lou Jingyue was performing on top of the airship, and there was a group of people around watching the performance with him. ",
        "How lively and interesting!",
        "“Ah Zheng, you go up too!” Qi Shiyan pushed Ming Zheng and told Ming Zheng to go up as evidence to support Lou Jingyue’s words.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng: “…” It was enough for Lou Jingyue to give a speech on top of the airship in a foolish manner. Now Qi Shiyan actually wanted him to go up as well.",
        "But now, he had no choice but to go up. ",
        "Ming Zheng gritted his teeth, climbed on top of the airship and stood next to Lou Jingyue.",
        "Everyone watching the live broadcast was laughing to death.",
        "After the airship approached the sanatorium, they were planning to take a good look at the place and the people there, when Lou Jingyue began his performance.",
        "No, speech. ",
        "At this moment, Lou Jingyue was indignantly revealing the emperor’s true face, while His Majesty the Emperor stood beside him, stating with a firm face that he was the emperor’s substitute.",
        "“I can’t hold on. My stomach hurts from laughing so hard! I really can’t take it anymore.”",
        "“Thumbs up for Lou Jingyue!”",
        "“Although His Majesty has no expression on his face, I can clearly see the despair in his eyes.” ",
        "“This live broadcast tells us that people should be honest and not lie. Lying will not end well. Hahahahahaha.”",
        "“Your Majesty, how could you cooperate? You broke another filter of mine. Wuwuwuw.”",
        "“Everyone in the sanatorium is so confused. I’m laughing to death.”",
        "“Hahahaha! Qi Shiyan is the most enthusiastic among the audience. He keeps clapping and cheering.” ",
        "“Is this really something I can watch without paying?”",
        "…",
        "Qi Shiyan was very excited. While clapping and cheering, he glanced at Marshal Ke Lun and saw that Marshal Ke Lun was playing with his communication terminal.",
        "Qi Shiyan said, “Marshal Ke Lun, in this kind of situation, you shouldn’t play with your communication terminal! By the way, do you want to go up and say a few words?” ",
        "“Forget it. This airship is too tall. I’m not in good health, so I won’t climb up.” Marshal Ke Lun quickly refused.",
        "“That’s true.” Qi Shiyan held Marshal Ke Lun’s hand with heartache and used his supernatural powers to heal Marshal Ke Lun slightly.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Zheng had been observing Qi Shiyan the whole time. When he saw this scene, he felt short of breath.",
        "Qi Shiyan was “touching” someone else behind his back! ",
        "Marshal Ke Lun sensed something and looked at Qi Shiyan with gratitude.",
        "This kid was such a good person.",
        "It was a pity that the imperial family let him down!",
        "They were also sorry to him. They were actually lying to him just to get him to treat them. ",
        "On the other side, Deputy Director Zhao received a message from Marshal Ke Lun. “The person who helped His Majesty eliminate the star worm poison has a grudge against the imperial family. From today on, His Majesty will be his own substitute.”",
        "Deputy Director Zhao took a look at the unfamiliar Qi Shiyan and immediately realized that His Majesty and Marshal Ke Lun and the others were colluding to deceive this young man.",
        "Although this was a bit unkind, this person could cure His Majesty.",
        "Deputy Director Zhao’s breathing became rapid. ",
        "“Deputy Director Zhao, is what Lou Jingyue said true or false?”",
        "“Deputy Director Zhao, isn’t that person on top of the airship His Majesty? How did he become His Majesty’s substitute?”",
        "“Deputy Director Zhao, what is going on?”",
        "… ",
        "Deputy Director Zhao said, “What Lou Jingyue said is true.”",
        "And those who asked Marshal Ke Lun received the same answer.",
        "What Lou Jingyue said was true. The person standing next to Lou Jingyue on top of the airship was not His Majesty, but His Majesty’s substitute.",
        "Of course, there were also a few people who were very familiar with His Majesty and didn’t believe what Lou Jingyue said at all. ",
        "But those people received the message sent by Marshal Ke Lun, so they cooperated in the acting.",
        "Lou Jingyue spoke for a long time on top of the airship, and his mouth became dry.",
        "",
        "But when he looked down and saw Qi Shiyan clapping and cheering below the airship, he felt motivated to continue speaking.",
        "However, just relying on his words was useless. Lou Jingyue looked at Ming Zheng and said, “Brother Zheng, isn’t the Dawn in your hands? Show them!” ",
        "Ming Zheng did not refuse.",
        "He took out the space button containing the Dawn. “Please move aside. I will release the Dawn.”",
        "People immediately made way, and Ming Zheng quickly released the SSS-class mecha, Dawn.",
        "The huge mecha stood there, obviously motionless, but inexplicably full of majesty. ",
        "And this was enough to prove that he was the one going to the battlefield.",
        "Those people in the sanatorium who were not familiar with Ming Zheng were stunned.",
        "Qi Shiyan was excited again. He ran to the mecha and touched the mecha’s legs. “Ah Zheng, Ah Zheng, this mecha is so cool! Ah Zheng, you are awesome. I like you so much! Ah Zheng, can you teach me how to use a mecha?”",
        "Ming Zheng immediately said, “Of course.” ",
        "Although it was stupid to stand on top of the airship and give a “speech” to criticize himself, when he saw Qi Shiyan so happy, he felt that everything he had done was worth it.",
        "Now, he was worried that Qi Shiyan would break up with him after learning the truth.",
        "Otherwise, he could accept the identity of a substitute and give up the identity of the emperor?",
        "“Ah Zheng, you are so good. I love you the most!” Qi Shiyan confessed again. ",
        "Ming Zheng jumped off the airship, feeling excited.",
        "He also wanted to say “love”, but there were too many people around them and he couldn’t say it.",
        "Ming Zheng said, “Ah Yan, shall I take you inside the mecha?”",
        "Qi Shiyan said, “Let’s wait until evening and continue watching the performance.” ",
        "The mecha could be seen at any time, but once the excitement passed, it was gone.",
        "Performance? Ming Zheng felt something was wrong.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Then, he saw Qi Shiyan leaning toward Deputy Director Zhao and shaking his hand. “Hello, hello, are you the Deputy Director of the sanatorium? I am Ah Zheng’s boyfriend. You can call me Ah Yan.”",
        "Deputy Director Zhao’s palms were sweaty for some reason, but he didn’t mind. ",
        "After all, this was a human being, a living person.",
        "“Hello…” Deputy Director Zhao’s jaw almost dropped when he heard the word “boyfriend”.",
        "Qi Shiyan held Deputy Director Zhao’s hand with both of his own, shaking it up and down for a long time before reluctantly letting it go. He then shook the hand of the person next to him and said, “Hello, my name is Ah Yan. I’m Ah Zheng’s boyfriend. What’s your name?”",
        "Qi Shiyan was very enthusiastic. The person whose hand he shook quickly said his name, and then Qi Shiyan went to shake hands with the next person. ",
        "Qi Shiyan was very happy.",
        "Shaking hands was such good etiquette. He could touch everyone present!",
        "Ming Zheng took a deep breath and resisted the urge to pull Qi Shiyan away.",
        "It was just a handshake, no kiss, so there was no need for him to stop it. ",
        "At this moment, Ming Zheng already understood.",
        "Qi Shiyan was trembling all over before, not because of fear, but because of excitement.",
        "He shouldn’t have brought Qi Shiyan back. Qi Shiyan was now like a mouse that had fallen into a rice vat, extremely happy.",
        "The live broadcast was laughing again. “This live broadcast has gone completely awry.” ",
        "“At first, the live broadcast room was full of cursing, but now it’s only left with hahahaha.”",
        "“Qi Shiyan is touching people openly!”",
        "“His Majesty’s whole body is sour*.”",
        "“How can Qi Shiyan play like this? He uses both of his hands to hold someone else’s hand and ends up wrapping up the other person’s hand!” ",
        "“I saw someone who originally didn’t react try to pull his hand back, but failed. Qi Shiyan is still very strong.”",
        "“I saw a lot of familiar people, all former high-ranking military generals. When they learned that Qi Shiyan is His Majesty’s boyfriend, their shocked expressions were hilarious!”",
        "",
        "“Qi Shiyan’s behavior is clearly taking advantage of others, but for some reason, I don’t find it disgusting at all.”",
        "“It’s definitely not disgusting! After all, Qi Shiyan just wants to have skin contact with people. He doesn’t have any other bad intentions.” ",
        "“Is Qi Shiyan planning to touch the hands of everyone present?”",
        "“Shock! The empress harassed thousands of people in public!”",
        "***",
        "T/N: *Sour and vinegar are both ways to indicate jealousy in Chinese. "
    ],
    "previous": "Ch42 - Sanatorium",
    "next": "Ch44 - Dawn"
}