{
    "title": "Ch44 - Dawn",
    "content": [
        "Everyone in the sanatorium saw Qi Shiyan’s behavior.",
        "No one thought that he was taking advantage of others by constantly shaking hands with others. They just thought that the young man was a little too enthusiastic. ",
        "Those who were also extroverted would happily shake Qi Shiyan’s hand and chat with him.",
        "Those who were not good at socializing felt a little uncomfortable. Fortunately, Qi Shiyan grabbed their hands and shook them vigorously a few times, asked their names, and then immediately went to find the next person. He did not spend too much time on them, which made them feel relieved.\n",
        "",
        "Ming Zheng followed behind Qi Shiyan, feeling extremely helpless.",
        "Deputy Director Zhao whispered, “Your Majesty…Ah Zheng, your boyfriend loves you very much.” ",
        "Not only did Qi Shiyan confess loudly, now he was telling everyone he met that he was Ming Zheng’s boyfriend. From Deputy Director Zhao’s perspective, this meant that Qi Shiyan loved Ming Zheng very much.\n\n",
        "Ming Zheng hummed and looked at Qi Shiyan not far away, feeling a little guilty.",
        "Although Qi Shiyan shook hands with everyone everywhere, his liking for him was genuine and not false at all.",
        "It was he who deceived Qi Shiyan.\n\n ",
        "However, he would definitely overthrow the imperial family and help Qi Shiyan take revenge.",
        "Qi Shiyan didn’t notice Ming Zheng’s dilemma. He happily moved among the crowd and even deliberately squeezed into the crowd.",
        "So happy, so happy!\n\n",
        "Unfortunately, this happiness had to come to an end. ",
        "After Lou Jingyue had been speaking on top of the airship for an hour, a bell rang in the sanatorium.",
        "It was time for dinner.",
        "Those who listened to Lou Jingyue’s speech were all patients of the sanatorium. The staff of the sanatorium were still busy at their respective posts and prepared the meal on time.",
        "Deputy Director Zhao shouted, “Everyone, go eat first. If anyone wants to discuss, please do so after dinner.” ",
        "After saying that, he looked at Lou Jingyue who was standing on top of the airship. “Lou Jingyue, come down quickly.”",
        "Lou Jingyue came down quickly.",
        "Although he planned to rebel and do something big, for some reason he was still a little scared when facing Deputy Director Zhao.",
        "Lou Jingyue’s hand held a loudspeaker given to him by someone else. He handed it to Deputy Director Zhao and smiled flatteringly. “Deputy Director Zhao, as long as you follow us to overthrow the imperial family, our Brother Yan can help you eliminate the star worm poison. Do you want to join us?” ",
        "Deputy Director Zhao said, “I stand on Ah Zheng’s side.”",
        "“I knew that Brother Zheng’s charm was unmatched!” Lou Jingyue was in high spirits, and then he started coughing again – he had been shouting for a long time and his voice was hoarse.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Let’s go eat.” Deputy Director Zhao said.",
        "His Majesty must have suffered a lot while being outside these past few days. ",
        "He had asked someone to prepare a table of delicious food for His Majesty. He could let Lou Jingyue have some too.",
        "Deputy Director Zhao asked Marshal Ke Lun to take Ming Zheng and the others over, while he himself hung back and asked Lou Jingyue, “What kind of person is your Brother Zheng’s boyfriend?”",
        "Lou Jingyue said, “My Brother Yan is an expert! His mental power is not weaker than my Brother Zheng, and he can also help people eliminate the star worm poison!”",
        "Deputy Director Zhao said, “Tell me about what happened in the past few days.” ",
        "Lou Jingyue was not on guard against Deputy Director Zhao and started talking right away.",
        "For the sake of his idol’s reputation, he did not mention the fact that Ming Zheng always pestered Qi Shiyan when he was not clear-headed. He only talked about how good Qi Shiyan was to Ming Zheng. “Before, when Brother Zheng’s mind wasn’t clear, it was Brother Yan who took care of him. Brother Yan even washed Brother Zheng’s feet and cut his nails. He was so considerate! Plus, isn’t Brother Zheng poisoned? Brother Yan worked hard to eat so as to accumulate energy to help him eliminate the poison…”",
        "After hearing this, Deputy Director Zhao felt even more that His Majesty was not kind.",
        "Lis Zapesty actually deceived a young man who was simple-minded and knew nothing about the world. ",
        "Dut if it were him, he would do the same.",
        "The patients in the sanatorium had all made contributions to the empire. Le hoped that Hi Shiyan could cure them.",
        "As for the matter of deceiving Hi Shiyan… they could only humbly ask for forgiveness in the future.",
        "Deputy Director Zhao thought so and told others about Qi Shiyan’s situation. ",
        "Qi Shiyan didn’t know what Deputy Director Zhao did in private.",
        "At this moment, he was still dizzy, as if he was in the clouds.",
        "Holding Ming Zheng’s hand tightly, Qi Shiyan said, “Ah Zheng, this place is really nice!”",
        "Ming Zheng felt more and more distressed for him. ",
        "The sanatorium was not a good place. If it were really good, Lou Jingyue wouldn’t have constantly thought about escaping.",
        "But Qi Shiyan liked this place very much.",
        "",
        "What kind of life did Qi Shiyan live in the past?",
        "The two followed Marshal Ke Lun to the top floor of the dining hall, where there was a small private room with a round table in the center. ",
        "At this moment, the round table was already filled with food.",
        "Qi Shiyan’s attention was immediately attracted by the food and he couldn’t help swallowing his saliva.",
        "Seeing this, Ming Zheng pulled him to sit down at the main seat and said, “Let’s eat quickly.”",
        "The food was served quickly. ",
        "Shan Xi and Lei Yin were delirious and had been taken to another place for care, but Marshal Ke Lun was there. Also eating with them were Lou Jingyue, Deputy Director Zhao, the security team captain of the sanatorium, and several other patients.",
        "“Hello!” Qi Shiyan greeted these people happily.",
        "Having a meal with others around the table was another thing that he had always dreamed of.",
        "“Hello, Young Master Yan.” These people spoke. ",
        "The security team captain and the patients all knew Ming Zheng’s identity and had already been informed in advance by Deputy Director Zhao.",
        "They were full of gratitude toward Qi Shiyan.",
        "Qi Shiyan also liked them very much, but he didn’t have time to chat with these people.",
        "He was busy eating. ",
        "The delicacies were served one by one. Every time a dish was served, Ming Zheng would turn the rotating table tray* to face Qi Shiyan and let Qi Shiyan eat first.",
        "Qi Shiyan was particularly happy while eating. “Ah Zheng, you are so good to me. I love you more and more.”",
        "“Ah Zheng, this dish is delicious. You should try it too.”",
        "“Ah Zheng, this drink is delicious!” ",
        "…",
        "Qi Shiyan ate with relish and fed Ming Zheng a bite from time to time.",
        "",
        "The other people present inexplicably felt that there was no room for anyone else to get between the two of them.",
        "Lou Jingyue said, “They are too sticky. Let’s ignore them, I will tell you guys about overthrowing the imperial family.” ",
        "Deputy Director Zhao could only say, “Okay.”",
        "Then, Lou Jingyue started his speech again.",
        "People watching the live broadcast: “Ahhh! I saw my idol! He has disappeared for several years. Now I’ve finally seen him again!”",
        "“It seems that Qi Shiyan is particularly happy.” ",
        "“How can he not be happy? Not only did he get to touch so many people, but he also got to eat so many delicious foods.”",
        "“Lou Jingyue is really supportive of His Majesty’s rebellion. Even while eating, he hasn’t forgotten to help His Majesty find allies.”",
        "“Those generals who were called to eat dinner all look confused.”",
        "“His Majesty is showing off his affection, and Lou Jingyue is trying to get them to rebel… They have it so hard.” ",
        "…",
        "The star worm that Qi Shiyan had killed before was very large and had a lot of meat.",
        "They ate some and brought the rest back.",
        "On the table, there was a dish made with star worm meat. ",
        "It was a pot of boiled meat slices, with spicy and delicious star worm meat in it, which made Qi Shiyan unable to stop eating.",
        "There were actually such delicious things in this world!",
        "Deputy Director Zhao felt guiltier and guiltier when he saw Qi Shiyan eating so happily during the meal.",
        "If a person suddenly ate so much, they would definitely feel uncomfortable. ",
        "Qi Shiyan must be eating so much in order to cure His Majesty as soon as possible, so he endured the discomfort, right?",
        "He really loved His Majesty. He didn’t know how he and His Majesty met.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "It was already evening when Qi Shiyan and the others arrived at the sanatorium.",
        "By the time they finished eating, it was already dark. ",
        "Those patients had to go back to take medicine and rest, but Qi Shiyan and Ming Zheng had nothing to do.",
        "Ming Zheng said, “I have my own room in the sanatorium. Will you live with me?”",
        "Qi Shiyan touched his belly and said, “Of course I’ll live with you, but let’s go to sleep a little later.”",
        "Ming Zheng was puzzled, and Qi Shiyan spoke again. “Let’s go see the mecha!” ",
        "That mecha was so cool! He liked it!",
        "Qi Shiyan wanted to see the mecha, and Ming Zheng naturally wouldn’t stop him.",
        "After he released the mecha, he never took it back. He held Qi Shiyan’s hand and walked toward the mecha.",
        "From a distance, the two saw a group of people gathered around the mecha. They were touching the Dawn with fascination on their faces. “The Dawn is so cool!” ",
        "“This is my dream mecha!”",
        "“I didn’t expect to be able to see the Dawn up close!”",
        "…",
        "Seeing this, Qi Shiyan couldn’t help but speak up. “Ah Zheng, these people’s obsession with the Dawn is almost catching up with my obsession with you when I first saw you.” ",
        "It seemed that he was not the only one who liked mechas.",
        "The audience followed Qi Shiyan and also saw the group of people.",
        "“Oh my god, among the people who kissed the Dawn’s feet, there is a former general of our Third Legion.”",
        "“My male god is there too! I didn’t expect him to have such a filthy side!” ",
        "“I also want to hug the Dawn and kiss it. I also want to lick it.”",
        "“His Majesty won’t let anyone touch the Dawn. If I had the chance to get close to the Dawn, I would be more of a pervert than them!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "…",
        "There was no one who liked mechas that didn’t like the Dawn. At this moment, they were all crazy with joy. “If I can see what the Dawn looks like inside, I will die without regrets!” ",
        "“It’s impossible to see inside. It is said that His Majesty regards the Dawn as his wife. He does all the repairs himself and never lets anyone else enter the cockpit.”",
        "“His Majesty said before that only after his death can someone else enter the cockpit of the Dawn.”",
        "“As you said, that was the past. His Majesty’s wife has already changed to another person. He will definitely bring Qi Shiyan into the Dawn.”",
        "… ",
        "As they were talking, they saw Ming Zheng say to Qi Shiyan in the live broadcast, “Ah Yan, shall I take you into the cockpit?”",
        "Qi Shiyan said, “Okay!”",
        "Ming Zheng sent a command, and the Dawn immediately squatted down and opened the cockpit door.",
        "“Let’s go in.” Ming Zheng said. ",
        "He indeed attached great importance to the Dawn.",
        "The Dawn’s cockpit cabin was his home. He used to sleep in it.",
        "Because of this, he was unwilling to let others enter the cockpit cabin.",
        "But Qi Shiyan was different. He couldn’t wait to bring Qi Shiyan back “home”. ",
        "The two entered the cockpit.",
        "The cockpit of the Dawn was not big, even a bit narrow. There were two seats inside, one for the pilot and the other for the assistant.",
        "Some mecha warriors would bring assistants, who were responsible for paying attention to the mecha warrior’s physical condition and feeding them medicine and food in a timely manner.",
        "However, Ming Zheng didn’t have the habit of bringing an assistant. ",
        "“Ah Yan, this is my home, my secret base.” Ming Zheng couldn’t help but want to introduce the Dawn. “I used to sleep here often.”",
        "“Isn’t this place a little small?” Qi Shiyan asked.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“It’s not small. When I was young and still in the laboratory, there was no place this big for me to live in.” Ming Zheng smiled.",
        "Qi Shiyan could sense that although Ming Zheng was smiling, he was a little sad. ",
        "Without thinking, he hugged Ming Zheng and said, “Ah Zheng, tell me about your past.”",
        "At this time, the people watching the live broadcast were dumbfounded.",
        "They were just discussing the internal facilities of the Dawn, and hadn’t expected to suddenly hear such a sentence.",
        "Could His Majesty really have come from a laboratory? ",
        "***",
        "T/N: *If you’ve eaten at a Chinese restaurant, you should know what this is. It’s a clear rotating glass tray set into round tables that you can rotate. It’s a way for everyone to access the dishes without reaching over too much."
    ],
    "previous": "Ch43 - Speech",
    "next": "Ch45 - Recovery"
}