{
    "title": "Ch45 - Recovery",
    "content": [
        "Being born in a laboratory was not a glorious thing. Ming Zheng still remembered that when he was first brought to the palace, his father looked at him as if he were garbage.",
        "If his mental power had not been so high, the retired emperor would never have let him survive. ",
        "His life before the age of eighteen was really boring, tedious and painful.",
        "He had never told anyone about it.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Now that Qi Shiyan asked, Ming Zheng thought for a while before speaking. “My earliest memories are all from my time in the laboratory. Because my mental power level was very high, they treated me as a precious experimental subject and could be said to have been quite nice to me.”",
        "Ming Zheng didn’t want Qi Shiyan to feel bad, so he picked out some less excessive scenes from his memories and told Qi Shiyan about them. ",
        "“At that time, I lived in a cabinet with a transparent door. There were many such cabinets in the room, and in each cabinet, there was a child.”\n\n",
        "“Many children would press their faces against the cabinet door to look out, and their faces would be squashed. They would also cry and shout, but the cabinet was well soundproofed, so the sound could not get out at all.”",
        "“Some children even regarded the robots that took care of them as their mothers. Once, when the laboratory replaced the robots taking care of us, those children became sick.”",
        "…\n\n ",
        "Ming Zheng said very little, and didn’t mention some darker things, such as the frequent deaths of children in the laboratory.",
        "But many of the audience members watching the live broadcast were already in tears.",
        "“My God, is what His Majesty said true?”\n\n",
        "“Isn’t this too tragic?” ",
        "“I feel suffocated just listening to this. Qi Shiyan, you must comfort His Majesty!”",
        "…",
        "Qi Shiyan listened very carefully and felt a little sorry for Ming Zheng.",
        "His life before was difficult, but there were still people who loved him. The opposite was true for Ming Zheng. ",
        "Ming Zheng didn’t have to starve, but no one loved him.",
        "Qi Shiyan said, “Ah Zheng, that was a test for you from God. Now it’s over. Things will get better and better for you in the future.”",
        "Ming Zheng looked at Qi Shiyan seriously. “As long as you are by my side, I will feel happy.”",
        "“Don’t worry, Ah Zheng, I will always be with you.” Qi Shiyan gave Ming Zheng a promise. ",
        "He could sense that Ming Zheng was a little uneasy.",
        "As a partner, he had to give his partner a sense of security.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng then asked, “Ah Yan, can you tell me about your past?”",
        "Qi Shiyan said, “There is nothing much to say about my past… Ah Zheng, please introduce this mecha to me.” ",
        "He couldn’t talk about his childhood. As for the original owner’s childhood, he had already talked about some of it. Continuing to talk about it would easily reveal his identity.",
        "Zoreover, he didn’t want to compare his misery with Zing Iheng.",
        "They should both welcome their new lives happily.",
        "Zing Iheng did not force it and began to introduce the mecha in front of them to Hi Shiyan. ",
        "Seeing that Hi Shiyan was listening attentively, he also said, “Ah Tan, I will give you permission so that you can use the Gawn in the future.”",
        "Since Qi Shiyan liked mechas, he could teach Qi Shiyan how to operate one.",
        "But not today. It was already dark.",
        "“Okay.” Qi Shiyan agreed, and then said, “Ah Zheng, let’s sleep here tonight.” ",
        "The space here was indeed small, but if they laid the mecha flat and adjusted the seats, they could sleep lying down.",
        "“Okay.” Ming Zheng agreed.",
        "He thought that after he became clear-headed, he would feel uncomfortable sleeping next to Qi Shiyan, but that was not the case.",
        "Lying next to Qi Shiyan, he fell asleep very quickly. ",
        "At this time, the audience watching the live broadcast were asking for explanations from the military and the imperial family.",
        "His Majesty actually came from a laboratory. This was too shocking!",
        "What happened to that laboratory? Had it been destroyed?",
        "The star network was a mess. There were also some people that wanted to guide public opinion, saying that Ming Zheng was a product of a laboratory and was not worthy of being the emperor, but the public didn’t care at all. “His Majesty is not worthy of being the emperor? Could it be that the retired emperor who is greedy for life and fearful of death is worthy?” ",
        "“Is Ming Qingyu, who tried to kill his fiancée and faked his military achievements, worthy?”",
        "“Now I just want to know what’s going on with that laboratory!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "The star network was bustling with activity, but the cockpit of the Dawn was very quiet. ",
        "When Qi Shiyan was eating dinner tonight, he specially asked the kitchen to make him some star worm jerky.",
        "Before going to bed, he helped Ming Zheng eliminate the poison once and ate two pieces of star worm jerky. Two hours later, he woke up and helped Ming Zheng eliminate the poison again.",
        "Then he ate a few more pieces of star worm jerky and went back to sleep.",
        "That night, he woke up every two hours to help Ming Zheng eliminate the poison. He held Ming Zheng in his arms carefully throughout the entire process. ",
        "Everyone who watched the live broadcast was moved.",
        "His Majesty had a hard life in the past, but fortunately, he had now met Qi Shiyan.",
        "Ming Zheng slept very well that night.",
        "He rarely slept so well. When he woke up, he felt so relaxed that he was not used to it. ",
        "All the pain and discomfort in his body had disappeared, as if he had never been poisoned or injured.",
        "Ming Zheng was a little confused.",
        "Then the next second, Qi Shiyan kissed him on the face. “Ah Zheng, congratulations! The star worm poison in your body has been completely eliminated!”",
        "Ming Zheng came back to his senses after hearing Qi Shiyan’s words. ",
        "Then he discovered that the star worm poison in his body had disappeared without a trace.",
        "In the previous twenty years, he had constantly been using his mental power to suppress the poison in his body, so he had been unable to use all of his mental power.",
        "He had thought that he could only completely release his mental power before he died.",
        "But now, his mental power had been completely liberated. ",
        "Ming Zheng’s mental power wrapped around Qi Shiyan. He had never shed tears before, but at this moment, his eyes were a little sore.",
        "“Ah Yan, thank you.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“I’ve said before that you don’t have to say thank you to me. However, you can hug me and kiss me,” Qi Shiyan suggested.",
        "When he was not clear-headed, Ming Zheng would kiss and hug him, but when he was clear-headed, Ming Zheng usually didn’t hug or kiss him. ",
        "He wanted Ming Zheng to kiss him.",
        "Ming Zheng hugged Qi Shiyan tightly.",
        "The huge mecha lay flat on the sports field of the sanatorium. Next to it, some patients were caressing the mecha obsessively.",
        "There was also Lou Jingyue “mixed in” among them. ",
        "Lou Jingyue, who was unable to touch the mecha yesterday, came to touch it early this morning. While touching it, he also publicized the matter of the emperor looking for a substitute to help him fight.",
        "Those patients who were not familiar with Ming Zheng believed what Lou Jingyue said. They sat next to the Dawn and scolded the emperor with Lou Jingyue.",
        "Deputy Director Zhao came out for a stroll and couldn’t help twitching his lips when he heard this.",
        "But he couldn’t help His Majesty clarify the matter. ",
        "Lou Jingyue was a guy who couldn’t keep secrets. If he found out that the matter of the substitute was fictitious, and he blurted it out in excitement, Young Master Yan would realize something was wrong!",
        "“Young Master Zheng and Young Master Yan still haven’t come out yet?” Deputy Director Zhao asked.",
        "Lou Jingyue said, “They haven’t come out yet. They must be acting lovey-dovey in the cockpit. They are like this every day. I’m used to it.”",
        "His Majesty would actually act lovey-dovey with someone? Deputy Director Zhao stood beside the Dawn, pretending to be waiting, and then touched the Dawn again and again. ",
        "He had never touched this mecha before, but now he could finally touch it.",
        "At this time, Lou Jingyue whispered to Deputy Director Zhao, “Uncle Zhao, let me tell you something.”",
        "“What?” Deputy Director Zhao said.",
        "Lou Jingyue said, “I suspect that my Brother Yan is the boss of the Chaotic Zone. You don’t know that his mental power is incredibly strong. He was able to help me seal all the poison in my body! Before, a star worm approached, and before I noticed it, the star worm was killed by him. I think his mental power is at least SS-level! I admire Brother Zheng the most, and right below him on the list of people I admire is my Brother Yan. His cooking skills are also good…” ",
        "SS-level was not that easy to achieve.",
        "Deputy Director Zhao didn’t know how Qi Shiyan helped His Majesty detoxify, but he felt that Qi Shiyan, who was so young, should not have SS-level mental power.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "When His Majesty was Qi Shiyan’s age, he was only SS-level, but His Majesty was a genius unparalleled in the world.",
        "However, at this moment, several researchers in white coats suddenly ran over from a distance. “Old Zhao! Old Zhao!” ",
        "“What’s wrong?” Deputy Director Zhao was puzzled.",
        "“Old Zhao, where did the star worm skin and star worm meat delivered yesterday come from? Who killed that star worm? That person is so strong that he killed the high-level star worm with one blow before it could release its poison and fight back! Was it His Majesty?” One of the researchers in a white coat had an excited look on his face.",
        "Deputy Director Zhao was stunned. “Is that a high-level star worm?”",
        "Lou Jingyue was also stunned. “Is that a high-level star worm?” ",
        "“It’s a high-level star worm, and a high-level star worm that has never been killed before! No wonder its meat is so rich in energy. How can the meat of a high-level star worm not be rich in energy?” The researcher in the white coat said.",
        "Lou Jingyue looked at Deputy Director Zhao. “Uncle Zhao, at that time, the star worm was killed by Brother Yan before it even got close to us…”",
        "Deputy Director Zhao said, “Even a SS-level expert can’t do this.”",
        "Could it be that Young Master Yan possessed SSS-level mental power just like His Majesty? ",
        "His Majesty had found a treasure!",
        "At this time, Lou Jingyue also slapped his thigh excitedly. “Uncle Zhao, with Brother Yan’s help, we can definitely overthrow the imperial family!”",
        "Deputy Director Zhao: “…”",
        "At this time, the cockpit of the mecha opened and Ming Zheng came out of the cockpit. ",
        "There was no trace of blue or purple discoloration on his face anymore.",
        "Standing on the lying flat mecha, he looked radiant with energy and extremely dazzling.",
        "“Brother Zheng is so handsome!” Lou Jingyue couldn’t help but say.",
        "People watching the live broadcast had the same thought as Lou Jingyue. ",
        "No wonder Qi Shiyan looked down on Lou Jingyue. His Majesty was really much more handsome than Lou Jingyue!",
        "Ming Zheng glanced at Lou Jingyue, and then said, “All of you move away from the Dawn.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng had a very strong aura. After he opened his mouth, people who were near the Dawn and touching the Dawn subconsciously moved away from the Dawn.",
        "After they left, Ming Zheng went back inside the mecha. ",
        "Soon, the mecha stood up and raised one foot.",
        "Just when everyone thought that the Dawn would make a handsome move in the next second, it fell to the ground with a “pop”."
    ],
    "previous": "Ch44 - Dawn",
    "next": "Ch46 - Whole Body Illness"
}