{
    "title": "Ch46 - Whole Body Illness",
    "content": [
        "In the eyes of the people of the empire, the Dawn was extremely majestic.",
        "After killing high-level star worms, the military would post the combat videos online. ",
        "Then, people from all over the empire watched the Dawn kill high-level star worms again and again.",
        "This mecha represented the empire’s strongest combat power.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "But now, it fell on the sports field of the sanatorium.",
        "After that, it crawled several times before it climbed up crookedly, and then began to stumble with every step, just like a child who was just learning to walk. ",
        "Those people in the sanatorium who had originally surrounded the Dawn all fled in all directions, fearing that they would be accidentally crushed by the Dawn.\n\n",
        "However, their worries were unnecessary.",
        "Qi Shiyan had always used his mental power to observe the situation outside and would never let anyone outside be in danger.",
        "After all, he loved people the most!\n\n ",
        "Yes, the one operating the mecha was Qi Shiyan.",
        "All of his supernatural powers had been used up and it would take time for them to recover. Now that he had nothing to do, he might as well play with the mecha.",
        "Most people who were learning to operate a mecha first learned on the star network through a virtual helmet. Only after they had learned everything they needed to learn would they practice using an actual mecha.\n\n",
        "But he directly used the most powerful mecha, Dawn, to learn. ",
        "“Ah Yan, are you okay?” Ming Zheng asked.",
        "He and Qi Shiyan were both fixed in their seats and would not be thrown out just because the Dawn fell.",
        "But they would take a lot of pounding.",
        "He had long been accustomed to it and did not take the impact seriously. He was just afraid that Qi Shiyan would get hurt. ",
        "“I’m fine! Ah Zheng, mechas are so fun!” Qi Shiyan used his mental power to connect to the mecha, and according to what Ming Zheng taught him, he began to explore how to control the mecha.",
        "Then, everyone in the sanatorium saw the Dawn jumping wildly on the sports field.",
        "Deputy Director Zhao: “…” It seemed that His Majesty also liked Young Master Yan very much. Look, he even gave away the Dawn!",
        "“The one controlling the mecha is Brother Yan? What is he doing? How come he can’t even operate a mecha?” Lou Jingyue couldn’t believe it. He had already learned how to operate a mecha when he was less than 10 years old! ",
        "“Lou Jingyue, have you noticed the ground of our sports field?” Deputy Director Zhao suddenly spoke.",
        "“What’s wrong with the ground?” Lou Jingyue was puzzled.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Deputy Director Zhao said, “Our sports field was built according to the standards of a civilian sports field. It can’t withstand much force. If you chop the ground with a knife, it will leave a mark. However, the Dawn was built with the best materials. Normally, with the Dawn falling and jumping on it, the sports field should have been destroyed long ago. But now the sports field is fine. There’s not even a small dent on it. How precise does the control have to be to achieve this?”",
        "When Deputy Director Zhao pointed this out, Lou Jingyue also noticed this and was surprised. ",
        "He didn’t know about others, but he couldn’t make the sports field dent-free.",
        "When Geputy Girector Ihao realihed this, the ezperienced people in the sanatorium also realihed it.",
        "Although the person controlling the Gawn made the Gawn make many mistakes due to his lack of ezperience, his reactions were really fast and his mental power was strong enough, so the Gawn didn’t even damage the sports field after pumping around.",
        "With such strong mental power, the person controlling the Dawn would sooner or later become a powerful mecha warrior. ",
        "Inside the Dawn, Qi Shiyan finally stopped playing after an hour. “Ah Zheng, let’s go out and eat!”",
        "When they went out to get something to eat, he could also help treat others.",
        "Qi Shiyan was very passionate about helping people eliminate the star worm poison.",
        "He hoped that everyone around him could be healthy. ",
        "In his previous life, he failed to save the people around him. In this life, he had to make sure that everyone was alive and well.",
        "This was also to make up for his regrets.",
        "“Okay.” Ming Zheng agreed, then thought of something and said, “Ah Yan, after eating, do you want to go to the medical cabin and lie down for a while and have a physical examination?”",
        "“Yes.” Qi Shiyan agreed immediately. ",
        "The original owner’s body was really weak. He just played with the mecha for a while and felt pain all over his body.",
        "It would be great if he could go to the medical cabin for a check-up.",
        "He was going to live to be three hundred years old.",
        "The two of them opened the cockpit of the mecha and went out, and saw at a glance that there were many people surrounding them. ",
        "Lou Jingyue asked first. “Brother Yan, were you the one operating the mecha just now?”",
        "“Yes.” Qi Shiyan smiled.",
        "",
        "“Brother Yan, you are so awesome! Your skills are so great!” Lou Jingyue said.",
        "Deputy Director Zhao then said, “Young Master Yan, your mecha talent is outstanding!” ",
        "Others also praised, “Young Master Yan, you are so strong!”",
        "“Young Master Yan, given time, you might become stronger than Young Master Zheng.”",
        "“Your control over the mecha makes me feel inferior.”",
        "… ",
        "Before this, Qi Shiyan had been in the cockpit of the mecha, so the people watching the live broadcast could not see the situation outside.",
        "They could only see Qi Shiyan’s messy operations. Sometimes, he fell on his back, sometimes on his stomach, and once he even fell headfirst, and became dizzy. Even they felt dizzy watching the live broadcast.",
        "This made them cry out for help. “Oh my God, I’m going to faint!”",
        "“Qi Shiyan has never learned how to operate a mecha, but he went straight into the actual operation. This is a bit too much!” ",
        "“Your Majesty, isn’t it too much for you to give Qi Shiyan a SSS-class mecha like the Dawn to learn basic operations?”",
        "“Hahahaha! My ten year old sister can operate a mecha better than Qi Shiyan!”",
        "…",
        "As they were laughing, they saw a group of military bigshots surrounding Qi Shiyan and praising his mecha operating skills. ",
        "“These people are amazing. Qi Shiyan’s mecha operation is so poor, but they can actually still praise him!”",
        "“This is a single-minded effort to flatter Qi Shiyan!”",
        "“When I see a group of people who appear repeatedly in the mecha operation course teaching videos, praising Qi Shiyan with sincere faces, I always feel that the empire is doomed.”",
        "“Looking at Qi Shiyan’s expression, he seems quite proud and happy.” ",
        "…",
        "Qi Shiyan was indeed very happy.",
        "",
        "How nice it was to have a group of people surrounding him and praising him!",
        "He was so happy that he shook hands with them one by one and said, “Thank you for your compliments.” ",
        "Seeing this, Ming Zheng said, “Ah Yan, it’s time for breakfast.”",
        "Upon hearing this, Qi Shiyan called everyone else to join them. “Have you guys eaten? Let’s go eat together?”",
        "These people were so cute. He wanted to go eat with them.",
        "Qi Shiyan had breakfast today with everyone in the dining hall, but he had an extra meal. ",
        "Qi Shiyan was very happy with the meal. He ate a lot as usual, chatted with others while eating, and patted his chest to assure. “Don’t worry, I will definitely cure all of you!”",
        "When the generals who were poisoned with star worm poison heard this, they were extremely grateful.",
        "Lou Jingyue said, “Brother Yan, there is a large auditorium in the sanatorium. When you help people eliminate the star worm poison later, why don’t you do it in the auditorium so that everyone can watch?”",
        "Qi Shiyan agreed immediately. “Okay!” He was actually a little envious when he saw Lou Jingyue giving a speech on top of the airship yesterday. ",
        "He also wanted to be like that – to be the center of attention!",
        "“I’ll help you arrange it!” Lou Jingyue said. He wanted everyone to see Qi Shiyan helping people eliminate the star worm poison. This would help them better convince the people in the sanatorium to firmly believe in overthrowing the imperial family. “Brother Yan, it’s 8 a.m. now. Let’s arrange the elimination of the star worm poison at 9 a.m. I’ll go and notify everyone.”",
        "Qi Shiyan had no opinion and looked at Ming Zheng again. “Ah Zheng, where is the medical cabin? I want to try it.”",
        "He had always been interested in the medical cabin where one could have their injuries healed just by lying down for a while. ",
        "He was not seriously injured when operating the mecha before, but because of the many collisions, many capillaries under the skin had ruptured and one of his ribs had been fractured. He wanted to receive treatment.",
        "Speaking of fractured ribs, this was all because he was too thin.",
        "Bones would not fracture so easily if they were protected by muscles and fat.",
        "Ming Zheng and Deputy Director Zhao took Qi Shiyan to the medical room. ",
        "Qi Shiyan hurriedly climbed into the medical cabin, ready to experience the advanced technology of the interstellar era.",
        "Then, the medical cabin lit up with a yellow light.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng and Deputy Director Zhao’s faces changed. “Why is the yellow light on?” A yellow light meant that one’s physical condition was very poor!",
        "The people in the live broadcast room were also stunned. Qi Shiyan had always been lively and happy, so why did the yellow light turn on? ",
        "Many people had some minor ailments, but most minor ailments would never cause the yellow light of the medical cabin to light up.",
        "At this time, the physical examination results of the medical cabin came out.",
        "He had multiple bruises on his body, a fractured rib on the right side, was severely malnourished, and lacked many types of nutrients… Qi Shiyan had no major illnesses, but he had a long list of minor ailments.",
        "“This, this…” Deputy Director Zhao was dumbfounded. “He has been malnourished and his body is not well developed. He was also injured just now… He should feel uncomfortable all over. How can he be so happy?” ",
        "Ming Zheng said, “He should be uncomfortable. He suffered too much in the past and is used to it… Give him the best medicine!”",
        "Even though his bones were fractured, Qi Shiyan had still been smiling the whole time while eating breakfast…",
        "Ming Zheng had a blank expression on his face and felt extremely upset.",
        "Qi Shiyan felt particularly good at this moment. ",
        "There was suddenly a lot more liquid in the medical cabin.",
        "These liquids were rich in energy and elements beneficial to the body. They began to repair his body. He could feel that his body was getting better quickly.",
        "This medical cabin was so great!",
        "The original owner’s health was quite poor, so he couldn’t exert his full strength, but if he could lie in the medical cabin longer, he would definitely recover faster. ",
        "By then, he might even be stronger than his family’s Ah Zheng.",
        "Qi Shiyan lay in the medical cabin for more than half an hour and then asked to come out.",
        "“Ah Yan, your body hasn’t recovered yet.” Ming Zheng was a little worried. All of Qi Shiyan’s wounds had healed, but his body was very weak, so it would be best for him to soak in there for a while longer.",
        "“It’s almost 9 a.m.! I’ll go help people eliminate the star worm poison first, and then continue to soak after that.” After saying this, Qi Shiyan thought of something. “Can this medical cabin be moved to the auditorium? In between treating people, I can go in and soak to restore my physical condition.” ",
        "After treating people, he could soak in the healing liquid, which was really wonderful!",
        "Ming Zheng and Deputy Director Zhao were shocked.",
        "Please visit chrysanthemumgarden (dot) com",
        "While treating others, he used the medical cabin to treat himself. Wasn’t Qi Shiyan exerting himself too much?!"
    ],
    "previous": "Ch45 - Recovery",
    "next": "Ch47 - Saving People"
}