{
    "title": "Ch47 - Saving People",
    "content": [
        "The sanatorium had a large auditorium, which was occasionally used for meetings.",
        "The auditorium faced south, with an elevated stage on the north side and rows of seats on the south side. ",
        "The convalescent planet was Ming Zheng’s private planet. The land was free, and the buildings were built by robots, using local materials, so the cost was quite low. The sanatorium was built very spaciously.",
        "This auditorium could easily accommodate over ten thousand people.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "At this moment, most of the people in the sanatorium were here.",
        "On the stage, Lou Jingyue was talking about how Qi Shiyan could help people eliminate poison, and below, people were also talking about this. ",
        "“I heard that the star worm poison in His Majesty’s substitute has all been eliminated.”\n\n",
        "“Were His Majesty’s military achievements really made by that substitute?”",
        "“Marshal Ke Lun and Deputy Director Zhao have both confirmed it, and that person also has the Dawn in his possession, so it should be true.”",
        "“I didn’t expect His Majesty to actually be such a person!”\n\n ",
        "“What ’His Majesty’ are you still thinking about at this moment? Young Master Zheng looks exactly like His Majesty, and all the military achievements were won by him… He is the person I have always admired.”",
        "“That’s true……”",
        "“By the way, where did Young Master Yan come from? How does he help people eliminate the star worm poison?”\n\n",
        "“I don’t know, but those researchers who study star worms and the doctors from the sanatorium are all here and sitting in the front. We should know soon.” ",
        "…",
        "Behind Lou Jingyue, Shan Xi felt a little embarrassed.",
        "Ming Zheng’s poison had been completely eliminated. Now, the person in the sanatorium with the worst condition and who was the most seriously poisoned was him.",
        "So, he was chosen as the first one to receive treatment from Qi Shiyan. ",
        "He was very happy about this, but he hadn’t expected this treatment to actually be in public.",
        "This made him a little uncomfortable, but fortunately, Marshal Ke Lun gave him medicine to allow him to become clear-headed.",
        "If he cried while receiving treatment on stage… Shan Xi felt that after he was cured, he would wish to die again.",
        "At this time, Qi Shiyan had already arrived at the auditorium. ",
        "As soon as he entered from the side door, he saw Lou Jingyue standing on the stage, looking very excited. “Everyone, it’s almost 9 a.m.! Young Master Yan will soon treat General Shan. When you see General Shan recover, you will know that everything I said is true.”",
        "There was longing in Qi Shiyan’s eyes.",
        "",
        "He could not wait to get on the stage. Looking at the huge crowd below, he was very happy. “I promise that I can cure General Shan today!”",
        "“Brother Yan, are you so awesome?” Lou Jingyue asked. ",
        "“Yes!” Qi Shiyan was sure.",
        "In the past two days, probably because he ate a lot of star worm meat, his supernatural powers had become stronger.",
        "As for Shan Xi, although he was seriously poisoned, it was not as serious as Ming Zheng’s had been. The poison in his body was less than one-third of Ming Zheng’s.",
        "With the help of star worm meat and the medical cabin, he would be able to cure Shan Xi by the afternoon. ",
        "Thinking of this, Qi Shiyan looked at Shan Xi. “General Shan, let’s start the treatment.”",
        "When Shan Xi saw Qi Shiyan, he felt a little embarrassed when he thought about how Qi Shiyan had coaxed him when he was not in his right mind.",
        "He was so old, but he was actually coaxed by a young man who could be his grandson!",
        "“Is there anything I have to do?” Shan Xi asked. ",
        "“Tou don’t have to do anything. Aust give me your hand,” Hi Shiyan said, “Zy mental power is very strong and special, and can help people dissolve poison.”",
        "Hi Shiyan did not mention anything about his supernatural powers, and attributed his detozification ability to his mental power.",
        "In fact, Hi Shiyan was also worried about showing off his detozification ability.",
        "He was afraid that after saving people, he would not have a good ending and would be taken away for research. ",
        "But the patients in the sanatorium were all heroes of the empire.",
        "Since he could save them, why wouldn’t he?",
        "He didn’t want these people to die.",
        "Qi Shiyan held Shan Xi’s hand and touched it subconsciously. ",
        "Shan Xi didn’t think much about it and thought it was necessary for medical treatment.",
        "The people watching the live broadcast were dying of laughter. “Here it comes again!”",
        "",
        "“Marshal Duan, the empress is molesting your partner. Shouldn’t you do something?”",
        "“Qi Shiyan: It’s good to help people eliminate poison. Now I can touch people openly!” ",
        "…",
        "Marshal Duan also saw this scene.",
        "He was a little speechless, but not angry.",
        "Qi Shiyan’s eyes were really pure. The way he looked at Shan Xi was completely different from the way he looked at His Majesty. ",
        "In the auditorium, after Qi Shiyan finished touching, he realized something was wrong and looked at Ming Zheng guiltily.",
        "Seeing that Ming Zheng was not angry, he breathed a sigh of relief, and his supernatural powers entered Shan Xi’s body…",
        "Qi Shiyan spent about ten minutes using up all of his supernatural powers.",
        "The blue and purple discoloration on Shan Xi’s face also visibly faded by one third. ",
        "Before, there were still many people talking in the auditorium, but now, one could hear a pin drop in the auditorium.",
        "This person could really eliminate the star worm poison!",
        "They witnessed a miracle.",
        "“General Shan, the first treatment is over.” Qi Shiyan let go of Shan Xi’s hand. ",
        "Shan Xi was still in a daze, but Qi Shiyan had already reached out, intending to grab some star worm jerky to eat.",
        "But before his hand touched the star worm jerky, Ming Zheng grabbed his hand.",
        "Ming Zheng took out a wet towel and helped Qi Shiyan wipe his hands before letting Qi Shiyan eat the star worm jerky.",
        "Qi Shiyan glanced at Ming Zheng with amusement. ",
        "His family’s Ah Zheng was definitely jealous!",
        "This guy was just a vinegar jar.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng asked at this time, “Ah Yan, do you want to go lie down in the medical cabin for a while?”",
        "Qi Shiyan naturally wanted it. “Yes, I’ll go lie down for a while.” ",
        "The medical cabin was also placed on the stage.",
        "Qi Shiyan climbed into the medical cabin and lay down.",
        "Although he had previously lain in the medical cabin for more than half an hour and his injuries had healed, Qi Shiyan’s physical condition was still not good.",
        "His body was too weak and his mental power was too strong. ",
        "This caused the yellow light of the medical cabin to remain on.",
        "Shan Xi stood up suddenly when he saw this scene.",
        "He suddenly thought that star worm poison, a poison that had always been considered untreatable, might not be so easy to treat.",
        "While Qi Shiyan was helping him to eliminate the star worm poison, was he also damaging his own body? ",
        "Shan Xi thought so, and so did the others present, all looking at the medical cabin worriedly.",
        "Ming Zheng stood next to the medical cabin and looked at Qi Shiyan’s new physical examination report. He was relieved to confirm that Qi Shiyan’s physical condition had not deteriorated.",
        "Qi Shiyan had said that helping to eliminate the star worm poison would not harm the body.",
        "But Ming Zheng was still a little worried. Now he finally felt relieved. ",
        "But he didn’t intend to let others know about this.",
        "Reaching out to turn off the indicator light of the medical cabin, Ming Zheng stood nearby, looking at Qi Shiyan lying happily in the medical cabin, and covered him with his hand.",
        "He would let the people in the sanatorium appreciate Qi Shiyan’s kindness and would also protect Qi Shiyan.",
        "Qi Shiyan liked the medical cabin very much. The only thing he was not satisfied with was that after lying inside, he could no longer hold hands with Ming Zheng. ",
        "Now Ming Zheng’s hand was on the lid of the medical cabin. He smiled, raised his hand, and put his hand together with Ming Zheng’s.",
        "Although he couldn’t move in the medical cabin, it was also good to have Ming Zheng by his side and a large group of people watching him, right?",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan was soaking in a special healing solution with a breathing mask on his face. “Ah Zheng, I will be able to recover after soaking until 11 a.m. Then I will continue to help General Shan with his treatment.”",
        "Ming Zheng said, “Don’t be so anxious. You can rest for a while.” ",
        "“No need, resting too long is a waste of time.” Qi Shiyan said with a smile.",
        "Ming Zheng looked at Qi Shiyan, an indescribable feeling welling up. “Then why don’t you take a nap?”",
        "Qi Shiyan said, “I can’t sleep. Ah Zheng, please chat with me.”",
        "“Okay.” Ming Zheng agreed. ",
        "The two of them started chatting about everything under the sun.",
        "As they chatted, Ming Zheng asked, “Ah Yan, I look exactly like the emperor. Do you feel uncomfortable with this?”",
        "Ming Zheng always thought that after the star worm poison in his body was completely eliminated and his true appearance was revealed, Qi Shiyan would question his appearance.",
        "But that didn’t happen. Qi Shiyan didn’t say anything other than saying that he was handsome. ",
        "Facing his face that looked exactly like the emperor’s, Qi Shiyan could still happily kiss him.",
        "Qi Shiyan had long discovered that Ming Zheng looked very similar to the emperor.",
        "However, in the interstellar era, changing one’s appearance was very easy. The original owner had also worn a face-changing mask that could drastically change his appearance.",
        "Qi Shiyan just thought that the emperor had modified Ming Zheng’s appearance and didn’t care at all. ",
        "As for kissing a face that looked exactly like the emperor’s… when Ming Zheng was particularly ugly before, he still kissed him.",
        "“No, you look very handsome like this.” Qi Shiyan said.",
        "Wasn’t it just that he looked like the emperor? He didn’t care.",
        "When the original owner had a video call with the emperor, the emperor was wearing a mask. Normally, the original owner would not deliberately search for photos of the emperor on the star network. In addition, those were the original owner’s memories, so there was a layer of separation for him. ",
        "He actually had no impression of the emperor. Now this face appeared on his family’s Ah Zheng, so it was his family’s Ah Zheng’s face.",
        "Ming Zheng was in a good mood when he heard Qi Shiyan praise his handsomeness. Then, the next second, he heard Qi Shiyan say, “Ah Zheng, if you don’t want the emperor to look like you, we will destroy his face in the future!”",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Zheng: “…”",
        "The two of them spoke in low voices. Without amplification, the people below the stage could not hear them. ",
        "At this moment, those people were all paying attention to Shan Xi.",
        "All the doctors in the sanatorium surrounded Shan Xi and examined him.",
        "When they discovered that the amount of star worm poison in Shan Xi’s body had really been reduced by one third, they were instantly super excited.",
        "They did not see Ming Zheng being cured with their own eyes, but now, Shan Xi had been partially cured by Qi Shiyan in front of them. ",
        "For a moment, they looked at Qi Shiyan with great enthusiasm, wanting Qi Shiyan to cooperate with their research.",
        "But when they saw Qi Shiyan lying in the medical cabin, and remembered that the yellow light of the medical cabin had lit up… they suddenly couldn’t say anything.",
        "Qi Shiyan didn’t know what they were thinking. When it was 11 a.m., he immediately climbed out of the medical cabin and said, “General Shan, I will continue to treat you!”",
        "Shan Xi looked at this enthusiastic and innocent child, feeling guilty. “I’m not in a hurry. You should rest for a while.” ",
        "“I don’t need to rest. General Shan, I will help treat you and then we will go to have lunch.” Qi Shiyan smiled sincerely.",
        "Shan Xi finally stretched out his hand.",
        "Qi Shiyan spent another ten minutes helping him eliminate the poison, and then said, “General Shan, I will help you eliminate the poison again in two hours. Then the star worm poison in your body will be completely eliminated.”",
        "He could actually recover… Shan Xi felt a little dazed. ",
        "He looked at Qi Shiyan and said, “Young Master Yan, you are my savior. From now on, as long as your requests are not outrageous and against morality, I will agree to all of them!”",
        "Qi Shiyan said, “I don’t have any requests. I only want you to help overthrow the imperial family.”",
        "His family’s Ah Zheng wanted to overthrow the imperial family, so he would fully support it!",
        "Shan Xi said, “Don’t worry, I am on your side. The entire Second Legion will stand on your side.” ",
        "Qi Shiyan laughed and said, “I’m hungry!”",
        "Deputy Director Zhao immediately sent over a lot of food.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan had a big meal. After he was full, he went back to the medical cabin to lie down.",
        "He could sense that his body was recovering rapidly. ",
        "The advanced technology of the interstellar era was really good stuff.",
        "Qi Shiyan was lying in the medical cabin purely because he liked it.",
        "But others didn’t know this.",
        "The people in the auditorium only saw that after he treated Shan Xi, he had to eat a lot of food and lie down in the medical cabin. ",
        "Young Master Yan definitely had to pay a huge price to help them eliminate the star worm poison. He might even cause harm to his body.",
        "But even so, Young Master Yan was still willing to help them.",
        "Young Master Yan was really a good person."
    ],
    "previous": "Ch46 - Whole Body Illness",
    "next": "Ch48 - Sending Meat"
}