{
    "title": "Ch48 - Sending Meat",
    "content": [
        "At 1 p.m. in the afternoon, Qi Shiyan opened the lid of the medical cabin again and sat up from inside.",
        "He was wet all over, so he was too lazy to climb out. He sat in the medical cabin and said to Shan Xi, “General Shan, stretch out your hand. I will eliminate the poison for you.” ",
        "Qi Shiyan was smiling the whole time, his face full of sincerity, which made Shan Xi even more moved.",
        "He had said everything he should say, and there was nothing more to say now… Shan Xi looked at Qi Shiyan silently, and felt that this child was truly innocent and kind.\n",
        "",
        "The blue and purple discoloration on Shan Xi’s face completely disappeared, revealing a square-shaped face.",
        "Qi Shiyan looked at him curiously. ",
        "The man who had been crying like a child before now looked like an ordinary middle-aged man with regular features. He was not handsome, but his face was full of righteousness.\n\n",
        "Qi Shiyan reluctantly let go of his hand. “General Shan, you are all better. Who is the next person? I will help them eliminate the poison at 3 p.m..”",
        "“Young Master Yan, you have already saved General Shan today. You can treat the next patient tomorrow.”",
        "Qi Shiyan said, “Let’s not delay any longer. I see that many people in the sanatorium are not in good health. I have star worm meat to eat, and I can also lie in the medical cabin to recover my strength. I can definitely treat a few more people.”\n\n ",
        "“Young Master Yan, will this harm your body?” Deputy Director Zhao asked.",
        "Qi Shiyan said, “Don’t worry, it won’t. Plus I like saving people.”",
        "If he had a medical cabin and star worm meat before, those who had raised him and accompanied him would not have died.\n\n",
        "Qi Shiyan felt that saving people now was actually making up for the regrets in his heart. ",
        "Anyway, he wanted to save more people quickly.",
        "“Then, Young Master Yan, is there anything you need? As long as our sanatorium has it, we will definitely bring it over for you.” Deputy Director Zhao said again.",
        "Qi Shiyan asked, “Do you have a larger medical cabin? Ah Zheng, can you lie in the medical cabin with me?”",
        "Lying in the medical cabin was quite interesting. It was just that he couldn’t touch anyone, which made him feel a little uncomfortable. ",
        "If Ming Zheng was willing to lie in the medical cabin with him, then he would be living a life like an immortal.",
        "“There is a larger medical cabin.” Deputy Director Zhao said, and then looked at Ming Zheng. “And Young Master Zheng, although your poison has been eliminated, your body is still weak. You should also lie down in the medical cabin.”",
        "“Yes, Young Master Zheng should also lie down in the medical cabin.” The doctor next to him spoke. In fact, they had already privately approached His Majesty and wanted him to go receive treatment, but unfortunately His Majesty was unwilling to go and wanted to accompany Qi Shiyan.",
        "Now the two of them could be treated together, which was quite good. ",
        "After a while, a larger medical cabin was brought in.",
        "This medical cabin was for people with larger bodies. Qi Shiyan and Ming Zheng were not fat, so they could both lie down comfortably.",
        "",
        "As for whether it would be more troublesome to treat two different people in the same medical cabin… The problem with Qi Shiyan and Ming Zheng was that they were both seriously physically weak, so they could just give them the best healing liquid in the sanatorium.",
        "Qi Shiyan happily lay down in the medical cabin and held Ming Zheng’s hand. “Ah Zheng, the two of us should soak well in the medical cabin. This way, we can be healthy and live a long life of 300 years.” ",
        "These healing liquids were all good stuff. He even wanted to take a few sips to taste.",
        "Ming Zheng held Qi Shiyan’s hand tightly.",
        "The retired emperor had always pursued longevity, but he was different.",
        "In the past, he had no desire to live that long, but now, he wanted to live on with Qi Shiyan. ",
        "Hi Shiyan was very happy, but the people watching the live broadcast burst into laughter again. “What is Hi Shiyan thinking? Not only is he lying in a medical cabin on stage, but now he’s even asking Lis Zapesty to lie down with him.”",
        "“This scene is really strange. Yver ten thousand people are looking at two people lying in a medical cabin.”",
        "“It looks like some mysterious ceremony is taking place.”",
        "“It makes me sad to think about it. Qi Shiyan really likes liveliness. He lived a very lonely life when he was a child.” ",
        "…",
        "As they were talking, someone brought up another matter. “Although Qi Shiyan’s behavior is a bit strange, he is really kind.”",
        "“Yes, helping people eliminate the star worm poison must also cause him some harm, otherwise he wouldn’t have to eat so much. But he’s still trying his best to help treat people.”",
        "“He’s always cheerful and not impatient at all.” ",
        "“I feel vigorous vitality from him.”",
        "…",
        "Indeed, Qi Shiyan possessed vigorous vitality.",
        "It seemed that no matter how many difficulties he encountered, he could live on with determination. ",
        "Now, this live broadcast room was not as full of twists and turns as before, but the audience was still willing to watch it, and some people even burst into tears.",
        "“General Shan saved my planet. It’s great that General Shan can recover!”",
        "",
        "“I’m from the Second Legion. From now on, I’ll be Qi Shiyan’s die-hard fan!”",
        "“The next person to receive treatment is General Lei. I hope everyone will get well soon.” ",
        "…",
        "At 3 p.m. in the afternoon, Qi Shiyan sat up from the medical cabin on time to help Lei Yin with treatment.",
        "By 7 p.m. in the evening, the star worm poison in Lei Yin’s body, who had received three treatments from Qi Shiyan, was also completely eliminated.",
        "Qi Shiyan spoke up at this time. “It’s already dark. Everyone go and rest. Just leave two patients here, I can help treat them when I wake up at night.” ",
        "Deputy Director Zhao didn’t expect that Qi Shiyan, who had been busy all day, actually didn’t plan to take a break in the evening.",
        "Was it really okay for him to squeeze himself like this?",
        "“Young Master Yan, you should have a good rest. We are not in a hurry.” Deputy Director Zhao said.",
        "“High-level star worms have appeared on the convalescent planet. The situation is still quite urgent. And if you guys can recover your strength faster, you can help me get revenge earlier.” Qi Shiyan said. ",
        "The star worm meat he ate came from a high-level star worm. Qi Shiyan already knew this.",
        "A high-level star worm had already appeared on the convalescent planet. Was the next one far behind?",
        "Anyway, Qi Shiyan felt it was not far behind.",
        "He needed to restore his strength, and these people did as well. Since he had the ability to cure them, he would definitely do his best to treat them. ",
        "“Old Zhao, let’s go to the medical room to rest, and then arrange patients for him according to Ah Yan’s request.” Ming Zheng said.",
        "He felt that the situation outside was probably not very good.",
        "In this case, they really needed to recover their strength quickly.",
        "Deputy Director Zhao looked at His Majesty in shock. ",
        "Not only did His Majesty trick Qi Shiyan into helping them with treatment, he even oppressed Qi Shiyan.",
        "This was not even allowing Qi Shiyan to sleep well?",
        "",
        "He looked at Qi Shiyan, waiting for him to object, but Qi Shiyan said, “Yes, let’s do that!”",
        "High-level star worms could come knocking at any time, so Deputy Director Zhao finally made arrangements according to what Qi Shiyan said. ",
        "Qi Shiyan and Ming Zheng were still lying in the medical cabin and were carried to the medical room.",
        "Qi Shiyan was very happy. “Ah Zheng, this is the first time I’ve had people carry* me. It’s really fun.”",
        "Ming Zheng didn’t know whether to laugh or cry*. This medical cabin was like a coffin. He actually felt a little uncomfortable being carried like this.",
        "But if Qi Shiyan liked it, then just be carried like this. ",
        "The third person to receive treatment was Marshal Ke Lun.",
        "Qi Shiyan really liked chatting with Marshal Ke Lun.",
        "He didn’t know much about the interstellar era, so he rarely spoke and mainly listened to Marshal Ke Lun.",
        "Marshal Ke Lun said a lot, and while he was talking, he took out a special feature compilation of the Dawn’s combat battles filmed by the military and showed it to Qi Shiyan. ",
        "The original owner had never seen these before, so Qi Shiyan watched with great interest. “So this is what star worms look like!”",
        "“Ah Zheng, you are so handsome!”",
        "“Ah Zheng, I am so lucky to have a partner like you.”",
        "“Ah Zheng, you are the treasure that God sent me.” ",
        "…",
        "Ming Zheng couldn’t help but say, “You are the treasure that God sent me.”",
        "Marshal Ke Lun followed up, “Yes, Young Master Yan is the treasure of all of us.”",
        "Ming Zheng couldn’t help but glare at Marshal Ke Lun – Qi Shiyan belonged to him alone! ",
        "Marshal Ke Lun laughed.",
        "After watching Ming Zheng’s combat videos, it was getting late, so Qi Shiyan told Ming Zheng and Marshal Ke Lun to go to sleep.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "However, although he slept, he woke up every two or three hours at night, ate some star worm meat, and then helped Marshal Ke Lun and other patients eliminate the star worm poison.",
        "So, by the next morning, in addition to Shan Xi and Lei Yin, there were two more people who had recovered. ",
        "The entire sanatorium was in an uproar!",
        "The star network was also in an uproar.",
        "“Qi Shiyan’s behavior has really moved me. I have cried several times today.”",
        "“He got up several times in the middle of the night to help treat people. Most people really can’t do this.” ",
        "“Everyone in the sanatorium should be grateful to him.”",
        "…",
        "The people in the sanatorium were indeed very grateful to Qi Shiyan.",
        "They already knew that Qi Shiyan was only in his twenties. ",
        "A young man in his twenties was now trying his best to save them… From now on, they would definitely follow his lead!",
        "“Brother Yan has a grudge against the imperial family. We must help him overthrow the imperial family!” Lou Jingyue raised his arms and shouted on the sports field of the sanatorium.",
        "Some patients in the sanatorium also followed suit and shouted, “Overthrow the imperial family!”",
        "Qi Shiyan went out for a walk this morning and just happened to see this scene. His eyes lit up. ",
        "He liked the enthusiasm of these people!",
        "However, the people in his live broadcast room were a little helpless. “Okay, the sanatorium has been conquered. Next, Qi Shiyan can lead the people in the sanatorium to officially rebel!”",
        "“Seeing so many former heroes following Lou Jingyue and shouting slogans like they’re part of a pyramid scheme, I almost died of laughter.”",
        "“Qi Shiyan’s eyes when he looks at these people are so kind!” ",
        "“Indeed, the way he looks at people is similar to the way my grandfather looks at me.”",
        "…",
        "",
        "That morning, Qi Shiyan took a stroll on the sports field before going back to continue helping people eliminate poison.",
        "He felt relaxed and comfortable all over. ",
        "His current physical condition was much better than when he first transmigrated over.",
        "He had gained twenty catties in weight.",
        "It was at this time that a patient said to Qi Shiyan, “Young Master Yan, you look a lot like General Qi.”",
        "Qi Shiyan was slightly stunned. ",
        "At the same time, outside the convalescent planet, Jiang Jin welcomed five high-level star worms sent by the star worm Queen Mother.",
        "Jiang Jin: “…” He was not good at fighting at all. How was he going to fight these five high-level star worms?",
        "There was no need to fight…",
        "“Make way for those high-level star worms and let them go to the convalescent planet. We will be responsible for stopping the low-level and intermediate-level star worms!” Jiang Jin gave an order without hesitation. ",
        "Qi Shiyan was almost done eating his star worm meat, so it was no big deal for him to send some over, right?",
        "***",
        "T/N: *Ming Zheng carried Qi Shiyan on his back in Chapter 18 and Shiyan has also mentioned that in his previous life, the people around him would also carry him, so I’m not sure if the author forgot or she means this is the first time someone has carried him in a container or something.",
        "*哭笑不得 (ku xiao bu de) – not knowing whether to laugh or cry. An idiom that expresses a feeling of helplessness, not knowing how to react to a particular situation. "
    ],
    "previous": "Ch47 - Saving People",
    "next": "Ch49 - Preparing to Confess"
}