{
    "title": "Ch49 - Preparing to Confess",
    "content": [
        "Qi Shiyan was now treating people in the medical room.",
        "Every two hours, he would spend ten minutes helping a patient eliminate poison. During his breaks, he would lie in the medical cabin with Ming Zheng, watching various videos and learning about this world. ",
        "The original owner of this body had a very small social circle, so he didn’t understand many things.",
        "He had really learned a lot of knowledge in these past few days.\n",
        "",
        "At this moment, Qi Shiyan was sitting in the medical cabin, removing star worm poison from a patient in his seventies.",
        "This patient had very little poison in his body and only needed one course of treatment to eliminate it all. ",
        "While using his supernatural powers, Qi Shiyan looked at the patient in front of him with a smile, and then heard the patient say that he looked like General Qi.\n\n",
        "“Are you talking about General Qi Yuncheng?” Qi Shiyan asked.",
        "“Yes, it’s General Qi Yuncheng. Young Master Yan, you look a bit like him.”",
        "“Someone else has also said this before. Did you know General Qi?” Qi Shiyan was a little curious.\n\n ",
        "“I knew him. I used to be General Qi’s subordinate.”",
        "“Can you tell me about General Qi? I watched a documentary about him saving a planet yesterday and I’m very curious about him.” Qi Shiyan asked.",
        "Of course this wasn’t a problem. The patient told Qi Shiyan about Qi Yuncheng.\n\n",
        "Qi Yuncheng was a cheerful person with strong mental power and good fighting talent. Although he had no background, he was promoted to major general because he eliminated some star thieves who plundered spaceships in the empire. ",
        "During this process, he also met the person he loved and married her.",
        "After marriage, the two naturally gave birth to a child. Although the child’s health was not very good, they loved the child very much.",
        "Just as life was getting better, the star worms arrived.",
        "This person seemed a little sad when he mentioned Qi Yuncheng. ",
        "Qi Shiyan did not show any sadness, but he said with certainty, “He saved many people, and was a good man.”",
        "He had seen too many deaths and had long been accustomed to it, so he was not sad.",
        "But he admired Qi Yuncheng.",
        "“Yes, General Qi was a good man.” ",
        "Qi Shiyan said, “I am very happy that I look like him.”",
        "The patient said, “Young Master Yan, you are a good person just like General Qi!”",
        "",
        "Qi Shiyan asked people to call him Ah Yan, but did not say which character* it was. In addition, the original owner of this body always wore a face-changing mask before, so no one associated him with Qi Yuncheng’s son.",
        "But this time, when he met someone who thought he looked like Qi Yuncheng… Qi Shiyan suddenly remembered that he had not yet told Ah Zheng his real identity. ",
        "During this period, Ah Zheng treated him particularly well and was obedient to him in every way.",
        "The people in the sanatorium were also very friendly to him.",
        "They were already preparing to overthrow the imperial family. In this case, it shouldn’t be a big deal for him to reveal his identity, right?",
        "He had been too busy these days and forgot about this matter. ",
        "Thinking of this, Qi Shiyan turned around and looked at Ming Zheng, and then saw Ming Zheng staring at his right hand.",
        "Ah, he was having so much fun chatting that he forgot to let go of the patient’s hand even though the treatment was long over.",
        "Hi Shiyan silently withdrew his hand, held Zing Iheng’s hand, and said to the patient, “The poison in your body has been completely eliminated. Xo to the medical cabin and lie down. Tou will be able to recover to the best condition.”",
        "“Okay, thank you, Young Master Yan! Don’t worry, Young Master Yan, I will definitely help you overthrow the imperial family!” The man said. ",
        "“Thank you!” Qi Shiyan said with a smile.",
        "The man left. Qi Shiyan took a bite of star worm meat and asked Ming Zheng, “Ah Zheng, what do you think of Qi Shiyan?”",
        "Ming Zheng said, “I don’t know him well. I only know that he is Ming Qingyu’s fiancé.”",
        "When his condition was still good, Qi Shiyan was still a child. ",
        "Qi Shiyan had grown up in the past few years, but the time he was clear-headed was less than the time he was a fool.",
        "He only knew that Qi Shiyan liked Ming Qingyu very much, but his talent was a little poor.",
        "Thinking of this, Ming Zheng asked, “Ah Yan, do you have a grudge against him?”",
        "Qi Shiyan said, “I have no grudge against him, and I even think he is quite pitiful.” ",
        "Ming Zheng was a little surprised. “Why?”",
        "Qi Shiyan planned to tell everyone about the matter of Ming Qingyu cheating, and at the same time make it clear that he was Qi Shiyan.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He hadn’t said it at first because he was worried that after he said it, Ming Zheng and the people in the sanatorium would be prejudiced against him.",
        "Now he had cured many people and gained the recognition of the people in the sanatorium, they should not be prejudiced against him because of those things on the star network. He could now speak about it. ",
        "“Ming Qingyu treated Qi Shiyan very badly. Not only did he cheat on him, he also arranged for people to frame Qi Shiyan…”",
        "As Qi Shiyan was speaking, a shrill alarm suddenly rang out throughout the sanatorium.",
        "What was going on?",
        "Qi Shiyan was a little puzzled, but Ming Zheng’s reaction was unusually fast. He rushed out, releasing the Dawn at the same time, and got into the cockpit of the mecha. ",
        "He was very familiar with this alarm. There were star worms coming, and they were high-level star worms!",
        "Qi Shiyan had never experienced this kind of thing, so his reaction was slow. By the time he rushed out, there were already many mechas outside.",
        "Those mechas were so majestic!",
        "But what exactly happened? ",
        "While Qi Shiyan was confused, the audience in the live broadcast room were also confused.",
        "These days, Qi Shiyan was either helping people treat illnesses or reading various popular science books.",
        "There were fewer people watching his live broadcast.",
        "But the population of the Human Empire was huge, so there were still many people squatting in his live broadcast room. Some people also watched various educational videos with him and said that they had learned a lot. ",
        "Today, seeing someone mention Qi Yuncheng, and Qi Shiyan taking the initiative to talk to Ming Zheng about Qi Shiyan, they were very excited. “Is Qi Shiyan planning to confess to His Majesty?”",
        "“I look forward to His Majesty learning that Qi Shiyan is his future niece-in-law!”",
        "“I want Qi Shiyan to find out His Majesty’s identity.”",
        "… ",
        "As a result, just as they were looking forward to the big reveal, an alarm sounded.",
        "“What’s going on?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Are they in danger?”",
        "“His Majesty is so fast! Ah Yan, quickly catch up!” ",
        "…",
        "When Qi Shiyan came outside, they followed Qi Shiyan to see countless mechas, and they all posted comments in the barrage. “So many mechas! These mechas are even ready for battle. What’s going on?”",
        "“Did they encounter star worms?”",
        "“They must have encountered star worms! According to the alarm, they have even encountered high-level star worms.” ",
        "“Will the people in the sanatorium be in danger?”",
        "People were very worried, but fortunately professionals soon came out to comfort them. “They shouldn’t be in danger. Do you remember? Qi Shiyan killed a high-level star worm without a sound before.”",
        "“In the sanatorium, there is His Majesty in his prime, as well as General Shan and General Lei who have fully recovered. It is estimated that the high-level star worms will come and have no chance to return.”",
        "“I am concerned about one thing now. Can they eat the high-level star worms that are coming this time?” ",
        "“The meat of the previous high-level star worm has been eaten up. Qi Shiyan is in urgent need of food. I hope the high-level star worms that came this time are edible and delicious!”",
        "“Qi Shiyan, charge! Go kill the high-level star worms and eat them!”",
        "…",
        "People watching the live broadcast thought this, and people in the sanatorium thought so too. ",
        "Could the high-level star worms that came this time be eaten?",
        "They had heard that high-level star worms were rich in energy, good for the body, and tasted very good, so everyone in the sanatorium wanted to try them.",
        "“Try to kill those high-level star worms with one blow!” Ming Zheng’s voice spread throughout the sanatorium.",
        "The meat of the high-level star worms that were killed in the past was poisonous. If they could kill them with one blow and prevent the high-level star worms from releasing poison, would there be a chance to obtain high-level star worm meat that was not poisonous? ",
        "As soon as Ming Zheng finished speaking, Deputy Director Zhao’s voice rang out. “Non-combat personnel, please go to the auditorium as soon as possible!”",
        "There was a mechanism under the auditorium that allowed it to sink completely into the ground. It was also equipped with a high-level protective cover.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Those who were unable to fight didn’t have to worry about being poisoned by star worm poison as long as they entered the auditorium.",
        "Deputy Director Zhao spoke again. “There are a total of five high-level star worms that came this time. Everyone must be careful. Non-combatants, please go to the auditorium as soon as possible.” ",
        "They didn’t see any high-level star worms at this moment.",
        "But Deputy Director Zhao received a communication from Jiang Jin, who said that the high-level star worms would arrive soon.",
        "Without thinking, he sounded the alarm and started making various arrangements.",
        "“Young Master Yan, please go to the auditorium quickly.” The guards of the sanatorium found Qi Shiyan and wanted to send him to the auditorium. They even carried the medical cabin up. ",
        "“I won’t go. I have very strong mental power and should be considered a combatant.” Qi Shiyan said.",
        "A guard said, “Young Master Yan, the human body is too fragile. To fight against high-level star worms, you must use a mecha, but you don’t have a mecha.”",
        "Upon hearing this, Qi Shiyan stopped talking and followed the others to the auditorium.",
        "As soon as he entered, he saw Lou Jingyue. ",
        "When helping people eliminate star worm poison, he would first treat those who were severely poisoned.",
        "Lou Jingyue was young and in good health, so his condition was not serious and he was ranked last.",
        "Since he couldn’t use his mental power, he was considered a non-combatant and also came to the auditorium.",
        "“Brother Yan, if you had cured me earlier, I would be able to go out and fight. This time, I would definitely be able to avenge my previous defeat…” Lou Jingyue muttered. ",
        "Qi Shiyan ignored him. He stood at the entrance, listening attentively to Deputy Director Zhao’s words.",
        "Everyone from the sanatorium had already arrived at the auditorium. Deputy Director Zhao immediately ordered people to close the entrance and prepare to go underground.",
        "At this moment, Qi Shiyan rushed out of the entrance.",
        "His speed was too fast and his timing was too accurate, so the guards from the sanatorium around him had no time to stop him. ",
        "Everyone who saw this scene was stunned, and Lou Jingyue even exclaimed, “My mecha!”",
        "Just now, Qi Shiyan snatched away his space button!",
        "Please visit chrysanthemumgarden (dot) com",
        "In the auditorium, everyone was stunned.",
        "After all, the auditorium was used for escape and to save their lives, so the speed of the entrance closing, sinking, and opening of the protective cover were all very fast. ",
        "Generally speaking, no one could run out or come in at the last minute.",
        "It was a bit unbelievable that Qi Shiyan was actually able to rush out.",
        "But if one thought about it carefully, this was not surprising. After all, Qi Shiyan’s mental power was too strong.",
        "As soon as Qi Shiyan went out, the auditorium sank into the ground. ",
        "It was too late to go up and bring Qi Shiyan back.",
        "Deputy Director Zhao took a deep breath and quickly contacted the people on the ground, asking them to protect Qi Shiyan well. He then turned on the many cameras in the sanatorium and began to observe the situation on the ground.",
        "On the ground, Qi Shiyan had already gotten into Lou Jingyue’s mecha.",
        "During this period of time, he had been helping people in the sanatorium with treatment, and then he discovered that he had underestimated his own abilities at the beginning. ",
        "He originally thought that his mental power was at most SS-level, but in fact, his mental power was stronger than Ming Zheng’s, definitely SSS-level, or possibly even higher.",
        "Therefore, he was actually the strongest person in the sanatorium.",
        "Although he had not received special combat training, star worms were afraid of mental power.",
        "Qi Shiyan finally decided to join the battle. ",
        "He wanted to kill all the star worms that came and take them back to roast and eat!",
        "He hoped that the star worms this time would be bigger. He wanted to make a roasted whole worm and share it with everyone in the sanatorium.",
        "At that time, he could also clarify his identity.",
        "After seeing his fighting ability, people should forget his previous bad reputation. ",
        "***",
        "T/N: *He means he didn’t specify which “yan” character his name uses. Lots of Chinese words/characters have the same or very similar pronunciation so Chinese people usually introduce themselves as [name] with the character/word from [some famous poem or idiom or commonly used word]. Because neither Qi Shiyan or Ming Zheng specified which characters their names use, netizens were confused for a long time with Ming Zheng’s name and thought it was 阿正 when he said 阿诤 (I left footnotes on this in Chapters 16 and 39).",
        ""
    ],
    "previous": "Ch48 - Sending Meat",
    "next": "Ch50 - “Big Battle”"
}