{
    "title": "Ch5 - Questioning",
    "content": [
        "There was a huge noise when Qi Shiyan’s escape pod landed. All the animals in the vicinity were frightened and ran away.",
        "Because of this, Qi Shiyan had not seen any large creatures before, only some small insects. ",
        "He caught a beautiful ladybug with lovely patterns on its back and held it in his hand. He carefully protected it with his mental power and loved it beyond words.",
        "He even wanted to catch a few beautiful caterpillars and raise them on his body, but those beautiful caterpillars were more or less poisonous.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "After he came to this world, his supernatural powers were weakened a little and needed time to recover, so much so that his current body had not yet cleared away the poisonous air that he had inhaled not long ago.",
        "Qi Shiyan, who didn’t want to add any burden to his body, finally gave up the idea of ​​raising caterpillars. ",
        "In fact, compared to small insects, he still preferred smarter creatures that could interact with him.\n\n",
        "What he loved most, of course, were people.",
        "When he was a child, there were many people who protected him and he liked those people very much.",
        "But later, the environment of the planet where he lived deteriorated sharply, and those people passed away one after another.\n\n ",
        "Before he transmigrated, he had lived alone for several years.",
        "God knew how much he wanted to hug someone and communicate with someone!",
        "He also hoped that there would be someone who would always be with him and never leave him for a moment.\n\n",
        "He had had enough of living alone! ",
        "There should be no people on this planet, so he planned to raise a few pets to satisfy his own desires first. When his body recovered, he would find a way to leave this planet, then find a clingy partner, and then “raise” a group of people and live the life he had always dreamed of.",
        "At that time, he could find a job in an orphanage or a nursing home. These places were always full of people 24 hours a day and were very lively.",
        "A hospital was also fine. There were a lot of people there and he could help treat illnesses.",
        "The specific situation would depend on what his future partner did. ",
        "Just as he was thinking this, Qi Shiyan saw a tiger.",
        "The huge tiger had ferocious eyes and was staring at him intently.",
        "That beautiful fur, that explosive body, and those sharp teeth!",
        "This was the tiger of his dreams! ",
        "What was the point of ladybugs? Tigers were the best!",
        "His first pet had been found!",
        "",
        "At this moment, the only thing left in Qi Shiyan’s eyes was the tiger in front of him. Nothing else could enter his eyes.",
        "The people watching the live broadcast started shouting. “It’s a tiger!” ",
        "“This animal is obviously a carnivore. It will definitely attack Qi Shiyan.”",
        "“Hahahaha, wait and see Qi Shiyan get into trouble!”",
        "“Qi Shiyan is a well-known loser. Even though this is just an ordinary tiger, he definitely can’t beat it.”",
        "“I don’t know if he will be torn to pieces by the tiger!” ",
        "“Just wait and see Qi Shiyan being eaten!”",
        "…",
        "Some people were full of malice, but there were also others who became worried after seeing this situation, fearing that something might happen to Qi Shiyan. “This is too dangerous!”",
        "“Didn’t they say that there’s no danger on this convalescent planet?” ",
        "“This tiger is an ordinary animal and is not dangerous to most people, but Qi Shiyan is a little weak.”",
        "“Live broadcast platform, Qi Shiyan is in danger! Quickly go save him!”",
        "…",
        "Mor ordinary people, although they didn’t like Hi Shiyan, they didn’t want to see Hi Shiyan die. ",
        "As a result, countless people left messages on the live broadcast platform, asking the platform to go rescue the person.",
        "The live broadcast platform was a little scared when they saw this situation.",
        "They thought that after landing on the “undeveloped planet”, Qi Shiyan would hide in the escape pod and refuse to come out.",
        "The escape pod was very sturdy. Ordinary creatures on this planet couldn’t damage it at all. ",
        "Who would have thought that Qi Shiyan would actually run out!",
        "Not only did he run out, he actually encountered one of the most powerful predators on the planet.",
        "",
        "If the person standing in front of the tiger was a warrior with the same mental power level as Qi Shiyan but who had undergone special training, the warrior could still kill the tiger with just his bare hands.",
        "But everyone knew that Qi Shiyan was a waste who relied on potions to raise his mental power to C-level, refused to participate in training, and had almost zero combat power! ",
        "If something happened to Qi Shiyan during the live broadcast, they would definitely have to take responsibility.",
        "The platform felt a little regretful. They shouldn’t have cooperated with the crown prince.",
        "Just when everyone was worried, someone suddenly spoke up. “Why do I feel like Qi Shiyan’s eyes seem to be a little excited?”",
        "It wasn’t just excitement! ",
        "At this moment, the tiger and Qi Shiyan had already discovered each other and were looking at each other.",
        "There was vigilance in the tiger’s eyes, but Qi Shiyan’s eyes were full of fanaticism.",
        "“This is Qi Shiyan’s second personality, right? This personality is a bit silly. Doesn’t he know how dangerous tigers are?”",
        "“It’s definitely the second personality. I suspect he has none of the main personality’s memories, so everything he sees is new to him. He can even play with a bug for a long time.” ",
        "“Why is he looking at the tiger like that?”",
        "“My camera is locked on his face. Now that he has that look in his eyes, I’m getting goosebumps.”",
        "“Goosebumps? Not really, right? Why do I feel like the way Qi Shiyan is looking at the camera is like looking at something he loves deeply?”",
        "… ",
        "Just as everyone was wondering what was going on with Qi Shiyan’s eyes, the tiger suddenly turned around and ran away.",
        "Firstly, he sensed danger from Qi Shiyan, and secondly… this kind of two-legged guy was not easy to mess with.",
        "This kind of two-legged creature was not part of the tiger’s diet, so it planned to leave.",
        "Seeing the tiger leave, those who wanted to see Qi Shiyan encounter trouble were a little unhappy, but the ordinary audience members were relieved. ",
        "But just as they breathed a sigh of relief, they saw Qi Shiyan rushing toward the tiger like an arrow.",
        "“Big cat, wait for me!” Qi Shiyan chased the tiger excitedly.",
        "",
        "He hadn’t spoken before. In the late stages of the apocalypse, there was no one around him and he was used to not speaking.",
        "But now, he spoke. ",
        "Once he opened his mouth, he couldn’t keep it shut.",
        "God knew how long it had been since he spoke. He loved to talk!",
        "“Tiger, tiger, don’t run away. Come into my arms quickly!”",
        "“Big tiger, wearing flowery clothes, come into my arms today!” ",
        "“I have a big tiger, and I never ride it…”",
        "Singing various adapted nursery rhymes, Qi Shiyan ran forward quickly.",
        "He didn’t experience much fighting in his previous life, but he was too bored. So bored that he could only play with his mental power.",
        "Therefore, his use of mental power was unmatched. ",
        "Now, he used his mental power to assist himself, allowing him to run as if he was flying.",
        "The plants in front of him made way for him, the places where he stepped automatically became flat, and his footsteps became light.",
        "He ran in the forest as if on level ground.",
        "In fact, he could have directly controlled the tiger with his mental power, but Qi Shiyan wanted to run for a while, so he didn’t do that. Instead, he sang a song and chased the tiger. “Little one, little boy, chasing a tiger to school…” ",
        "People watching the live broadcast started to ask, “What the hell is this?”",
        "“Is Qi Shiyan really crazy?”",
        "“What is he singing? Strangely enough, it sounds very nice.”",
        "“Isn’t your focus a bit off? He’s chasing a tiger right now!” ",
        "“Isn’t he afraid that the tiger will turn around and bite him?”",
        "“His physical fitness is so poor that he ranked last in the school’s physical test. I didn’t expect him to actually be able to run so fast.”",
        "Please visit chrysanthemumgarden (dot) com",
        "…",
        "Qi Shiyan felt that his current health was really not good. ",
        "In order to become the person Ming Qingyu liked, the original owner starved himself all the time and almost starved himself to death!",
        "But no matter how bad this body was, it was still better than his previous life.",
        "At least the original owner didn’t starve to death. In his previous life, he had no food to eat and died of starvation.",
        "After running for a while, he felt that he couldn’t run anymore, so Qi Shiyan said, “Big cat, let’s not play games anymore. Be good, I’m coming to hug you!” ",
        "After saying this, Qi Shiyan exerted his mental power.",
        "Due to physical limitations, Qi Shiyan could now use less than one tenth of his mental power.",
        "But this little bit of mental power was enough to deal with an ordinary tiger that had no mental power.",
        "The tiger was knocked down by Qi Shiyan’s mental power and could not move. ",
        "It looked at Qi Shiyan angrily and bared its teeth at him, but it couldn’t hurt Qi Shiyan at all.",
        "“Big cat, here I come!” Qi Shiyan rushed toward the tiger and hugged it.",
        "The tiger was a ferocious beast. Its fur was not soft but actually very hard.",
        "But it was warm! ",
        "This was the first time Qi Shiyan had come into contact with a warm creature in several years.",
        "“Big cat, you are so cute. I really like you!” Qi Shiyan hugged the tiger’s head and rubbed it. He liked this tiger very much.",
        "As for the ladybug that he had carefully protected with his mental power, he had already let it fly away.",
        "How could a ladybug compare to a tiger? At this moment, the only thing in his mind and eyes was the tiger in front of him. ",
        "The tiger that was suppressed by Qi Shiyan’s mental power was trembling.",
        "Two-legged beasts were really too terrifying!",
        "",
        "The people in the live broadcast room watched Qi Shiyan hugging the tiger and rubbing it, wondering if they had seen it wrong. “This tiger was actually caught by Qi Shiyan?”",
        "“The key point is not this. The key point is that this tiger is actually obediently letting Qi Shiyan hold it and rub against it!” ",
        "“When Qi Shiyan chased the tiger at the beginning, the tiger reacted normally, but then it stopped moving. Judging from its condition, it must have been suppressed by mental power. Generally, those who can achieve this level have mental power of at least B-level.”",
        "“The tiger has been rubbed by Qi Shiyan for a long time, but it hasn’t moved at all. This means that Qi Shiyan has been suppressing it the whole time. Is Qi Shiyan’s mental power level really C-level?”",
        "…",
        "A C-level mental power user could also release their mental power to suppress a tiger, but they couldn’t suppress it for too long, and they certainly couldn’t suppress a tiger while rubbing against it as if nothing had happened. ",
        "Fifty percent of the people in the empire were C-level, and they were very familiar with the situation of C-level.",
        "“I’m C-level and I can’t suppress a tiger for long.”",
        "“I’m also C-level and a retired soldier. I can’t do what Qi Shiyan is doing.”",
        "“Didn’t they say that Qi Shiyan’s mental power level is not even C-level, but only D+, and they just said it was C-level in order to make it look good? Is this C-level?” ",
        "“Even if Qi Shiyan has a split personality, his mental power wouldn’t change levels just because of a change in personality!”",
        "“Qi Shiyan’s mental power is at least B-level. Why do people on the star network keep saying he’s a waste?”",
        "…",
        "There was a huge difference between C-level and B-level. C-level was just an ordinary person. If they joined the army, they could only be an ordinary soldier or a lower-level officer. B-level, however, could be trained with emphasis and become mecha warriors or middle-level officers. ",
        "Just when netizens were questioning, suddenly, a light circle lit up in the live broadcast room. This was because someone spent a lot of money to post a barrage in the live broadcast room that everyone could see and would not be blocked.",
        "This barrage was very long. “I have been observing Qi Shiyan. When he was chasing the tiger, the trees and weeds in front of him automatically parted, and the places where he stepped became very flat. This is obviously because he used his mental power to check the environment in advance while running! He must have at least B-level mental power to be able to do this! His control over his mental power has also reached the top level! Who is saying that Qi Shiyan is a waste? Are Qi Shiyan’s scandals on the star network true or false?!”",
        "This person’s barrage should also be voice-to-text. Those exclamation marks fully conveyed his excitement.",
        "The person who posted the barrage was indeed very excited. ",
        "This person was from the planet that Qi Yuncheng saved back then.",
        "When the planet he lived on encountered a crisis, he had just joined the Capital Star’s Imperial Research Institute due to his extraordinary talent and was responsible for military research.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He lived on the Capital Star and was not in any danger, but his parents, his brothers and sisters, and his relatives were all on that planet. The person he liked was also on that planet!",
        "His family didn’t have much money and couldn’t afford the evacuation spaceship tickets which had increased hundreds of times in price. He had just joined the Imperial Research Institute and didn’t have the ability to arrange for his family to evacuate in advance. ",
        "At that time, he was on the Capital Star watching the live broadcast of his hometown being besieged by star worms, and he almost fainted.",
        "It was General Qi Yuncheng who saved his entire family.",
        "He would be grateful to Qi Yuncheng for the rest of his life.",
        "For the past twenty years, he had been paying attention to Qi Shiyan and had watched Qi Shiyan go from a lovely child to a person who was hated by everyone on the star network. ",
        "Unlike those young people who just blamed Qi Shiyan, he had always been dissatisfied with the Qi family.",
        "Qi Shiyan did have problems, but it was all the Qi family’s fault that Qi Shiyan became like this!",
        "It must be because the Qi family didn’t educate Qi Shiyan well that Qi Shiyan grew up crooked!",
        "After the live broadcast started, he reported the live broadcast platform while posting barrages to support Qi Shiyan. ",
        "But there were too many people in the Human Empire, and his comments were mixed in with the many comments insulting Qi Shiyan, making them inconspicuous.",
        "The words he said to help Qi Shiyan seemed very powerless at the time.",
        "But now, Qi Shiyan showed a different side of himself in the live broadcast.",
        "He realized something, immediately spent money to recharge, and posted a questioning barrage. ",
        "Just as his barrage faded, a new barrage appeared. “I am a soldier, good at using mental power to fight. According to my analysis, Qi Shiyan’s mental power is at least B+. But according to his personal information, his mental power level has always been C-, and his grades in the Central Military Academy are also at the bottom. He must be hiding his strength. Why would he hide his strength? Is he in danger? The upper echelons of the Capital Star, the Qi family, the Central Military Academy, what have you done?!”",
        "The questions raised in these two barrages were earth-shattering.",
        "On the star network, people tended to follow the crowd.",
        "There were black materials about Qi Shiyan everywhere before, so people naturally thought that there was something wrong with Qi Shiyan. ",
        "But as soon as the live broadcast started, Qi Shiyan’s performance was completely different from what they had imagined, and now these two comments appeared.",
        "Some people watching the live broadcast began to have doubts.",
        "",
        "Was Qi Shiyan really the useless guy on the star network who caused trouble all day long?"
    ],
    "previous": "Ch4 - Qi Jianuo",
    "next": "Ch6 - Hunting"
}