{
    "title": "Ch50 - “Big Battle”",
    "content": [
        "Qi Shiyan moved too quickly, and the people in the sanatorium couldn’t react in time. The same was true for the people watching the live broadcast.",
        "“What just happened?” ",
        "“Wasn’t Qi Shiyan in the auditorium? How did he run outside?”",
        "“Who saw what happened just now?”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“It happened so fast! How could anyone see it clearly?”",
        "“I rewound the live broadcast and replayed it in slow motion, and saw the whole process. At that time, Qi Shiyan snatched Lou Jingyue’s space button, and then rushed out when the entrance of the auditorium was about to close. The auditorium doors paused for a moment when they closed. If there was no accident, it should be that Qi Shiyan used his mental power to delay the closing time. As soon as he left the auditorium, he immediately released the mecha and got in.” ",
        "“Lou Jingyue is so useless. He actually had his mecha stolen by someone.”\n\n",
        "“Qi Shiyan shouldn’t have the permissions required to use Jingyue’s mecha, right? How can Qi Shiyan use it just because he wants to?”",
        "…",
        "The audience was surprised, and Lou Jingyue was also surprised.\n\n ",
        "He stayed in the auditorium, watching the surveillance screens, and was shocked. “I am the only one who can operate my mecha. How did Brother Yan get in?”",
        "Marshal Ke Lun said, “Young Master Yan has very strong mental power. He can force your mecha to open.”",
        "Lou Jingyue felt a little aggrieved. “That’s too much! Having strong mental power is amazing!”\n\n",
        "Marshal Ke Lun said, “Strong mental power is indeed amazing.” ",
        "Lou Jingyue: “…”",
        "Although Marshal Ke Lun had recovered, his body was severely deficient due to the star worm poison and he was also old, so he did not participate in the battle and instead stayed in the auditorium.",
        "At this moment, he and Deputy Director Zhao were talking on the phone with Jiang Jin.",
        "“Five high-level star worms have entered the atmosphere of the convalescent planet. You guys should be prepared.” Jiang Jin said. ",
        "Marshal Ke Lun asked, “Jiang Jin, is the situation outside very urgent?”",
        "Jiang Jin had rarely contacted them since leaving the convalescent planet.",
        "They had tried to contact Jiang Jin, but Jiang Jin hadn’t responded to their messages.",
        "Deputy Director Zhao only told this matter to a few people, including Ming Zheng and Marshal Ke Lun. After they discussed it privately, they felt that something must have happened outside. ",
        "The reason why they did not forcefully stop Qi Shiyan from treating the patients in the sanatorium despite his health was because they felt that there might be a big battle next.",
        "Now, the big battle had finally come!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "During this period, they had not been able to contact Jiang Jin. Jiang Jin probably didn’t know the situation at the sanatorium*. Normally, he would try his best to prevent high-level star worms from entering the convalescent planet.",
        "After all, before Qi Shiyan appeared, there were a bunch of old, weak and sick people in the sanatorium. Let alone five high-level star worms, even if there was only one high-level star worm, it could probably wipe out the sanatorium. ",
        "But Jiang Jin allowed five high-level star worms to enter!",
        "They didn’t know what was going on outside. Had Jiang Jin and the others suffered heavy losses with many people dead?",
        "How many high-level star worms had come to the convalescent planet?",
        "In recent years, the Human Empire and the star worms had been fighting on equal footing. Could it be that the star worms had been hiding their strength? ",
        "Or maybe, the star worm Queen Mother suddenly became more powerful and gave birth to dozens of high-level star worms in one go?",
        "Marshal Ke Lun was very worried.",
        "Jiang Jin said, “Everything is fine outside. Don’t worry. I’m training soldiers right now. I’m hanging up now.”",
        "After saying that, Jiang Jin hung up the phone. ",
        "The people in the sanatorium thought he didn’t know the situation in the sanatorium, but in fact, he knew it very well.",
        "Le had been watching the live broadcast and even synchronihed his sleep schedule to be the same as Hi Shiyan’s.",
        "When the live broadcast first started, he was still very worried, fearing that Lis Zapesty and Hi Shiyan would die on the convalescent planet.",
        "But when Qi Shiyan cured His Majesty, his worries disappeared without a trace. ",
        "Now that His Majesty, this great killing weapon had recovered, what was there to fear from the star worms?",
        "After Qi Shiyan healed Shan Xi, Lei Yin, and many other strong warriors…",
        "What was there for him to worry about? Those five high-level star worms were just there to deliver food!",
        "In fact, at this moment, Jiang Jin welcomed not only high-level star worms, but also A-level and S-level mecha warriors who came from other places to reinforce and protect the convalescent planet. ",
        "But he felt that the convalescent planet did not need protection.",
        "Therefore, he didn’t let them go to the convalescent planet but asked them to help train those new recruits outside the convalescent planet.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Training soldiers was very important. He needed to train soldiers!",
        "Jiang Jin stood up and looked outside. ",
        "There were many types of star worms, one of which were called nest worms. They could carry a large number of low-level and intermediate-level star worms and travel through the universe.",
        "The five high-level star worms brought a lot of nest worms over. Now, these nest worms were constantly spraying out star worms.",
        "Some of the star worms they sprayed out stuck to their battleships, spat out gastric juices that could dissolve metal, and gnawed at the battleship hulls. Some weren’t afraid of death and used themselves as ammunition, directly rushing toward the battleships or mechas and self-destructing, creating a bunch of star worm fireworks.",
        "It was the first time for the new recruits under Jiang Jin to experience such a battle. ",
        "They were in a panic at first, but with the help of high-level mecha warriors who came from various places, they quickly stabilized the situation and went out in mechas to slay the star worms.",
        "Of course, not all of them were mecha warriors. There were also many people who stayed on the spaceship to do logistical work or operate the spaceship to attack the nest worms.",
        "These people were quite relaxed and had time to chat. “A lot of star worms came.”",
        "“Why are those star worms self-destructing one after another? I want to do some research to see if their corpses can be eaten.” ",
        "“I want to watch the live broadcast. Five high-level star worms have gone to the convalescent planet. His Majesty will definitely participate in the battle. I want to see His Majesty’s heroic battle against the star worms.”",
        "“Let’s kill these star worms quickly so we can go watch the live broadcast!”",
        "“Kill all the star worms and go watch the live broadcast!”",
        "“Yes, kill all the star worms and go watch the live broadcast!” ",
        "…",
        "On the spaceship, people were shouting such slogans everywhere, making the new recruits more motivated to kill the star worms.",
        "Seeing that his subordinates were so motivated, Jiang Jin called over an officer who was good at commanding battle operations and asked the other party to be responsible for commanding the battle.",
        "As for him… he was just a small director of a sanatorium and was not good at fighting. He should just go back and watch the live broadcast. ",
        "After handing over the command authority, Jiang Jin was planning to go back and watch the live broadcast comfortably, when he suddenly saw something flash by on the command screen.",
        "He quickly activated the detection equipment, and then relied on the high-tech products brought by the reinforcements to figure out the situation.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "A small stealth battleship followed the five high-level star worms and went to the convalescent planet.",
        "He recognized that battleship. It had been customized from a military factory using his connections. ",
        "That was Old Second’s battleship, not the enemy’s battleship… Jiang Jin relaxed and ignored the matter.",
        "Among the four of them, although Old Second didn’t get along with Ming Zheng, he only caused Ming Zheng some minor troubles and wouldn’t go too far.",
        "Moreover, Ming Zheng had been trying to overthrow the imperial family recently. Old Second might have come to seek cooperation.",
        "Among the laboratory’s experimental subjects, other than Ming Zheng, only three survived. ",
        "He and Old Four both followed Ming Zheng. Some time ago, Old Four even acted as Ming Zheng’s stand-in to attract the attention of the outside world.",
        "But Old Second hated the imperial family so much that he was unwilling to follow Ming Zheng, so he went out on his own and made a name for himself in the Chaotic Zone, becoming the boss of the Chaotic Zone.",
        "He was committed to opposing the imperial family. At this moment, he was definitely planning to stir up trouble.",
        "On the convalescent planet, Marshal Ke Lun looked at Jiang Jin’s hung up communication, and was somewhat puzzled. ",
        "Jiang Jin said that everything was fine outside. If that was the case, then why did he let five high-level star worms in?",
        "Jiang Jin betrayed His Majesty?",
        "Jiang Jin’s background was questionable to begin with. He didn’t know why His Majesty trusted him so much…",
        "Marshal Ke Lun was very anxious, and so was Ming Zheng on the ground. “Ah Yan, why aren’t you staying in the auditorium?” ",
        "Qi Shiyan said, “I want to participate in the battle too!”",
        "Ming Zheng said, “It’s very dangerous to fight against high-level star worms. You haven’t learned how to fight with a mecha yet…”",
        "“I have mental power.”",
        "“Ah Yan, you don’t know much about star worms, and don’t even know their weaknesses…” ",
        "“I have mental power!”",
        "Ming Zheng: “…”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Shiyan said, “Don’t worry, Ah Zheng, my goal is to live to be 300 years old. I will take good care of myself.”",
        "Qi Shiyan had already come out, so Ming Zheng had no choice but to instruct the people around him. “Today, our main task is to protect Ah Yan. As for the high-level star worms that are coming, it’s best if we can kill them, but it doesn’t matter if we can’t kill them.” ",
        "“Yes!” The mecha warriors around Ming Zheng spoke one after another.",
        "The people watching the live broadcast were almost dizzy with excitement when they saw the row of S-level mechas.",
        "“This is the most powerful group in the empire!”",
        "“One SSS-level warrior, five SS-level warriors, and a whole group of S-level warriors… With this configuration, they can directly challenge the star worm Queen Mother to a duel!” ",
        "“Are five high-level star worms enough for them to kill?”",
        "“Qi Shiyan’s mecha operation is really bad. I think he went to the battlefield just to make trouble. But with this group of people protecting him, he can go to an even more dangerous place, right?”",
        "“Does Qi Shiyan not want them to win too easily, so he‘s making it more difficult for them?”",
        "… ",
        "Everyone was excitedly waiting for the coming battle.",
        "Qi Shiyan was the same.",
        "At this time, five huge monsters came into their field of view.",
        "Qi Shiyan was a little surprised. “So big? How much meat is there?” ",
        "The high-level star worm he killed before was obviously very small, so why were these high-level star worms so big?",
        "People who heard Qi Shiyan’s voice: “…” Young Master Yan’s focus was really different from others!",
        "Whenever Ming Zheng participated in a battle, he always led the charge.",
        "But today he did not rush into battle, and instead let the people around him go first. ",
        "Qi Shiyan was here, and he wanted to protect Qi Shiyan.",
        "Ming Zheng didn’t take action, but Qi Shiyan rushed out.",
        "Please visit chrysanthemumgarden (dot) com",
        "In just a short while, Qi Shiyan had already figured out the situation of these high-level star worms.",
        "Their bodies were very strong, far superior to humans, as could be seen from the fact that they could live in space and pass through the atmosphere unscathed. ",
        "In addition, they carried poison, and the poison carried in different parts of their body was different. The most frightening of them was undoubtedly the star worm poison.",
        "But their mental power was weak, and using strong mental power could suppress them and make them move slowly.",
        "One could even strangle them directly with mental power.",
        "The high-level star worm he encountered before was probably in its weak period, so it was so easy to kill. The high-level star worms in front of him were much stronger than the one he had killed before. It wouldn’t be so easy to kill them. ",
        "But when he killed that high-level star worm before, he was also weaker than he was now!",
        "These days, he had been spending every day in the most high-end medical cabin in the sanatorium. His body had recovered and his mental power had also become stronger.",
        "Now he could still use his mental power to strangle star worms!",
        "He was also not afraid of poison… He was simply the star worms’ nemesis! ",
        "Go fight. He must fight!",
        "Qi Shiyan had watched some mecha operation videos during this period of time. Although he was busy lying in the medical cabin and didn’t have time to practice with the Dawn, he already knew how to operate a mecha.",
        "In particular, Lou Jingyue’s mecha was for S-level warriors, and he possessed SSS-level mental power.",
        "This was equivalent to him, an adult, getting a children’s bicycle. ",
        "Even if he didn’t know how to ride the bicycle, he could “ride” the bicycle faster than the real kid next to him just by pushing forward with his two feet on the ground.",
        "The mecha was controlled using mental power. Qi Shiyan controlled Lou Jingyue’s mecha and rushed toward the fattest, no, the largest star worm.",
        "Then, all his mental power rushed toward the other party.",
        "This high-level star worm was killed before it could react and fell to the ground. ",
        "“Ah Yan…” Ming Zheng spoke.",
        "Qi Shiyan said, “I have already killed a star worm. Darling, you have to work harder!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng: “…” Were high-level star worms so easy to kill?",
        "Qi Shiyan had already killed a high-level star worm. He couldn’t fall behind! ",
        "Ming Zheng glanced at Qi Shiyan, and used his mental power to attack another high-level star worm, while also using his mecha’s attached weapons.",
        "That star worm was dead in just one move.",
        "Weren’t these star worms a little too easy to kill?",
        "The audience watching the live broadcast and the people in the sanatorium: “…” What happened to the promised big battle? Those five star worms had yet to do anything, and two of them were already dead? ",
        "This kind of battle was not fun to watch at all. Bad review!",
        "***",
        "T/N: Hi everyone, I’ve picked up a new novel called From Shadow Guard To Empress (FSGTE). Please check it out if you’re interested!",
        "*Remember that the sanatorium isn’t connected to the star network, so the people there still have no idea that Jiang Jin and others have actually been watching them via the live broadcast this whole time. That’s why they think the situation is very serious outside. "
    ],
    "previous": "Ch49 - Preparing to Confess",
    "next": "Ch51 - Roasted Whole Worm"
}