{
    "title": "Ch51 - Roasted Whole Worm",
    "content": [
        "Ming Zheng didn’t expect the high-level star worms to actually be so easy to kill.",
        "This made him a little unsettled. He felt that his own strength was a little too strong. ",
        "But soon, he figured out the reason.",
        "Twenty years ago, not long after he went to the battlefield, he was poisoned by star worm poison.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "For many years afterward, he used his mental power to suppress the poison in his body at all times, so in battle, he was unable to exert his full combat power.",
        "Over the years, his mental power had increased a lot, but the star worm poison in his body had also increased, so his combat power had not increased at all. ",
        "A few days ago, Qi Shiyan helped him eliminate all the poison from his body. He also stayed in the medical cabin with Qi Shiyan and  ate star worm meat…\n\n",
        "His physical and mental strength had completely recovered to their peak state.",
        "He was like a runner who started weight training at the age of eighteen and who had been carrying an ever increasing amount of weight for twenty years. One day, the weight was removed from his body and he naturally became as light as a swallow.",
        "Ming Zheng immediately rushed toward another star worm…\n\n ",
        "The remaining two star worms were snatched away by Shan Xi and Lei Yin. The two of them used all their mental power and their strongest skills.",
        "The remaining three star worms were killed together.",
        "The battle ended inexplicably, and the mecha warriors in the sanatorium, except for the four of them, didn’t even have a chance to fight.\n\n",
        "Those high-level star worms that were killed didn’t even have a chance to fight back. ",
        "In the auditorium, Marshal Ke Lun was silent. “Are high-level star worms so easy to kill now?”",
        "Deputy Director Zhao said, “I don’t know. Have I stayed in the sanatorium for too long and can’t keep up with the times?”",
        "The audience watching the live broadcast were also shocked. “Is it over already?”",
        "“In my eyes, high-level star worms have always been demonic. Why are high-level star worms so easy to kill in this live broadcast?” ",
        "“What I watched was really a live broadcast, not some random video on the star network showing the protagonist being invincible?”",
        "“I only knew that His Majesty was very strong, but I didn’t expect His Majesty to be this strong…”",
        "“Isn’t Qi Shiyan also too strong?”",
        "… ",
        "At this time, a military general who had been explaining parts of Qi Shiyan’s live broadcast gave an explanation.",
        "“High-level star worms are indeed very strong. They can travel throughout the universe, are not afraid of most thermal weapons, and can even eat battleships. But their weaknesses are also obvious. They cannot withstand mental attacks. People with S-level mental power can hurt them after getting close to them. If they are not afraid of death, they can also give up their lives and kill one. General Qi Yuncheng did this back then.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“People with SS-level mental power are even stronger. In a one-on-one situation, they can easily kill high-level star worms. As for SSS-level warriors, they can fight several high-level star worms at a time and win. His Majesty couldn’t kill high-level star worms easily before because he was poisoned a long time ago and couldn’t exert his full strength. Now that he has been detoxified, he can use all his mental power, so killing high-level star worms is naturally easy.”",
        "After this person’s explanation, the director of the military research institute specializing in the study of mental power and star worm poison also posted a paper and gave a brief explanation. ",
        "“Through our research, we have discovered that mental power can grow after training, but the growth is relatively slow. In the past, the empire was very peaceful, and mental power did not play a big role, so no one could persist in training their mental power. In the past thousand years, the overall mental power level of the people in the empire has been declining.”",
        "“In the past twenty years, due to the threat of star worms, the role of mental power has increased a lot, and more people have been training their mental power. People’s mental power levels have begun to increase, and many S-level powerhouses have emerged.”",
        "“But when it comes to training their mental power, no one can compare to those who have been poisoned by star worm poison. In order to survive, they must constantly use their mental power to suppress the poison. In other words, they are constantly training their mental power. When they are still poisoned, other people cannot feel how powerful they are, but once the star worm poison in their bodies is eliminated, their strength will not only not decrease, but will increase.”",
        "“Whether it’s His Majesty or General Shan or General Lei, their current strength is far greater than before!” ",
        "There was actually such a thing!",
        "The audience were boiling with excitement!",
        "“I went to read the paper. My god, it turns out that General Shan and General Lei’s mental power level has reached SS-level a long time ago, but they were poisoned before and couldn’t exert their full strength.”",
        "“So this group of people is even stronger than I thought!” ",
        "“Jan humans win the war against star worms?”",
        "…",
        "At this time, Zarshal Guan of the Second Oegion also spoke out on the star network. “In fact, the star worms have always targeted and attacked those warriors of the empire with the most potential. Mor ezample, Oou Aingyue was ambushed by star worms not long after he went to the battlefield. Therefore, even though many powerful warriors have emerged in the empire in recent years, the war against the star worms can only end in a draw.”",
        "“We have previously conducted war simulations. According to our speculation, once His Majesty has an accident, humans may be at a disadvantage in the war against the star worms. After all, in previous battles, humans have lost too many outstanding talents due to the star worm poison, and countless more outstanding talents will also perish in the future.” ",
        "“Only those with A-level mental power can survive after being poisoned by the star worm poison. There are a total of 4,352 patients in the military sanatorium, not including His Majesty. More than 700 of them had reached S-level mental power before being poisoned. The rest had at least A-level mental power before being poisoned. Once these people recover, the military’s combat effectiveness will be greatly enhanced, and the war between humans and star worms will undergo earth-shaking changes!”",
        "“Qi Shiyan is a hero of mankind! The Second Legion will always protect him!”",
        "After Marshal Duan spoke out, people in the military began to speak out one after another.",
        "Qi Shiyan and the others killed high-level star worms easily, but the military knew better than anyone how difficult high-level star worms were to kill. ",
        "Qi Shiyan was a miracle!",
        "Ming Qingyu and the Qi family were simply unforgivable. They almost killed Qi Shiyan and brought ruin to the empire!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "It had to be known that many people in the military were already prepared to fail in their quest to stop the star worms and to perish with the empire.",
        "As for now? Their future was bright! ",
        "Those military personnel who had free time basically all opened the live broadcast, and then they saw that in the live broadcast, Qi Shiyan had already controlled Lou Jingyue’s mecha and started cutting up the high-level star worm that he had killed at the beginning.",
        "His movements were very skilled. He completely didn’t look like someone who had never systematically learned how to operate a mecha.",
        "The audience was very surprised. “Didn’t Qi Shiyan fall down when he was operating a mecha a few days ago? How come he has even learned how to dissect a star worm now?”",
        "“The knife that comes with the mecha can indeed injure star worms, but this is the first time someone has used it to skin a star worm.” ",
        "“He peeled it so cleanly. There’s no flesh at all on the skin. Compared to him, the work Lou Jingyue did before was too rough.”",
        "“Young Master Lou is really not cut out for work!”",
        "“I just want to know, when did Qi Shiyan’s mecha operating skills improve?”",
        "“Probably the day before yesterday? That day he watched some videos teaching people how to control mechas.” ",
        "“He can learn just by watching a video? Isn’t this learning ability too amazing?”",
        "“It’s obviously a very bloody scene, but it’s fun to watch.”",
        "…",
        "Qi Shiyan didn’t know that there were people admiring his learning ability. He skinned the star worm very seriously and found it very interesting. ",
        "When he had nothing to do in his previous life, he liked to use his mental power to do things to kill time.",
        "Right now, operating a mecha to skin a star worm, was much more interesting than the things he did in his previous life.",
        "“Ah Yan, do you need me to help?” Ming Zheng asked.",
        "Qi Shiyan said, “Yes, Ah Zheng, peel off the skins of the other star worms as well!” ",
        "Ming Zheng agreed, and then the people watching the live broadcast saw the Dawn also start peeling the skin off a star worm.",
        "Ever since they started watching this live broadcast, their filter for military heroes had been shattered.",
        "",
        "They didn’t expect that now, even the filter for mechas could be broken.",
        "The most powerful mecha in the empire, the white moonlight* in the hearts of countless people, was now doing the job of skinning and cutting meat, and it was even doing quite a good job at that. ",
        "In the auditorium, Deputy Director Zhao and others were also helpless.",
        "Deputy Director Zhao asked Marshal Ke Lun, “What should we do next?”",
        "Marshal Ke Lun did not answer, but directly connected to Lou Jingyue’s mecha. “Young Master Yan, is the concentration of star worm poison outside right now strong?”",
        "Qi Shiyan said, “I don’t know. Wait a moment.” ",
        "After he finished speaking, he directly opened the cockpit door.",
        "“Young Master Yan!” Marshal Ke Lun was a little worried. “There’s poison outside!”",
        "“There is poison, but this little bit of poison has no effect on me,” Qi Shiyan said without caring, “Don’t come out yet. Wait for two hours before coming out. By then, the star worm poison outside should have dissipated.”",
        "It was meaningless to talk about toxicity without considering the dosage. ",
        "For example, apple seeds were poisonous, but one would have to eat 150 of them to risk poisoning, and would have to eat three catties of apple seeds at once to risk death.",
        "Star worm poison was highly toxic, but if it was only in trace amounts, the damage to the human body was minimal.",
        "The concentration of poison in the air was not high at the moment, and would actually have little impact on the people in the sanatorium. However, for safety reasons, Qi Shiyan told them to come out two hours later.",
        "Having already come out of the mecha, Qi Shiyan simply didn’t go back. He jumped to the ground and went to check the condition of the meat of those star worms. ",
        "He hoped this meat didn’t contain poison! He was still waiting to eat it!",
        "After checking around, Qi Shiyan noticed that these high-level star worms were not as good as the one he had encountered before, and they were more or less poisonous.",
        "But the poison contained in their meat was not much. Such a big star worm, with dozens of tons of meat, contained poison that was about the same amount as that contained in Lou Jingyue’s body.",
        "He could easily eliminate this little bit of poison. ",
        "However, the poison sacs inside the star worms’ bodies were filled with high concentrations of star worm poison, so these five poison sacs must be handled with care.",
        "The poison sacs of star worms grew together with their internal organs. The high-level star worm he had encountered before was not poisonous, which should be related to the fact that it had no internal organs. He didn’t know where its internal organs went.",
        "",
        "Qi Shiyan eliminated the poison from one of the high-level star worms and said to Ming Zheng, “Ah Zheng, let’s eat roasted whole worm tonight! The meat of this star worm is enough for everyone in the sanatorium to have a meal together.”",
        "“Okay.” Ming Zheng agreed, then came out of his mecha and looked at the high-level star worm. ",
        "He had never imagined that high-level star worms could become food ingredients.",
        "His Ah Yan was truly an amazing person.",
        "It was just… he had lied to Ah Yan. How should he tell Ah Yan that he was actually the emperor?",
        "Qi Shiyan noticed that Ming Zheng was in a bad mood. ",
        "Did he think of his dead comrades when he saw the star worms?",
        "Qi Shiyan walked over and kissed Ming Zheng on the face. “Ah Zheng, you looked so handsome when you killed the star worms just now!”",
        "“Ah Zheng, I have never seen these star worms before. Can you tell me about them?”",
        "“Ah Zheng, I stole Lou Jingyue’s mecha. I can use it even though he didn’t give me permission. Is that awesome or what?” ",
        "…",
        "Ming Zheng’s attention was diverted by Qi Shiyan and he looked around.",
        "There were people around, but Qi Shiyan actually kissed him…",
        "Qi Shiyan noticed Ming Zheng’s reaction and said with a smile, “Ah Zhang, we are partners. You have to get used to me kissing you.” ",
        "He really liked to kiss Ming Zheng.",
        "However, after arriving at the sanatorium, Ming Zheng was obviously not able to adapt well, so he gave Ming Zheng some time to adapt.",
        "When there were people around before, he always refrained from kissing Ming Zheng",
        "Well, that was also because he saw a lot of new things and new people, and his attention was diverted. ",
        "Ming Zheng looked at Qi Shiyan and hummed, “Hmmm.”",
        "These days, seeing Qi Shiyan being so nice to the patients in the sanatorium and not kissing him all day like before, he actually felt a little sour.",
        "",
        "Therefore, Qi Shiyan should kiss him if he wanted to!",
        "“Ah Zheng, you are so good.” Qi Shiyan also kissed Ming Zheng on the other side of his face. ",
        "His Ah Zheng had soaked in the medical cabin for a few days, and his skin had become much smoother. It was so comfortable to kiss!",
        "And Ah Zheng’s hand felt better and better to touch. Qi Shiyan was reluctant to let go.",
        "Of course, his skin and hands were even smoother than Ming Zheng’s… The medical cabin was really a good thing.",
        "“You are the best.” Ming Zheng said seriously. ",
        "“That’s right, I’m the best!” Qi Shiyan said with a smile.",
        "He was a very confident person. After all, he was once the most handsome and powerful man on his planet.",
        "After Qi Shiyan kissed Ming Zheng, he took Ming Zheng’s hand and went to the kitchen of the sanatorium to find cooking robots and let those robots roast the star worm meat.",
        "He didn’t really know how to control the robots, but fortunately Ming Zheng knew how to use them. ",
        "The two of them were busy, but the mecha warriors who had detected that the concentration of star worm poison outside was not high and who had come out of their mechas were very bored.",
        "“It’s my first time participating in a battle like this. Before I even managed to make a move, the star worms were killed.”",
        "“Young Master Yan and Young Master Zheng are too powerful!”",
        "“Why didn’t these five high-level star worms bring some subordinates with them? If a nest worm came, we wouldn’t be so bored.” ",
        "In the past, when they were fighting against high-level star worms, they also had to guard against the low-level and intermediate-level star worms around them that could self-destruct at any time and also eat their mechas.",
        "The fighting was always exhilarating.",
        "It wasn’t like today where they had just gotten on their mechas and hadn’t managed to take action yet, and the battle was already over.",
        "Shan Xi glanced at these people who didn’t know their own blessings, quietly cut off a piece of star worm meat, placed it on the weapon carried by his mecha, adjusted the weapon power and started grilling the meat. ",
        "He had eaten star worm meat before and it was extremely delicious. He wondered what this one tasted like.",
        "However, Shan Xi had just finished grilling and had not yet eaten the meat when it was snatched away by someone.",
        "",
        "The one who snatched the meat was Ming Zheng. He turned around and gave the meat in his hand to Qi Shiyan. “Ah Yan, eat meat.”",
        "Qi Shiyan took a bite without being polite, his face full of amazement. “This star worm is also very delicious!” ",
        "The meat of the previous star worm was relatively tender, while this one was very chewy and full of fat. It was so delicious!",
        "“I’ll go grill more for you.” Ming Zheng said.",
        "He followed Shan Xi’s example and used the Dawn to grill meat.",
        "At this time, a voice suddenly rang out. “Ming Zheng, didn’t you always treat the Dawn as your wife and cherished it like a treasure? Why, now that you have a new lover, you have forgotten the old one? Poor Dawn, it actually met a heartless man like you.” ",
        "***",
        "T/N: *白月光 (bai yue guang) – white moonlight. Chinese term that usually refers to a first love – basically something or someone that is elusive and unattainable in your heart. Something or someone you desire, but cannot obtain."
    ],
    "previous": "Ch50 - “Big Battle”",
    "next": "Ch52.1 - Falling Off The Horse"
}