{
    "title": "Ch52.2 - Falling Off The Horse",
    "content": [
        "On the Capital Star, Ming Qingyu’s pupils constricted as he watched the live broadcast in the detention room.",
        "People on the star network were also shocked. ",
        "“This Jiang Ren should know about the live broadcast. Did he deliberately produce this evidence?”",
        "“He said that His Majesty asked him to investigate… Is that true or false?”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Is it really true that His Majesty wants to overthrow the imperial family, and not just a lie to deceive Qi Shiyan?”",
        "“I think what His Majesty said is probably true… In fact, His Majesty’s relationship with the imperial family has always been bad.” ",
        "“Before His Majesty ascended the throne, no one knew of His Majesty’s existence!”\n\n",
        "“Getting rid of the imperial family won’t have much impact on His Majesty…”",
        "…",
        "“This Ming Qingyu is really not a human being, right?” Jiang Ren looked at Qi Shiyan and asked.\n\n ",
        "Qi Shiyan said with certainty, “Yes!”",
        "Jiang Ren laughed. He glanced at Ming Zheng and said, “In fact, in the imperial family, Ming Qingyu is still considered good. The most outrageous person is the retired emperor.”",
        "After Jiang Ren finished speaking, he began to use the projector to show the evidence of the retired emperor’s crimes.\n\n",
        "He prepared all the evidence very completely and even organized it all. ",
        "On a certain day of a certain month of a certain year, the retired emperor did something and violated certain laws… It was a complete list.",
        "Jiang Ren still felt it was not enough, so he specifically picked out some of the things to explain.",
        "Qi Shiyan became angry when he heard it.",
        "This retired emperor was really a piece of shit! ",
        "The retired emperor once sent people to a resource planet to mine ore, but he did not tell the workers that there was radiation on that resource planet.",
        "The health of all those who went to that resource planet began to deteriorate, and the situation became increasingly worse. They wanted to ask for compensation from the company that hired them, but the company simply cancelled its registration.",
        "Tens of thousands of workers who went to work on that planet lived in pain for the rest of their lives. Some of them with more serious conditions even died at a young age.",
        "From beginning to end, they did not receive a cent of compensation, and the empire’s medical insurance did not cover their medical expenses. ",
        "Such things were innumerable.",
        "The retired emperor even ordered the abandonment of a resource planet where tens of thousands of people were living. Resource planets were not suitable for living. If no one provided food and energy to those people, they could only starve to death.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He built laboratories on private planets to conduct human experiments and captured people as experimental subjects. He cooperated with star thieves to eliminate those who offended him. He retrieved citizens’ private information at will. When there was a problem with his organs, he found people with the same genetic match as him and removed their organs… The retired emperor did all kinds of things.",
        "It could be seen that the retired emperor really did not take ordinary people’s lives seriously. ",
        "Compared with the retired emperor, Ming Qingyu was indeed quite good.",
        "Some of these things Ming Zheng already knew, but some he did not.",
        "However, most of these things happened twenty years ago. In the past twenty years, he had been keeping an eye on people of the imperial family, so those people of the imperial family didn’t dare to go too far.",
        "It was pust that many people in the imperial family had private planets, and he didn’t know a lot of things that happened on those private planets. ",
        "“The retired emperor deserves to die, right?” Aiang Een asked Hi Shiyan again.",
        "Hi Shiyan said without hesitation, “Le deserves to die.”",
        "So many lovely people were killed by the retired emperor!",
        "He felt even more sympathetic toward those who were abandoned on the resource planet. ",
        "Those tens of thousands of people had been living in the human base on the resource planet. They mined minerals for the retired emperor and relied on supplies delivered by spaceships every month to survive.",
        "Then, because the resources of that planet had been almost mined clean, and star worms appeared on the route to that planet, the retired emperor felt that it was not cost-effective to send them things or take them away, so he said that the resource planet was attacked by star worms and all the people on it were killed, thus abandoning those people.",
        "Qi Shiyan once lived on a planet with nothing for a long time.",
        "He knew how desperate people would feel when they were trapped there without any food! ",
        "“It’s so deserving of death! He is simply a devil! Jiang Ren, join our alliance to overthrow the imperial family, and overthrow the imperial family with us!” Lou Jingyue rushed out.",
        "The concentration of star worm poison had become very low, and the auditorium rose again from underground. The people who had been hiding in the auditorium also came out.",
        "When Lou Jingyue was in the auditorium, he could see what was happening outside through the surveillance.",
        "At first, he didn’t like Jiang Ren, but after Jiang Ren produced so much evidence of the imperial family’s crimes, he regarded Jiang Ren as a like-minded confidant. ",
        "Jiang Ren looked at Lou Jingyue and said with a smile, “Okay, let’s overthrow the imperial family together.”",
        "After talking about the retired emperor, it was Prince Renhe’s turn and other members of the imperial family.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Prince Renhe also did many excessive things.",
        "During the years when Ming Zheng was in power, he did not restrain himself and continued to do many evil things, such as bribing high-ranking military officials, causing trouble for Ming Zheng and making profit from war. ",
        "But Ming Zheng was not someone who was easy to talk to. All those high-ranking military officials were killed by Ming Zheng.",
        "“Some people on the star network said that His Majesty killed meritorious generals indiscriminately. This is false. His Majesty killed those people because they colluded with Prince Renhe and sold out the interests of the military.” Jiang Ren said.",
        "Everyone in the sanatorium gathered around Jiang Ren and listened to what he said.",
        "They were already stunned by what Jiang Ren said. ",
        "The same went for people watching the live broadcast.",
        "The little evidence of the imperial family’s crimes revealed by Qi Shiyan before couldn’t be compared with what Jiang Ren said.",
        "“Who is this Jiang Ren?”",
        "“My God, the evidence he produced made my scalp tingle.” ",
        "“The retired emperor is too scary!”",
        "“In my impression, the retired emperor was a kind-hearted old man. I didn’t expect him to be a devil.”",
        "…",
        "For those watching the live broadcast, they now truly felt that the imperial family should not exist and that it needed to be thoroughly investigated. ",
        "Those imperial family members who had committed crimes were now going crazy. “Who is this Jiang Ren?”",
        "“That guy Ming Zheng has been trying to harm us for a long time. He is not a good guy!”",
        "“This damn live broadcast! Can it really not be stopped?”",
        "… ",
        "The retired emperor immediately ordered a statement to be issued, saying that Jiang Ren was making false accusations.",
        "But as soon as his statement was released, many victims appeared on the star network and they also produced a lot of evidence.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "What was even more shocking was that the First Legion, which was managed by the imperial family, actually used its official account to start publishing evidence as well.",
        "This official account was run by Lu Yuan. ",
        "He posted the evidence, and then sent a message to Jiang Jin. “I have already posted the evidence you gave me. I don’t know if His Majesty will be angry.”",
        "“His Majesty will not be angry.”",
        "Lu Yuan also knew that His Majesty would not be angry.",
        "Those who were close to His Majesty all knew that His Majesty hated the imperial family. ",
        "At this time, Jiang Ren suddenly spoke up in the live broadcast. “Ah Yan, Lou Jingyue, do you know? Some people in the imperial family have connections with star worms.”",
        "Everyone was shocked.",
        "Jiang Ren said, “They will provide information to the star worms and let the star worms go ambush those talented people, such as you, Young Master Lou. Young Master Lou, in fact, your older sister was also ambushed at that time, but she was more cautious than you and managed to escape with minimal injury.”",
        "Jiang Ren’s words were made up. ",
        "He had no evidence of collusion between the imperial family and the star worms.",
        "However, there were indeed many young warriors who were ambushed by high-level star worms and lost their combat effectiveness shortly after entering the battlefield.",
        "The imperial family had already been charged with so many crimes, so it was no big deal if he accused them of one more, right?",
        "He was not a good person. ",
        "Lou Jingyue was furious. “They have gone too far!”",
        "“Yes, they have gone too far!” Jiang Ren said, “We must overthrow the imperial family!”",
        "Lou Jingyue immediately raised his arms in agreement.",
        "Jiang Ren was right. They must overthrow the imperial family! ",
        "Other people in the sanatorium were also excited by what they heard.",
        "Jiang Ren was very happy to see this scene.",
        "",
        "He had thought that he would never be able to avenge himself in this lifetime.",
        "He had long found evidence of the imperial family’s crimes, but at that time, there were star worms outside watching covetously. In order to avoid unrest in the empire, this guy Ming Zheng was unwilling to shed all pretendes of cordiality with the imperial family. ",
        "Ming Zheng was afraid that the imperial family would become desperate and cause trouble for the military, which would make the military unable to withstand the attacks of the star worms.",
        "Only relying on his own strength, what good would it do even if he had evidence?",
        "The imperial family could simply say that the evidence was fake!",
        "Thinking of this, Jiang Ren looked at Ming Zheng. “Boss, what I said is all true, right?” ",
        "Ming Zheng nodded. “The evidence you produced is all true.”",
        "He was always careful with his words and didn’t say that everything was true.",
        "But this was already enough.",
        "After Ming Zheng said this, ordinary people would definitely believe it. ",
        "Jiang Ren wanted to laugh, but forced himself to suppress it, so his face looked a little distorted.",
        "He took a few deep breaths before looking at Qi Shiyan. “Ah Yan, thank you.”",
        "He was really grateful to Qi Shiyan. Thanks to Qi Shiyan’s live broadcast, he was able to make the evidence of the imperial family’s crimes public on the entire star network.",
        "It was also Qi Shiyan’s live broadcast that made the military completely stand in opposition to the imperial family. ",
        "Qi Shiyan was his benefactor, so he wanted to give Qi Shiyan a big gift.",
        "Jiang Ren suddenly reached out and held Qi Shiyan’s hand.",
        "There were many calluses on Jiang Ren’s hand… Qi Shiyan touched them subconsciously, and then realized something was wrong.",
        "As a result, before he could pull his hand back, Jiang Ren said, “Ah Yan, I have something very important to tell you.” ",
        "“What?” Qi Shiyan pulled his hand a bit, but didn’t pull it back.",
        "He felt that Jiang Ren’s mental power was very active.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Jiang Ren was extremely excited at this moment. He didn’t know what he wanted to say.",
        "Ming Zheng realized at this time that something was wrong. ",
        "He knew that Jiang Ren would not be so peaceful.",
        "But he had no way to stop it, Jiang Ren said, “Ah Yan, someone has deceived you. The emperor has no substitute at all. He has always gone to the battlefield himself. Your Ah Zheng is actually the emperor!”",
        "Qi Shiyan was stunned, while Lou Jingyue said in disbelief, “This is impossible!”",
        "“I’m telling the truth. Right, Ming Zheng?” Jiang Ren looked at Ming Zheng and smiled brightly. ",
        "Ming Zheng didn’t say anything. Jiang Ren looked at Qi Shiyan again. “Ah Yan, he has been lying to you this whole time, so do you want to change your partner? I fell in love with you at first sight. I like you very much. I can also swear that I will never lie to you.”",
        "After saying that, Jiang Ren lowered his head and was about to kiss Qi Shiyan’s hand.",
        "Qi Shiyan subconsciously pulled his hand free, but because he was too eager, his hand landed on Jiang Ren’s face, as if he had slapped Jiang Ren in the face.",
        "Jiang Ren was not angry at all and laughed happily. ",
        "***",
        "T/N: Chapter title explanation – 掉马 (diao ma) – literally falling off the horse, is an internet term similar to losing one’s vest (where the vest is your side account/fake identity). Basically just means identity exposure."
    ],
    "previous": "Ch52.1 - Falling Off The Horse",
    "next": "Ch53 - Another Falling Off The Horse"
}