{
    "title": "Ch52.1 - Falling Off The Horse",
    "content": [
        "Qi Shiyan looked up and saw a man with gray hair but handsome appearance who didn’t look old at all.",
        "He wore a monocle, leaned on a cane, and looked like an old-fashioned aristocrat from before humans entered the interstellar era. ",
        "But this was obviously just the outer appearance.",
        "Qi Shiyan used his mental power to scan the other party and found that there were many weapons hidden in his cane. The monocle was not simple either. Although he could not understand it, it was full of advanced technology.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The man’s clothes and shoes also had peculiarities, and even his hair contained hidden weapons.",
        "This was a walking weapons rack! ",
        "Qi Shiyan was a little curious, but didn’t react much to what the other party said.\n\n",
        "His family’s Ah Zheng treated the Dawn as his wife, but he couldn’t be jealous of the Dawn.",
        "And at this moment, Ah Zheng was using the Dawn to grill meat for him. It was obvious that in Ah Zheng’s heart, he was more important than the Dawn.",
        "The Dawn’s melee weapon was a knife. Of course, this was just its external appearance. It contained a thermal weapon and could heat up in a short amount of time to split the skin of star worms.\n\n ",
        "The Dawn used this knife to deal with star worms before.",
        "Now, Ming Zheng controlled the Dawn to place the knife horizontally, adjusted it to the appropriate temperature, and then placed the star worm meat slices on it.",
        "The star worm meat slices soon sizzled with oil and smelled very fragrant. The meat didn’t stick to the knife at all.\n\n",
        "Qi Shiyan asked Ming Zheng, “Do you know this person?” ",
        "Ming Zheng frowned. “I know him.” Of course Ming Zheng knew the person in front of him. He was the one who arranged the other party’s identity and even gave him his name, Jiang Ren.",
        "Jiang Ren hated the imperial family and did not have a good relationship with him, but he had never targeted him.",
        "But now, Jiang Ren came up and called him Ming Zheng!",
        "This was the emperor’s name. ",
        "Did Ah Yan notice anything wrong?",
        "“Of course we know each other. He and I came from the same laboratory. I’m his younger brother.” Jiang Ren smiled at Qi Shiyan.",
        "Qi Shiyan said, “Your relationship doesn’t seem to be very good.”",
        "He could sense that his family’s Ah Zheng was very resistant to this person, but it wasn’t like he really hated him. ",
        "“After all, we haven’t seen each other for many years,” Jiang Ren walked over with a smile, “Can I eat star worm meat with you guys?”",
        "“That’s something you should ask Ah Zheng.” Qi Shiyan said.",
        "",
        "He could sense that the man in front of him had no ill will toward him.",
        "He didn’t mind eating with this person, but his family’s Ah Zheng had some rejection toward this person… As a person who doted on his partner, he would definitely listen to Ah Zheng’s opinion. ",
        "Anyway, there were a lot of people eating with him now, so he didn’t need this newcomer.",
        "Aiang Een looked at Zing Iheng and gave him a provocative smile. “Zing Iheng, can I stay for dinner?”",
        "Zing Iheng looked at Aiang Een deeply and said, “Ykay.”",
        "The disaster couldn’t be avoided. If Aiang Een wanted to ezpose his identity, then let him do it. ",
        "Hi Shiyan then said, “Tou can stay for dinner, but don’t provoke Ah Iheng, and don’t call him the emperor’s name.”",
        "This person shouted, “Ming Zheng” twice, and Qi Shiyan also heard it.",
        "At first he didn’t take it seriously. After all, his family’s Ah Zheng had always been the emperor’s substitute and had no name of his own, so it was normal to use the emperor’s name.",
        "But when this person shouted the second time, it was obvious that he had bad intentions. ",
        "Jiang Ren smiled upon hearing this and said, “Okay, then I won’t call him Ming Zheng anymore.”",
        "“That’s good.” Qi Shiyan looked at Ming Zheng. “Ah Zheng, the meat is ready!”",
        "The meat that Ming Zheng grilled was ready to eat, making Qi Shiyan salivate.",
        "When Ming Zheng went to the kitchen to find the cooking robot, he took some tableware. Now, he used chopsticks to pick up the slices of meat and put them on a plate for Qi Shiyan to eat. ",
        "Qi Shiyan took a bite and started to praise, “Ah Zheng, how come you know how to do everything? This grilled meat is so delicious!”",
        "Ming Zheng was in a good mood, but Jiang Ren said, “When my family’s boss* grilled the meat, he didn’t even put salt on it. How could the grilled meat be delicious? You are praising with your eyes closed. It’s not sincere.”",
        "When Jiang Ren first appeared, he was a bit enigmatic, but now, that aura had disappeared and he even called Ming Zheng “Boss”.",
        "This made Qi Shiyan’s attitude toward him much better. “I just think it tastes delicious. Can’t I?” ",
        "“Of course you can! Speaking of which, I have learned how to cook. Do you and the boss want to try my cooking?” Jiang Ren asked.",
        "As he spoke, he waved his hand, and then a robot came over with a folding table and chairs and many cooking tools, and set them out on the open space. It also took out many bottles and jars of seasonings and placed them on the table.",
        "Please visit chrysanthemumgarden (dot) com",
        "This setup looked very professional at a glance.",
        "Qi Shiyan was curious. “Where are you from? Why did you bring these things?” ",
        "The person in front of them should not be from the sanatorium.",
        "Judging from the way he was dressed… No one in the sanatorium, whether a patient or a guard, would arm themselves with weapons like this.",
        "Jiang Ren said, “I followed the high-level star worms to the convalescent planet to find the boss. As for these kitchen utensils, I took them from the kitchen of the spaceship. I don’t like to drink nutrient solution, so I cook for myself. Ah Yan, I originally thought I would come here this time to collect the boss’s body. I didn’t expect him to actually be fine… Did you save him?”",
        "“Yes.” Qi Shiyan said. ",
        "“No wonder he treats you so well,” Jiang Ren laughed, “My name is Jiang Ren. What’s your name?”",
        "Qi Shiyan said, “You can call me Ah Yan.”",
        "“Okay, I’m older than you, so I’ll just call you Ah Yan,” Jiang Ren said, “Ah Yan, let me make you something delicious.”",
        "He stood up, walked to the table on the side, and began to cook the star worm meat with graceful but quick movements. ",
        "Some of the star worm meat was roasted on a spit, some was boiled in a pot, and some was grilled on an iron plate.",
        "He also took out bottles one by one and started putting seasonings and spices on the meat.",
        "When adding the seasoning, he would occasionally throw the bottle into the air and catch it again. His skilled movements made him look like a chef showing off his skills.",
        "Qi Shiyan was dazzled and felt that this person was a bit mysterious. ",
        "He grabbed Ming Zheng’s hand and asked, “Ah Zheng, what’s the matter with your younger brother? Is he a cook?”",
        "Qi Shiyan thought Jiang Ren was a little strange. The people watching the live broadcast also found him strange. “Who is this person?”",
        "“I don’t know. I searched his appearance on the star network, but found nothing.”",
        "“His cooking skills are really good. Compared to him, Qi Shiyan’s cooking skills are too poor.” ",
        "“Qi Shiyan’s skills can’t be considered cooking skills!”",
        "“I think the relationship between this person and His Majesty is not simple.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“He said that he and His Majesty came from the same laboratory. Have they known each other since childhood?”",
        "“Is he also a member of the imperial family? What is the story behind His Majesty’s life experience?” ",
        "“The imperial family has been pretending to be dead…”",
        "…",
        "However, those who recognized Jiang Ren were very silent at this moment.",
        "Who was Jiang Ren? He was the boss of the Chaotic Zone, a SS-level warrior. ",
        "He was decisive in killing and had the final say in the Chaotic Zone, leaving behind many horrific legends.",
        "But now this person was grilling meat for others?",
        "Ming Zheng replied to Qi Shiyan, “He is not a cook, but he should have no ill intentions.”",
        "Ming Zheng didn’t have much contact with Jiang Ren. ",
        "But Jiang Ren was not the kind of person who killed innocent people. Although he didn’t like him, he wouldn’t intentionally target him. At most, he would cause him some minor trouble.",
        "He was startled by the way Jiang Ren addressed him before, but since Jiang Ren did not take the next step, Ming Zheng relaxed a lot.",
        "“I also think he has no ill intentions.” Qi Shiyan said.",
        "At this time, Jiang Ren placed a piece of grilled star worm meat on the plate in front of Qi Shiyan. “Ah Yan, try my grilled star worm meat.” ",
        "Qi Shiyan took a bite and his eyes lit up. He immediately picked up the meat with chopsticks and brought it to Ming Zheng’s mouth. “Ah Zheng, this meat is very delicious. You should try it!”",
        "Ming Zheng took a bite and found it was indeed very delicious.",
        "At this time, Jiang Ren put another piece of roasted meat on Qi Shiyan’s plate. This roasted meat is cumin flavored. You can try it first. There will be other flavors later.”",
        "“Thank you.” Qi Shiyan said with a smile. ",
        "“You’re welcome.” Jiang Ren looked at Qi Shiyan gently.",
        "Qi Shiyan took another bite and then went to feed Ming Zheng. “Ah Zheng, this roasted meat is the best roasted meat I have ever eaten!”",
        "",
        "“Thank you for the compliment. The two of you can sit down and slowly enjoy your meal.” Jiang Ren spoke again.",
        "The robot brought a stool, and Qi Shiyan and Ming Zheng sat down at the small table in front of Jiang Ren. ",
        "Qi Shiyan was no longer so wary of Jiang Ren and asked, “Jiang Ren, where did you learn your cooking skills?”",
        "“I learned from watching the star network. Ah Yan, if you like, I can always cook for you.”",
        "“That’s not necessary. I will learn it myself when the time comes. Ah Zheng, when I learn, I will make you something delicious.” Qi Shiyan looked at Ming Zheng and said.",
        "He didn’t mind being fed, but he preferred feeding others. ",
        "“Okay.” Ming Zheng agreed.",
        "Jiang Ren’s eyes flickered, and then he said to Ming Zheng, “Boss, didn’t you ask me to look for evidence of the imperial family’s crimes? I found a lot.”",
        "Ming Zheng had indeed asked Jiang Ren to do this before.",
        "He himself also conducted special investigations into the imperial family. ",
        "He didn’t want those people in the imperial family to cause him trouble or trip him up, so he grabbed their handles* and used them to threaten them.",
        "“I’ve troubled you.” Ming Zheng said.",
        "Jiang Ren smiled and said, “It was no trouble. After all, we both have a grudge against the imperial family… By the way, let me tell you what I found out.”",
        "While Jiang Ren was speaking, he pressed a button next to him and a projection appeared in front of everyone. ",
        "Jiang Ren said, “The emperor is always at the front lines, so I couldn’t find out anything. Let’s start with the crown prince, Ming Qingyu.”",
        "As soon as he finished speaking, evidence of Ming Qingyu’s crimes appeared on the projection.",
        "Qi Shiyan learned a lot about Ming Qingyu’s illegal and criminal deeds from the original owner’s memories, but what the original owner knew were only those superficial things.",
        "The original owner had no idea what Ming Qingyu did in private. ",
        "But Jiang Ren was different. The evidence he provided completely exposed Ming Qingyu’s past. Even those who were interrogating Ming Qingyu might not have found out so much.",
        "Even Ming Qingyu himself might not know some of these things.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Because it wasn’t him who did them. It was his subordinates who did them behind his back.",
        "*** ",
        "T/N: *老大 (lao da) – literally Eldest, term for the eldest child in a family. Remember, among the survivors of the laboratory, Ming Zheng is considered the eldest brother, Jiang Ren who was introduced in this chapter is Old Second, Jiang Jin (the director of the sanatorium) is Old Three and Old Four (the youngest) hasn’t been introduced, only mentioned in passing. 老大 (lao da) is often translated as “Boss” as it’s also often used in gang settings for the head of the gang. I’m translating it as “Boss” as using “Eldest” sounds weird in English.",
        "*A handle is Chinese slang for having dirt on someone, blackmail material, etc."
    ],
    "previous": "Ch51 - Roasted Whole Worm",
    "next": "Ch52.2 - Falling Off The Horse"
}