{
    "title": "Ch53 - Another Falling Off The Horse",
    "content": [
        "Jiang Ren’s behavior was so unexpected that everyone present was stunned.",
        "Seeing him still laughing after being slapped, a word popped up in everyone’s mind – pervert. ",
        "The people watching the live broadcast were also dumbfounded.",
        "“This person gave me a weird feeling from the moment he appeared.”\n",
        "",
        "“I’ve been anticipating the moment when His Majesty is exposed in front of Qi Shiyan, but it was beyond my expectations for it to be so sudden.”",
        "“So who is this Jiang Ren?” ",
        "“Actually, he’s not bad looking, but for some reason, his hair has turned grey.”\n\n",
        "“I don’t know Jiang Ren’s identity, but I’m a psychology major. According to my observations, Jiang Ren should have a grudge against the imperial family. He obviously went to the convalescent planet specifically to expose the imperial family’s scandals in front of the people of the entire empire and make a big deal out of it. Since he has a grudge against the imperial family, it’s normal for him to stab His Majesty and dig his corner*.”",
        "“I wonder how His Majesty will respond…”",
        "…\n\n ",
        "Netizens only knew what was shown on the surface, but some people, including Lu Yuan, knew more.",
        "For example, Jiang Ren was the boss of the Chaotic Zone.",
        "The Chaotic Zone was really chaotic in the past, but since Jiang Ren became the boss, the security in the Chaotic Zone had improved a lot.\n\n",
        "However, Jiang Ren really hated the imperial family. ",
        "He often attacked members of the imperial family, and once almost killed Prince Renhe. As a result, the imperial family always wanted to send their First Legion to wipe out the Chaotic Zone.",
        "They wanted to wipe it out, but it was impossible to wipe out the Chaotic Zone. His Majesty rejected all of their requests on the grounds that they needed to fight the star worms.",
        "Then, the imperial family organized several sieges against the Chaotic Zone themselves. As for the results… the Chaotic Zone obtained many new battleships, and even posted a video on the star network showing the captured imperial guards singing and dancing in their underpants.",
        "The songs they sang were crazy songs like, “The retired emperor is a piece of shit”. ",
        "Of course, the imperial family reacted quickly, and these things did not spread. Ordinary people did not even know that the imperial family had attacked the Chaotic Zone and was beaten miserably.",
        "Lu Yuan called Jiang Jin and said, “Jiang Jin, why did Jiang Ren go to the convalescent planet? He is even talking nonsense. Isn’t he afraid that His Majesty will beat him to death?”",
        "Jiang Jin said, “Don’t worry, His Majesty won’t beat him to death.”",
        "Lu Yuan: “…” He wasn’t worried about Jiang Ren! He just didn’t want Jiang Ren to cause trouble for His Majesty! ",
        "But before he could say anything more, Jiang Jin had already cut off the communication.",
        "Looking at the live broadcast, Jiang Jin also laughed.",
        "Please visit chrysanthemumgarden (dot) com",
        "The people around Jiang Jin looked at Jiang Ren in the live broadcast, then looked at Jiang Jin, and began to have some doubts.",
        "Were these two people brothers? ",
        "Why did they feel that Jiang Jin was a bit like Jiang Ren sometimes?",
        "Sanatorium.",
        "In the open field, only Jiang Ren’s laughter was left. Everyone else was silent.",
        "After seeing Jiang Ren, Ming Zheng had guessed that he was going to cause trouble. ",
        "Dased on his understanding of Aiang Een, after knowing that he had concealed his identity and was together with Hi Shiyan, Aiang Een would definitely ezpose his identity.",
        "Le had long been prepared for this.",
        "Le had always felt guilty for not telling Hi Shiyan his real identity due to a momentary lapse in pudgment.",
        "Qi Shiyan tried his best to save him and the people in the sanatorum, but they were deceiving him. ",
        "So, when Jiang Ren revealed his identity, Ming Zheng just felt relieved.",
        "But Jiang Ren actually wanted to hold Shi Yan’s hand!",
        "If Qi Shiyan hadn’t broken free, he would have definitely punched Jiang Ren.",
        "After glancing at Jiang Ren who was laughing beside him, Ming Zheng looked at Qi Shiyan and apologized solemnly. “Ah Yan, I’m sorry.” ",
        "“Wait, wait, Brother Zheng, you said sorry? You actually apologized? What this madman said can’t be true, right?” Lou Jingyue’s face was full of shock.",
        "Those in the sanatorium who believed Ming Zheng was the emperor’s substitute were also shocked.",
        "In the past few days, they had felt sorry for Ming Zheng and cursed the emperor in private.",
        "But it turned out that Ming Zheng was the emperor? ",
        "Ming Zheng said, “I am indeed the emperor, but I sincerely want to overthrow the imperial family.”",
        "By now, Qi Shiyan had already figured out the whole story.",
        "",
        "His Ah Zheng was the emperor. Because he had been fighting star worms outside for many years, he was severely poisoned and was sent to the sanatorium to recuperate.",
        "As a result, someone attacked him and threw him into the primitive jungle while he was still confused and delirious. ",
        "The airship Ming Zheng was riding on even had poison in it.",
        "If he had not met him, the star worm poison in Ming Zheng’s body would have been aggravated and he would have died due to the poison flaring up long ago.",
        "Later, he saved Ming Zheng and fell in love with him, and then Ming Zheng lied to him and said that he was the emperor’s substitute.",
        "Qi Shiyan should be angry because the person he liked deceived him, but he couldn’t summon any anger. ",
        "Ming Zheng didn’t know at first that the star worm poison in his body could be eliminated, so he spoke his last words to the airship’s intelligent system. Those last words were to instruct others to take good care of him.",
        "Ming Zheng was very indulgent toward him. He kissed and hugged Ming Zheng, and Ming Zheng did not resist at all. Even when he was delirious, he kept sticking to him.",
        "Ming Zheng’s feelings for him were not fake.",
        "The most important thing was, except for the fact that he was a substitute was fake, everything else Ming Zheng said should be true. ",
        "Ming Zheng indeed came from a laboratory, and he indeed led the troops personally, charging ahead and fighting against high-level star worms.",
        "In fact, he should have guessed Ming Zheng’s identity long ago.",
        "Even if the emperor wanted to find a substitute, it was impossible to allow the substitute to have such a good relationship with Marshal Ke Lun and others.",
        "This substitute was exactly the same as the emperor. He could definitely kill the emperor and take his place, right? ",
        "Qi Shiyan stared at Ming Zheng’s face, feeling inexplicably excited.",
        "Emperor, this was the emperor!",
        "This was the most powerful and strongest person in the Human Empire!",
        "He was also the uncle of the original owner’s fiancé! ",
        "He hugged and kissed this person, calling him Xiao Guai and it was… quite exciting.",
        "Ming Zheng lowered his head, waiting for Qi Shiyan to judge him.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The people watching the live broadcast and the people nearby were all very nervous.",
        "The people present either didn’t dare to speak or were stunned and silent. The people watching the live broadcast were different. “Qi Shiyan, His Majesty really loves you. Don’t be angry!” ",
        "“I hope my CP doesn’t BE*!”",
        "“Although lying is not good, Xiao Guai is quite pitiful. Please forgive him!”",
        "…",
        "Jiang Ren finally stopped laughing at this time. “Ah Yan, this guy Ming Zheng only cares about his army and his subordinates, and he only wants to kill star worms. He is with you to exploit you and make you help the people in the sanatorium eliminate the star worm poison. He has bad intentions! You should kick him away and choose me. I will definitely take good care of you.” ",
        "The silent Ming Zheng immediately glared at Jiang Ren.",
        "Jiang Ren said, “Look, look, he’s getting anxious! He’s glaring at me!”",
        "At this moment, Qi Shiyan pulled Ming Zheng into his arms and kissed Ming Zheng on the face. “Ah Zheng, why are you so cute?”",
        "Ming Zheng couldn’t react for a moment. ",
        "Qi Shiyan said, “Don’t be jealous, I don’t like his type.” From childhood to adulthood, he had been surrounded by a group of people who were not recognizable as human beings.",
        "These people basically couldn’t make any facial expressions, and in the later stages, some of them couldn’t even speak.",
        "He would observe them and understand their emotions using his mental power.",
        "He could always accurately discern other people’s emotions. ",
        "Ming Zheng liked him. He had long been certain of this. As for this Jiang Ren… the other party was full of kindness toward him, but obviously did not like him.",
        "As for why this person said this, it should be just for fun?",
        "After all… Jiang Ren didn’t seem to hate Ming Zheng.",
        "Ming Zheng was stunned after being kissed. ",
        "Jiang Ren said again, “Why don’t you like me? I look no worse than Ming Zheng, and I also know how to cook.”",
        "Ming Zheng glared at Jiang Ren again.",
        "",
        "Seeing this, Qi Shiyan kissed Ming Zheng again and said, “Don’t be jealous. I only like you.”",
        "Ming Zheng asked, “You’re not angry?” ",
        "Qi Shiyan said, “As long as you really like me, I won’t be angry.”",
        "He was even a little excited now. If Ming Zheng was in his delirious state right now, he thought he would be even more excited!",
        "Ming Zheng was stunned and spoke again, “I’m sorry.”",
        "If he had known Qi Shiyan would have such an attitude, he wouldn’t have lied to Qi Shiyan in the first place. ",
        "At this time, Lou Jingyue became anxious. “Brother Yan, Brother Yan, how can you not be angry?! He lied to you, Brother Yan! He, he…”",
        "The more Lou Jingyue thought about it, the sadder he became.",
        "His Majesty had gone too far by lying to him!",
        "What had he done these past few days? ",
        "Who did he work so hard for every day?",
        "Also, if the person in front of him was His Majesty… then when His Majesty was delirious before, he not only kissed Qi Shiyan, but was also jealous of him and kicked him…",
        "Lou Jingyue looked at Marshal Ke Lun, Shan Xi and others beside him.",
        "Marshal Ke Lun avoided his sight. ",
        "Lou Jingyue plopped down on the ground. “This is too much. You guys are too much! I don’t want to live anymore!”",
        "Qi Shiyan: “…” How old was he for him to still be acting like a child…",
        "It was still Ming Zheng that was better.",
        "Qi Shiyan touched Ming Zheng’s hand again. ",
        "Ming Zheng asked worriedly, “Ah Yan, you said that you have a grudge against the imperial family…”",
        "Qi Shiyan said, “Actually, there is no big grudge.” The only one he had a grudge against was Ming Qingyu.",
        "",
        "Ming Qingyu was just a crown prince. After he had Ming Zheng, what was Ming Qingyu?",
        "Jiang Ren wanted to see the two people quarrel, but unfortunately, he didn’t get to see it. He said, “Ah Yan, why are you so good-tempered? You should make a scene and make him sign various unequal contracts…” ",
        "Qi Shiyan felt speechless. Partners were meant to be pampered. Why do these things?",
        "“You really are…” Jiang Ren looked at Qi Shiyan with a look of hating iron for not becoming steel*, and suddenly said to Ming Zheng, “Ming Zheng, I owe you a life-saving debt. I should repay you. How about this? I will also tell you something important.”",
        "Ming Zheng felt that Jiang Ren might be stirring up trouble again.",
        "Jiang Ren was indeed about to stir up trouble again, “Ming Zheng, your Ah Yan is actually your nephew’s fiancée! He is Qi Shiyan! Qi Yuncheng’s son! Don’t you think he looks a lot like Qi Yuncheng?” ",
        "The people present from the sanatorium were shocked again.",
        "Jiang Ren started to talk nonsense. “Ming Zheng, Qi Shiyan loves Ming Qingyu deeply. Maybe he is with you because you look a lot like Ming Qingyu, and he is using you as a substitute!”",
        "Ming Zheng: “…” Did he look like Ming Qingyu with his blue and purple face at the beginning?",
        "*** ",
        "T/N: Bonus chapter for Danypooh. Thanks for the ko-fis!",
        "*Dig/pry someone’s corner is Chinese slang for trying to steal their significant other.",
        "*CP and BE were both in English in the raws. I figured everyone already knows, but just in case, CP means pairing/couple and BE means bad ending.",
        "*恨铁不成钢 (hen tie bu cheng gang) – hating iron for not becoming steel. An idiom that means to feel resentful toward someone for failing to meet expectations. "
    ],
    "previous": "Ch52.2 - Falling Off The Horse",
    "next": "Ch54 - Liven Up"
}