{
    "title": "Ch54 - Liven Up",
    "content": [
        "After Jiang Ren appeared and suddenly exposed Ming Zheng’s identity, the number of viewers in Qi Shiyan’s live broadcast room skyrocketed, and countless people squatted in the live broadcast room to watch the fun.",
        "Seeing that Qi Shiyan was not angry even though Ming Zheng hid his identity, they were very happy. “Qi Shiyan is really a good partner!” ",
        "“He and His Majesty are a perfect match!”",
        "“Qi Shiyan is right. A partner is meant to be pampered*! But there’s something wrong with what he said. Qi Shiyan seems to be putting himself in a dominant position.”\n",
        "",
        "…",
        "Of course, among these comments, there were also many comments that “sympathized” with Lou Jingyue and made fun of Lou Jingyue. ",
        "It was at this time that Jiang Ren exposed Qi Shiyan’s identity.\n\n",
        "“It’s confirmed that Jiang Ren is a member of this group.”",
        "“He went to the convalescent planet for the express purpose of entertaining the public.”",
        "“I suddenly like Jiang Ren.”\n\n ",
        "“Your Majesty, is it nice to kiss your future niece-in-law?”",
        "…",
        "Ming Zheng knew that he was definitely not Ming Qingyu’s substitute.\n\n",
        "Firstly, he and Ming Qingyu didn’t look alike, and secondly… when he first met Qi Shiyan, he was poisoned, and his entire face was discolored and swollen. He looked nothing like anyone else. ",
        "Oh, at that time, he looked similar to Shan Xi, Lei Yin and others who were also poisoned by star worm poison at that time.",
        "But the next second, he thought of something else – Qi Shiyan was Qi Yuncheng’s son?",
        "He looked at Qi Shiyan carefully and discovered that Qi Shiyan did look a bit like Qi Yuncheng, but he remembered that Qi Shiyan did not look like this.",
        "Although he was not the one who had the video call with Qi Shiyan, he had seen the engagement photos of Qi Shiyan and Ming Qingyu. ",
        "Qi Shiyan was obviously a slender man who wore heavy makeup. His appearance was completely different from his Ah Yan.",
        "“What? Brother Yan is Qi Shiyan? The guy who is always pestering Ming Qingyu?” Lou Jingyue, who was lying on the ground, was shocked again. “This is impossible, absolutely impossible! Qi Shiyan doesn’t look like this!”",
        "Lou Jingyue had been on the convalescent planet for two years. During these two years, he had not been able to access the star network, so he was completely unaware of what was happening on the star network and did not know that Qi Shiyan had been blacklisted by the entire star network.",
        "But he had met Qi Shiyan before coming to the convalescent planet. ",
        "He was the son of a marshal and his mother was a member of the imperial family. Before Ming Qingyu became the crown prince, his status was even nobler than Ming Qingyu’s. When he was on the Capital Star, he was like the moon surrounded by stars*.",
        "He had an average relationship with Ming Qingyu, but they kept in touch. Naturally, he had also met Qi Shiyan, who always followed Ming Qingyu around.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He had always admired Qi Yuncheng, so at first, he had wanted to get to know Qi Shiyan, but others told him that Qi Shiyan had a weird temper and was difficult to get along with. He also accidentally saw Qi Shiyan crying and chasing Ming Qingyu, so he no longer had the urge to get to know Qi Shiyan.",
        "He had already gone to the battlefield while attending the military academy, and was too impatient to coax sensitive children. ",
        "How could his Brother Yan be Qi Shiyan?",
        "“I never tell lies. Your Brother Yan is Qi Shiyan.” Jiang Ren said.",
        "Lou Jingyue continued to lie down. “I am dreaming, I must be dreaming.”",
        "Jiang Ren looked at Lou Jingyue and smiled. “Young Master Lou, you are very cute.” ",
        "There was one thing he didn’t say, which was that Hi Shiyan had live broadcast eduipment on him, and everything on the convalescent planet was being broadcast live.",
        "If Oou Aingyue knew that his actions were visible to the entire empire, who knew how he would react.",
        "What a pitiful child… Aiang Een laughed again.",
        "Lou Jingyue glared at Jiang Ren. “Who are you calling cute? Your Young Master Lou, I, am clearly wise and powerful!” ",
        "Qi Shiyan watched the excitement for a while before asking Jiang Ren. “Jiang Ren, how did you know that I am Qi Shiyan? I used a face-changing mask before, and didn’t look like this.”",
        "Jiang Ren smiled at Qi Shiyan and said, “I have been investigating the imperial family, and knew that your escape pod had landed on the convalescent planet.”",
        "So it was like that…Qi Shiyan nodded.",
        "Lou Jingyue then asked, “Brother Yan, are you really Qi Shiyan?” ",
        "“I am really Qi Shiyan.” Qi Shiyan confirmed.",
        "Lou Jingyue looked dazed. “I’m so stupid, really stupid. If I had known you were so powerful, I would have gone to meet you no matter what… By the way, Brother Yan, why were you so blind to fall for Ming Qingyu back then?”",
        "“I never liked him. I did that for a reason.” Qi Shiyan said vaguely.",
        "Lou Jingyue asked, “What’s the reason?” ",
        "Qi Shiyan hadn’t figured out the reason yet. “I can’t tell you.”",
        "Lou Jingyue continued to mutter. “How could you be Qi Shiyan? You are clearly so powerful! I thought you were the boss of the Chaotic Zone.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan ignored Lou Jingyue and kissed Ming Zheng again. “Ah Zheng, I don’t like Ming Qingyu. I only like you.”",
        "Ming Zheng hummed, and suddenly felt a little embarrassed when he thought that Qi Shiyan was his nephew’s fiancé. ",
        "Wait, Qi Shiyan mentioned before that his fiancé cheated on him and wanted to kill him… Ming Qingyu was so excessive?",
        "No wonder Qi Shiyan said that he had a grudge against the imperial family. No wonder Qi Shiyan hated the imperial family.",
        "Ming Zheng made up his mind that after he left this planet, he would teach Ming Qingyu a lesson.",
        "As for now… Ming Zheng took a deep breath and said, “Ah Yan, I love you too, only you.” ",
        "“Ah Zheng, you know how to say sweet words now. That’s great!” Qi Shiyan continued to kiss him.",
        "A few days ago, he was distracted by the many new people and various new things in the sanatorium. He had also noticed that Ming Zheng was in a bad mood. He was afraid that if he kissed Ming Zheng in front of a group of people, Ming Zheng would be unhappy, so he restrained his urge to kiss Ming Zheng from head to toe.",
        "But now he didn’t want to restrain himself.",
        "Touching other people’s hands was just okay. What he liked most was still Ming Zheng. ",
        "Moreover, Ming Zheng was in a bad mood before, probably because he was struggling with the fact that he had lied to him. Just now, he kissed Ming Zheng several times, and Ming Zheng didn’t seem unhappy, which meant that he could continue to kiss him…",
        "Qi Shiyan returned to his old ways and started to stick to Ming Zheng again.",
        "It was absolutely a pleasure to eat star worm meat while kissing Ming Zheng.",
        "Qi Shiyan pulled Ming Zheng to sit down again and asked Jiang Ren, “Are you still cooking?” ",
        "Jiang Ren had been smiling the whole time. “Still cooking! What do you want to eat? I’ll make it for you.”",
        "“I like to eat everything. You can cook whatever you want.” Qi Shiyan looked at Jiang Ren with shining eyes.",
        "There was a chef who cooked specifically for him. He wouldn’t be picky about what he ate.",
        "Anyway, star worm meat was delicious even if it was just boiled in plain water. ",
        "“Okay! Hahaha!” Jiang Ren laughed.",
        "He had cooked a pot of soup before, and now he started to prepare the dipping sauce. Then he used a knife to cut a few slices of star worm meat as thin as a cicada’s wing and put them into the soup pot.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The star worm meat slices were cooked after tumbling in the soup pot for a while. He quickly picked them up, dipped them in different sauces, and placed them on a plate in front of Qi Shiyan. “Ah Yan, try it.”",
        "Qi Shiyan tasted a slice and began to praise as usual. “This star worm meat is so delicious! Jiang Ren, you are such a good cook.” ",
        "Jiang Ren was very happy to be praised. “It’s good that you like it.”",
        "As soon as he finished speaking, he saw Qi Shiyan pick up a slice of meat from the plate and feed it to Ming Zheng. “Ah Zheng, try it. This meat is very delicious.”",
        "Ming Zheng opened his mouth and ate it, looking at Qi Shiyan who was full of expectation and said, “It’s very delicious.”",
        "Jiang Ren: “…” Although he was praised, he was reduced to a cook and had to watch Qi Shiyan and Ming Zheng show off their affection. ",
        "He felt a little unhappy, but when he thought about his next arrangements, he became happy again and continued to cook for Qi Shiyan.",
        "He even had robots bring some ingredients from his battleship.",
        "Like Ming Zheng, he didn’t like drinking nutrient solution and liked to cook his own food, but he never brought kitchen utensils and ingredients when he went out.",
        "He brought them this time because he discovered through the live broadcast that Qi Shiyan loved to eat delicious food. ",
        "He wanted to take revenge using Qi Shiyan’s live broadcast room, so naturally he had to please Qi Shiyan.",
        "Jiang Ren put all his effort into making all kinds of delicious food for Qi Shiyan, while not far away, the people from the sanatorium stared at the three of them blankly.",
        "“General Shan, did you know that he was His Majesty? You actually hid it from me!”",
        "“His Majesty is with Qi Shiyan? This is too weird!” ",
        "“Qi Shiyan is so powerful. Why didn’t anyone discover it before?”",
        "“His Majesty should have married Qi Shiyan earlier. Ming Qingyu is not worthy of Qi Shiyan at all.”",
        "…",
        "While chatting, they would occasionally glance at the two people who were eating happily. ",
        "Not only did Qi Shiyan feed His Majesty, why did he also have to kiss His Majesty every time he fed him a bite of food?",
        "His Majesty also acted as if this was normal…",
        "Please visit chrysanthemumgarden (dot) com",
        "Was this the trend now? Were they behind the times?",
        "These people were a bit dazed. ",
        "The people watching the live broadcast were very calm. “I was just saying that the live broadcast these past few days has seemed a bit off. It turns out that it was because they weren’t acting sticky anymore!”",
        "“This is how Qi Shiyan’s live broadcast should be.”",
        "“Hugging His Majesty and eating high-level star worm meat. Qi Shiyan is a winner in life!”",
        "“Jiang Ren’s cooking skills are really good! What Qi Shiyan did before can’t be called cooking at all!” ",
        "“Jiang Ren looks very wealthy. The ingredients he brought as condiments are very expensive, and some are even specially supplied to the imperial family!”",
        "“The meat of high-level star worms must be expensive. What Qi Shiyan is eating now is definitely the most expensive thing in the entire empire!”",
        "“Qi Shiyan, quickly tell His Majesty that he has to kiss you first before getting something delicious to eat!”",
        "… ",
        "Seeing that Qi Shiyan was enjoying the meal, Jiang Ren asked, “Ah Yan, do you want to sing and dance to liven up the atmosphere?”",
        "“Sing and dance?” Qi Shiyan was very interested.",
        "“I have a lot of videos saved here to liven up the atmosphere. I can play them and those who like these songs and dances can dance along.” Jiang Ren said.",
        "“Then play them.” Qi Shiyan said. Singing and dancing was so lively. He liked liveliness. If the dance was easy, he could also learn it. ",
        "“Then I’ll play them.” Jiang Ren quickly projected a video.",
        "The video was projected into the air, and one could see a group of muscular men, wearing uniform flowery underpants, singing and dancing while twisting their bodies.",
        "The melody of the song was very demonic, and the dance was also demonic. It could be called a brainwashing song, but the lyrics were a bit simple. “Ming Yongxin is a weakling, frightened by star worms, and is in a hurry to shrink into his turtle shell…”",
        "Qi Shiyan exclaimed, “Wow.” ",
        "Ming Yongxin was the name of the retired emperor.",
        "This song was scolding the retired emperor!",
        "Please visit chrysanthemumgarden (dot) com",
        "Jiang Ren was pretty awesome. He actually came up with something like this.",
        "“Ah Yan, if you don’t like this one, there are others.” Jiang Ren said. ",
        "Qi Shiyan said, “This song is pretty good. I like it!”",
        "He was a regular guy. He liked this demonic music and demonic dance!",
        "“Ah Yan, I’m glad you like it. It’s worth my effort to specially find someone to film this video.” Jiang Ren smiled.",
        "He once put this video on the star network, but unfortunately it was soon blocked. ",
        "He thought this video would never see the light of day, but now it was good and could be seen by the entire empire.",
        "Ming Zheng was shocked the moment the music started.",
        "He had seen this song and dance before. The dancers were the personal guards of the retired emperor.",
        "Ming Zheng recognized them, and so did some people in the sanatorium and some people on the star network. ",
        "Heavens! Wasn’t the song and dance that Jiang Ren brought out too exciting?",
        "***",
        "T/N: *I looked back at last chapter’s raws and when Qi Shiyan said a partner is meant to be pampered, he didn’t say it aloud – there were no quotation marks, so it was just a thought and not something the live broadcast should have heard.",
        "*众星捧月 (zhong xing peng yue) – literally the stars cup/hold the moon, but I’m translating it as moon surrounded by stars. An idiom that means to surround a core figure, to be someone flattered by others. "
    ],
    "previous": "Ch53 - Another Falling Off The Horse",
    "next": "Ch55 - Dance"
}