{
    "title": "Ch55 - Dance",
    "content": [
        "Capital Star, Imperial Palace.",
        "Because Ming Zheng had not returned to the Capital Star for many years, the imperial palace of the Capital Star was still occupied by the retired emperor. ",
        "Upon learning that high-level star worms had attacked the convalescent planet, the retired emperor, who wished that all the people on the convalescent planet would die, also started watching the live broadcast.",
        "Seeing the high-level star worms being killed so quickly, he was so angry that he almost stopped watching. Later, Jiang Ren, who obviously had malicious intentions, appeared in the live broadcast room, so he continued watching.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "As a result, Jiang Ren began to expose the imperial family’s black materials!",
        "The retired emperor immediately ordered people to suppress the news and clarify things, but it obviously had little effect. ",
        "Just when he was furious, Jiang Ren exposed Ming Zheng’s identity.\n\n",
        "He was waiting for Ming Zheng and Qi Shiyan to turn against each other, but these two people didn’t quarrel at all. Instead, they became sticky again.",
        "The retired emperor was furious and helpless. “Ming Zheng, this guy, actually helped others make a joke of the imperial family in public. He is so unruly and has brought shame to the imperial family! He is indeed a bastard from a laboratory and is not fit to be seen in public!”",
        "While he was scolding Ming Zheng, the retired emperor saw the video that he considered to be a humiliation.\n\n ",
        "Not only did his personal guards fail in the battle, but after being captured by the barbarians in the Chaotic Zone, they unexpectedly did not commit suicide. Instead, they made such a video, which completely humiliated him.",
        "The retired emperor hated the people in the Chaotic Zone and also hated those personal guards of his. Over the years, he had spent a lot of money to have people go assassinate his captured personal guards and the Dark Emperor who controlled the Chaotic Zone.",
        "Unfortunately, none of them were successful.\n\n",
        "He also received other demonic dances performed by his personal guards. ",
        "The mastermind that oversaw the star network would block all these videos. Before, the people of the empire had never seen these things, but now, the entire empire had seen them.",
        "His crimes and the humiliation he had suffered were now known to everyone.",
        "He wanted to close this live broadcast room, but the live broadcast room had long been taken over by the military, and now it was being broadcast on more than one platform. Even if he ruthlessly managed to shut down one platform, there were still other platforms.",
        "The retired emperor was so angry that his face turned blue. ",
        "The people around him didn’t dare to look at him, so they didn’t notice that there were terrible bulges on some parts of his face, as if something was about to break out of his body.",
        "The retired emperor was very angry, but there was laughter and joy on the star network.",
        "“This song made me laugh to death.”",
        "“This music is so demonic!” ",
        "“Help! My ears are contaminated!”",
        "“I couldn’t help but sing along, wuwuwu.”",
        "",
        "“Qi Shiyan, what kind of aesthetic taste do you have? You actually like this kind of song and dance!”",
        "“Your Majesty, stop him now! Don’t let his aesthetic sense go further astray!” ",
        "“Although this dance is weird, it’s actually quite nice to watch. Look at those dancers. They all have great bodies, eight-pack abs, and they all look very handsome.”",
        "“These are all handsome guys who can directly make their debut. I’ll watch such handsome guys even if their dancing is terrible, not to mention that they dance pretty well.”",
        "“I don’t want to disturb Qi Shiyan and His Majesty’s romance, so next, my live broadcast camera will be focused on the song and dance performance, licking the abdominal muscles!”",
        "… ",
        "While ordinary people were laughing, some people realized something was wrong. “These people look a bit familiar.”",
        "“The leader looks a lot like the imperial guard I was a fan of when I was young.”",
        "“These people seem to all be imperial guards… The retired emperor chooses his guards based on their appearance, so the imperial guards are all handsome guys.”",
        "“Five years ago, a large number of the retired emperor’s personal guards were replaced. It is said that they were killed by star worms when they went to the front lines to express their condolences… Those personal guards actually didn’t die? Instead, they went dancing?” ",
        "“Their pensions have all been paid, so there’s no way these personal guards are still alive. So these people are using face-changing masks to imitate those personal guards? This is too much, sucking the blood of the dead!”",
        "…",
        "These guards had families. Some of their family members saw the live broadcast and were also very angry.",
        "After their loved ones passed away, they overcame their grief with great difficulty. Fnezpectedly, now, people were actually dancing like this using their family members’ faces. This was simply unforgivable! ",
        "These people ezploded.",
        "In the live broadcast, the more Oou Aingyue stared at the song and dance, the more he felt something was wrong. “Aiang Een, these people are wearing the faces of deceased imperial guards, right? I know you have a grudge against the imperial family, but isn’t it a bit inappropriate for you to use the faces of deceased people to shoot a video like this?”",
        "Jiang Ren raised his eyebrows. “Who said these people are dead?”",
        "“They died five years ago while visiting the front lines to express their condolences. You can find the details on the imperial family’s official website,” Lou Jingyue said. He had felt very upset for a while at that time and had vowed to kill all the star worms. ",
        "Jiang Ren sighed. “Star worms are also unlucky. They are always blamed… These people are obviously not dead. They are all living well in the Chaotic Zone.”",
        "Lou Jingyue was stunned, and those people on the star network who were complaining about the injustice done to these imperial guards were also stunned.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Five years ago, they didn’t go to the front lines at all. Instead, they followed the orders of the retired emperor to attack the Chaotic Zone. It’s just that they were too weak, so they were captured and became prisoners. The Dark Emperor asked the retired emperor to spend money to redeem them. The retired emperor refused, and the Dark Emperor couldn’t support them for free. So he let them sing and dance to earn some money to support themselves… There was no other way, right?” Jiang Ren said.",
        "Lou Jingyue realized something was wrong. “Who are you?” ",
        "Jiang Ren said, “I am an insignificant person, but people in the Jianghu* call me the Dark Emperor.”",
        "Lou Jingyue was silent for a while, then he said, “The Dark Emperor is obviously what you call yourself!” He had always called him the “boss of the Chaotic Zone” because while the empire had a wise and powerful emperor, he was unwilling to call the boss of the Chaotic Zone the “Dark Emperor”.",
        "How could that guy be compared with His Majesty?",
        "“You can call me whatever you want. I don’t mind.” Jiang Ren said with a smile. ",
        "“Wait, you are the Dark Emperor, yet you actually dared to show up here alone? Do you want to die?” Lou Jingyue was shocked. “You are a wanted criminal!”",
        "“Didn’t you guys plan to overthrow the imperial family before? All of you are wanted criminals like me. What do I have to be afraid of?” Jiang Ren laughed, “By the way, Young Master Lou, you thought Qi Shiyan was me, but you kept calling him Brother Yan and being so close to him… Those that follow those on the wanted list are wanted people, so you and I are both on the wanted list.”",
        "Lou Jingyue’s expression collapsed.",
        "Qi Shiyan listened and looked at Jiang Ren with eyes that seemed to be shining. ",
        "The Dark Emperor was wanted by the imperial family, but the people of the empire didn’t actually hate this man. After all, the Chaotic Zone was not so chaotic anymore ever since he appeared.",
        "He also only targeted the imperial family and wouldn’t indiscriminately kill innocent people. Sometimes he even helped people in remote galaxies… Many young people worshipped the Dark Emperor as an idol.",
        "On the star network, there were many people who drew fanart of the Dark Emperor or wrote novels related to the Dark Emperor.",
        "Of course, directly using the words “Dark Emperor” or “Chaotic Zone” would be censored, so they usually used pseudonyms. ",
        "Although the original owner of Qi Shiyan’s body liked Ming Qingyu, he didn’t like other people in the imperial family. After all, those people all looked down on him.",
        "Because of this, he had a good impression of the Dark Emperor, had read many related works in private, and was one of the Dark Emperor’s admirers.",
        "However, the Dark Emperor in the legends was a cold-blooded, ruthless and decisive villain, while the real Dark Emperor, uh…",
        "Jiang Ren would laugh without caring about his image at any time. After capturing the imperial guards, he made them do a demonic dance! ",
        "If the original owner were here, he would definitely feel that the filter had been broken. Fortunately, he was not the original owner.",
        "Qi Shiyan said, “Did you come up with this song? You’re amazing! By the way, can you sign an autograph for me and take a photo with me? I’ve bought your merchandise before and I’ve always liked you.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Of course! Ah Yan, since you like me so much, why don’t you kick Ming Zheng away and be with me? I’m also very strong, and I’m the ruler of the Chaotic Zone.”",
        "Ming Zheng glared at Jiang Ren, and Qi Shiyan refused without hesitation. “No.” ",
        "“Really? You don’t know how to appreciate me! What’s so good about this guy Ming Zheng? He’s old-fashioned and boring, and lacks interest in life. It’s definitely more fun to be with me than with him.”",
        "Qi Shiyan said, “Let’s take a photo and then change the song. Didn’t you say that there are other songs?”",
        "“Yes, there are others. Let me tell you, I also caught a few imperial family members who went to remote galaxies and committed illegal acts. I have a video of them pole dancing buried in the back, but these people don’t have good figures and they also don’t dance very well. Just watch it casually. It’s not worth appreciating.”",
        "“Let’s watch the good-looking ones first.” Qi Shiyan said. ",
        "“Okay!” Jiang Ren immediately changed to another song and dance for Qi Shiyan.",
        "It was still very demonic and brainwashing music, but there were more people dancing.",
        "Jiang Ren explained to Qi Shiyan, “The extra ones are assassins sent by the retired emperor to kill those personal guards. He felt that those personal guards had humiliated him and wanted to kill all the captured guards. I don’t like fighting and killing, so I reformed them and had them dance affectionately with the guards.”",
        "Qi Shiyan agreed with Jiang Ren’s point of view. “Fighting and killing are indeed not good. It’s better for everyone to dance together!” ",
        "On the planet where Qi Shiyan originally lived, before the apocalypse, there was a kind of dance that was performed by people all over the country, called square dance*.",
        "He had never seen square dancing, but he had heard people talk about it and had also seen descriptions of it in some books.",
        "He was very interested.",
        "It was so interesting and lively to see a large group of people gathering in a square to dance! ",
        "Now, he felt that these songs and dances were very suitable to be used as square dances.",
        "The open field of the sanatorium was large and flat, suitable for dancing.",
        "They would first take a look, familiarize themselves with the song and rhythm, eat something, and then they could dance together.",
        "“Yes, it’s best for everyone to dance together.” Jiang Ren said with a smile. ",
        "The people from the sanatorium had a vague feeling that something was wrong.",
        "They were also surprised – how come His Majesty seemed to be very familiar with the Dark Emperor? The Dark Emperor had also said before that they grew up together…",
        "Please visit chrysanthemumgarden (dot) com",
        "This world was so complicated!",
        "On the star network, a large number of viewers had their filters broken by Jiang Ren’s words. ",
        "“Is this the Dark Emperor? Is this the Dark Emperor?”",
        "“I watched as those people who were fans of the military bigshots had their filters broken one by one, and I even felt proud. After all, the person I am a fan of is not from the military, but the Dark Emperor. I didn’t expect that now it would be my turn to have my filter broken.”",
        "“The Dark Emperor is actually a man who loves to have fun…”",
        "… ",
        "Those who felt sorry for the imperial guards were now also attacking the imperial family. “How many things has the imperial family hidden from us?”",
        "“Why did you say they’re dead when they’re clearly not dead?”",
        "“Why didn’t the imperial family save people, but instead wanted to assassinate people?”",
        "… ",
        "As for their loved ones being forced to dance or whatever by the Dark Emperor, as long as they were alive, just dance.",
        "Of course, there were also people on the star network who questioned Ming Zheng.",
        "They felt that he, as the emperor, was actually familiar with the Dark Emperor and asked the Dark Emperor, a wanted criminal, to investigate and obtain evidence of the imperial family’s crimes, which was a betrayal of the empire.",
        "But people didn’t care about this. ",
        "The Dark Emperor was a man of principle and never killed innocent people. They thought he was much better than the retired emperor.",
        "There were even people from the Chaotic Zone who came forward to share their own experiences. “I am a student from the Capital’s Military Academy. Few people know that I come from the Chaotic Zone. In the past, children like us from the Chaotic Zone would never have a chance to make a name for ourselves. Many of us sold our bodies and even our organs just to survive before we even reached adulthood. Survival was a very difficult thing for us, but since the Dark Emperor appeared, our lives have been getting better and better. I can even change my identity and come to the Capital Star to go to school!”",
        "“I am also a student from the Chaotic Zone. My mother’s talent is actually better than mine, but she became a commodity and was sold here and there. She started giving birth to children when she was still a teenager… She said she envied me the most because I was born later and met the Dark Emperor.”",
        "“In the past, there were many laboratories in the Chaotic Zone, and they conducted research on all kinds of things. The empire’s pharmaceutical companies also opened test sites in the Chaotic Zone. They used us as experimental subjects and tested drugs on us. After the Dark Emperor appeared, all these people were dealt with! We are finally living like human beings!” ",
        "“The Dark Emperor is the emperor in my heart!”",
        "…",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The star network was very lively.",
        "In the past, people from the Chaotic Zone tried their best to hide their origins after leaving the Chaotic Zone and coming to the empire. ",
        "If they let others know that they came from the Chaotic Zone, they would be discriminated against and even arrested.",
        "But now that the Dark Emperor had revealed his true face in Qi Shiyan’s live broadcast room, it was no big deal for them to also reveal their identities, right?",
        "What was even more shocking was that the Chaotic Zone set up an official account, and used the military’s media channels to start releasing information in waves.",
        "They released all the evidence of the imperial family’s crimes that Jiang Ren had previously shown in the live broadcast room. ",
        "They also posted the song and dance videos that Jiang Ren had played in the live broadcast room.",
        "There was also evidence that those imperial guards were still alive… Jiang Ren was a very capable person. Five years had passed, and those imperial guards had long been instigated by him to rebel.",
        "Now they were all loyal to the Chaotic Zone.",
        "Jiang Ren also did not treat them unfairly. ",
        "Before he came to the convalescent planet, he had actually thought about what he was going to do next and had made various arrangements, including picking up the family members of the imperial guards that had already surrendered to him.",
        "At this moment, people in the Chaotic Zone started to take action, but the people in the sanatorium were still having a great time, eating star worm meat and watching singing and dancing.",
        "Qi Shiyan kissed Ming Zheng from time to time, and his whole body was in an excited state.",
        "His family’s Ah Zheng was really cute! ",
        "When Ah Zheng was not clear-headed, he would take the initiative to kiss him and had no idea what “shame” was. After he became clear-headed, he became a little thin-skinned.",
        "Every time he kissed Ming Zheng, he could feel Ming Zheng’s heartbeat quickening and his shyness.",
        "But because of this, he wanted to kiss Ming Zheng even more.",
        "“Ah Yan, this is a kind of mushroom that is unique to our Chaotic Zone. It’s a little poisonous, but after cooking, the toxicity disappears. It tastes really good. You should try it.” Jiang Ren wrapped the mushroom slices with star worm meat and placed them on the plate in front of Qi Shiyan. ",
        "Qi Shiyan took a bite and said in surprise, “It’s really delicious! Make a few more. Ah Zheng will also want some.”",
        "Jiang Ren smiled and continued cooking.",
        "Please visit chrysanthemumgarden (dot) com",
        "The audience in the live broadcast room were envious. “Qi Shiyan is a complete winner in life. He is not only hugging and kissing the emperor, but also has the Dark Emperor to cook for him.”",
        "“How come the Dark Emperor is such a good cook?! I didn’t expect he even has this kind of wife attribute!” ",
        "“I really envy Qi Shiyan.”",
        "…",
        "Everyone was envious when they saw Qi Shiyan suddenly stand up after eating the mushrooms wrapped with star worm meat and say, “Everyone, let’s dance together! These songs and dances are easy to learn and suitable for square dancing. Let’s dance!”",
        "Ming Zheng froze, but Lou Jingyue, who had already smashed the cracked jar*, responded enthusiastically. “Come on, dance!” ",
        "Even Marshal Ke Lun was eager to try.",
        "Jiang Ren looked at them, feeling inexplicably guilty.",
        "He forgot to tell these people that everything right now was being broadcast live.",
        "Well, there was nothing to feel guilty about. He was not a good person. He was a wanted criminal! ",
        "Thinking of this, Jiang Ren was eager and encouraged everyone. “Yes, let’s dance together! Ming Zheng, you should learn a little too.”",
        "Ming Zheng already had a lot of emoticons, but he didn’t mind helping to add a few more.",
        "Unfortunately, Qi Shiyan did not let Jiang Ren get his wish.",
        "Qi Shiyan understood Ming Zheng to a certain extent, and knew that he didn’t like to join in the fun. Qi Shiyan didn’t want to make things difficult for Ming Zheng. “Ah Zheng, don’t dance. Ah Zheng, help me take pictures and videos!” ",
        "He wanted to take a photo to commemorate this wonderful moment.",
        "Outside the convalescent planet, Jiang Jin was stunned by the sight of such a large group of people preparing to square dance together.",
        "He had to record a video and save it.",
        "However, before he could do so, the detection devices in the spaceship started to sound alarms wildly. ",
        "When the five high-level star worms came before, the alarms were not so loud. Now the alarms were deafening. Could it be that the star worm Queen Mother had arrived?",
        "***",
        "",
        "T/N: *江湖 (Jianghu) – literally rivers and lakes. It’s the term used in wuxia, xianxia, etc. to refer to the martial arts world, and more generally, refers to a society removed from the mainstream. So Jianghu in novels can refer to anywhere that isn’t governed by and doesn’t abide by the rules of the imperial court. Here, it means the area outside of the empire’s jurisdiction.",
        "*Public square dancing in China is a form of public exercise, a little bit like how old Chinese people like to practice tai chi, but less intense (and it’s performed to music). ",
        "*破罐子破摔 (pu guan zi po shuai) – to smash an already cracked jar. Basically, to write something off as hopeless and act recklessly."
    ],
    "previous": "Ch54 - Liven Up",
    "next": "Ch56.1 - Star Worm Queen Mother"
}