{
    "title": "Ch56.2 - Star Worm Queen Mother",
    "content": [
        "Outside the convalescent planet, a battle was about to break out.",
        "In Jiang Ren’s battleship, Qi Shiyan had just finished helping Lou Jingyue eliminate the poison in his body. ",
        "After Deputy Director Zhao finished talking to Jiang Jin, he said to Lou Jingyue, “Go to the medical cabin and soak in it for a while to recover. Director Jiang said that another spaceship will be sent to pick us up tomorrow morning. It will take all of us over.”",
        "Once the battle really got underway, the convalescent planet might not be safe. It would be better for them to go to the command ship outside.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "As for why no one came to pick them up right now…there was no command ship outside the convalescent planet at the moment at all.",
        "Although the new recruits Jiang Jin found had some good equipment and spaceships, their spaceships were not comparable to those of the regular army. ",
        "High-level star worms could even directly chew a hole in their spaceships!\n\n",
        "Jiang Jin had already contacted the First Legion. If nothing unexpected happened, the most solid command ship in the entire empire, which belonged to the First Legion, would arrive tomorrow morning.",
        "“Okay.” Lou Jingyue responded decisively and lay down in a medical cabin.",
        "Seeing this, Qi Shiyan also lay down in a medical cabin.\n\n ",
        "The atmosphere was very tense, and the audience watching the live broadcast felt like their hearts were hanging by a string.",
        "“The style of this live broadcast suddenly changed from a sand sculpture* live broadcast to a war live broadcast.”",
        "“Lou Jingyue has also become serious. I’m not used to it.”\n\n",
        "“Me too……” ",
        "“Alas, I wonder how His Majesty is doing now.”",
        "…",
        "Ming Zheng, who was being missed by the audience in the live broadcast room, had already arrived outside the convalescent planet.",
        "Outside the convalescent planet, the reinforcements that had arrived had already gone to intercept the star worms. Their spaceship was also heading toward the place where high-level star worms had appeared. ",
        "They soon saw the images sent back by the vanguard and saw a huge army of star worms.",
        "As they got closer, Ming Zheng, who had taken the Dawn into space, sensed that there were two star worms emitting powerful energy fluctuations among the star worm army.",
        "The size of these two star worms was much larger than ordinary high-level star worms. They were covered with densely packed intermediate-level star worms, and there were also over a hundred high-level star worms surrounding them.",
        "Ming Zheng’s heart skipped a beat. ",
        "During the twenty years that he had fought star worms, they had once captured an image of one of the two powerful star worms that appeared this time.",
        "They had always thought that it was the star worm Queen Mother, but looking at the current situation, it was obviously not the case.",
        "",
        "There couldn’t be two star worm Queen Mothers.",
        "So, this was another kind of star worm that was stronger than a high-level star worm? ",
        "Why hadn’t this kind of star worm ever gone to the battlefield?",
        "Had the star worms been hiding their strength for the past twenty years?",
        "Ming Zheng knew very well that if he had faced a star worm like this a few years ago, it would not be the star worm that would die, but him.",
        "And once he died, the human army would most likely be defeated. ",
        "But at that time, these two star worms did not come to kill him. Instead, they only appeared now.",
        "What did they want to do?",
        "Narious thoughts flashed through his mind, but Zing Iheng’s determination became stronger and stronger.",
        "Le wanted to win. Le must win! ",
        "In the past, he wanted to protect his empire and his people, but now, he had to protect another person, Hi Shiyan.",
        "He would never let anything happen to Qi Shiyan!",
        "While Ming Zheng was determined to kill all these star worms, the one these star worms wanted to kill was Qi Shiyan.",
        "These two star worms were indeed not star worm Queen Mothers, but king worms. ",
        "The star worm Queen Mother was mainly responsible for reproduction, and her combat ability was actually not that strong, even inferior to that of high-level star worms.",
        "The strongest fighting force among the star worms were the king worms.",
        "A long, long time ago, when this star worm colony was at its strongest, they had dozens of king worms who were responsible for protecting their queen.",
        "But over the past thousand years, their queen had become increasingly weak and could no longer give birth to king worms, and could only give birth to high-level star worms. ",
        "Now, it had become difficult for the queen to even give birth to high-level star worms.",
        "Their queen was dying, but before she died, she laid an egg that would transform into a new queen.",
        "Please visit chrysanthemumgarden (dot) com",
        "All members of this star worm colony were of the queen’s bloodline. If a new queen grew and transformed within the colony, it would be difficult for her to give birth to king worms in the future. At most, she would only be able to give birth to high-level star worms.",
        "Therefore, the star worms would place the egg of the new queen into the body of an organism of another species, allowing the organism of another species to help them “nurture” the new queen. ",
        "The new queen would hatch in the body of another species, absorb the characteristics of the organisms of that species, give birth to powerful king worms, bring evolution to the entire star worm colony, and make the star worm colony stronger.",
        "This time, the creature they chose for their new queen to parasitize was a human.",
        "Humans were wonderful creatures. Although their bodies were relatively fragile, their mental power was strong and they had a splendid civilization.",
        "If their new queen was hatched in a human’s body, she would absorb the advantages of humans, and in the future, the star worms she gave birth to would not only have strong bodies, but also smart brains. ",
        "By that time, they should be able to give birth to star worms that had human appearances but could survive in the universe and had extremely strong bodies, and then successfully take over human civilization.",
        "From then on, human civilization would belong to them.",
        "Star worms had long coveted human civilization and everything that humans possessed.",
        "They only had to wait until the new queen was born, and then they would completely conquer the Human Empire. ",
        "But now, something unexpected happened to their plans.",
        "This time, all the powerful star worms came out in full force to resolve the accident.",
        "That accident was Qi Shiyan.",
        "Twenty years ago, the person chosen by the star worms to hatch their new queen was the retired emperor. ",
        "The vast majority of star worms had very low IQs, but the star worms the star worm Queen Mother gave birth to had relatively high IQs.",
        "Ever since they started the war with the Human Empire, they had been selecting a person suitable for the new queen to parasitize.",
        "After choosing and choosing, they finally chose the then emperor at that time, now the retired emperor.",
        "The retired emperor was the king* of mankind. ",
        "Their new queen must be hatched in the body of the noblest human being.",
        "After several decades, when the new queen hatched, she could take over the identity of the creature she had parasitized. By then, their queen would be the king of humans.",
        "",
        "But what they had never imagined was that the king of mankind could actually be replaced at will.",
        "Their queen, no matter how weak she was, was supreme. They would be loyal to her all their lives. ",
        "When a new queen was born and the old queen died, they would even become food for the new queen one after another, thus dying with the old queen and simultaneously helping the new queen give birth to new king worms.",
        "What about the Human Empire? The previous king was still fine, but a new king suddenly appeared, which was difficult for them to understand.",
        "That new king was also very powerful!",
        "But they didn’t really care. ",
        "No matter how powerful the new king of mankind was, he couldn’t defeat their king worms. As for whether he would kill some high-level star worms… the high-level star worms sent by them to fight against humans were basically at the end of their lives. It didn’t matter if they died. If the corpses could be brought back, they could even be used to supplement the body of their old queen.",
        "Moreover, the new king of mankind had been poisoned by them and would probably die soon.",
        "They didn’t take Ming Zheng seriously at all.",
        "But what they hadn’t expected was that Ming Zheng could actually recover, and there appeared Qi Shiyan who could eliminate the star worm poison. ",
        "It would take decades for their new queen to hatch after entering the body of another organism. During that period, the organism that was parasitized would not be able to detect the existence of the new queen.",
        "Their new queen was in the body of the retired emperor, so she had always been very safe.",
        "But Qi Shiyan had some strange abilities.",
        "Would he discover their new queen? Would he be able to separate their new queen from the retired emperor? ",
        "Also, Qi Shiyan and Ming Zheng wanted to overthrow the imperial family… If the retired emperor went to jail, what would happen to their new queen?",
        "They must kill Qi Shiyan and Ming Zheng.",
        "This time, the strongest fighting force of the star worms came out in full force.",
        "Now, there were only three king worms left in their colony. ",
        "In addition to the two king worms that Ming Zheng encountered, there was another king worm hiding in the dark.",
        "That king worm would find a way to enter the convalescent planet and then kill Qi Shiyan.",
        "Please visit chrysanthemumgarden (dot) com",
        "Seeing Ming Zheng, the two king worms shook their bodies, and then the intermediate-level star worms on their bodies were thrown out and rushed toward Ming Zheng like cannonballs.",
        "These intermediate-level star worms were indeed cannonballs. ",
        "After they approached Ming Zheng, they began to explode, exploding one after another.",
        "Ming Zheng had encountered this kind of fighting style before. His expression was solemn. While commanding the people who had followed him, he rushed toward one of the king worms.",
        "His strength had now recovered to its peak state, but at most it was only on par with a king worm.",
        "In this situation, it would be a dream for him to fight two at once. He could only target one of them and kill that one first. ",
        "While Ming Zheng was fighting the king worm, the First Legion also started a live broadcast.",
        "This live broadcast captured scenes from the battlefield.",
        "Then, the two huge king worms appeared in front of the audience. “Oh my god, what is this thing?”",
        "“The star worm Queen Mother?” ",
        "“Isn’t there only one star worm Queen Mother? This isn’t right! There are two here!”",
        "“This shouldn’t be the star worm Queen Mother. The star worms have been hiding their strength. There are star worms among them who are stronger than high-level star worms!”",
        "“Oh my god, this is unbelievable! The star worms actually know how to hide their strength?”",
        "“The military commentator said that this kind of star worm is as powerful as a SSS warrior, which means that the other side suddenly appeared with two star worms as powerful as His Majesty!” ",
        "“Will His Majesty be in trouble?”",
        "“I believe in His Majesty. His Majesty is so powerful. Nothing will happen to him!”",
        "…",
        "People were talking all over each other, but the battle situation was not as they expected. ",
        "Ming Zheng was indeed very strong, but the star worms’ king worm was even stronger than Ming Zheng.",
        "Even if Ming Zheng launched a mental attack, it didn’t have much effect on the king worm.",
        "",
        "The strongest mecha, Dawn, couldn’t even break the skin of the king worm.",
        "If Qi Shiyan had not helped Ming Zheng eliminate the star worm poison and asked Ming Zheng to stay with him in the medical cabin for several days, making Ming Zheng’s condition better than ever before, Ming Zheng would most likely have already been defeated by now. ",
        "But even if he hadn’t lost yet, the situation was not optimistic.",
        "Those who were watching the military’s live broadcast were almost dying of anxiety!",
        "On the other side, Qi Shiyan’s live broadcast room was very peaceful.",
        "A lot of star worms had arrived outside, but this time, the mecha warriors stopped all the star worms outside the convalescent star. ",
        "The battle that took place outside the atmosphere, some distance away from the convalescent planet, had little impact on the convalescent planet.",
        "Of course, there was still some impact.",
        "Qi Shiyan looked out the window and could see shooting stars from time to time.",
        "Something fell into the atmosphere. ",
        "Ming Zheng did not contact them, but the director of the sanatorium contacted them several times.",
        "He didn’t say much about the situation outside, but Qi Shiyan knew that the situation was very critical.",
        "But at this time, there was not much he could do.",
        "Qi Shiyan was lying in the medical cabin, watching a mecha operation video. When his supernatural powers recovered, he came out of the medical cabin to help people eliminate the star worm poison. ",
        "He needed to seize the time and treat more people.",
        "***",
        "T/N: *沙雕 (sha diao) – sand sculpture. Internet slang for idiot, foolish, silly, etc.",
        "*This isn’t a typo – humans use 皇帝 (huang di), emperor, for the supreme position, but for star worms, they use 王 (wang), king, to describe the emperor. That’s why “king” is always used when describing from the star worms’ perspective. "
    ],
    "previous": "Ch56.1 - Star Worm Queen Mother",
    "next": "Ch57 - King Worm"
}