{
    "title": "Ch56.1 - Star Worm Queen Mother",
    "content": [
        "Qi Shiyan was in high spirits as he looked at the crowds of people in the open field of the sanatorium.",
        "If there were so many of them dancing in the open field together, the scene would definitely be spectacular. ",
        "And just thinking about dancing in a crowd of people made him happy.",
        "Ming Zheng saw Qi Shiyan’s excitement and felt helpless.\n",
        "",
        "He didn’t know why this child liked to join in the fun so much.",
        "Fortunately, he didn’t have to dance. ",
        "Ming Zheng felt a sense of happiness.\n\n",
        "Qi Shiyan was directing. “Everyone, line up according to the team you are in for morning exercises. Once everyone has lined up, we will start dancing.”",
        "“Yes, let’s line up and dance together.” Marshal Ke Lun said with a smile.",
        "When he heard the music just now, he couldn’t help but want to dance a little. Now he could finally dance to his heart’s content.\n\n ",
        "In the future, the morning exercises in the sanatorium could be replaced with dances like this. How interesting!",
        "Others: “…” Since Qi Shiyan, Marshal Ke Lun, and Lou Jingyue were planning to dance, then they should just follow suit. After all, they were not the only ones who would be losing face.",
        "The people watching the live broadcast were already dying of laughter. “Ready to take screenshots. Start dancing quickly.”\n\n",
        "“It can be seen that Qi Shiyan really likes this kind of demonic dance, and was not just watching for fun.” ",
        "“I have some sympathy for these military bigshots. Not only have they been bombarded with shocking news one after another, but now they even have to dance.”",
        "“Deputy Director Zhao’s expression cracked.”",
        "“Deputy Director Zhao: When I joined the army, no one told me that I would have to dance.”",
        "“The top military officials gathered together in the middle of the night just to do this…” ",
        "…",
        "However, before everyone could start dancing, a shrill alarm suddenly sounded throughout the sanatorium.",
        "Such an alarm meant that something had happened, indicating that a large number of star worms were attacking the convalescent planet.",
        "This was not a good thing, but for a moment, Deputy Director Zhao felt joy in his heart. ",
        "He had dodged a bullet!",
        "No, the point now was not this, but… what exactly happened outside?",
        "",
        "Deputy Director Zhao was just wondering when Jiang Jin’s voice resounded throughout the sanatorium. “A large number of star worms have appeared outside. The danger alert has reached the highest level. I will send someone to pick you guys up immediately!”",
        "“According to the analysis of the existing information, star worms stronger than high-level star worms have appeared.” ",
        "“The latest intelligence is that there are at least a hundred high-level star worms, plus star worms with energy ezceeding the detection value, rushing here at full speed!”",
        "Aiang Ain said a lot of shocking information at once.",
        "Geputy Girector Ihao and everyone present were shocked.",
        "The Luman Smpire had invented many detection devices for star worms and had set up different levels of danger alerts. ",
        "Throughout history, the danger alert level had never reached the highest level.",
        "As for a star worm that was stronger than high-level star worms, could it be the star worm Queen Mother?",
        "Or maybe they lacked understanding of star worms, and there were still other levels of star worms between high-level star worms and the star worm Queen Mother?",
        "“The situation outside is actually so serious? No wonder Jiang Jin allowed high-level star worms to enter the convalescent planet before.” Deputy Director Zhao looked solemn, but also a little confused. ",
        "Jiang Jin shouldn’t know about what had happened on the convalescent planet. It was already outrageous that he had allowed five high-level star worms into the convalescent planet, but now he was actually asking them to go provide assistance?",
        "If it weren’t for Qi Shiyan, those five high-level star worms would have already destroyed the entire sanatorium!",
        "Ming Zheng said, “Ah Yan, wait here for me. I’ll go take a look!”",
        "Marshal Ke Lun also said, “Those who can join the battle, go and join the battle! Qi Shiyan, you can’t join the battle this time. You stay and help the rest of the people eliminate the star worm poison.” ",
        "No one knew the exact situation outside. In this situation, Qi Shiyan could not be allowed to go outside.",
        "Qi Shiyan agreed. “Okay.”",
        "He ran out to join the battle before because there were only five high-level star worms.",
        "Seeing the solemn expressions of the people around him, he realized that the situation was bad, and didn’t ask to participate in the battle. “Then let’s go to the auditorium. I will treat people right away.” ",
        "“Jiang Ren, after I leave, you protect Qi Shiyan.” Ming Zheng spoke again.",
        "The situation outside was very urgent, so he had to go out and take a look. The task of protecting Qi Shiyan was handed over to Jiang Ren.",
        "",
        "He was the child with the highest level of mental power cultivated in their laboratory, and Jiang Ren was the second highest.",
        "Many years ago, Jiang Ren’s mental power level had already reached SS-level. ",
        "He was also good at fighting. When Ming Zheng was poisoned with the star worm poison before, he could only fight Jiang Ren to a draw.",
        "It was because of his great strength that he could defeat so many of the retired emperor’s personal guards.",
        "“I will.” Jiang Ren’s expression was solemn, and then he said, “Qi Shiyan, you’d better not go to the auditorium. It’s better to go to my battleship. This way, if we encounter danger, we can leave immediately.”",
        "The auditorium could be hidden underground, which could buy some time to wait for rescue, but if there was real danger, it was better to use the battleship so that they could escape. ",
        "His battleship was custom built at his own expense and was extremely fast.",
        "Of course they might not be able to escape, but even so, the battleship could at least take them to participate in the battle.",
        "Jiang Jin arranged for a spaceship to come pick up people from the convalescent planet. While everyone was chatting, the spaceship arrived.",
        "Including Ming Zheng, those who were still able to go to the battlefield quickly boarded the spaceship and prepared to go to the battlefield. ",
        "Qi Shiyan watched them leave.",
        "The spaceship headed into space, leaving a red trail in the dark night.",
        "Qi Shiyan retracted his gaze and asked Jiang Ren, “Where is your battleship?”",
        "After that, he looked at Lou Jingyue. “Lou Jingyue, follow me. I will treat you next.” ",
        "Lou Jingyue was stunned. “It doesn’t seem to be my turn yet?”",
        "Qi Shiyan said, “Since this is an emergency, it’s best to treat those with strong combat ability first.”",
        "Lou Jingyue’s mental power was quite high, and he also had a mecha with very good performance.",
        "Curing Lou Jingyue would mean that they would have an extra mecha warrior who could fight against high-level star worms. ",
        "Jiang Ren had previously always been smiling, but now his expression was serious.",
        "He brought Qi Shiyan to his battleship which was parked not far away.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Marshal Ke Lun and Deputy Director Zhao also followed and were discussing the order in which people would receive treatment next.",
        "Marshal Ke Lun and Deputy Director Zhao were both capable of fighting. If things really reached a critical point, they could risk their lives to kill one or two high-level star worms. ",
        "They did not leave the convalescent planet to join the battle in order to protect Qi Shiyan.",
        "Qi Shiyan was the treasure of the empire and the hope for mankind to defeat the star worms. They could not let anything happen to Qi Shiyan!",
        "At the sanatorium, everything was running in an orderly manner, but the people watching the live broadcast were shocked.",
        "“What happened? What’s happening right now?” ",
        "“Over a hundred high-level star worms, and star worms that are even stronger than high-level star worms. Where did they come from?”",
        "“Is the situation critical?”",
        "“It must be very critical! When five high-level star worms came before, the military obviously didn’t take it seriously, but this time it’s different.”",
        "“Why would so many star worms suddenly come?” ",
        "“His Majesty and Qi Shiyan are too powerful. Once the star worms know about these two people, they will definitely want to kill them.”",
        "“They found out from the live broadcast, right? This live broadcast should have been shut down long ago!”",
        "“It’s useless to shut it down! When the live broadcast first started, the live broadcast platform said that they had placed Qi Shiyan on the military’s convalescent planet. At that time, the coordinates of the convalescent planet had already been leaked. Even if the live broadcast was shut down, the star worms would have come sooner or later. After all, those people on the convalescent planet are all enemies that the star worms have already identified.”",
        "“That high-level star worm that Qi Shiyan killed before should be the sentry sent ahead to gather information. Qi Shiyan felt that it was very weak. It should be that it took the initiative to lower its energy level in order to avoid detection.” ",
        "“The five high-level star worms that appeared not long ago should be the vanguard. They came to explore the situation. Now the main force is coming.”",
        "…",
        "Many people analyzed the current situation online and confirmed three things.",
        "First of all, Ming Qingyu was unforgivable for leaking military secrets. ",
        "Secondly, the star worms had made up their minds to kill Ming Zheng and Qi Shiyan.",
        "Finally, Qi Shiyan’s decision to tirelessly help people eliminate star worm poison over the past few days was a wise one.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“If Qi Shiyan hadn’t worked day and night to help His Majesty and the others in the sanatorium eliminate the star worm poison, they would definitely not have been able to stop the star worm army when it arrived.”",
        "“Thank you, Qi Shiyan!” ",
        "“Pray for His Majesty!”",
        "“His Majesty will definitely win! His Majesty, capture the star worm Queen Mother and let Qi Shiyan have a taste of her!”",
        "“Yes, capture the star worm Queen Mother and give it to Qi Shiyan to eat!”",
        "“Your Majesty, jiayou*!” ",
        "…",
        "On the star network, countless people were cheering for the convalescent planet.",
        "Marshal Duan of the Second Legion and Marshal Lou of the Third Legion were rushing to the convalescent planet.",
        "No wonder the high-level star worms on their side suddenly left. It turned out they were going to attack the convalescent planet! ",
        "The two of them originally secretly headed for the convalescent planet because they saw that the high-level star worms where they were stationed had suddenly disappeared, and they were worried about their loved ones. Now was a good opportunity to go over and provide support.",
        "And near the convalescent planet, the people from the Chaotic Zone who were waiting for their boss to finish his business and reunite with them were also fully armed and ready to fight the star worms to the death.",
        "The Chaotic Zone had never been invaded by star worms, so their hatred for star worms was not that great.",
        "But they were also human. ",
        "When mankind was in danger, they were also willing to contribute their own efforts.",
        "***",
        "T/N: *加油 (jiayou) – literally add oil. In Chinese, it’s used to encourage people and cheer them on. Similar to ganbatte in Japanese."
    ],
    "previous": "Ch55 - Dance",
    "next": "Ch56.2 - Star Worm Queen Mother"
}