{
    "title": "Ch57 - King Worm",
    "content": [
        "In the military live broadcast, the situation was not good after the human army confronted the star worm army.",
        "But no one backed down. ",
        "They all realized one thing.",
        "The star worms had been hiding their strength, so the fact that the war between them and the star worms had been able to maintain a balance over the years was all an illusion.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Twenty years ago, the star worms could have destroyed humanity, but they didn’t do it. Were they plotting a bigger conspiracy?",
        "Now, they had finally stopped pretending and had bared their sharp claws and fangs. Facing such an army of star worms, could human civilization continue? ",
        "The military named this newly emerged star worm the king worm and made public all the information the military had previously learned about star worms.\n\n",
        "“These newly emerged star worms are stronger than high-level star worms. We will temporarily call them king worms.”",
        "“At the beginning of the war with the star worms, before His Majesty ascended the throne, we saw a king worm once. At that time, there was only one, and it was guarded by high-level star worms, and it could command the other star worms around it.”",
        "“We have been studying star worms for many years. According to our research results, all star worms have genes from a star worm we call the ‘Queen Mother’. We believe that the leader of the star worms is the star worm Queen Mother.”\n\n ",
        "“In the past twenty years, we have always believed that the king worm we saw back then was the star worm Queen Mother.”",
        "“But now, the situation has changed. Since there are two king worms, it means that they are not the ‘Queen Mother’ that is the source of* the entire star worm population in our research.”",
        "“We don’t know how many king worms there are in the star worm colony, nor do we know how powerful the star worm Queen Mother is.”\n\n",
        "“We are only certain of one thing – humanity has reached a juncture of life or death. We hope that the people of the entire empire will unite!” ",
        "…",
        "In the Human Empire, many people stopped working and started paying attention to the live broadcasts and war information on the star network.",
        "Twenty years ago, the people of the Human Empire once experienced such tension. At that time, countless humans became food for the star worms.",
        "Now, it was like they had been transported back to twenty years ago. ",
        "In the universe, sensing the call of the star worm Queen Mother, the high-level star worms that were fighting in various places in the interstellar all headed toward the direction of the convalescent planet battlefield.",
        "And the powerful warriors of the Human Empire made the same choice.",
        "They chased after those high-level star worms heading toward the convalescent planet and attacked them desperately.",
        "There were even some people who previously chose to be bodyguards or mercenaries, who were now driving mechas and joining in to become part of a civilian army. ",
        "They didn’t join the army before because the casualty rate in the army was very high.",
        "Even though the military offered good benefits, they still retreated.",
        "",
        "But during this period, in conjunction with Qi Shiyan’s live broadcast, the star network was flooded with military propaganda, and it was as if a fire had been lit in their hearts.",
        "And now, everything on the star network was pouring fuel on the fire in their hearts. ",
        "They also wanted to fight for the empire and for the people!",
        "Convalescent planet.",
        "Six hours had passed since Ming Zheng left the convalescent planet.",
        "Qi Shiyan now treated those who were powerful and less seriously poisoned first. In addition to Lou Jingyue, he helped three other people eliminate the star worm poison. ",
        "After taking his hand back, Qi Shiyan immediately started eating the delicious star worm meat prepared by Jiang Ren next to him.",
        "He used to praise the food no matter what he ate, but now he didn’t say anything.",
        "He was not in a good mood.",
        "He had finally re-entered human society. He could not allow all humans in this world to be eaten by star worms. ",
        "“Qi Shiyan, after you finish eating, take a nap.” Jiang Ren said.",
        "In the previous six hours, in between helping treat people, Qi Shiyan had been learning all kinds of knowledge and had not slept at all.",
        "“Okay.” Qi Shiyan agreed.",
        "After eating, he lay down in the medical cabin and closed his eyes. ",
        "But he did not fall asleep. A feeling of uneasiness lingered in his heart.",
        "His mental power slowly spread out, covering the entire sanatorium and even more distant places.",
        "Thanks to the star worm meat and the medical cabin, Qi Shiyan’s body had recovered to its best condition.",
        "Although the original owner had been starving himself and had damaged his body, he was young after all, so there was nothing seriously wrong with this body. ",
        "And with this body in the best condition, it was finally able to withstand all of Qi Shiyan’s mental power.",
        "Lis mental power was eztremely strong, even stronger than Zing Iheng at his peak.",
        "",
        "Lowever, due to the limitations of his weak body, he was unable to use all of his mental power before.",
        "Ynly now was he able to use his full strength. ",
        "Hi Shiyan slowly adapted to his own mental power.",
        "In the apocalypse, he had a hard life, with little food and clothing, and a pale and thin face.",
        "His current condition was really better than ever.",
        "At this moment, the shrill alarm sounded again in the sanatorium. ",
        "“A king worm has entered the convalescent planet! Jiang Ren, quickly take Qi Shiyan away!”",
        "On the broadcast system, Jiang Jin’s voice seemed to be roaring.",
        "Jiang Ren’s battleship was not big. It was very small and could not accommodate too many people.",
        "At this moment, there were only a few dozen people on the battleship. The remaining people were all staying in the auditorium. ",
        "The moment the alarm sounded, Deputy Director Zhao pressed the control panel and sank the auditorium into the ground.",
        "At the same time, Jiang Ren launched the battleship.",
        "The battleship rushed out as fast as an arrow released from a bow.",
        "At the same time, a huge star worm fell where the sanatorium was located, and the entire sanatorium was instantly reduced to rubble. ",
        "The ground trembled, the mountains shook, the ground cracked, and the green trees and blue lakes near the sanatorium disappeared in an instant.",
        "Qi Shiyan, who had not yet retracted his mental power, was stunned when he saw the scene of the destroyed sanatorium.",
        "The destruction was so severe. Could those people hiding in the auditorium survive?",
        "The sanatorium that he loved from the bottom of his heart these days was gone just like that? ",
        "Before Qi Shiyan could think more about it, that star worm chased after them.",
        "Humans could detect the existence of star worms, and star worms also had some special abilities that allowed them to easily find the people they wanted to find.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The king worm had locked onto Qi Shiyan.",
        "“I didn’t expect there to be a third king worm.” Marshal Ke Lun* looked solemn. ",
        "They had also thought that there were only two king worms.",
        "Now, Ming Zheng, with many experts, was trying his best to stop the two king worms from approaching the convalescent planet.",
        "Who would have thought that there was still a third king worm hiding in the dark?!",
        "A third king worm had appeared. Would there be a fourth and fifth? Could humans defeat the star worms? ",
        "Marshal Ke Lun had a bad feeling in his heart.",
        "On the star network, the people watching the live broadcast were also shocked. “There is actually a third king worm!”",
        "“Three king worm worms have appeared. Will there be a fourth one?”",
        "“Is this king worm here to kill Qi Shiyan? Can Qi Shiyan and the others escape?” ",
        "“Quickly run! Quickly run!”",
        "…",
        "At this time, Qi Shiyan suddenly asked, “Are there two such king worms over there where Ming Zheng is?”",
        "“Yes.” Marshal Ke Lun did not hide it. ",
        "Qi Shiyan suddenly said, “Jiang Ren, let’s go back and kill that guy!”",
        "“Qi Shiyan, it’s too dangerous!” Marshal Ke Lun wanted to stop it.",
        "But Qi Shiyan was determined. “Go back!”",
        "This king worm was very powerful. In terms of mental power alone, it was on par with Ming Zheng. ",
        "It also had an extremely strong body, comparable to that of a battleship.",
        "Ming Zheng and the people outside were facing two such king worms. Even if they could barely hold on now, they would surely lose in time.",
        "",
        "Now a third one had appeared. Of course they could escape. But then what?",
        "What would the army outside the convalescent planet do? ",
        "What would the patients in the auditorium do?",
        "Following the king worm that landed on the convalescent planet, there were also some high-level star worms and intermediate-level star worms. They were densely packed on the ruins of the sanatorium and had begun digging for the auditorium that had sunk into the ground.",
        "When the auditorium was dug out, everyone inside would become food for the star worms.",
        "Not long ago, these people were being dragged by him to dance unwillingly, but now, they were about to face death. ",
        "Qi Shiyan had seen too many deaths, which made him hate death deeply.",
        "“No need to go back. It’s catching up.” Jiang Ren said.",
        "If he drove the battleship away at full speed, he could naturally take Qi Shiyan away.",
        "If he had thrown away Qi Shiyan’s communication terminal earlier, stopped Qi Shiyan’s live broadcast, and made the outside world lose track of Qi Shiyan, it would have been even easier to take Qi Shiyan away. ",
        "But the situation was so serious now. If they retreated, what would happen to other people?",
        "Twenty years ago, because the retired emperor ran away, planets were successively conquered by star worms, and countless people died in the mouths of star worms.",
        "Jiang Ren considered himself a selfish person.",
        "In the past few years, Ming Zheng had approached him countless times, hoping that he could join the army and contribute his part to stopping the star worms. ",
        "But he never agreed.",
        "He felt that this rotten, disappointing empire was not worth risking his life to protect.",
        "Compared to killing star worms, he wanted to kill the entire imperial family.",
        "After Ming Zheng was taken away from the laboratory, he entered the imperial palace. Although he was neglected, he was well fed and had good medical conditions. ",
        "But they were different.",
        "Ming Yongxin originally planned to destroy them.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng slashed himself several times with a cold face. Ming Yongxin didn’t want to lose Ming Zheng, this son with super strong mental power, so he allowed them to survive.",
        "But their living conditions were not good, and they were taken to a place where death warriors were trained. ",
        "The imperial family trained them brutally.",
        "There were still dozens of them at the time. Among them, those with genetic defects died first. Later, others died one after another because they could not withstand the extremely intense training.",
        "Among the dead was the older sister whom they all respected.",
        "She was the oldest person in their group, and she was a girl. ",
        "In the place where the death warriors were trained, she had always protected them.",
        "But in the end, she died.",
        "A member of the imperial family came looking for a bodyguard and took her away when she had just come of age.",
        "Jiang Ren thought that their sister would be able to live a better life after leaving there. ",
        "When Ming Zheng finally grew up and took him, Jiang Jin, and the youngest Jiang Mu* away, he asked to go see their sister.",
        "Without their sister, the three of them might not have survived.",
        "Then they learned that their sister was already dead.",
        "After she was taken away, she was first treated as a toy. Later, those people found out that she was bred in a laboratory and conducted experiments on her. ",
        "They tried to transform her legs into a fish tail and turn her into a mermaid.",
        "The experiment failed.",
        "His sister died.",
        "That member of the imperial family was just a member of a side branch, and he had already found a way to kill him twenty years ago, but his hatred had never diminished. ",
        "Jiang Ren thought that he would never protect this empire in his lifetime.",
        "But now… He slowed down the battleship and threw a mecha to Qi Shiyan. “This mecha is no worse than Lou Jingyue’s mecha.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Thank you.” Qi Shiyan said.",
        "“Next, let’s have a battle with that thing behind us!” Jiang Ren launched an attack with the battleship, while protecting the people in the battleship who were entering into mechas. ",
        "Qi Shiyan landed on the ground in his mecha and immediately saw the giant star worm that was chasing him.",
        "The appearance of this star worm was similar to a creature called “water bear*” on the planet where he was originally from.",
        "But it was much larger than a water bear. Wherever it passed, the ground and mountains would shake and everything would be destroyed.",
        "Qi Shiyan didn’t hesitate and rushed forward in the mecha. ",
        "This was his first time participating in such a dangerous battle, but for some reason, he was not afraid but extremely calm.",
        "His mental power covered the entire area, and everything seemed to be under his control.",
        "It seemed as if something was guiding him in the dark.",
        "The king worm opened its mouth toward Qi Shiyan. That round mouth looked like a huge, terrifying cave. ",
        "But Qi Shiyan did not dodge. Instead, he rushed in headfirst.",
        "Marshal Ke Lun, Jiang Ren and Lou Jingyue were all stunned when they saw this scene. Then, the three of them began to attack the king worm frantically, trying to make it spit out Qi Shiyan.",
        "The people watching the live broadcast were also dumbfounded.",
        "Seeing Qi Shiyan and the others decide to take on the challenge, the audience was very excited. However, right at the start, Qi Shiyan was swallowed up, which made them confused. “Qi Shiyan was swallowed by the king worm?” ",
        "“Oh my god…the gastric juices of high-level star worms can melt mechas! A king worm should be even more powerful!”",
        "“Qi Shiyan won’t just die like this, right?”",
        "“Although he has learned how to operate a mecha, he has only been learning for a few days. He…”",
        "“Qi Shiyan, don’t have an accident!” ",
        "…",
        "Many people burst into tears instantly and didn’t even dare to watch the live broadcast.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Shiyan in the live broadcast was currently still fine. After all, he was in the cockpit of the mecha.",
        "But the mecha kept sounding alarms – “The mecha has been corroded by 5%.” ",
        "“The mecha has been damaged by 10%.”",
        "“Power system failure! Power system failure!”",
        "…",
        "Qi Shiyan in the cockpit might not be able to hold on for long. ",
        "This young man, who had never been treated favorably since birth, loved life and also lived very passionately. He also tried his best to help others, but now, he was about to die in the stomach of a star worm.",
        "“Qi Shiyan! Hold on!” Countless people shouted together.",
        "At this time, Qi Shiyan used all his mental power.",
        "As soon as he saw the king worm, he discovered that the king worm’s skin could resist mental attacks. ",
        "Using mental power to attack the king worm from outside would not have much effect.",
        "But once he entered the body of the king worm, his mental power could penetrate directly and attack the king worm’s brain!",
        "Under the mental attack, the king worm went crazy and rolled on the ground.",
        "It was at this moment that the poisonous gastric juices in its body completely dissolved Qi Shiyan’s mecha. ",
        "The audience watching the live broadcast could only see the room spinning, and then suddenly the screen went black and disappeared. Not only the screen, but even the sound disappeared.",
        "This was because the communication terminal worn by Qi Shiyan, which also contained the live broadcast device, was dissolved by the star worm’s gastric juices.",
        "Even the communication terminal had been melted. Could Qi Shiyan still be alive?",
        "The entire star network was silent, and soon everyone started crying together. ",
        "Qi Shiyan knew nothing about this.",
        "He felt like he had returned to the apocalypse, with poison all around him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Fortunately, he had supernatural powers.",
        "The king worm was already dead. Qi Shiyan followed the king worm’s esophagus and began to crawl out. ",
        "This damn place was so disgusting!",
        "***",
        "T/N: *I modified this slightly as it said the Queen Mother was the one that bred/gave birth to the entire star worm population in the raws. All star worms are of the queen’s bloodline as stated in the last chapter, so she’e the original source of all their genes, but she didn’t give birth to all of them – it’s been mentioned before that star worms can also breed among themselves, which is how there are so many different types. It was also mentioned before that star worms the Queen Mother gives birth to personally usually have higher IQs, while other star worms have relatively lower IQs.",
        "*Marshal Ke Lun stayed with the non-combatants on the convalescent planet so theoretically he shouldn’t know about the king worms (because the convalescent planet isn’t connected to the star network). I can only assume they’ve received a bunch of news from Jiang Jin. ",
        "*Wow, Old Four finally has a name! I don’t think he appears in the story though lol.",
        "*Tardigrades, known colloquially as water bears or moss piglets."
    ],
    "previous": "Ch56.2 - Star Worm Queen Mother",
    "next": "Ch58 - Rescuing People"
}