{
    "title": "Ch58 - Rescuing People",
    "content": [
        "Convalescent planet.",
        "The place where Qi Shiyan and the others fought with the king worm was greeted by the soft morning light. ",
        "One of the legs of the mecha driven by Jiang Ren was missing, and one of its arms was hanging crookedly on its body. The surface of the mecha was full of pits and had many signs of corrosion and explosions.",
        "Just now, the king worm suddenly went crazy and frantically attacked everything around it. The intermediate-level star worms on its body also exploded one after another.\n",
        "",
        "Jiang Ren and the others’ mechas were almost all damaged, but fortunately the battleship was far away and was not affected.",
        "And now, the king worm was not moving. ",
        "Jiang Ren controlled his mecha and slowly moved toward where the king worm was.\n\n",
        "At this moment, Lou Jingyue rushed over. “Is the king worm dead? Where is Qi Shiyan?”",
        "Lou Jingyue’s mecha suffered the least damage because at the most critical moment, Marshal Ke Lun threw him out.",
        "At this moment, Marshal Ke Lun’s mecha was lying next to Jiang Ren. It had been deformed and there was a red light flashing on it, indicating that the driver’s condition was not optimistic.\n\n ",
        "“Go and cut open the king worm’s stomach. Qi Shiyan might still be alive.” Jiang Ren spoke, his voice trembling a little.",
        "He thought that Qi Shiyan should be dead.",
        "Just now, when the king worm went crazy, it vomited some of its gastric juices.\n\n",
        "The leg of his mecha that disappeared was corroded by the king worm’s gastric juices. ",
        "The gastric juices of this king worm were too corrosive!",
        "The mecha used by Qi Shiyan was exactly the same as his own. At this moment, Qi Shiyan’s mecha must have been melted.",
        "If even mechas could be melted, how could the human body be spared?",
        "Also, the death of the king worm must have been caused by an internal attack. ",
        "Jiang Ren thought of Qi Shiyan’s father, a hero acknowledged by the entire empire.",
        "Twenty years ago, Qi Yuncheng was unable to defeat a high-level star worm. At the critical moment, he chose to self-destruct, using his own life to exchange for the life of the high-level star worm. This also helped the imperial army discover the weaknesses of high-level star worms.",
        "Qi Shiyan should have chosen to self-destruct as well.",
        "Now that the king worm was dead, how could he survive? ",
        "Jiang Ren’s eyes were a little moist, and his heart was filled with inexplicable emotions.",
        "He thought of the documentaries he had watched before, in which planets were destroyed and humans were eaten by star worms.",
        "",
        "He had never taken those people to heart before, but at this moment, he realized that he was also a member of the human race.",
        "The true face of the imperial family had already been revealed by him in front of the entire empire. From now on, the imperial family would no longer exist. ",
        "Now, he might die a heroic death.",
        "King worms were difficult to kill. Thermal weapons couldn’t break their defense, and mental power would be blocked by their skin.",
        "But as long as he entered a king worm’s body and self-destructed, there was a chance to kill it.",
        "After Qi Shiyan’s death, his strength was second only to Ming Zheng’s. He could use this method to kill a king worm. ",
        "Jiang Ren thought a lot in an instant, and at this time, Lou Jingyue had already walked to the mouth of the king worm.",
        "His mecha couldn’t break the skin of the king worm at all. If he wanted to get Qi Shiyan out of the king worm’s stomach, should he start from the king worm’s mouth?",
        "Just as he was thinking this, Lou Jingyue saw the king worm’s mouth move.",
        "“It moved. It’s not dead yet!” Lou Jingyue exclaimed. ",
        "Except for Marshal Ke Lun who was in the worst condition, all the others who had just participated in the battle were on alert.",
        "They wanted to launch an attack, but when their previous attacks hit the king worm, they couldn’t even damage its skin.",
        "Moreover, their ammunition had been almost used up after the king worm swallowed Qi Shiyan.",
        "At this moment, a voice came from the king worm’s mouth. “Don’t attack, it’s me.” ",
        "This was Qi Shiyan’s voice!",
        "Everyone was shocked, and Lou Jingyue even asked, “Are you a human or a ghost?”",
        "Although Lou Jingyue tried to save Qi Shiyan, he, like everyone else, felt that Qi Shiyan should already be dead.",
        "The gastric puices of the king worm were really terrible! ",
        "Hi Shiyan was speechless when he heard what Oou Aingyue said. “Lelp me!”",
        "Le was running out of strength!",
        "Please visit chrysanthemumgarden (dot) com",
        "When Oou Aingyue and the others heard Hi Shiyan’s words, they saw a bald head popping out of the king worm’s mouth.",
        "This head was really shiny and white. ",
        "At the same time, a hand tremblingly stretched out from the star worm’s mouth.",
        "This was clearly a scene from a horror movie! Fortunately, Lou Jingyue was very brave. He used his mental power to control his mecha and gently pulled half of Qi Shiyan out of the star worm’s mouth.",
        "Qi Shiyan’s body was covered with the star worm‘s gastric juices, and where his mecha touched Qi Shiyan, a layer of it was immediately corroded away.",
        "But he didn’t have time to feel sorry for his mecha – because Qi Shiyan was still alive! ",
        "Lou Jingyue wanted to continue pulling him out, but Qi Shiyan stopped him. “Wash me with water and find me some clothes!”",
        "He used his supernatural powers and mental power to protect his body, but his clothes, hair and other things had been completely corroded.",
        "At this moment, he was bare naked and his body was covered with gastric juices.",
        "Jiang Ren had already jumped out of his mecha. Hearing Qi Shiyan’s words, he immediately controlled his battleship to come over. Then the robots on his battleship rushed out with water and poured it on Qi Shiyan. ",
        "Afterward, another robot rushed out with a blanket, and several nanny robots surrounded Qi Shiyan and cleaned him.",
        "While the robots were washing Qi Shiyan, the others also climbed out of their mechas to rescue Marshal Ke Lun.",
        "When they fought against the king worm this time, their mechas were basically all damaged and many people were injured, but no one died.",
        "Marshal Ke Lun, who was in the most serious condition, was also able to preserve his life after being put into a medical cabin. ",
        "After Qi Shiyan washed off the star worm gastric juices on his body, he wrapped himself in a blanket and said, “Carry me to a medical cabin and let me lie down, then go back immediately to rescue the people in the auditorium.”",
        "The king worm came to chase them, but several high-level star worms that followed the king worm to the sanatorium were digging for the auditorium.",
        "There were still six to seven thousand people in the auditorium! Qi Shiyan couldn’t bear to see those people die.",
        "Jiang Ren saw that Qi Shiyan had barely escaped death and was injured, but he was still thinking about saving people. He felt very complicated, but he agreed immediately. “Okay, we will go back and save people right away.” ",
        "After he finished speaking, he ordered the robots to move Qi Shiyan onto the battleship, and then started the battleship.",
        "It was at this time that everyone came back to their senses. Lou Jingyue was very excited. “I survived, I actually survived! Brother Yan, you are so amazing! Such a powerful king worm was killed by you! You saved me again. My life will be yours from now on…”",
        "",
        "Qi Shiyan was helpless. “Stop shouting.”",
        "Lou Jingyue stopped talking, but after a while, he couldn’t help but whisper, “Brother Yan, your head is like a peeled egg. So shiny.” ",
        "Qi Shiyan’s eyebrows were gone, which was quite interesting to see.",
        "Qi Shiyan: “…” Lou Jingyue, this guy, talked too much!",
        "Previously, because Qi Shiyan was treating people on the battleship, the best medical cabins in the sanatorium were all moved to the battleship.",
        "As soon as he lay down in the medical cabin, Qi Shiyan felt his condition improve a lot. ",
        "At this time, there was the constant sound of wailing on the star network.",
        "Qi Shiyan was swallowed by the king worm, and then his mecha was quickly corroded, and the live broadcast room started spinning…",
        "Soon, the live broadcast room was gone.",
        "Was Qi Shiyan dead? ",
        "Those who were watching the holographic live broadcast were stunned after being kicked out of the live broadcast room, while those who were watching the ordinary live broadcast stared at the black screen in a daze.",
        "After a while, everyone finally reacted. “What happened?”",
        "“Something happened to Qi Shiyan?”",
        "“This is fake, right?” ",
        "…",
        "After a brief moment of confusion, everyone burst into tears.",
        "They cried for a long time before they had time to express their emotions on the star network. “I have been watching Qi Shiyan’s live broadcast from the very beginning. He used to live a very depressing and miserable life, so when he first arrived on the convalescent planet, everything he saw was new to him and he liked everything. He was a person who was full of love for life and ardently loved all the beauty in this world. He only had a few days of freedom. How could God be so unfair?”",
        "“Qi Yuncheng is dead, and Qi Shiyan is also dead…” ",
        "“I can’t stop crying. Qi Shiyan had such a miserable life before. After landing on the convalescent planet, he also hasn’t had that many good days. I thought that in the future, he would be able to experience his own happiness and eat all kinds of delicious food. I didn’t expect that before happiness came, he would have an accident.”",
        "“This world is too cruel to Qi Shiyan!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "Most of the military personnel were participating in the battle and had little time to watch the live broadcast. ",
        "But there were still some people who paid attention to the convalescent planet through the live broadcast.",
        "Among them was Jiang Jin.",
        "Seeing what happened to Qi Shiyan, Jiang Jin felt dizzy.",
        "For various reasons, he had never shut down the live broadcast. ",
        "Not long ago, he was still thinking that broadcasting Qi Shiyan’s live broadcast would be beneficial to the war.",
        "When the soldiers on the front lines saw Qi Shiyan silently rescuing those people poisoned by star worm poison in the rear, they would be more motivated to fight.",
        "But he had never expected Qi Shiyan would die.",
        "This was all his fault. He should have shut down the live broadcast room. ",
        "It was this live broadcast room that brought disaster to Qi Shiyan.",
        "This was a child in his twenties. He was full of life and loved life, but he lost his life.",
        "When Jiang Jin learned about this matter, some other people also learned about it.",
        "They shed tears silently but did not cry out loud. ",
        "They were afraid that more people would learn about Qi Shiyan’s accident and that it would affect the morale of the front lines.",
        "If His Majesty and those fighting on the front lines knew that Qi Shiyan was dead, they would definitely suffer a great shock.",
        "They had already suffered a great blow.",
        "The king worms were so powerful, and there were more than two of them, at least three… could humanity really win? ",
        "They gritted their teeth, swallowed all their anxiety, turned on the military live broadcast, and continued to do their own thing.",
        "Capital Star.",
        "",
        "Lou Jingyue’s mother, Madam Ming, who had always been elegant and calm, was now trembling all over.",
        "Qi Shiyan was dead. Could Lou Jingyue, who was always by Qi Shiyan’s side, survive? ",
        "The king worm was so powerful that countless powerful humans gathered together and were still defeated. Could her son escape?",
        "Madam Ming thought that he probably couldn’t.",
        "Not long ago, she was still happy that her son had finally recovered, but now, her son was probably dead.",
        "There were many people who were as sad as Madam Ming. Even Ming Qingyu found it hard to accept the death of Qi Shiyan. ",
        "The star worms were so powerful. Now that Qi Shiyan was dead, Ming Zheng probably wouldn’t be able to hold on for much longer either.",
        "Was the Human Empire going to be destroyed?",
        "What about him? What did his future hold?",
        "But the retired emperor was in a good mood. ",
        "Qi Shiyan was dead. This was good, very good!",
        "As for the Human Empire being conquered by the star worms… he could escape and go live somewhere else.",
        "Twenty years ago, the retired emperor was frightened by the star worms. After that, he began to build spaceships in secret.",
        "He built an extremely large spaceship that could accommodate hundreds of thousands of people and was self-sufficient. ",
        "When the star worms came, he could take this spaceship to escape.",
        "The energy stored on this spaceship was enough to travel in the universe for hundreds of years. If they found a suitable planet, they could settle down and reproduce. If they couldn’t find a suitable planet, it didn’t matter if they kept wandering.",
        "Anyway, he would definitely be dead in a few hundred years.",
        "After watching the military live broadcast, he saw that the army led by Ming Zheng was being pushed back. The retired emperor gave his personal guards a list of imperial family members and those who served the imperial family. He ordered his personal guards to notify those on the list and have them board the spaceship. ",
        "He wanted to take this spaceship and leave the Human Empire.",
        "One of the retired emperor’s personal guards couldn’t help but ask, “Your Majesty, isn’t it not good to leave at this time?”",
        "",
        "There was a war going on at the front lines, yet the retired emperor wanted to run away?",
        "The retired emperor said, “Do you want me to stay here and become a meal for the king worms? People, come and arrest him! Don’t let him get on board!” ",
        "That guard was soon taken away by other guards.",
        "The retired emperor boarded the spaceship under the protection of his personal guards. After receiving his notice, other people also boarded the spaceship with their families.",
        "This spaceship could accommodate hundreds of thousands of people, but the retired emperor did not intend to fill it up. In the end, only 100,000 people got on board.",
        "After receiving the news from the retired emperor, these 100,000 people rushed over as soon as possible. After all, this might be their only way to survive. ",
        "Some of them abandoned their wives with whom they had a bad relationship, some abandoned their parents, and some left without notifying their children…",
        "This spaceship would be launched in two hours. Time was too tight!",
        "Fortunately, today’s means of transportation were very fast, and two hours were enough for everyone who had received the message to board the spaceship in time.",
        "At the same time, Jiang Ren’s battleship had returned to the sky above the sanatorium. ",
        "The auditorium that had sunk into the ground had already been dug out by high-level star worms, and one corner had been corroded away.",
        "But the people inside were not dead yet.",
        "Among the mecha warriors near the convalescent planet, some were fearless and rushed in following the king worm.",
        "At this moment, they were fighting against those high-level star worms to protect the people in the auditorium. ",
        "Among these people were several of Jiang Ren’s subordinates.",
        "They were fighting, so naturally they had no time to watch the live broadcast, and they had no idea what had happened to Qi Shiyan.",
        "When they saw the battleship coming back, they cheered. “The battleship is back!”",
        "“Has the king worm been killed?” ",
        "“I knew it. Our boss is the most powerful!”",
        "“Qi Shiyan is also very powerful!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "In the battleship, Jiang Ren looked at Qi Shiyan and said, “Qi Shiyan, you don’t need to take action against these high-level star worms. I will go deal with them.” ",
        "Qi Shiyan said, “Thank you! Jiang Ren, let’s kill these star worms and then go find Ming Zheng. By then, I should have recovered and can kill the king worms on his side as well.”",
        "He had no intention of taking action here. He wanted to conserve his energy to go rescue Ming Zheng.",
        "He had already mastered the method of killing king worms, and could follow the same method to kill the other two king worms.",
        "Wasn’t it just a matter of being swallowed? He could do it! ",
        "When Jiang Ren heard Qi Shiyan’s words, he suddenly felt a little envious of Ming Zheng.",
        "How could this guy Ming Zheng be so lucky?",
        "Even though he was disfigured, he was still able to find a partner who was devoted to him and loved him deeply.",
        "Jiang Ren glanced at Qi Shiyan, took out a new mecha, and rushed out. ",
        "Jiang Ren’s combat power was really strong, comparable to Ming Zheng when he was poisoned by star worm poison.",
        "In addition, there were Lou Jingyue and several other strong warriors on the battleship… They worked together and quickly killed the four high-level star worms besieging the sanatorium.",
        "However, Jiang Ren’s mecha was broken again.",
        "His fighting style was a bit reckless, and because of this, his mecha broke down very quickly. ",
        "Throwing away the mecha, Jiang Ren got back on the battleship. “Go! Let’s go find Ming Zheng!”",
        "Haha, Ming Zheng was such a useless guy that he actually needed them to go rescue him.",
        "When he arrived, he would definitely laugh at Ming Zheng!"
    ],
    "previous": "Ch57 - King Worm",
    "next": "Ch59.1 - Swallowed Again"
}