{
    "title": "Ch59.2 - Swallowed Again",
    "content": [
        "The retired emperor and the dignitaries who were invited onto the spaceship by him had already started a cocktail party.",
        "How great would it be if they could escape before the star worm army engulfed the Human Empire?! ",
        "The crew members on the spaceship were passing information from the outside world to each other.",
        "What were they going to do next? Were they really going to drive this spaceship and leave the Human Empire?\n",
        "",
        "“I don’t want to leave.”",
        "“These king worms are so strong, far beyond high-level star worms. His Majesty may not be able to stop them. If they can’t be stopped, my hometown and my relatives will definitely become food for the star worms… I won’t leave.” ",
        "“So what are we going to do?”\n\n",
        "…",
        "After a group of people discussed, the pilots who were in charge of flying the spaceship and who had retired from the First Legion said, “We know the coordinates of the convalescent planet. Why don’t we drive the spaceship to the convalescent planet?”",
        "“Okay, let’s drive to the convalescent planet!”\n\n ",
        "“The people on the spaceship are all parasites of the empire. They are the ones who deserve to become star worm food!”",
        "“If we have to die either way, I’d rather die on the battlefield!”",
        "…\n\n",
        "The retired emperor ordered that the spaceship should go in the opposite direction of the convalescent planet. ",
        "But the people in charge of flying the spaceship started it and headed for the convalescent planet.",
        "They also cut off the spaceship’s external communications and moved forward at full speed.",
        "“This spaceship is loaded with weapons, including many new weapons that the Imperial Research Institute has just developed and that even the military doesn’t have. When we get to the battlefield, we’ll just crash into a king worm and activate all the weapons!”",
        "“Yes, let’s do this. Maybe we can even kill a king worm!” ",
        "“We’re going to have a big fireworks display.”",
        "“With so many imperial family members and the retired emperor dying with us, it’s all worth it!”",
        "…",
        "The people on the spaceship were prepared to die. ",
        "The ordinary people of the empire had just received the news that a king worm had been killed.",
        "Normally, people were not allowed to read news on the star network while at work or school.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But now, school teachers gathered their students to watch the military live broadcast together.",
        "In companies, the bosses also organized a group of employees to pay attention to the situation on the front lines. ",
        "Those who were older and had experienced what had happened twenty years ago began to talk about various matters from twenty years ago.",
        "It was at this time that they learned that a king worm had been killed.",
        "The king worm that had been killed was the one that had chased Qi Shiyan.",
        "The battlefield was in ruins. Researchers collected the gastric juices of the king worm for research and discovered that it could easily corrode the empire’s best materials used in the manufacturing of mechas and battleships. ",
        "When it was dripped on an animal that had been killed as collateral damage in the battle, the animal immediately turned into a pool of blood.",
        "Hi Shiyan, who had been swallowed by the king worm, should have died.",
        "As for why the king worm died…",
        "The military speculated that Hi Shiyan must have self-destructed inside the king worm’s body. ",
        "The two king worms that were fighting with the military were still unharmed. No matter how powerful an attack was, it couldn’t hurt them at all.",
        "Now it seemed that the king worm’s weakness lay inside it.",
        "If they wanted to kill the remaining two king worms, they could only do so by exchanging lives, allowing people to be swallowed by the king worms and then self-destruct.",
        "“Before, a king worm swallowed an A-level mecha warrior. That mecha warrior self-destructed inside the king worm, but the king worm didn’t seem to feel anything at all.” ",
        "“Based on this situation, even if an S-level mecha warrior self-destructs inside a king worm, it may be useless.”",
        "“Although Qi Shiyan has never learned how to fight, his mental power is stronger than His Majesty’s, so he was able to kill a king worm.”",
        "“So, who will kill the remaining two king worms?”",
        "… ",
        "People couldn’t discuss it any further.",
        "To kill the remaining two king worms, His Majesty and other powerful warriors of the empire might need to sacrifice their lives.",
        "",
        "His Majesty’s life experience had already been made public.",
        "He was born in a laboratory and had never lived a normal life since he was young. ",
        "Later, he was taken back to the imperial palace by the retired emperor. He still lived a very difficult life there, and then he went to the battlefield at the age of eighteen.",
        "Afterward, he was poisoned by star worm poison and suffered for twenty years.",
        "Not long ago, he finally fell in love, found someone he liked, and the poison in his body was also eliminated. Just when he was about to usher in a good life, the king worms appeared and destroyed everything.",
        "Qi Shiyan was dead, and in order to kill the remaining king worms, he needed to sacrifice his life. This was too cruel to His Majesty! ",
        "People on the star network burst into tears.",
        "Those military personnel who were fighting had no time to read the news on the star network, so they didn’t know what had happened to Qi Shiyan, let alone how to kill the king worms.",
        "At this moment, they only knew that they had to keep fighting, exhausting every bit of their strength.",
        "The king worms were too strong and almost impossible to resist. They were able to hold on because His Majesty, whom they regarded as their glimmer of hope, kept fighting at the front. ",
        "His Majesty’s battle with a king worm had been going on for a whole day.",
        "If it were an ordinary person, they would have given up long ago, but His Majesty gritted his teeth and persevered.",
        "They had to persevere too!",
        "At this moment, Ming Zheng was not in good condition. ",
        "The long battle made him very tired.",
        "The king worm was too powerful, which made him feel deeply powerless.",
        "He knew that there was only one way to kill the king worm.",
        "The skin of the king worm was very special. It could not only block attacks from thermal weapons, but also block mental power attacks. ",
        "If one wanted to kill them, they could only attack from the inside.",
        "If he drove the Dawn, entered the body of the king worm, used all of his mental power to attack or self-destruct, he would most likely be able to kill a king worm.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "But after doing so, he would definitely not survive.",
        "Moreover, after killing one king worm, there was still another one. ",
        "After he used this method to kill a king worm, who would kill the remaining king worm?",
        "Qi Shiyan?",
        "How old was Qi Shiyan?",
        "He lost his parents when he was young, was abused as a child, and was bullied as he grew up. ",
        "He used to not even be able to eat enough, so he could eat a bunch of miscellaneous weeds with relish.",
        "Ming Zheng was not afraid of death, but he did not want Qi Shiyan to die.",
        "There must be other ways to kill a king worm.",
        "Ming Zheng’s body was already soaked with sweat. He stared at the king worm intently and dodged its attacks quickly, not daring to slack off in the slightest. ",
        "At this moment, a group of soldiers around him retreated to rest due to fatigue, and a new group of soldiers rushed up.",
        "Ming Zheng suddenly noticed that these people were very excited and their fighting power was amazing, so much so that they bought him a few minutes of rest.",
        "He really needed to rest.",
        "Ming Zheng retreated a little, recharged his mecha, ate nutrient solution and star worm meat, adjusted his condition, and at the same time glanced at the combat channel, wondering why these people were suddenly so passionate. ",
        "With one glance, Ming Zheng was stunned.",
        "There wasn’t much information in the combat channel. It was only publicizing one matter. “A king worm attacked the convalescent planet and was killed.”",
        "A king worm had already been killed, which was indeed very encouraging.",
        "But Ming Zheng only felt cold all over. ",
        "There were not many weapons on the convalescent planet. Although he left behind a lot of combat personnel and Jiang Ren, under normal circumstances, they could not break through the defense of the king worm and kill it.",
        "Now that a king worm had died, how did it die?",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Was it Qi Shiyan who killed the king worm by exchanging his own life?",
        "King worms were very difficult to deal with. One had to have strong mental power to see that a king worm’s weakness was inside its body. ",
        "Qi Shiyan’s mental power was stronger than his, so he should be able to figure this out.",
        "Qi Shiyan, that guy, had once disregarded his own health in order to save others.",
        "If the sanatorium was in danger, he might even sacrifice himself to save others.",
        "For a moment, Ming Zheng felt as if a basin of ice water had been poured on him, making him feel cold from head to toe. ",
        "He looked up at the two king worms not far away, and with trembling hands, he contacted Jiang Jin.",
        "The command ship had arrived. Jiang Jin should be on the command ship and could be contacted.",
        "He indeed could be contacted, and when the call connected, Ming Zheng asked, “Jiang Jin, is Qi Shiyan dead?”",
        "His whole body was trembling, but his voice was unusually calm and clear. ",
        "Jiang Jin paused for a moment before saying, “Your Majesty, we are looking for the person now…”",
        "Ming Zheng turned off the communication.",
        "Something must have happened to Qi Shiyan.",
        "He should have realized this long ago. Three hours ago, the two king worms seemed to have sensed something and went crazy for a while. After that, their offensive weakened a little. They were not as ferocious as before and began to protect themselves. ",
        "They must have sensed the death of their companion.",
        "A star worm killed Qi Shiyan!",
        "Ming Zheng could no longer suppress the hatred in his heart.",
        "He thought for a moment, contacted the command ship, and began to speak. “The king worm’s skin has no weaknesses. If you want to hurt it, you can only attack from the inside. Only if people with strong enough mental power enter its body through the mouth and self-destruct will there be a certain chance of killing one.” ",
        "“We can’t let such a powerful star worm live. I will take action.”",
        "“I… love Qi Shiyan very much.”",
        "Please visit chrysanthemumgarden (dot) com",
        "He was actually not very comfortable expressing his feelings in public.",
        "He and Qi Shiyan had completely different personalities. ",
        "But at this moment, he wanted to say something.",
        "After saying his last words, Ming Zheng began to command the battle, asking the warriors around him to attack the king worm according to his commands.",
        "He wanted the king worm to open its mouth so that he could enter its body.",
        "In fact, the king worm had such powerful gastric juices that its interior was not a weakness when faced with ordinary people. ",
        "But his mental power made him as strong as the king worm. If he staked his life, he could naturally kill the king worm.",
        "Anger stimulated Ming Zheng’s fighting power, causing it to soar, but also causing him to ignore the situation around him.",
        "He didn’t notice that a small battleship that did not belong to the military appeared next to him.",
        "Currently, there were many civilians coming to support the battlefield, and there were all kinds of battleships and spaceships. ",
        "Because the people operating the battleships were all humans, their own people, the military soldiers around Ming Zheng also did now show any reaction after they discovered the small battleship.",
        "At this moment, the king worm, which was being stared at by Ming Zheng, opened its mouth in anger and tried to bite the drone mecha beside it.",
        "Ming Zheng was about to take action when a mecha was suddenly ejected from the small battleship next to him and flew straight toward the king worm’s mouth, instantly entering the king worm’s mouth.",
        "This situation made Ming Zheng lose the opportunity to rush into the king worm’s mouth, and also made those who were watching the military live broadcast a little stunned. ",
        "This scene was somewhat familiar."
    ],
    "previous": "Ch59.1 - Swallowed Again",
    "next": "Ch60 - Embrace"
}