{
    "title": "Ch59.1 - Swallowed Again",
    "content": [
        "Jiang Ren was anxious to take Qi Shiyan to kill the other two king worms.",
        "So, after killing the four high-level star worms at the sanatorium and leaving behind the people from the battleship who had lost their combat effectiveness, including Marshal Ke Lun, he hurriedly drove the battleship away. ",
        "They were going to the front lines of the battlefield, and it was not safe for the injured to follow them. It was better for them to stay here in the sanatorium.",
        "Here, people were continuously coming to help rescue people.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "These people were not very strong. Most of them were A-level or B-level mecha warriors, but there were also a few S-level mecha warriors, including two of Jiang Ren’s subordinates.",
        "With these people around, they would be safe as long as they weren’t attacked by another king worm or too many high-level star worms. ",
        "And judging by the time, Jiang Jin was about to send someone to pick them up to take them to the command ship.\n\n",
        "Indeed, as soon as Jiang Ren left, Jiang Jin came to pick people up.",
        "When he arrived, the fighters were killing the remaining low-level and intermediate-level star worms, while the people in the auditorium were crawling out one by one through the holes gnawed by the star worms.",
        "The entire auditorium had been dug out. If the walls of the auditorium had not been made of the same materials used to manufacture mechas and battleships, which were relatively difficult to chew, and if there hadn’t been people constantly attacking the high-level star worms outside, the people inside would have probably become the high-level star worms’ meal long ago.\n\n ",
        "But even so, they still felt uncomfortable.",
        "After those high-level star worms dug out the auditorium, they rolled it around like a toy. Even though the people in the auditorium were fixed in their seats, some of them were injured by the spinning around.",
        "Seeing Jiang Jin, these people all started to speak at once. “Director Jiang, you are finally here!”\n\n",
        "“Director Jiang, what’s the situation outside?” ",
        "“Director Jiang, where is Qi Shiyan?”",
        "…",
        "They hadn’t seen Jiang Jin for a long time and were a little excited.",
        "Jiang Jin nodded at them and wanted to say something, but no words came out. ",
        "These people obviously didn’t know that Qi Shiyan was dead.",
        "He didn’t even know how to tell them.",
        "At this moment, Jiang Jin saw Marshal Ke Lun in the medical cabin next to him.",
        "He was stunned for a moment, and asked in shock, “Why is Marshal Ke Lun here?” ",
        "Didn’t Marshal Ke Lun go to fight against the king worm together with Qi Shiyan?",
        "He thought Marshal Ke Lun died in the battle with the king worm, but he was actually not dead?",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Our boss left him here. They have to go to the front lines, and it’s not convenient to take Marshal Ke Lun with them.” One of Jiang Ren’s subordinates said.",
        "Jiang Jin recognized this person and asked, “Is Jiang Ren okay?” ",
        "Hearing his question, Jiang Ren’s subordinate was unhappy. “What do you mean? Our boss is fine. Two of the four high-level star worms here were killed by our boss! He is very strong!”",
        "Jiang Jin immediately asked, “Then what about Qi Shiyan?”",
        "The person said, “We didn’t see Qi Shiyan. He should be on the boss’s battleship.”",
        "The others gave the same answer. Jiang Jin asked around and found out what had happened before. ",
        "Jiang Ren drove the battleship back and helped them kill the high-level star worms together with Lou Jingyue.",
        "Dut no one present had seen Hi Shiyan. After Aiang Een killed the high-level star worms, he immediately drove the battleship away.",
        "So, was Hi Shiyan still alive?",
        "Aiang Ain wanted to say something, but at this moment, the person he had assigned to look for the king worm sent back news. “Girector Aiang! The king worm is dead! Gead!” ",
        "Jiang Jin led people over without saying a word.",
        "The traces of the king worm were easy to find, and they soon arrived next to the king worm’s corpse.",
        "The king worm was dead.",
        "All the nearby vegetation had been destroyed, deep pits had appeared in the ground, and the nearby mountains had split, indicating that a fierce battle had taken place here. ",
        "Next to the king worm’s corpse, there was a broken mecha thrown aside.",
        "“How did the king worm die?” Jiang Jin asked.",
        "“Director Jiang, there are no injuries on the surface of the king worm. It should have died from severe internal trauma.” Jiang Jin’s subordinate replied.",
        "Jiang Jin thought of Qi Shiyan. ",
        "After entering the body of the king worm, there was no panic on Qi Shiyan’s face. His expression was very calm and he also closed his eyes.",
        "He didn’t think much about it at the time, but now thinking back, Qi Shiyan should have been launching an attack.",
        "",
        "As for what kind of attack was launched…it was most likely self-destruction.",
        "Only by self-destructing could the king worm be killed. ",
        "Even if it was not self-destruction but an ordinary mental attack, Qi Shiyan, who remained in the stomach of the king worm, would definitely not survive after the attack.",
        "The gastric juices of the king worm were too corrosive.",
        "Jiang Jin said, “Take the corpse of the king worm back and make a public announcement saying that a king worm has been killed.”",
        "Now, both the army and the people of the empire were a little demoralized. ",
        "Many people felt that humanity was doomed.",
        "At this time, releasing the news that a king worm had been killed would give them hope.",
        "Twenty years ago, Qi Yuncheng killed a high-level star worm, and humans then had the courage to fight against high-level star worms. As time went on, killing high-level star worms became less difficult.",
        "Now, Qi Shiyan killed a king worm. ",
        "King worms were not invincible either. They would definitely win!",
        "The military was very efficient in doing things.",
        "Soon, the corpse of the king worm was taken away, and photos and videos of the battle scene were posted online along with the announcement that the king worm had been killed.",
        "By now, two hours had passed since Qi Shiyan was swallowed by the king worm. ",
        "On the Capital Star, the retired emperor’s super-large spaceship officially set sail.",
        "There were 100,000 people on this spaceship, 40,000 of whom were dignitaries who hurriedly boarded the ship after receiving the news from the retired emperor in the past two hours, and the people who served them.",
        "The remaining 60,000 people were those who worked on the spaceship.",
        "There were always 50,000 to 60,000 people working on this spaceship. ",
        "They were responsible for driving the spaceship, maintaining the spaceship, cooking, growing vegetables, and cleaning on the spaceship…",
        "Although there were robots, they couldn’t completely replace humans. Moreover, in order to show off their wealth, the imperial family had always preferred to have people serve them rather than using mass-produced machines.",
        "",
        "These 60,000 people were all children born in ordinary families and who had graduated from top universities in the Human Empire.",
        "They were very satisfied with their jobs. ",
        "Their jobs had always been easy, and their salaries were very high.",
        "The housing prices on the Capital Star were high. If they worked an ordinary job, they would never have the chance to buy a house in their lifetime. But if they worked on this spaceship and saved for ten years, they would be able to buy a house.",
        "Two hours ago, the crew members on the spaceship were happily chatting. “In two years, my university student loans will be paid off.”",
        "“My parents were so happy that I was able to find such a good job. They really sacrificed a lot to support my education.” ",
        "“My child was born not long ago. She won’t have to work as hard as I do in the future.”",
        "“I just bought a house with a loan. It’s a great house!”",
        "…",
        "As they chatted, they also talked about Qi Shiyan. ",
        "They couldn’t watch the live broadcast during working hours. The star network was also banned on the spaceship, so they also had no way to watch the live broadcast.",
        "But their working conditions were good, working two days and getting one day off, so they all knew about Qi Shiyan’s live broadcast.",
        "One of them was on vacation yesterday and just came back to work today. He took out the “Edited Version of Qi Shiyan’s Live Broadcast” that he had downloaded from the star network and showed it to others.",
        "This edited version would cut out the boring content from the live broadcast and leave only the essential content. ",
        "Many people didn’t have time to watch live broadcasts, so what they actually watched were the edited versions and commentary.",
        "“Qi Shiyan is a really good person. He has constantly been helping people eliminate the star worm poison these past few days.”",
        "“Once the star worm poison in His Majesty’s and other people in the sanatorium’s bodies has been eliminated, we will definitely be able to win the war against the star worms.”",
        "“I once followed the crowd and scolded Qi Shiyan. I feel really bad about it.” ",
        "“Who doesn’t?”",
        "…",
        "Please visit chrysanthemumgarden (dot) com",
        "As they were chatting, they were informed that the spaceship would take off in two hours.",
        "Over the years, this spaceship had not been idle all the time. It had gone on test flights several times. ",
        "These workers initially thought that this was just a test voyage like before.",
        "They made various preparations skillfully, and then discovered that this time seemed a little different.",
        "The spaceship was always full of supplies. From time to time, old supplies would be replaced with new supplies.",
        "The supplies were just replaced a few days ago, but today, a lot of supplies were loaded again. ",
        "There were also many other people who boarded the spaceship today. Most of them were dignitaries who hurriedly boarded the spaceship with their families.",
        "These workers were very confused. “What’s going on?”",
        "“Why have so many people come here all of a sudden?”",
        "“Is this a long-distance voyage?” ",
        "…",
        "They were very curious, but they dared not pry into the affairs of the imperial family and could only do their work quietly.",
        "However, just as the spaceship was about to launch, one of the retired emperor’s personal guards found them and said, “I want to show you guys something.”",
        "The retired emperor’s personal guard showed them the latest “Edited Version of Qi Shiyan’s Live Broadcast” and various news on the star network. ",
        "The guard had a serious expression on his face. “Among the star worms, there appeared a king worm that is much stronger than high-level star worms. Three of them appeared at once.”",
        "“His Majesty and the powerful warriors of the empire are unable to stop the king worms, and Qi Shiyan was also swallowed by a king worm.”",
        "“This spaceship was built by the retired emperor to escape and save his own life. Now, he is leaving the empire and the people behind and fleeing for his life.”",
        "… ",
        "The personal guards of the retired emperor were all specially trained by the imperial family.",
        "The imperial family would use various means to ensure their loyalty to the imperial family.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "For example, Jiang Ren and his companions were arranged to receive training from a young age, and chips were implanted in their bodies to prevent them from betraying the imperial family.",
        "Those who were trained as imperial guards since childhood also had to undergo a long period of brainwashing before becoming imperial guards. ",
        "However, no matter how perfect a method was, there would always be loopholes.",
        "Jiang Ren had been committed to undermining the retired emperor’s power over the years. With the help of the many imperial guards he had captured before, he instigated several of the retired emperor’s current personal guards to rebel.",
        "After the retired emperor decided to escape by spaceship, these guards immediately took action.",
        "They instigated the personal guards who also disapproved of the retired emperor’s behavior, and prepared a lot of evidence to instigate the tens of thousands of crew members on the spaceship to rebel. ",
        "“The retired emperor has already abandoned everything in the empire. Even if you go and report him, you won’t gain anything. Instead, the retired emperor might go on a killing spree in anger, killing everyone who has seen these videos.” The guard said calmly, “So, don’t report him, and keep an eye on the people around you. Don’t let them go report.”",
        "The crew members were all shocked.",
        "Most of them had no intention of reporting this matter.",
        "The retired emperor chose to abandon humanity at a life or death moment. Such a person was not worthy of their service. ",
        "Most importantly, their families were not on the spaceship!",
        "Even if they followed the spaceship away and managed to avoid the star worms and survive, what about their relatives and loved ones?",
        "Moreover, they came to work on the spaceship mainly for money. They made money to give themselves and their families a better life.",
        "Now what? ",
        "Their families were going to be eaten by star worms, and if they stayed on this spaceship, they would become the lowest class and serve the imperial family members onboard for the rest of their lives.",
        "They were outstanding among ordinary people.",
        "Their family backgrounds were not good, but not bad either. They studied hard to get admitted to top universities and spent huge tuition fees to study, not to become “servants” on the spaceship and serve the powerful."
    ],
    "previous": "Ch58 - Rescuing People",
    "next": "Ch59.2 - Swallowed Again"
}