{
    "title": "Ch6 - Hunting",
    "content": [
        "Most ordinary people in this world didn’t like to stir up trouble.",
        "When the star network was full of Qi Shiyan’s black materials, even if they felt that Qi Shiyan was not at fault, they would keep their mouths shut because they did not want to be attacked online. ",
        "But now that some people were questioning it, these people started to speak up.",
        "“I’ve always felt that there was something wrong with the Qi family. If they didn’t dote on Qi Shiyan so much, Qi Shiyan wouldn’t be so willful, right?”\n",
        "Please visit chrysanthemumgarden (dot) com",
        "“There’s also something wrong with this live broadcast. Qi Shiyan is the future crown princess. How dare the live broadcast platform just throw him into a primitive forest?”",
        "“Where is the crown prince? Something happened to Qi Shiyan, but there’s no reaction from him at all?” ",
        "…\n\n",
        "Of course, the majority of people were still talking about the issue of Qi Shiyan’s mental power.",
        "Qi Yuncheng was worthy of being called a genius. He was just a member of the Qi family’s side branch and had little money. He couldn’t afford potions that could enhance mental power, but he still possessed S-level mental power.",
        "Before, Qi Shiyan only had C-level mental power, which made some people feel that he was not worthy of being Qi Yuncheng’s son. They lashed out and scolded him.\n\n ",
        "There were also some people with dark minds who, seeing that Qi Shiyan’s mental power was the same as that of ordinary people, were happy to use this matter to make fun of Qi Shiyan on the star network all day long.",
        "Everyone also unanimously felt that Qi Shiyan was not worthy of the crown prince, whose mental power had reached S-level.",
        "But now, Qi Shiyan’s mental power level was fake?\n\n",
        "So was what they knew and understood about Qi Shiyan true? ",
        "“Why would Qi Shiyan hide his mental power level?”",
        "“I slowed down the video of Qi Shiyan chasing the tiger and rewatched it. His use of mental power is amazing! He must have trained for a long time to be able to use mental power so well. He has been hiding all this. Is it because his life is different from what we imagined, and not as good as we think?”",
        "“Is the Qi Shiyan in the live broadcast really his second personality? Is it possible that this is his true face?”",
        "“Does Qi Shiyan feel that because he’s on an undeveloped planet and no one is watching him, he can let himself go?” ",
        "“Qi Shiyan is the future crown princess, but there are so many black materials about him online. This is really abnormal.”",
        "…",
        "Various doubts arose one after another.",
        "But Qi Shiyan had too many black fans. ",
        "“Qi Shiyan’s mental power level is higher than what he showed previously. Can we just brush aside what he’s done?”",
        "“Qi Shiyan participated in this live broadcast to whitewash himself. Now the whitewashing has begun!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“This is all a script!”",
        "“We don’t see anyone, but who knows if there are people hiding in the dark helping him?” ",
        "“The person in the live broadcast may not be Qi Shiyan! Ordinary people have no way to fabricate an identity, but he can definitely do it.”",
        "“That’s right. According to those people’s logic, he hid his mental power… Mental power is tested by official testing agencies, and there is no way to hide it. If someone can really hide his mental power, then it’s also not impossible for the future crown princess to find a substitute to help him go on the live broadcast.”",
        "…",
        "What these black fans said made sense. ",
        "Those who had previously scolded Qi Shiyan were more willing to believe what these black fans said. “This live broadcast is boring. It’s all fake.”",
        "“That’s right. The person in the live broadcast might not be Qi Shiyan.”",
        "“We watched Hi Shiyan grow up. Le doesn’t look like this!”",
        "… ",
        "Hi Shiyan had indeed grown up under the eyes of the people of the empire.",
        "Decause of his identity, he had been the focus of attention since he was a child. In a year, he would be photographed by the media at least ten times, not to mention the various photos and videos posted by Hi Aianuo, and the photos and videos he himself posted on the star network after he got his own star network account.",
        "Qi Shiyan had a bad temper when he was a child. Whenever he was taken out by Qi Jianuo to participate in activities, he always had a stern face.",
        "But he was still young at the time, so no one thought it was a big deal. Instead, they thought he was cute with a stern face and an expression that said “I don’t want to go to work”. ",
        "At that time, Qi Shiyan had a huge number of fans in the empire, and could be called the empire’s son.",
        "But the people saved by Qi Yuncheng were only a small part of the more than 100 billion people on more than 100 planets under the Human Empire’s jurisdiction.",
        "To most people, Qi Shiyan was no different from those celebrities.",
        "Once they discovered that Qi Shiyan did not meet their expectations, they naturally stopped being his fans. Some even felt cheated and could not help but turn against him. ",
        "When Qi Shiyan was fifteen years old, he still had a lot of fans.",
        "At that time, he still had baby fat on his face and many people liked him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "It was also that year that he, who had been receiving one-on-one education in the Qi family, went to the imperial high school to study.",
        "His academic performance was not up to par and he did not know how to handle interpersonal relationships. The students at the imperial high school were either rich or noble and would not pamper him or take care of him, so he had a hard time at school. ",
        "At that time, Ming Qingyu, who was in his third year at the school, helped him, and he fell in love with Ming Qingyu.",
        "It was Qi Shiyan who posted things related to Ming Qingyu on the star network all day long and talked about Ming Qingyu all the time, which made Ming Qingyu well known to the public.",
        "One had to know that the retired emperor married three wives and had seven sons and six daughters. Except for the current emperor, all of these people had already married and had children. The retired emperor had dozens of grandchildren in total.",
        "Ming Qingyu’s father was the eldest son of the retired emperor. He was already seventy years old this year. He had five sons, and Ming Qingyu was the third. He was not very noticeable at all. ",
        "As for Ming Qingyu’s possession of S-level mental power, it was not uncommon in the imperial family to have S-level mental power. Among the seven sons of the retired emperor, the youngest, Ming Zheng, was a genius. His mental power had already reached the SSS-level. Among the other six sons, four also had S-level mental power.",
        "There were many grandchildren, and there were even more people with high mental power among them.",
        "However, Ming Qingyu was indeed outstanding, so more and more people paid attention to him.",
        "In contrast, Qi Shiyan became less and less likable. ",
        "Under the intentional or unintentional hints from Ming Qingyu and Qi Jianuo, the young Qi Shiyan began to tinker with his face. When he was sixteen, he even went to the hospital, wanting to be injected with height-suppressing drugs and have plastic surgery.",
        "Fortunately, he was a minor at the time and the hospital refused to perform the operation.",
        "He could only allow himself to grow as tall as Ming Qingyu, and could only use a face-changing mask to modify his appearance to a certain extent.",
        "When he grew up, he wanted to be shorter, but the only way was to have his legs amputated, which would easily lead to media gossip, so he gave up. ",
        "The way Qi Shiyan dressed and acted didn’t match his height and face shape. A tall man acting timid, delicate and weak, and coquettishly acting cute was even more disgusting, so naturally fewer and fewer people liked him.",
        "At the same time, after entering high school and being in contact with outsiders for a long time, he could no longer hide his poor personality and grades.",
        "Many people felt that the child they had liked for many years was different from what they had imagined. They were extremely disappointed and stopped being fans.",
        "But at that time, everyone was still very tolerant of him. After all, he was still a minor. ",
        "But then, he became an adult.",
        "After Qi Shiyan turned 18 and got engaged to the crown prince, he did one weird thing after another. Gradually, he was blacklisted by the entire star network.",
        "",
        "Now, there were videos everywhere on the star network of Qi Shiyan crying, screaming and hitting people at school. These videos had also been edited in various ways, so that he became a joke, and liking him had become a shameful thing.",
        "The star network was bustling with activity, but Qi Shiyan on the convalescent planet knew nothing about it. ",
        "At this moment, he was cultivating feelings with the tiger in front of him.",
        "He rubbed and hugged the warm tiger, loving it very much.",
        "This was a living thing!",
        "“Big tiger, you are so cute.” ",
        "“You are the cutest and most beautiful tiger in the world!”",
        "“Come on, give daddy a kiss.”",
        "…",
        "Qi Shiyan remembered that before the apocalypse, many people treated their pets as their own children. ",
        "He wanted to do this too!",
        "Qi Shiyan hugged the tiger and kissed it.",
        "Tigers were animals, and it was difficult for humans to see any expression on their faces.",
        "But those who were watching the live broadcast always felt that they could tell that the tiger had lost all desire to live from its dull eyes, slightly open mouth, and trembling ears. ",
        "While some people were arguing, ordinary people who were simply watching the live broadcast laughed and said, “Tiger: Don’t come over here!”",
        "“A handsome man and a ferocious beast. What a harmonious picture!”",
        "“Qi Shiyan’s control over mental power is really amazing. The tiger hasn’t been able to escape his clutches!”",
        "“What the hell is with him calling himself daddy?” ",
        "“There was a video before of Qi Shiyan kicking a dog. Everyone said he was a psychopath and abused animals… Now it seems that he is indeed a psychopath. He’s actually teasing a tiger!”",
        "“This is too much! How can he tease a tiger? He should be teasing me!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "…",
        "“My dear son, are you hungry? Daddy will take you hunting!” After Qi Shiyan had been intimate with the tiger for half an hour, he finally stopped. ",
        "He actually didn’t know whether the tiger was hungry or not. The main thing was that he was hungry.",
        "There was no problem with the nutrient solution in the escape pod. When he first transmigrated over, he was weak and needed nutrition. He had already eaten one and carried the rest with him.",
        "The nutrient solution was rich in various nutrients and could make one feel full.",
        "A normal person could go without food for a day after drinking a bottle of nutrient solution, but Qi Shiyan was not a normal person. ",
        "Whether he used his mental power or supernatural powers, he needed to consume a lot of energy, so his appetite was also very big.",
        "At this moment, the nutrient solution had been completely digested by him. As for the grass and leaves he had eaten, the energy contained in these things was very little and was not enough at all.",
        "Unsure of how long he would have to stay on this undeveloped planet, Qi Shiyan planned to save the remaining nutrient solution and eat it as a last resort.",
        "As for right now, hunt and eat! ",
        "Thinking of hunting, Qi Shiyan became excited again.",
        "When he was born, most of the plants and animals on the planet he lived on had died.",
        "He had never eaten fresh vegetables or meat.",
        "There were tigers on this primitive planet, so there must be other animals as well. Once he caught one, he could eat meat! ",
        "As for the tiger beside him, it was the first mammal he had ever seen, so he was reluctant to eat it.",
        "Hugging the tiger and taking a deep breath, Qi Shiyan said, “Son, let’s go and conquer the sea of ​​stars together!”",
        "After Qi Shiyan said he wanted to hunt, he scanned the surroundings with his mental power.",
        "He discovered a burrow underground not far away. There were rabbits in the burrow. ",
        "This burrow extended in all directions and there were many rabbits inside!",
        "Rabbit meat, here he came!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan used his mental power to control the tiger, brought it to the rabbit burrow, and patted its head. “Son, wait here obediently. Daddy will catch rabbits for you to eat.”",
        "When Qi Shiyan was a child, he was taken care of by everyone. ",
        "But when he grew up a little, he used his supernatural powers to help others prolong their lives and the situation changed to him taking care of others.",
        "Unfortunately, those people all died later.",
        "He really wanted someone to take care of. He had always wanted to raise a large group of people to keep him company.",
        "Since he couldn’t raise a human right now, he could only raise a tiger first to satisfy his desire. ",
        "Thinking of this, Qi Shiyan used his fingers to comb the tiger’s messy fur.",
        "The tiger that was pinned down and unable to move: Please let it go!",
        "Qi Shiyan had already used his mental power to investigate the situation of the rabbit burrow. He found some soil and blocked some of the holes.",
        "There were still two holes that hadn’t been blocked. He then took out the all-purpose pen he had taken from the escape pod and used it to light a fire in one of the holes. ",
        "The escape pod was equipped with some survival tools to give people who used it a better chance of survival after landing on a strange planet.",
        "The all-purpose pen was one of the tools.",
        "It was called a pen, but it was actually much larger than a pen and had many functions.",
        "It could start fires, emit laser beams to injure people, pop out sharp knives, pull out thin steel wires… in short, it had many uses. ",
        "Qi Shiyan liked this thing very much.",
        "If he didn’t have the all-purpose pen, he could only use his mental power to drill wood to make a fire, which would be much slower!",
        "After lighting the fire, Qi Shiyan immediately went to the remaining hole and waited for the rabbits inside to run out.",
        "At this time, there was a person approaching him quickly. ",
        "At the same time, on this planet, in the sanatorium built by the military, a group of people were extremely anxious. “His Majesty destroyed the locator device installed on him. I don’t know where he ran off to!”",
        "“His Majesty is not in his right mind. Once he uses his mental power, his body will be corroded by poison. If he encounters danger, he may die!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Quickly bring people to go look for him!”",
        "*** ",
        "T/N: Bonus chapter for Tere. Thanks for the ko-fi!",
        "Also, I realized I may have confused some readers who are familiar with interstellar novels and are used to zerg being the enemy. It’s not a typo – the author didn’t take the usual route and doesn’t use zerg in the raws. Zerg in Chinese is 虫族 (chong zu). Chong (虫) in Chinese can mean worm/bug/insect. What I’m translating as star worm is 星虫 (xing chong) – literally star worm/bug/insect."
    ],
    "previous": "Ch5 - Questioning",
    "next": "Ch7 - Someone is Coming"
}