{
    "title": "Ch60 - Embrace",
    "content": [
        "After Jiang Ren’s battleship left the convalescent planet, it headed straight for the battlefield.",
        "Jiang Ren gave the battleship to one of his subordinates to drive. As for himself, he found a stove and started to cook star worm meat for Qi Shiyan. ",
        "He was the Dark Emperor, in charge of countless planets and nearly one billion people in the Chaotic Zone, but now he had actually become a cook. It was really unbelievable.",
        "Although he thought so, Jiang Ren was still very focused when cooking star worm meat.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Qi Shiyan, with a bald head, was lying in the medical cabin, smiling at Jiang Ren. “Jiang Ren, when you cook, put in fewer ingredients. Use pure star worm meat, which contains more energy.”",
        "Although his appetite was huge, it was also limited. ",
        "Now, he wanted to fill his stomach with star worm meat and not eat any other side dishes.\n\n",
        "Before, when he was in the king worm’s stomach, in order to resist the king worm’s gastric juices, he squeezed out all the energy in his body.",
        "Fortunately, before that, he had eaten a lot of star worm meat, which had provided him with a lot of energy and allowed him to block the erosion of the king worm’s gastric juices.",
        "The environment in the king worm’s stomach was even worse than the apocalypse he had been in before. If possible, Qi Shiyan didn’t want to go in a second time.\n\n ",
        "But if he didn’t go, how would the other two king worms be dealt with? He couldn’t let Ming Zheng stake his life, right?",
        "He could only continue to prepare himself mentally and keep going.",
        "Jiang Ren quickly cooked the star worm meat and placed the cooked star worm meat on a plate next to him.\n\n",
        "Lou Jingyue came over stealthily, secretly took a piece and ate it. After finishing it, he said, “Jiang Ren, your cooking skills are really good. This star worm meat tastes amazing!” ",
        "Jiang Ren snorted coldly. “Who allowed you to call me Jiang Ren? Call me Uncle!” Lou Jingyue, a junior, actually dared to call him by his name. How bold!",
        "Lou Jingyue quickly admitted his mistake. “Uncle, I was wrong! I definitely won’t randomly address you in the future!”",
        "His strength was far inferior to Jiang Ren’s, so it was better for him to be sensible.",
        "Jiang Ren added, “If you want to eat, then cook it yourself. While you’re at it, cook some for the others on the spaceship as well. This is for Qi Shiyan to eat.” ",
        "Lou Jingyue responded, took a pot, and started cooking the star worm meat in a hurry.",
        "He only knew how to boil the star worm meat in water. Fortunately, Jiang Ren had a lot of sauces. The star worm meat boiled in plain water tasted pretty good when dipped in the different sauces.",
        "At this time, Qi Shiyan, whose condition had improved a bit, sat up from the medical cabin and began to eat star worm meat.",
        "“Jiang Ren, your cooking skills are really good.” Qi Shiyan said. ",
        "“Then you should eat more.” Jiang Ren looked at Qi Shiyan with a complicated expression.",
        "Although Qi Shiyan survived, the situation at that time was equivalent to him dying and he also suffered a lot.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Jiang Ren subconsciously wanted to be nicer to Qi Shiyan.",
        "Speaking of which, Qi Shiyan was going to kill the other king worms next, which was equivalent to saving his life. ",
        "If it weren’t for Qi Shiyan, he had planned to sacrifice himself to kill a king worm.",
        "“I will definitely eat more!” Qi Shiyan began to eat meat in big mouthfuls.",
        "Seeing Qi Shiyan enjoying his meal, Lou Jingyue couldn’t help but ask, “Qi Shiyan, whose cooking is better, Jiang Ren’s or yours?”",
        "Qi Shiyan looked at Lou Jingyue and smiled. “Of course my cooking skills are better” ",
        "After hearing this, Lou Jingyue became even more interested in Qi Shiyan’s cooking skills.",
        "Jiang Ren had watched the live broadcast and could also see the teasing in Qi Shiyan’s eyes at this moment, so he couldn’t help but laugh.",
        "Qi Shiyan then said, “By the way, Lou Jingyue, don’t call me Brother Yan in the future. Call me Uncle Yan.”",
        "“Why? You are younger than me!” Lou Jingyue was unhappy. ",
        "Qi Shiyan said, “I am Ming Zheng’s partner. Ming Zheng is Jiang Ren’s eldest brother. You call Jiang Ren, Uncle. Doesn’t that mean you are a generation younger than Ming Zheng? You are a generation younger than Ming Zheng, so you must call me Uncle.”",
        "Lou Jingyue: This made sense, but he didn’t want to call.",
        "While Qi Shiyan was talking, he ate quickly and lay down in the medical cabin again after finishing his meal.",
        "When Qi Shiyan first crawled out of the king worm’s mouth, he looked very bad. Now he looked much better and was even in the mood to joke… Jiang Ren felt relieved and asked Qi Shiyan, “Qi Shiyan, how did you survive in the king worm’s gastric juices?” ",
        "Qi Shiyan said, “I relied on my mental power. My mental power is stronger than Ming Zheng’s, and it blocked the gastric juices.”",
        "In fact, he relied on his supernatural powers.",
        "The king worm’s gastric juices were very corrosive and were actually a kind of poison.",
        "His supernatural powers could shield him from poison. ",
        "In his previous life, he had always lived in a toxic environment, so he knew very well how to block poison!",
        "He knew how to use as little supernatural power as possible to block the most poison.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "However, the king worm’s gastric juices were so powerful that he almost had a layer of skin corroded away.",
        "Jiang Ren didn’t know whether what Qi Shiyan said was true or not, but he didn’t ask any more questions. He continued, “Let’s discuss how to deal with the other two king worms.” ",
        "Qi Shiyan said, “The method is very simple. Just launch me into the mouth of the king worm and let me attack inside the king worm’s stomach. But after the king worm dies, you have to drag it onto the spaceship as soon as possible. I don’t want to find myself in space after I crawl out of the king worm’s mouth with great difficulty. Although I probably won’t die if I stay in space for a while, it will be very uncomfortable. By the way, you also need to prepare things to help me clean my body and things to help me cover my body…”",
        "While Hi Shiyan talked about precautions, Aiang Een listened carefully and added some more.",
        "Mor ezample, they needed to find a spaceship with a thick enough bottom to accommodate the king worm.",
        "Ytherwise, when Hi Shiyan climbed out, he might corrode a hole in the spaceship. ",
        "Oou Aingyue heard this and said, “Jan’t we pust lift the king worm’s mouth higher and pour water into it directly so that Drother Tan will be clean when he crawls out?”",
        "Yes, they could do this. This way, tney didn’t have to worry about the king worm’s gastric juices flowing out.",
        "Lou Jingyue was still very smart.",
        "By the time they had finished discussing, they had arrived at the battlefield. ",
        "The two king worms were some distance away from each other.",
        "Now, the human army was divided into two teams. One team, led by Ming Zheng, blocked a king worm, and the other team, led by Shan Xi and Lei Yin, blocked another king worm.",
        "They went directly to Ming Zheng.",
        "Qi Shiyan said, “Jiang Ren, is there any way to contact Ming Zheng?” He could kill a king worm on his own, but it would be best if Ming Zheng could help him in this matter. ",
        "Jiang Ren said, “I’ll try, but this is a battlefield, and we probably won’t be able to contact Ming Zheng.”",
        "Ming Zheng was busy fighting, so he would definitely block all communications that were not related to the war and only accept orders from the command ship.",
        "It was almost impossible for them to contact Ming Zheng at this time.",
        "If they were on the convalescent planet, as long as they got close and shouted, Ming Zheng would be able to hear them. ",
        "But this was in outer space.",
        "Jiang Ren sent a communication request to Ming Zheng, but Ming Zheng did not answer.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He sent communication requests to Jiang Jin and Jiang Mu, but neither of them answered.",
        "At this moment, these two people were also very busy! ",
        "And he only had their private contact information. At this moment, they were definitely not answering private communications.",
        "“Forget it, let’s contact him later.” Qi Shiyan began to study the battle situation outside. As he studied it, his expression changed. “Ming Zheng, this guy, is looking for death!”",
        "“What?” Jiang Ren asked.",
        "Qi Shiyan said, “He is forcing the king worm to open its mouth. What does he want to do?” ",
        "Qi Shiyan was in a hurry to find Ming Zheng because he knew that Ming Zheng, like him, could see the weaknesses of the king worm.",
        "He was afraid that Ming Zheng would launch a suicide attack on the king worm.",
        "It now seemed that Ming Zheng really intended to do so.",
        "Qi Shiyan added, “He doesn’t want to live anymore. He plans to fight the king worm to the death! How could he do this? He didn’t even say goodbye to me!” ",
        "When Jiang Ren heard Qi Shiyan’s words, he suddenly thought of something.",
        "Was the incident of Qi Shiyan rushing into the king worm’s mouth broadcast live?",
        "At that time, he thought Qi Shiyan was dead. Did the people in Qi Shiyan’s live broadcast room think so too?",
        "The current situation was not critical enough for the commander Ming Zheng to fight the king worm to the death, but Ming Zheng was planning to sacrifice his life. Did he already know that Qi Shiyan was “dead”? ",
        "When Qi Shiyan first crawled out of the king worm’s mouth, Jiang Ren had thought about the live broadcast, fearing that Qi Shiyan’s naked appearance would be broadcast live.",
        "He had breathed a sigh of relief when he saw that the communication terminal on Qi Shiyan’s wrist had been corroded cleanly.",
        "The communication terminal was gone, so the live broadcast must have stopped.",
        "Later, there were too many things going on and he forgot about it. ",
        "And now… Jiang Ren felt a little guilty.",
        "Qi Shiyan was a little angry, but still forgave Ming Zheng. “Forget it, he also just wants to save people… Jiang Ren, let’s get ready. I must rush into the king worm’s mouth first! I want to follow Ming Zheng’s path and leave Ming Zheng with no way out!”",
        "Please visit chrysanthemumgarden (dot) com",
        "Jiang Ren said, “Then you get into the mecha right away. There is a mecha ejection device on my battleship. I will launch you directly into the mouth of the king worm. As for Ming Zheng, I will stop him when the time comes.”",
        "“Okay.” Qi Shiyan agreed, then carried a pile of dried star worm meat and entered the new mecha that Jiang Ren gave him. ",
        "Jiang Ren had so many mechas that Qi Shiyan couldn’t help but ask, “How many mechas do you have?”",
        "Jiang Ren said, “I bought ten at once, and now I still have five left.”",
        "“You are so rich.” Qi Shiyan was a little envious. After all, the original owner was very poor.",
        "Qi Shiyan’s speculation was correct. Ming Zheng was indeed forcing the king worm to open its mouth. ",
        "The king worm was huge and had many legs, but its legs were very short, making it difficult for it to attack with its legs.",
        "When it attacked people, it usually used its mouth.",
        "It already knew about the death of its companion and how its companion had died, so it was unwilling to open its mouth. However, faced with the continuous provocations from humans, it could not help but open its mouth and bite the mecha near its mouth.",
        "But it was still very careful. When doing this, it deliberately turned its head to the side to prevent the Dawn from entering its mouth while it was unprepared. ",
        "Among the people present, the only one who posed a threat to it was Ming Zheng.",
        "As long as the person who entered its mouth was not Ming Zheng, there would be no threat to it.",
        "The king worm’s behavior indeed prevented Ming Zheng from entering its mouth right away.",
        "But another mecha rushed into its mouth. ",
        "The king worm didn’t take it seriously.",
        "It could easily digest ordinary mecha warriors and turn them into its energy.",
        "But the king worm miscalculated.",
        "As soon as the mecha entered its mouth, it was attacked by mental power. ",
        "The person in this mecha was stronger than Ming Zheng!",
        "They, the star worms, had always been hiding their strength. As the strongest fighting force of the colony, they, the king worms, had never appeared on the battlefield.",
        "Please visit chrysanthemumgarden (dot) com",
        "Could it be that humans had also been hiding their strength?",
        "This thought flashed through the king worm’s mind, and then it lost the ability to think and began to roll and struggle in space. ",
        "At this time, Ming Zheng had already caught Lou Jingyue who had jumped off Jiang Ren’s battleship and connected the communication directly. “Lou Jingyue, who is that? Is it Jiang Ren?”",
        "Lou Jingyue jumped off the battleship, wanting to fight against the high-level star worms.",
        "But he didn’t expect that he would be caught by the Dawn as soon as he jumped off.",
        "His mecha had been registered with the military, and Ming Zheng, as the commander, could directly establish communication with his mecha. ",
        "Hearing Ming Zheng’s question, Lou Jingyue said, “That’s not Jiang Ren. It’s Qi Shiyan”",
        "“What?” Ming Zheng was shocked. Qi Shiyan didn’t die before, but now, Qi Shiyan died in front of him?",
        "The king worm was obviously in pain, rolling and twitching. Qi Shiyan, who was swallowed by the king worm, had a high probability of not surviving.",
        "“Your Majesty, stop talking so much. Quickly find a spaceship that can accommodate this king worm so that we can go and rescue Qi Shiyan!” Lou Jingyue spoke, feeling he was a little bit awesome. ",
        "He actually told His Majesty to stop talking so much!",
        "Thinking of this, Lou Jingyue pulled Jiang Ren’s contact number into the communication.",
        "Jiang Ren said concisely, “Qi Shiyan has already killed a king worm. He has a method to kill king worms, but we have to rescue him in time.”",
        "After saying that, Jiang Ren began to talk about the various things that were needed. ",
        "Ming Zheng’s body began to tremble again, but he remained very calm and gave one order after another to his subordinates.",
        "The people of the First Legion were also very obedient. Even though Ming Zheng’s orders were strange, they still listened and got busy according to Ming Zheng’s requirements.",
        "On the star network, people watching the military live broadcast were a little dumbfounded. “What’s going on?”",
        "“That mecha just now was Jiang Ren’s, right?” ",
        "“It’s Jiang Ren’s. Jiang Ren seems to have many mechas of the same model. The mecha he gave Qi Shiyan to use before was this type.”",
        "“So, Jiang Ren rushed into the king worm’s mouth before His Majesty could?”",
        "",
        "…",
        "The military had deployed many cameras on the battlefield. ",
        "People watching the live broadcast were unaware of Ming Zheng’s communication with others and the various orders he had issued, but they could see the overall situation and the battle situation clearly.",
        "When Qi Shiyan realized that Ming Zheng was deliberately forcing the king worm to open his mouth, the audience also realized it.",
        "After seeing this, countless people on the star network shed tears and prayed for Ming Zheng.",
        "They felt so uncomfortable. ",
        "Through Qi Shiyan’s live broadcast, they fell in love with Qi Shiyan and Ming Zheng.",
        "But now, they had to watch these two people die?",
        "This was definitely the saddest live broadcast they had ever seen!",
        "Then, just when they were feeling uncomfortable, a mecha suddenly rushed out, got ahead of Ming Zheng, and entered the star worm’s mouth. ",
        "That was Jiang Ren’s mecha.",
        "“Wuwuwu, I didn’t expect the Dark Emperor to be so good…”",
        "“His Majesty survived. How great!”",
        "“Upstairs, don’t be too happy. There is still another king worm! And with the Dark Emperor’s strength, he may not be able to kill this king worm.” ",
        "“Damn these king worms!”",
        "…",
        "People were discussing, and then they discovered that the mechas, battleships, and spaceships on the battlefield, including the Dawn, were all busy.",
        "They also noticed that the king worm’s struggles were becoming increasingly weaker and it seemed like it was about to die. ",
        "“The king worm is about to die!”",
        "“Marvelous!”",
        "Please visit chrysanthemumgarden (dot) com",
        "“The Heavens have blessed us!”",
        "People’s eyes were filled with tears, and Jiang Ren’s name was added to the list of those they were grateful to. ",
        "They thought that humanity was doomed, but unexpectedly they still saw hope for victory.",
        "At this moment, the people on the battlefield couldn’t think so much.",
        "Ming Zheng arranged a group of people to deal with the high-level star worms and intermediate-level and low-level star worms around the king worm, while he personally led people to drag the still struggling king worm onto a spaceship.",
        "Jiang Ren followed, and the two of them controlled the body of the king worm, making it unable to move while it struggled to death. Then they asked someone to bring water, pried open the king worm’s mouth and poured the water in. ",
        "The king worm was already dead. In its dying twitches, it looked a bit pitiful, but it did not arouse any sympathy at all. Many mecha warriors controlled it and poured water into its mouth.",
        "This spaceship was very large and was a place for combat mecha warriors to rest. There were also many mecha maintenance technicians who were responsible for repairing mechas.",
        "Because of this, the military arranged a live broadcast camera on this spaceship.",
        "The camera was aimed at the king worm and broadcast the scene live, making the people watching the live broadcast a little confused. ",
        "“What are they doing?”",
        "“Giving poison to the king worm? But it seems to be water.”",
        "“Are they trying to save the person in the stomach of the king worm?”",
        "“Wait, is the one in the king worm’s stomach really Jiang Ren? Why is there another person operating the same type of mecha outside?” ",
        "…",
        "Not only were the audience watching the live broadcast confused, but the mecha warriors present also didn’t understand what Ming Zheng was trying to do.",
        "The king worm once vomited gastric juices to attack approaching battleships. They all knew how terrible the king worm’s gastric juices were.",
        "In addition to gastric juices, the king worm’s body also contained a high concentration of star worm poison. ",
        "Now Ming Zheng had brought the king worm onto the spaceship. If the mecha of a mecha warrior was corroded by the king worm’s gastric juices, they would most likely be poisoned by the star worm poison.",
        "Everything was fine a few days ago, but not long ago, something happened to Qi Shiyan!",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Star worm poison had now become a difficult thing to treat.",
        "By the way, did His Majesty still not know that something had happened to Qi Shiyan? ",
        "While everyone was thinking about various things, Qi Shiyan was trying hard to climb out.",
        "There was too much water, which made it very difficult for him to climb.",
        "But this also washed away the gastric juices on his body, allowing him to save some of his supernatural powers.",
        "Finally, Qi Shiyan approached the mouth opening. ",
        "Just then, a familiar mecha arm reached in, pulled him out, and covered him with a thick blanket.",
        "If this mecha wasn’t Dawn, then who else could it be?",
        "Although he had been rinsed with water, there were still residual star worm gastric juices on his body, and a shallow layer of the Dawn’s mecha arm was still corroded. The place where he was lying and the blanket covering him were also corroded a little.",
        "But he survived again! ",
        "Qi Shiyan was in a very good mood. He had gotten used to the task of killing king worms. After a short rest, he could go and kill another king worm.",
        "Just as he was thinking this, Qi Shiyan saw the door of the Dawn’s cockpit opening. Ming Zheng came out and hugged him.",
        "“Ming Zheng, I still have star worm gastric juices on my body.” Qi Shiyan tried to stop him, but it was too late.",
        "Ming Zheng put his face against his and was immediately burned. Fortunately, at this time, someone poured water on them, several buckets of it. ",
        "Although a shallow layer of the spaceship’s deck was corroded and Ming Zheng’s military boots and uniform became riddled with holes, the gastric juices on Qi Shiyan’s body were finally washed away.",
        "Jiang Ren operated his mecha and picked up Ming Zheng and Qi Shiyan. He continued to wash them while shouting, “Where’s the medical cabin? Medical cabin!”",
        "Qi Shiyan and Ming Zheng were quickly sent to different medical cabins. A yellow light lit up in both of their medical cabins at the same time.",
        "Ming Zheng had been fighting for a whole day and his body was already overloaded. Qi Shiyan was in a similar situation. ",
        "At this time, people on the star network were extremely surprised.",
        "Qi Shiyan was still alive! Alive!",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The previous king worm must have been killed by Qi Shiyan. After killing a king worm, Qi Shiyan survived, and now, he had killed another king worm.",
        "A huge surprise filled the hearts of every audience member, and people cried again. ",
        "But this time, when they cried, they were not sad, but full of joy."
    ],
    "previous": "Ch59.2 - Swallowed Again",
    "next": "Ch61 - Iron Head Spaceship"
}