{
    "title": "Ch61 - Iron Head Spaceship",
    "content": [
        "Qi Shiyan lay down in the medical cabin and instantly felt more comfortable.",
        "All the pores on his body opened up and began to absorb the medicinal power of the healing fluid to repair his body. ",
        "This was how people should live. He hated places full of poison.",
        "Fortunately, he didn’t stay in the king worm’s stomach for long.\n",
        "",
        "Qi Shiyan took a deep breath, turned his head and glared at Ming Zheng beside him.",
        "Before in the sanatorium, neither of them was sick. They just needed to generally nurse their bodies back to health and could lie in the same medical cabin. ",
        "But this time, their medical needs were different, so they lay down separately.\n\n",
        "However, the medical cabins were transparent, which allowed them to see each other.",
        "Ming Zheng was wearing a breathing mask, and his entire body was inside a medical cabin filled with healing fluid. He looked at him with wide eyes, the left half of his face sporting a wound from the corrosive gastric juices.",
        "When Qi Shiyan saw the wound, he was furious.\n\n ",
        "His face was not covered by the healing fluid, so he could talk, and he talked non-stop.",
        "“Ming Zheng, why are you so stupid? Not only did you run out of the mecha, but you actually hugged me and put your face next to mine… Aren’t you afraid of getting hurt?”",
        "“There’s still star worm poison out there. What if you get poisoned again?”\n\n",
        "“You are too reckless!” ",
        "After a few more words, Qi Shiyan asked worriedly, “Ah Zheng, does your face hurt?”",
        "Ming Zheng looked at Qi Shiyan intently.",
        "Qi Shiyan’s head was very bald. Not to mention hair and eyebrows, he didn’t even have eyelashes.",
        "But he was full of energy. ",
        "It was quite embarrassing to be scolded by someone who was almost twenty years younger than him, but Ming Zheng just felt touched.",
        "He was completely submerged in the medical cabin’s healing fluid and couldn’t speak, so he typed on the communication terminal and projected it onto the medical cabin. “It doesn’t hurt. I was wrong this time.”",
        "He really shouldn’t have done that.",
        "He was the supreme commander in this battle and he shouldn’t have put himself in danger. ",
        "But he was too agitated just now.",
        "Even though he knew there was star worm poison nearby and that Qi Shiyan still had king worm gastric juices on his body, he still couldn’t help but go out and hug Qi Shiyan.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "At that time, he couldn’t control his emotions.",
        "“You have to take care of yourself in the future, you know?” Qi Shiyan said earnestly, “There’s another thing you did that makes me angry. Ming Zheng, were you trying to force the king worm to open its mouth? Did you want to fight the king worm to the death? The situation has not reached the most critical point, and there is also more than one king worm. How could it be the time for you, the supreme commander, to fight to the death? What were you thinking?” ",
        "As Qi Shiyan spoke, his voice became louder.",
        "Ming Zheng typed again. “I was wrong.”",
        "Seeing Ming Zheng admit his mistake, Qi Shiyan’s voice returned to normal. “Why didn’t you consider me? Ah Zheng, what if something happens to you? What would I do?”",
        "Ming Zheng continued typing. “I thought something had happened to you. After one king worm died, the remaining two king worms began to retreat. These king worms have never participated in battles before. I deduced that there should be only these three king worms among the star worms. If I got rid of one more, there would only be one king worm left…” ",
        "He was actually very rational.",
        "On the convalescent planet, when he learned that the star worm army was about to arrive, he immediately left Qi Shiyan and came to fight on the front lines.",
        "He had thought that he could stop the army of star worms, but he hadn’t expected that there would be more than two king worms. One of them actually bypassed the defense line, entered the convalescent planet, and attacked Qi Shiyan.",
        "After knowing this, he made a decision in a very short amount of time. ",
        "Qi Shiyan had already killed one king worm. If he killed another one, Jiang Ren, Shan Xi, Lei Yin and the others should be able to deal with the remaining one.",
        "In this way, the situation would be better than before Qi Shiyan appeared.",
        "“You thought something had happened to me?” Qi Shiyan was stunned.",
        "Ming Zheng typed. “They found the corpse of a king worm on the convalescent planet.” ",
        "Qi Shiyan: “…” He really hadn’t thought about this.",
        "After rescuing the people in the sanatorium, he did not show up because of his poor health and because he was in a hurry to see Ming Zheng.",
        "Ming Zheng was very smart and had already clearly understood the king worm’s weakness. That was probably why he had such wild thoughts.",
        "So, Ming Zheng wanted to commit suicide for love? ",
        "Why did he feel so happy for no reason?",
        "Qi Shiyan said, “Ming Zheng, I know what you did was right, but I am still very angry, and I can’t be coaxed in the short term.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Jiang Jin rushed over and apologized to Qi Shiyan, “Young Master Qi, I’m sorry, I gave His Majesty the wrong information.”",
        "“Who are you?” Qi Shiyan asked. ",
        "Jiang Jin said, “I am the director of the sanatorium, Jiang Jin.”",
        "It turned out that this was the legendary Girector Aiang. Hi Shiyan looked at Aiang Ain curiously, then turned his head to look at Zing Iheng who was lying in the medical cabin nezt to him.",
        "It was still Zpng Iheng who was better looking.",
        "“Ah Iheng, I missed you so much.” ",
        "Ming Zheng said, “I missed you too.”",
        "Qi Shiyan, who had just said that he “could not be coaxed”, laughed happily.",
        "After he realized that Ming Zheng wanted to die together with the king worm, his heart had been tense.",
        "Now, he finally felt relieved and had time to think about other things. ",
        "Lying in the medical cabin, he asked Jiang Jin. “Can I eat while lying like this?”",
        "Jiang Jin immediately said, “You can still drink nutrient solution while lying in the medical cabin. If you want to eat something else, just mash it into a paste.”",
        "“Then make me some ground up star worm meat and I’ll get up and eat it.” Qi Shiyan said.",
        "He was really tired at this moment. ",
        "And he wanted to recover quickly. After all, there was still a king worm outside that had not been killed yet.",
        "“I’ll prepare it right away.” Jiang Jin asked the chef on the ship to come and prepare food for Qi Shiyan.",
        "As for Jiang Ren, after Qi Shiyan and Ming Zheng entered their medical cabins, Jiang Ren had gone out to fight the star worms. Other people who were able to fight also shouted and rushed out to kill the star worms.",
        "Although one king worm had been dealt with, there was still one outside, and there were also many high-level star worms surrounding that king worm. ",
        "They had to find ways to kill more star worms and eliminate their vitality.",
        "The most important thing was that Qi Shiyan killed a king worm in front of all of them!",
        "Please visit chrysanthemumgarden (dot) com",
        "This was really exciting. They felt full of energy, and wanted to go and fight and kill star worms!",
        "Ming Zheng actually wanted to go as well, but before it was all on him to attract the king worm’s attention and hold the king worm back to prevent it from going on a killing spree. ",
        "At that time, everyone else could take turns to rest, but he could not. He had already been fighting intensively for the whole day.",
        "He needed to rest.",
        "The command was handed over to Marshal Duan of the Second Legion. His medical cabin was set to open only after three hours. The Dawn was also towed away for repairs. Even if Ming Zheng wanted to go out, he couldn’t.",
        "He just lay in the medical cabin, watching Qi Shiyan eat star worm meat congee. ",
        "Then, he was fed some as well.",
        "When Jiang Jin saw this scene, his eyes felt a little sore.",
        "He wanted to broadcast this scene live for everyone to see, but he didn’t dare.",
        "Jiang Jin asked, “Your Majesty, can I take a photo and make it public? Everyone is very worried about you and Qi Shiyan.” ",
        "Ming Zheng looked at Qi Shiyan.",
        "Qi Shiyan agreed, “Okay.”",
        "Although he had no hair now, he was a confident person. He thought that he was still very handsome even with a bald head.",
        "After all, Ming Zheng still looked at him without even blinking. ",
        "He didn’t care about all the ugly photos of the original owner, so what did one more bald photo matter now?",
        "Qi Shiyan was most concerned about something else now. “Can you break the skin of the king worm? I don’t know if the meat of the king worm is delicious or not. I want to try it.”",
        "He had been swallowed by the king worms twice. It was not too much to eat some king worm meat, right?",
        "Jiang Jin said, “I’ll have someone do some research.” ",
        "“Thank you!” Qi Shiyan smiled, then looked at Ming Zheng beside him.",
        "Now that he had recovered a little, he had the energy to brag to Ming Zheng. “Ah Zheng, you look so handsome when you fight!”",
        "",
        "“Ah Zheng, I came to you in a hurry because I was afraid that you would perish together with the king worm. I couldn’t bear to see you have an accident.”",
        "“Ah Zheng, I was really worried about you before. After all, you are my baby*.” ",
        "…",
        "One must tell others about what they had done! Qi Shiyan told Ming Zheng all about his previous worries and fears.",
        "Ming Zheng’s heartbeat was so abnormal that it was detected by the medical cabin.",
        "He simply couldn’t withstand such straightforward and passionate emotions. ",
        "Jiang Jin was in a very good mood watching this scene.",
        "He sent out the photo he had taken so that the soldiers who were fighting and the public on the star network could all see it.",
        "The live camera on their spaceship had constantly been filming the king worm.",
        "The people watched Qi Shiyan and Ming Zheng being taken away, and then they had no idea what happened next. ",
        "“How is Qi Shiyan?”",
        "“The one who came out of the king worm’s stomach was Qi Shiyan, right?”",
        "“Military, don’t be silent! Quickly tell us about Qi Shiyan’s situation!”",
        "“Wuwuwu, Qi Shiyan must be okay!” ",
        "…",
        "Just when they were anxious, a photo of Qi Shiyan and Ming Zheng lying in medical cabins was posted on the star network.",
        "In the photo, the yellow light was flashing in the medical cabins of both people, indicating that their conditions were not very good, but they were alive!",
        "Countless people shed tears when looking at this photo. “That’s great. It’s really great.” ",
        "“I’m so happy that I can’t stop crying.”",
        "“Great! We have hope again!”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“The CP I ship didn’t have a BE (bad ending)! Wuwuwu!”",
        "“Your Majesty, Qi Shiyan, you must be well!” ",
        "…",
        "It was not until a long time later that someone noticed Qi Shiyan’s bald head.",
        "“I suddenly feel that bald heads look good.”",
        "“I want to shave my head!” ",
        "“I need to remain logical! I’m so excited right now that I want to do something…”",
        "…",
        "At the same time, an extremely huge spaceship was flying in space.",
        "The total living area of ​​this spaceship was comparable to that of some megacities, but the universe was so vast that it still appeared small in the universe. ",
        "This was the spaceship the retired emperor used to flee for his life.",
        "After all, it was used for escaping, so this spaceship had sufficient power and could move forward very quickly. Of course, the energy consumption would also be relatively large, and it might even damage the spaceship itself.",
        "Normally, this high-speed mode could only be driven for a short time, but at this moment, the pilot of the spaceship ignored the condition of the spaceship and the safety of the passengers on the spaceship and kept driving in high-speed mode.",
        "In high-speed mode, the cocktail party would definitely not be able to continue. ",
        "The retired emperor realized that something was wrong and wanted to stop them, but he was staggering and couldn’t stand straight.",
        "“Your Majesty, your body can’t take it!” The guards rushed forward and sent the retired emperor into a sleeping cabin.",
        "They also considerately sent other dignitaries into sleeping cabins.",
        "The high-speed mode would hurt the passengers, but entering a sleeping cabin would greatly reduce the damage. ",
        "They were all doing this for the good of the retired emperor.",
        "The retired emperor looked at his guards unwillingly, but soon lost consciousness.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "And the spaceship rushed toward the border.",
        "Because the spaceship was constantly in high-speed mode, the people on the spaceship were not in good condition and couldn’t receive any signals at all, so they had no idea of ​​the situation outside. ",
        "They didn’t even have a rough idea of ​​where they were.",
        "But they turned the star worm detection device on the spaceship to the maximum.",
        "In this way, they could discover the traces of star worms even if they were far away from them.",
        "“Are we close to the border?” The main pilot spat out blood. ",
        "“Judging from the time, we should be there soon.” Tears of blood flowed from the co-pilot’s eyes.",
        "“Slow down.” The main pilot pressed a button.",
        "The co-pilot began to turn off other devices that only had to be turned on in high-speed mode.",
        "It was at this time that the star worm detection device on the spaceship showed traces of star worms ahead. ",
        "According to the information provided by the detection device, there were star worms in the asteroid belt not far from them, but because the asteroid belt blocked most of the detection device, the detection device couldn’t clearly determine the number of star worms inside.",
        "After slowing down, the main pilot’s condition improved a lot.",
        "He looked at the star map and was somewhat happy. “If we rush through this asteroid belt, we can reach the convalescent planet quickly!”",
        "The co-pilot also said, “This is a shortcut. Shall we take it?” ",
        "“Go!”",
        "The two of them drove the spaceship directly toward the asteroid belt.",
        "Most people who encountered such an asteroid belt in a spaceship would take a detour.",
        "The gravity in the asteroid belt was complex, and some high-speed moving asteroids could cause irreversible damage to a spaceship. ",
        "But they were not afraid.",
        "Their spaceship was big enough. It was the largest spaceship currently in existence. All of humanity’s top technology was used in this spaceship.",
        "",
        "This spaceship could even sail for five hundred years without stopping for supplies.",
        "They didn’t need it to sail for that long. They just wanted it to reach the battlefield near the convalescent planet as quickly as possible and then die together with a king worm. ",
        "In this case, there was no need to feel sorry for the spaceship.",
        "Wasn’t it just an asteroid belt? Just hit it.",
        "They originally came here seeking death!",
        "This spaceship crashed head-on into the asteroid belt, which normal people would avoid. ",
        "Since they had already crashed in…they might as well kill the star worms inside!",
        "The pilot rushed forward quickly in the direction where star worms had been detected.",
        "Countless asteroids hit the spaceship, causing it to vibrate. The energy contained in the protective shield became less and less.",
        "But it was okay. The retired emperor had prepared a lot of energy! ",
        "The powerful guards around the retired emperor were wearing protective clothing in the shaky spaceship, working hard to change the energy source for the spaceship.",
        "Some of them were so brainwashed that they couldn’t help but ask, “Is it not good for us to disobey the orders of the retired emperor?”",
        "Then, a guard who had escaped from brainwashing control told them. “We are doing this for the good of the retired emperor. If the retired emperor runs for his life, his reputation will be ruined! But if he goes to the front lines, he can sacrifice his life for the empire and become a martyr.”",
        "“We are loyal to the retired emperor, the imperial family, and His Majesty. Now that His Majesty is at the front lines, we must go there too!” ",
        "“All we have to do is protect the retired emperor at all costs!”",
        "“Yes, the retired emperor didn’t order us not to go to the front lines, did he?”",
        "…",
        "What they said was… The retired emperor had been put into a sleeping cabin. How could he give orders to object? ",
        "But since everyone wanted to go to the front lines, then just go.",
        "The spaceship was getting closer and closer to the detected star worms and also provided specific information.",
        "Please visit chrysanthemumgarden (dot) com",
        "In the middle of the asteroid belt, there was an asteroid where there were at least ten high-level star worms.",
        "Twenty years ago, high-level star worms were considered invincible, but humans had been making progress. ",
        "People nowadays were no longer so afraid of high-level star worms.",
        "What was more, there were more than fifty S-level mecha warriors on their spaceship!",
        "Their spaceship was also very good. It was even almost as big as the asteroid, so nothing might happen even if it collided with it.",
        "Well, in that case, why not just crash into it? ",
        "The spaceship was fearless and crashed into the asteroid. At the same time, the spaceship’s broadcast sounded. “Prepare for battle! Prepare for battle!”",
        "“Star worms spotted ahead. Prepare for battle!”",
        "The retired emperor’s personal guards and the guards of other dignitaries on the spaceship all rushed out in mechas.",
        "At the same time, the spaceship collided with the asteroid. ",
        "The spaceship shook violently, and all the objects in the spaceship that were not fixed to the bulkhead were thrown around.",
        "But this spaceship was really durable. Although its head was flattened, the damage rate was less than 20% and it could still be driven.",
        "It was indeed a good thing made by the retired emperor at great expense!",
        "The pilot, whose face was covered in blood, couldn’t help but say, “It’s really cool to drive this thing.” ",
        "The co-pilot was stunned for a moment, then nodded, vomited blood and said, “Change people.”",
        "They had to change pilots. He could no longer hold on.",
        "But it had been really cool driving this spaceship!",
        "At this moment, the two pilots and the mecha warriors who ran out to kill the star worms all felt something was wrong. ",
        "The asteroid was actually hollow. After being hit by the spaceship, a hole was opened.",
        "Then, dense swarms of star worms crawled out from inside. They were also able to scan the situation inside.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This thing looked like a huge nest.",
        "Humans had been fighting star worms for twenty years and had never seen the star worm’s nest. Unexpectedly, this time, they crashed into the nest?! ",
        "***",
        "T/N: *宝贝 (baobei) – treasure, baby, darling. A common pet name between lovers and also a common nickname for children."
    ],
    "previous": "Ch60 - Embrace",
    "next": "Ch62 - The Retired Emperor Is A Star Worm_"
}