{
    "title": "Ch62 - The Retired Emperor Is A Star Worm?",
    "content": [
        "Qi Shiyan chatted with Ming Zheng for a while and then stopped talking.",
        "He was very tired and wanted to take a nap, and Ming Zheng should feel the same way. ",
        "Qi Shiyan closed his eyes and fell asleep instantly.",
        "Ming Zheng looked at Qi Shiyan for a while, then closed his eyes.\n",
        "",
        "Outside, the human army was still fighting against the star worms.",
        "After the death of the first king worm, the remaining two king worms became very cautious and slowed down their attacks. ",
        "After the second king worm died, the only remaining king worm even had the intention to retreat.\n\n",
        "The morale of the human army was greatly boosted. With the addition of Jiang Ren and the reinforcements that arrived one after another, Shan Xi, Lei Yin and others could also go to the rear to rest like Ming Zheng.",
        "They came to the spaceship at the rear and lay down in medical cabins like Ming Zheng, feeling very good.",
        "“There shouldn’t be any other king worms left. We will definitely win!”\n\n ",
        "“I hope that people in the future won’t have to face star worms again.”",
        "“Look now, the king worm isn’t that strong. Since it doesn’t dare to open its mouth, its attack power is limited.”",
        "…\n\n",
        "They were chatting in a good mood and taking a look at the battle situation. Suddenly, they discovered that there was something wrong with the king worm. ",
        "Although it had the intention to retreat, the king worm, which had not actually retreated before, suddenly began to flee in one direction.",
        "No, it didn’t seem like it was running away. It seemed like something happened in that direction and it was rushing over.",
        "Before, when the king worm was fighting with humans, it would protect the high-level star worms around it and prevent them from being injured, but at this moment, the king worm abandoned the high-level star worms around it.",
        "The human army didn’t understand what was going on, but after thinking it over, they chased after it without hesitation. ",
        "The battle had reached this point, and there had to be a winner.",
        "At the same time, on the retired emperor’s spaceship, a group of guards entered mechas and rushed into the asteroid.",
        "The imperial assets that should have been controlled by the retired emperor had been divided into two over the years, half in the hands of the retired emperor and half in the hands of Ming Zheng.",
        "Ming Zheng supported the First Legion with the income from his half of the assets, and also provided assistance to the Second Legion and Third Legion from time to time. ",
        "The retired emperor didn’t need to support a legion. He only needed to support his own personal guards. The things his personal guards used were naturally top-notch.",
        "The materials used in these people’s mechas were exactly the same as those of the Dawn, and were not inferior to the Dawn at all.",
        "",
        "The guards had the best equipment and were prepared to die, so when they encountered star worms, they were fearless and started killing.",
        "The powerful guards specifically dealt with high-level star worms, while the weaker guards and the crew members on the spaceship used various weapons to kill low-level and intermediate-level star worms. ",
        "Even the combat robots on board this spaceship went to the battlefield – their strength should not be underestimated.",
        "The two sides were fighting fiercely, and at this moment, several S-level mecha warriors who were in the front saw a group of star worms that looked a bit like humans in the middle of the asteroid.",
        "These guys had strange shapes, but they all had hands and feet similar to humans.",
        "What disgusting things! ",
        "Keep killing!",
        "As they were killing, they noticed that there were a lot of high-tech human equipment here. Had these star worms stolen human technology?",
        "No matter what, just kill them!",
        "Suddenly, they were stopped by a group of high-level star worms. ",
        "Behind these high-level star worms, there was a big worm that looked very much like a silkworm. It was protected by many star worms and stared at them with a pair of black eyes.",
        "These guards discovered that after being stared at by this “silkworm”, their movements began to slow down.",
        "The most powerful among them, the leader of the personal guards, had reached SS-level in mental power.",
        "But even his movements would become sluggish in front of this silkworm. ",
        "There was definitely something wrong with this large silkworm!",
        "The leader of the personal guards said, “Retreat!”",
        "After he finished speaking, he retreated with the others and ordered the spaceship to bomb the asteroid.",
        "Their spaceship was eduipped with the best missiles. ",
        "It was very difficult to kill high-level star worms with missiles, but such missiles could still cause certain damage to high-level star worms.",
        "Sspecially now that these high-level star worms had nowhere to hide.",
        "",
        "The spaceship bombarded the asteroid, killing countless star worms and blowing many holes in it.",
        "At this time, they rushed in again. ",
        "Although the silkworm-like star worm was protected by high-level star worms, it was obviously injured. It curled up into a ball, looking very uncomfortable.",
        "The guards divided themselves into two groups and moved forward. Some of them stopped the high-level star worms, and the rest went to kill this star worm that didn’t appear to be simple.",
        "This star worm was easy to kill. They killed it in just two or three strokes.",
        "Then, like disturbing a hornet’s nest, all the star worms attacked them like crazy. ",
        "One of them felt something was wrong and couldn’t help but ask, “That fat and white star worm we killed, could it be the star worm Queen Mother? Why were all the star worms protecting it and now going crazy?”",
        "The others were silent. After thinking about it carefully, they realized that it was indeed possible.",
        "So, they took advantage of the absence of the star worm army to destroy the worm nest and the star worm Queen Mother at once?",
        "Was the star worm Queen Mother so weak? ",
        "They were suddenly a little excited!",
        "There were many intermediate-level star worms in this worm nest, but there were only a dozen high-level star worms with high-end combat power.",
        "This “configuration” was not bad, but they could crush it.",
        "After killing the high-level star worms inside, everyone was confused. “What should we do next?” ",
        "Someone said, “This asteroid may be a worm nest. It looks empty inside, so it shouldn’t be heavy. How about we tow it away?”",
        "This asteroid was about the same size as their spaceship, but not as heavy as their spaceship.",
        "As long as their spaceship had enough power, it should be no problem for them to tow this thing away.",
        "“Let’s do it.” The others nodded in agreement. ",
        "So, behind the spaceship, it towed an asteroid from which star worms occasionally emerged, and continued to head toward the convalescent planet.",
        "At this time, the king worm near the convalescent planet that was trying to run away, and had already run a long distance, suddenly stopped running.",
        "",
        "It stayed motionless in the universe for a while, and then began to attack humans frantically.",
        "The high-level star worms that followed it also attacked everything around them like crazy. ",
        "Their old and weak queen had been killed by humans!",
        "Although a new queen was about to be born, she would no longer be their queen!",
        "At this moment, the hatred of these star worms toward humans reached its peak and they began to counterattack frantically.",
        "The military was stunned, and those who were watching the military’s live broadcast were also a little slow to react. ",
        "“What happened to these star worms?”",
        "“They tried to run away not long ago, but now they are fighting back desperately. Have they gone crazy?”",
        "“Be careful! Everyone be careful!”",
        "… ",
        "The human army was unable to react in time and suffered heavy losses.",
        "Jiang Jin noticed this situation and immediately woke up Ming Zheng.",
        "They wanted to let Ming Zheng rest, but in this situation, they could only rely on him!",
        "Ming Zheng rushed out immediately. ",
        "Qi Shiyan also woke up and said, “Find a battleship and carry my medical cabin onto it. When the king worm opens its mouth, launch my medical cabin directly into its mouth.”",
        "If he thought about it carefully, the effect of him driving a mecha into the mouth of a king worm was the same as him lying in a medical cabin and being launched into the mouth of a king worm.",
        "In that case, just lie down and be “eaten” by the king worm!",
        "At this moment, Qi Shiyan’s condition had improved a lot. If he was given a little more time, he would be able to recover to his peak state. ",
        "He was now able to enter the king worm’s stomach once again.",
        "This battle was really fierce. Before, when the human army fought against the king worms, there were not many casualties. But at this moment, because of the crazy attacks of the star worms, many people were injured or killed.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Jiang Ren and Lou Jingyue both had their mechas smashed.",
        "Fortunately, the Human Empire arranged various rescue spaceships on the battlefield, and those who had lost their combat effectiveness were rescued. They were just poisoned with some star worm poison. ",
        "As soon as Jiang Ren had an accident, Ming Zheng arrived.",
        "However, the berserk king worm was too powerful. Ming Zheng was at a disadvantage, and even the Dawn was smashed.",
        "Immediately afterward, he was surrounded by more than a dozen high-level star worms.",
        "This king worm, like the previous one, was most wary of Ming Zheng. ",
        "Seeing Ming Zheng was entangled, it began to bite everything around it frantically.",
        "Its mouth was moving all the time, so if they launched Qi Shiyan out at this time and he was bitten by it, Qi Shiyan would be finished!",
        "The battleship carrying Qi Shiyan hovered near the king worm and did not take any action.",
        "At this time, the king worm discovered the battleship and bit it directly. ",
        "It bit off the battleship’s tail, and just as it opened its mouth to swallow the entire battleship, Qi Shiyan’s medical cabin was launched into its mouth.",
        "The king worm didn’t take this medical cabin seriously.",
        "In its view, the only one that could hurt it was Ming Zheng.",
        "But it miscalculated. ",
        "The third king worm fell into their trap, rolling in pain in the universe and losing its life.",
        "On the Human Empire side, they had already skillfully begun to salvage the corpse of the king worm and rescue Qi Shiyan.",
        "But this time, Ming Zheng was not by his side.",
        "Those high-level star worms attacked him like crazy, and he couldn’t get away at all! ",
        "By the time Qi Shiyan crawled out of the king worm’s mouth, several hours had passed since the king worm went berserk.",
        "Many humans died, but fortunately, the number of high-level star worms was decreasing one by one.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Moreover, no new king worm had appeared, which made everyone full of hope.",
        "They would definitely win! ",
        "Ming Zheng had been fighting against the star worms for twenty years and thought he knew them very well. But it was not until now that he realized that the star worms that had fought against him in the past had not exerted their full strength.",
        "Now, these high-level star worms were really fighting with him to the death.",
        "The Dawn was smashed, and he was ejected from the cockpit, but was later rescued.",
        "Then he entered a new mecha and continued fighting. ",
        "In this process, being poisoned by star worm poison was inevitable, but he had no time to care about it.",
        "At this moment, he just wanted to kill all these star worms.",
        "Other people thought the same as him.",
        "The number of living star worms in front of them was gradually decreasing, the battlefield was a mess, and the dawn of victory was just around the corner. ",
        "At this moment, a huge spaceship, towing an asteroid, suddenly approached the battlefield.",
        "During the battle with the star worms, human reinforcements kept arriving, including several groups of people from the Chaotic Zone.",
        "Those former personal guards of the retired emperor who were forced by Jiang Ren to perform demonic dances were all now on the battlefield.",
        "But this was the first time that everyone had seen such a large spaceship. ",
        "This was bigger than the First Legion’s command ship! Where did this spaceship come from?",
        "The military was puzzled, and the people watching the live broadcast were even more confused. “The empire has such a large spaceship?”",
        "“Where did this spaceship come from?”",
        "“What’s that being dragged behind it?” ",
        "…",
        "Everyone was curious when they saw some powerful mecha warriors coming down from the spaceship and starting to help the military kill star worms.",
        "Please visit chrysanthemumgarden (dot) com",
        "“Brother, where are you from?” Someone asked them.",
        "These mecha warriors, who were equipped with special equipment, just killed star worms without saying a word. ",
        "They were naturally the personal guards of the retired emperor.",
        "When the spaceship approached the battlefield and did not see any king worms, they felt the situation was a bit wrong.",
        "There happened to be signal here, so they connected to the star network and checked the news on the star network.",
        "Then they discovered that the current situation was not quite what they had imagined. ",
        "They thought the empire was facing a life or death situation, so they traveled thousands of miles to the border in the hopes of dying together with a king worm.",
        "As a result, the king worms were already dead?",
        "The star worm army was also almost wiped out?",
        "Qi Shiyan and His Majesty were still alive and well? ",
        "Then…what should they do?",
        "After all the high-level star worms were killed, they discussed it and approached Ming Zheng.",
        "At this time, Qi Shiyan finally recovered and returned to the battlefield.",
        "Humanity had won, but Qi Shiyan was not in a good mood. ",
        "Too many people died in this battle.",
        "“Where is Ah Zheng? Let’s go find him.” Qi Shiyan was in a low mood.",
        "Jiang Jin agreed and took Qi Shiyan to find Ming Zheng.",
        "After asking around, he found out that Ming Zheng had been invited to the huge spaceship. ",
        "“This spaceship is really big…” Qi Shiyan was full of emotion as he boarded the spaceship with Jiang Jin.",
        "From a distance, he saw Ming Zheng.",
        "Please visit chrysanthemumgarden (dot) com",
        "He noticed that Ming Zheng was in very bad condition. Not only was he very tired, but he had also been poisoned by star worm poison.",
        "Without his knowledge, his Ah Zheng might have gone through a tough battle. ",
        "“Ah Zheng.” Qi Shiyan hurried over, wanting to help Ming Zheng eliminate the poison from his body.",
        "But before he could open his mouth, he saw someone carrying a sleeping cabin in front of Ming Zheng.",
        "The sleeping cabin was carried by the retired emperor’s personal guards.",
        "They had already betrayed the retired emperor, and now they had no choice but to go down this path… “Your Majesty, aren’t you going to overthrow the imperial family? We plan to join you! This is the retired emperor. We’ve captured him for you!” ",
        "After boarding the spaceship, Ming Zheng had realized that it belonged to the retired emperor. Ming Zheng, who was on high alert, fearing that the retired emperor had some tricks up his sleeve, was dumbfounded at this moment.",
        "There was a live broadcast camera following Ming Zheng, so those who were watching the military’s live broadcast were also dumbfounded.",
        "His Majesty said he wanted to rebel, but before he even started, others had already acted for him?",
        "At this moment, only Qi Shiyan was relatively clear-headed. “Is this the retired emperor? The retired emperor… is a star worm?” ",
        "The person lying in this sleeping cabin was indeed a human, but there was a star worm inside this person’s body.",
        "That star worm was about to take over this person’s body… then was this still a human or a star worm?",
        "People present: What?",
        "People watching the live broadcast: “???” "
    ],
    "previous": "Ch61 - Iron Head Spaceship",
    "next": "Ch63.1 - Was Broadcast Live_"
}