{
    "title": "Ch63.2 - Was Broadcast Live?",
    "content": [
        "This was indeed what should be done.",
        "The retired emperor had been parasitized, and there was a chance that others might have been parasitized as well. It would be better to study it and find out the situation. ",
        "This way, if someone else had been parasitized, they could find a cure.",
        "Jiang Ren smiled when he heard this. “Retired emperor, congratulations, you are going to be a test subject! Since you like studying others so much, you must be happy to be someone else’s test subject!”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The retired emperor’s face changed drastically.",
        "When Jiang Ren first appeared in Qi Shiyan’s live broadcast room, the retired emperor did not recognize this person. ",
        "But later, when he learned that Jiang Ren was the Dark Emperor and saw Jiang Ren call Ming Zheng “Boss”, he knew who Jiang Ren was.\n\n",
        "This person should be one of the children who came out of the same laboratory as Ming Zheng.",
        "He should have killed these people earlier and not let them live!",
        "Ming Zheng then said, “The retired emperor’s situation is very special. Inject him with a drug that can make the star worm lose its mobility and keep him under strict supervision… Lu Yuan, aren’t you doing a live broadcast? Put more cameras on him and have the whole network monitor him.”\n\n ",
        "“Okay.” Lu Yuan said.",
        "At this time, Ming Zheng was quick-witted and quickly locked the monster, no, the retired emperor, into the sleeping cabin.",
        "The situation of the retired emperor had been dealt with. Ming Zheng looked at the retired emperor’s personal guards standing on the side and said, “You…”\n\n",
        "“There are also some issues with their mental power.” Qi Shiyan suddenly spoke. ",
        "After hearing Qi Shiyan’s words, everyone present subconsciously moved away from the guards, and even the guards themselves became nervous.",
        "They had constantly been by the retired emperor’s side. Could they also have been parasitized by star worms?",
        "When they thought of this, they really felt that something was wrong with them.",
        "Fortunately, Qi Shiyan reassured them. “Don’t worry, you should not have been parasitized by star worms, but there is a chip in your brains. Find a way to remove it. It’s not good for your health.” ",
        "In the interstellar era, many people installed chips in their bodies.",
        "But the chips in these guards’ heads were different from ordinary chips and could cause certain damage to them.",
        "“This is the chip that the imperial family uses to control people. I can help them take it out.” Jiang Ren looked at the guards and said, “You can go to my spaceship to perform the surgery later.”",
        "When these guards saw Jiang Ren, they were reminded of their colleagues who ended up performing demonic dances after being captured by Jiang Ren. ",
        "They had mixed feelings and didn’t want to go with Jiang Ren.",
        "But the chip in their brains still needed to be removed… Before leaving, they said to Ming Zheng, “Your Majesty, we have captured not only the retired emperor, but also other imperial family members and dignitaries. They are all on this spaceship. You can find someone to go detain them. I guarantee that none of them are innocent.”",
        "Please visit chrysanthemumgarden (dot) com",
        "They didn’t actually capture these people, but they had to claim this credit!",
        "Ming Zheng: “…” He didn’t even do anything yet, and his rebellion was successful? ",
        "But this was also a bit wrong.",
        "Ming Zheng suddenly asked, “How did you know that I want to overthrow the imperial family?”",
        "Although there were people like Oou Aingyue who were keen on telling others that he wanted to overthrow the imperial family, they had been busy killing star worms since they left the convalescent planet. This matter shouldn’t be known to everyone, right?",
        "In fact, when these guards first opened their mouths and spoke, he realihed that something was wrong, but at that time he was attracted by the fact that “the retired emperor was a star worm”, so he did not ask. ",
        "When everyone present heard Ming Zheng’s question, they all fell silent.",
        "Qi Shiyan had a live broadcast device on him and had been broadcasting the entire process live… His Majesty seemed to still be unaware of this?",
        "How should they explain this?",
        "Marshal Duan of the Second Legion said, “I still have some things to deal with, so I’ll leave first.” ",
        "Marshal Lou of the Third Legion followed closely behind. “I also have some things to do.”",
        "“The people under my command need to be resettled.”",
        "“My injuries are a bit serious. I need to go to a medical cabin and lie down.”",
        "… ",
        "These people quickly found excuses and ran away without hesitation.",
        "There was clearly something fishy going on with this situation.",
        "When Jiang Jin and Jiang Ren wanted to leave, Ming Zheng stopped them and locked them with his mental power. “Tell me, what’s going on?”",
        "In fact, something was not right when Jiang Ren suddenly appeared on the convalescent planet. ",
        "Jiang Ren could cook, but given Jiang Ren’s personality, he wouldn’t cook for Qi Shiyan, someone he had just met.",
        "At that time, he actually wanted to ask Jiang Ren privately, but soon the star worm army arrived and he had no chance to ask Jiang Ren.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Jiang Jin’s situation was also not right. As the director of the sanatorium, why didn’t he contact the sanatorium at all when he was obviously able to do so?",
        "And Lu Yuan… Ming Zheng looked at Lu Yuan standing not far away, who had a guilty look on his face. ",
        "The audience watching the live broadcast had been frightened by the retired emperor before, but now, their mood had improved. “Your Majesty, the entire process of your love affair with Qi Shiyan was broadcast live!”",
        "“Hahahahahaha, I look forward to His Majesty’s expression when he finds out about the live broadcast.”",
        "“His Majesty’s emoticons have flooded the entire star network!”",
        "“Xiao Guai, you have to be good and obedient from now on!” ",
        "…",
        "Qi Shiyan didn’t think too much about this before, and he also had a very good attitude toward the people in front of him.",
        "After all, he could sense that these people had no ill will toward him.",
        "But after Ming Zheng said this… Qi Shiyan said, “I feel like they are hiding something from us.” ",
        "Jiang Ren spoke first. “This matter has nothing to do with me!”",
        "Jiang Jin said, “This is Ming Qingyu’s fault!”",
        "Ming Zheng took a deep breath and asked Lu Yuan, “What exactly are you hiding from me?”",
        "Lu Yuan was Ming Zheng’s subordinate. Even though he had watched Ming Zheng on the live broadcast and his filter for Ming Zheng had been shattered, he still didn’t dare to hide anything when facing Ming Zheng’s question. “Your Majesty, before it was corroded by the king worm, Qi Shiyan had a live broadcast device on him. Everything on the convalescent planet was broadcast live.” ",
        "Ming Zheng’s eyes suddenly widened. “What do you mean?”",
        "Qi Shiyan also said, “I had a live broadcast device on me? How come I didn’t know about it?”",
        "Lu Yuan said, “The thing is, Ming Qingyu wanted to cancel the engagement, but he didn’t want to ruin his own reputation, so he kept slandering Young Master Qi. He even installed the latest live broadcast equipment on Young Master Qi and stranded Young Master Qi on the convalescent planet, hoping to broadcast Young Master Qi’s ugly behavior live…”",
        "Lu Yuan explained the matter. ",
        "Ming Qingyu had already confessed everything that should be confessed, and the live broadcast platform had also said everything that should be said.",
        "This was pretty much the situation.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ming Zheng asked, “So, everything Qi Shiyan encountered after arriving on the convalescent planet was broadcast live?”",
        "Jiang Ren interrupted, “Yes! Now the whole empire knows that you kissed Qi Shiyan just to eat meat.” ",
        "Ming Zheng’s face turned red instantly.",
        "Jiang Ren still didn’t stop. “When you first met, Qi Shiyan called you Xiao Guai, Xiao Guai, hehe.”",
        "Ming Zheng even wanted to fight with Jiang Ren.",
        "Jiang Ren realized something was wrong and turned to run, but he still left some last words. “We also saw your plan to overthrow the imperial family! The people of the entire empire support you. Look, you didn’t even have to do anything, and this matter has been accomplished… You’re welcome!” ",
        "Ming Zheng looked like he was about to catch fire. The star worm poison he was poisoned with in the previous battle could no longer be suppressed, and his face turned blue and purple.",
        "Qi Shiyan immediately grabbed his hand and helped him eliminate the poison. “Ah Zheng, I’m sorry, I didn’t know there was a live broadcast.”",
        "“Young Master Qi really didn’t know about this, and he was almost murdered. The escape pod that the live broadcast platform used to drop him on the convalescent planet contained poison.” Lu Yuan was afraid that Ming Zheng would be angry, so he helped Qi Shiyan explain.",
        "Ming Zheng was not actually angry with Qi Shiyan. He would not be angry with Qi Shiyan. ",
        "He just felt embarrassed right now, more embarrassed than ever before.",
        "He thought that when he was delirious and acted like a spoiled child with Qi Shiyan, at most Lou Jingyue and the others had seen it. Who would have thought that the entire empire had seen it?",
        "If possible, Ming Zheng wanted to dig a hole and bury himself.",
        "But now that things had come to this point, he could only choose to accept it. ",
        "Ming Zheng looked at Qi Shiyan and said, “Ah Yan, you don’t have to apologize. This has nothing to do with you. In fact, I should be the one to apologize to you. Everything you encountered before was due to my negligence.”",
        "If he had paid more attention to Qi Yuncheng’s son before, Qi Shiyan would never have been so miserable.",
        "“Those things had nothing to do with you.” Qi Shiyan said.",
        "“You don’t mind being broadcast live?” Ming Zheng couldn’t help asking when he saw that Qi Shiyan was not angry at all. ",
        "Qi Shiyan said, “I don’t mind. I didn’t do anything bad!”",
        "He really didn’t mind.",
        "",
        "He had lived alone for a long time and he was quite happy to be noticed.",
        "As for the live broadcast, he did a lot of sticky things with Ming Zheng… He just liked Ming Zheng very much, and he didn’t mind letting the whole world know. ",
        "Seeing Qi Shiyan like this, Ming Zheng’s mood also calmed down.",
        "If he thought about it, there was nothing wrong with being broadcast live.",
        "Even though it was a bit embarrassing for him, Qi Shiyan was so good. After being broadcast live, there should be a lot of people who liked Qi Shiyan.",
        "This was good for Qi Shiyan. ",
        "But he still felt a little upset… Ming Zheng looked at the live broadcast cameras around him and said, “I don’t want to see the live broadcast cameras again for the time being.”",
        "Lu Yuan nodded quickly.",
        "Ming Zheng pulled Qi Shiyan away and said, “I have things to do too. I’m leaving first.”",
        "The star worm that had parasitized the retired emperor was very weak and couldn’t cause any trouble… Let others take care of the rest. ",
        "He needed to rest!",
        "Ming Zheng took Qi Shiyan to his bedroom on the First Legion’s command ship.",
        "As they passed by, everyone saluted them.",
        "It was also like this in the past, and Ming Zheng was used to it. But today, the looks these people gave him were too gentle, and many people even smiled at him. ",
        "They should have all watched the live broadcast.",
        "Ming Zheng sighed secretly, then noticed that Qi Shiyan was looking at these people with great interest and even waving at them.",
        "Forget it. If it was broadcast live, then it was broadcast live. It was fine as long as Qi Shiyan liked it.",
        "“Ah Yan, this is my residence on the spaceship,” Ming Zheng opened the door of his room and pointed to the medical cabin in the room. “There is a medical cabin here. You can lie down in it and rest. I’ll have someone bring another one over.” ",
        "“Let’s lie down together!” Qi Shiyan pulled Ming Zheng and entered the medical cabin. “I don’t want to be separated from you.”",
        "There was nothing wrong with his body. Ming Zheng’s main problem now was that he was too tired and had been poisoned by star worm poison.",
        "",
        "They could lie down in the same medical cabin, and he could also help Ming Zheng eliminate the star worm poison that the medical cabin could not treat.",
        "This medical cabin had not been enlarged, and was the normal size. ",
        "The two of them huddled together, body to body, and face to face.",
        "Ming Zheng’s breathing became a little faster.",
        "At this time, Qi Shiyan kissed Ming Zheng. “Ah Zheng, I love you more and more!”",
        "Ming Zheng’s eyes suddenly felt a little sore. He said solemnly, “Me too.” ",
        "***",
        "T/N: This is the end of the main text. The rest of the chapters are extras."
    ],
    "previous": "Ch63.1 - Was Broadcast Live_",
    "next": "Ch64.1 - Extra_ Behind The Scenes"
}