{
    "title": "Ch63.1 - Was Broadcast Live?",
    "content": [
        "After killing the third king worm, Qi Shiyan went into the medical cabin and lay down, and also ate a lot of high-level star worm meat.",
        "At this moment, his mental power and supernatural powers had mostly recovered. ",
        "He even felt that his mental power and supernatural powers had improved a little.",
        "Therefore, after boarding the spaceship, he began to use his mental power to scan everything around him.\n",
        "",
        "He first noticed Ming Zheng’s poor physical condition.",
        "Ming Zheng had been poisoned by star worm poison again, and his body was also a little too exhausted. ",
        "Then, Qi Shiyan’s attention was attracted by the people carrying the sleeping cabin over.\n\n",
        "These people were all very handsome, their movements were in unison, they were about the same height and weight, and they were also wearing the same uniform, which made them look very pleasing to the eye.",
        "But their mental power seemed a little unnatural, as if it had been tampered with.",
        "Qi Shiyan was just curious when he heard these people say that they wanted to join them and overthrow the imperial family together. They also said that they had helped them capture the retired emperor.\n\n ",
        "The person in the sleeping cabin was the retired emperor? Qi Shiyan’s mental power immediately enveloped the sleeping cabin, and then discovered that there was something wrong with the person in the sleeping cabin.",
        "So was this still a human or a star worm?",
        "“What do you mean the retired emperor is a star worm?” Ming Zheng asked. The others also looked at Qi Shiyan in confusion.\n\n",
        "Qi Shiyan pointed at the retired emperor in the sleeping cabin and said, “I sense the presence of a star worm in this human body.” ",
        "Ming Zheng was stunned and immediately used his mental power to check the situation of the retired emperor.",
        "He discovered that there was indeed a mental power unique to star worms in the body of the retired emperor, and that the retired emperor’s physical condition was also not right.",
        "He had not met the retired emperor in recent years, so he had never noticed anything unusual about the retired emperor.",
        "However, even if they had met, the previous him wouldn’t have been able to detect anything unusual. ",
        "Because the previous him had been poisoned by star worm poison, he was unable to use all of his mental power at the time and wouldn’t have been able to discover anything unusual about the retired emperor.",
        "Those personal guards around the retired emperor also hadn’t noticed that there was anything wrong with the retired emperor?",
        "“There’s a star worm in the body of the retired emperor? Then we must kill him immediately!” Jiang Ren said excitedly.",
        "Now that the battle was over, when the retired emperor’s personal guards invited Ming Zheng to this huge spaceship, many generals followed. ",
        "After Qi Shiyan also boarded the spaceship, even more high-ranking military officials came over – they had watched the live broadcast for a long time, but had never really come into contact with Qi Shiyan, so now they wanted to meet Qi Shiyan.",
        "These people had just climbed out of their mechas and were originally tidying up their clothes and hair, trying to appear in front of Qi Shiyan with their best possible appearance.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Then they heard the shocking conversation between the retired emperor’s personal guards, Qi Shiyan and Jiang Ren.",
        "These people started to speak up. “The rebellion has been successful? I still haven’t done anything yet.” ",
        "“The retired emperor is still the retired emperor. We cannot kill him casually. We still need to put him on trial. Should we set up a military court now?”",
        "“If the retired emperor is a star worm and not a human, it’s not against the law to kill him.”",
        "“Your Majesty, I am willing to kill the star worm for you!”",
        "… ",
        "Ou Tuan was speechless. “Gon’t talk nonsense! Low can you kill people casually? Wait for me to transfer over the live broadcast cameras… Hi Shiyan, do you have a way to prove that the retired emperor is a star worm? After you prove it, you can kill him.”",
        "Hi Shiyan: “…” This situation didn’t seem duite right?",
        "In the original owner’s memory, the retired emperor was very respected and held great power.",
        "In the past, the retired emperor did not invite the original owner to his birthday party, and the original owner was ridiculed for a long time. Ming Qingyu also gave the original owner the cold shoulder and told the original owner to go please the retired emperor. ",
        "But how could the original owner please the retired emperor? At that time, even the retired emperor’s personal guards looked down on the original owner.",
        "How many days had it been? Only half a month at most. Had the retired emperor suddenly become worthless?",
        "While Lu Yuan was speaking, he had already transferred half of the military’s live broadcast cameras over and aimed them at the retired emperor from all angles.",
        "Then, the audience watching the live broadcast saw a group of military leaders surrounding the retired emperor’s sleeping cabin, all of them eager to try and ready to kill the retired emperor at any time. ",
        "“This scene is kind of funny.”",
        "“Hurry up and wake up the retired emperor. It would be interesting if he woke up now! Being stared at by so many people, hahahaha.”",
        "“The retired emperor is so unpopular that there are so many people who want to kill him. There’s not enough of him to go around.”",
        "“Isn’t it said that the imperial family’s guards are the most loyal? How come even the imperial guards have betrayed the retired emperor?” ",
        "“Just now, the scene where these guards carried the retired emperor to present him to His Majesty really made me laugh to death.”",
        "…",
        "Please visit chrysanthemumgarden (dot) com",
        "Qi Shiyan was being stared at by many people. Everyone was waiting for him to prove that the retired emperor was a star worm.",
        "Sensing that the star worm in the retired emperor’s body was not strong, Qi Shiyan said, “How about you open the sleeping cabin first?” ",
        "He couldn’t do anything through the sleeping cabin. Plus, right now, the retired emperor was sleeping peacefully, and the star worm in his body was also sleeping well.",
        "Hearing Qi Shiyan’s words, the leader of the personal guards stepped forward and opened the sleeping cabin.",
        "The retired emperor didn’t fall asleep because he was tired, but was forced to fall asleep by the sleeping cabin.",
        "Now that the sleeping cabin was opened, he woke up immediately. ",
        "When he woke up, his mind was filled with the images of being forcibly sent to the sleeping cabin by his personal guards, and he instantly flew into a rage. “How dare you guys?!”",
        "As soon as he finished speaking, the retired emperor realized something was wrong.",
        "He was lying in a sleeping cabin, and around him, a large group of people were staring at him eagerly.",
        "He knew all these people, including high-ranking military officials, his personal guards, Ming Zheng, Qi Shiyan, Jiang Ren and others. ",
        "“What do you want to do?” The retired emperor’s pupils constricted, and he looked fierce on the outside but weak on the inside.",
        "Jiang Ren said, “Your personal guards decided to support us in overthrowing the imperial family, and gave you to us as a token of their loyalty.”",
        "The retired emperor’s face changed drastically.",
        "Jiang Ren smiled and said, “We originally planned to put you on trial first and then kill you, but Qi Shiyan discovered that you are no longer a human being, but a star worm… This is good. We don’t even have to put you on trial, and can just kill you.” ",
        "The retired emperor’s frightened appearance was so beautiful! He liked it!",
        "“You are framing me! How could I be a star worm?! Ming Zheng, I am your father. I value you so much and even gave you the throne. You can’t treat me like this!” The retired emperor was still very smart. He immediately realized that the only person who could save him was Ming Zheng.",
        "After all, he was Ming Zheng’s father.",
        "As for the others, they most likely wouldn’t take him seriously. ",
        "Ming Zheng didn’t say anything, and instead looked at Qi Shiyan. “Ah Yan, how do we get the star worm out of his body? Why do I feel like they’ve fused together?”",
        "“They have indeed fused together.” Qi Shiyan’s expression was solemn.",
        "",
        "The retired emperor became even angrier. “What do you want to do? You actually framed me as a star worm! You…”",
        "Qi Shiyan spoke up at this time. “Ah Zheng, you also sensed the star worm, right? That thing can parasitize others. It’s very dangerous. Let’s stay away from it, and then use our mental power together to force it out?” ",
        "Ming Zheng nodded. “Okay!”",
        "After hearing the conversation between the two, everyone moved away from the retired emperor. The strong ones formed a circle to prevent the star worm from escaping, while the weak ones stayed behind the strong ones to watch the excitement.",
        "When people on the star network saw this scene, they were a little shocked. “Is there really a star worm in the body of the retired emperor? I thought Qi Shiyan was joking.”",
        "“Of course it’s true! Qi Shiyan never jokes about serious matters.” ",
        "“I feel cold all over right now… The retired emperor has a star worm in his body, so could other people have star worms in their bodies as well?”",
        "“Probably not? Qi Shiyan didn’t have any special reaction when he saw other people.”",
        "“Do you guys remember? When the retired emperor celebrated his birthday, he didn’t invite Qi Shiyan, the future crown princess. At that time, we all laughed at Qi Shiyan and felt that he was not valued. But now thinking about it, maybe the retired emperor didn’t dare to see him for fear of being discovered.”",
        "“That shouldn’t be the case. After all, no one knew at that time that Qi Shiyan’s mental power was so strong.” ",
        "“A star worm can parasitize the retired emperor, which means that they can also parasitize others. If there was no Qi Shiyan, would we have been ruled by star worms after His Majesty’s death?”",
        "“Please stop talking! This is too horrifying!”",
        "…",
        "At the scene, the retired emperor was still furious and helpless. ",
        "Qi Shiyan didn’t take him seriously and said to Ming Zheng, “Begin.”",
        "As soon as he finished speaking, the two of them started to act together.",
        "Then, everyone saw the retired emperor’s face distort, as if something was about to “break out” from his body.",
        "This thing was even successful! ",
        "The retired emperor’s face turned blue and purple, and then a head popped out from his neck.",
        "This head looked a bit like a human, but it had a star worm’s compound eyes, which were scary to look at. After the head grew out, two insect legs grew on the shoulders of the retired emperor.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Ahhhhhh!” The retired emperor cried out in pain.",
        "Everyone surrounding the sleeping cabin took a step back. ",
        "And those who were watching the live broadcast were screaming like the retired emperor.",
        "Ming Zheng had seen many star worms, but he also felt that this scene was a bit disgusting. Only Qi Shiyan stared at the retired emperor with curiosity on his face.",
        "After looking for a while, Qi Shiyan said, “They have fused together and cannot be separated. The retired emperor looks quite interesting now.”",
        "He had seen many strange-looking people in the apocalypse, but this was the first time he had seen one like this. ",
        "Everyone looked at Qi Shiyan in shock.",
        "The retired emperor looked so scary, but he actually found him interesting?",
        "At this time, the retired emperor was still screaming. “Save me! Save me! I don’t want to die!”",
        "Qi Shiyan answered seriously. “We helped you force the star worm out, so you won’t die for the time being. If we hadn’t helped you, it wouldn’t be long before your body would have been taken over by this star worm.” ",
        "The retired emperor was well maintained and in good health. If he ate well in the future, he would still be able to live for a long time.",
        "Thinking of this, Qi Shiyan said with a bit of envy, “You can live for at least another twenty years, which is already very good!”",
        "In his previous life, he only lived for twenty years in total. What about the retired emperor? Twenty years later, he would be two hundred years old.",
        "The people watching the live broadcast didn’t know whether to laugh or cry. “Qi Shiyan said this very sincerely, but I always feel it’s weird.” ",
        "“Qi Shiyan has always been weird. You just have to get used to it.”",
        "“Please don’t let the retired emperor live another twenty years! Kill him quickly!”",
        "“This thing is too searing for the eyes, wuwuwu.”",
        "… ",
        "At this moment, even the retired emperor wanted to die.",
        "A worm head grew next to his head, and it stared at him closely with its compound eyes. It was really too horrifying!",
        "",
        "After screaming, the retired emperor fainted.",
        "Then, the star worm took control of the retired emperor’s body, climbed out of the sleeping cabin, and rushed toward Qi Shiyan. ",
        "But it couldn’t get close to Qi Shiyan.",
        "Jiang Ren took out a stick from somewhere and hit the star worm on the head, knocking it back.",
        "Then, he also hit the retired emperor on the head with the stick, causing his head to bleed and bringing him back to his senses.",
        "Jiang Ren acted a little embarrassed when he saw this. “Sorry, I accidentally hit you.” ",
        "Everyone: How could this be an accidental hit? This was clearly intentional!",
        "They felt that what Jiang Ren really wanted to hit, from the very beginning, was not the star worm’s head, but the retired emperor’s head.",
        "What Jiang Ren wanted to hit was indeed the head of the retired emperor.",
        "At this moment, he even thought that this star worm that had parasitized the body of the retired emperor was quite cute. ",
        "Look, this little cutie had almost scared the retired emperor crazy.",
        "“So what should we do now? Kill him?” Jiang Ren asked again.",
        "Everyone looked at Ming Zheng. After all, the one who had been parasitized was the retired emperor. It was still up to Ming Zheng to decide how to deal with him.",
        "Ming Zheng said, “Lock him up first. If the star worm can parasitize him, it can definitely parasitize others. I’ll find someone to study it and find out what’s going on.” "
    ],
    "previous": "Ch62 - The Retired Emperor Is A Star Worm_",
    "next": "Ch63.2 - Was Broadcast Live_"
}