{
    "title": "Ch64.1 - Extra: Behind The Scenes",
    "content": [
        "Qi Shiyan liked this normal model of the medical cabin very much.",
        "He was squeezed together with Ming Zheng, so close that he could kiss Ming Zheng just by moving his mouth. ",
        "So, he just treated it as if he was playing, and started to kiss Ming Zheng again and again.",
        "Ming Zheng’s heartbeat quickened when he was kissed. He looked at Qi Shiyan, and his uneasy heart finally calmed down.\n",
        "",
        "Before, he had been fighting at a high intensity and was extremely exhausted.",
        "Now he was lying in a medical cabin, with someone he trusted by his side… Ming Zheng stared at Qi Shiyan for a while, and finally couldn’t hold on any longer and closed his eyes. ",
        "His breathing became steady and he soon fell asleep.\n\n",
        "When Qi Shiyan saw Ming Zheng fall asleep, he kissed him and then fell asleep as well.",
        "He was also quite tired after being swallowed into the king worm’s stomach and attacking three times in a row.",
        "The two of them slept, but the people outside were busy.\n\n ",
        "The body of a king worm was very large, so after rescuing Qi Shiyan, they threw the king worms back into space – if they left them on the spaceship, their mecha warriors and small battleships would not be able to get on the spaceship.",
        "But they couldn’t let the king worms float in space all the time, as that would make it inconvenient for them to study the king worms.",
        "Now, they finally had a place to place the king worm corpses, and that was the retired emperor’s spaceship.\n\n",
        "The gastric juices of the three king worms were squeezed out and then they were neatly placed in an open area of the spaceship. In front of the king worms, there were many sleeping cabins. ",
        "Those lying in these sleeping cabins were all imperial family members and dignitaries. Robots were verifying their identities and posting their identity information online.",
        "The people on the star network could submit evidence of these people’s crimes under their identity information.",
        "Later, someone would verify the evidence and deal with the offenders according to the law.",
        "The live broadcast was still on. Although Qi Shiyan and Ming Zheng could no longer be seen, there were still many people watching the live broadcast. “There are so many imperial family members and dignitaries from the empire!” ",
        "“It was hard to see even one in the past, but now there are so many of them sleeping in rows for us to watch. It’s quite fun.”",
        "“They are really good looking, all handsome men and beautiful women.”",
        "“What a pity that none of them act like humans!”",
        "… ",
        "Jiang Ren carried a medical kit and walked around among the rows of sleeping cabins.",
        "The medical kit was a simplified version of the medical cabin, filled with liquid medicine, and could be carried on one’s back for treatment.",
        "Please visit chrysanthemumgarden (dot) com",
        "In the empire, some particularly hard-working people would carry medical kits on their backs while working. Right now, Jiang Ren was watching the fun with a medical kit on his back.",
        "He had worked really hard too. ",
        "Jiang Ren was surrounded by several of the retired emperor’s former personal guards.",
        "They knew a lot of the imperial family’s secrets and would chat with Aiang Een from time to time.",
        "“This Guke is obsessed with hands. Le likes to chop off other people’s hands and make specimens of them. Dut he always pays people enough money, so the news never spread.”",
        "“This is the second son of the retired emperor. He likes to go to poor places to play the true love game. He will choose a beautiful but poor person, have a passionate love affair with the other party, give the other party the best material enjoyment, and then abandon the other party after they fall deeply in love with him. The people he abandons usually have a miserable end.” ",
        "“This granddaughter of the retired emperor is a love brain. Once she falls in love with a man, she will obey him in everything. This originally should be no big deal, but her methods of dealing with her love rivals are very cruel. When she was still studying, she once forced her love rival to death…”",
        "…",
        "Everyone watching the live broadcast was stunned as they listened.",
        "Lu Yuan, who was registering these people’s information, couldn’t help but ask, “Is there no good person in the imperial family?” ",
        "The former commander of the imperial guards spoke up. “Of course there are. There are quite a few, but most of them are not on this ship.”",
        "After hearing what he said, the people watching the live broadcast started to speak up. “Yes! Ming Qingyi is also a member of the imperial family and Ming Qingyu’s older brother. He is a clean man. This guy didn’t even go to university. He went out to explore when he was a teenager. In the past few decades, he has only returned to the Capital Star a few times.”",
        "“He’s always going to undeveloped planets, and often doesn’t even see people for a year or two. He must not be doing anything bad.”",
        "“Ming Qingyi is dark and strong, and he really doesn’t look like these imperial family members in front of us at all.” ",
        "“I heard that he doesn’t even spend the imperial family’s money. He earns money through live broadcasts, filming adventure documentaries, and searching for resource planets in the universe.”",
        "…",
        "In addition to Ming Qingyi, the crowd also dug out some other imperial family members who were relatively good people.",
        "Among them, there were several members of the imperial family who followed Ming Zheng and joined the army to kill star worms seriously. ",
        "People like Lou Jingyue’s mother who had never done anything bad were also considered good people.",
        "However, none of them were on this spaceship.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“The retired emperor wanted to take away the cancer of the empire in one go!”",
        "“What’s even funnier is that he brought the people to the front lines.” ",
        "“This mass arrest of criminals is so cool! It wouldn’t be so easy to catch these people separately!”",
        "“The retired emperor is a good man, no, a good star worm.”",
        "…",
        "Although everyone was joking, they knew in their hearts that these people were captured thanks to the guards, pilots, and crew members on the spaceship. ",
        "“The crew members and guards on this spaceship are heroes.”",
        "“The conditions of those pilots are terrible. It is said that even if they are healed, they will be left with serious sequelae.”",
        "“On the way to the border, they encountered star worms and some people died…”",
        "“They came to the front lines with the determination to die, which is admirable.” ",
        "…",
        "The spaceship’s journey and experience had been published online, along with some video clips.",
        "Many people on the star network cried after watching the videos.",
        "Some people were also curious about what the asteroid brought back by this spaceship was. ",
        "Was this a worm nest?",
        "What they were even more curious about was the star worm that had parasitized the retired emperor.",
        "People hoped that the military could publish an investigation report as soon as possible, but there was a shortage of people on the front lines and no one had time to study these things.",
        "Jiang Jin used the military‘s account to announce this matter. After that, professors from various universities in the empire submitted applications one after another, expressing their willingness to go to the front lines to help with research for free. Some professors had already boarded spaceships and rushed to the border while submitting their applications. ",
        "However, the spaceships they were riding did not have high-speed modes, and it would take several days to reach the border, so a lot of work could not be carried out until several days later.",
        "In the live broadcast, Jiang Ren came to the front of a sleeping cabin.",
        "Please visit chrysanthemumgarden (dot) com",
        "“Who is this person? He looks unfamiliar.”",
        "The current commander of the retired emperor’s personal guards, who had already undergone surgery to remove the chip in his brain, took a look and said, “This is the retired emperor’s son, Ming Jin.” ",
        "“I remember this person, but I don’t have much impression of him.” Jiang Ren said.",
        "One of the guards said, “He has always been very low-key, but he has a good relationship with everyone. Because he is good at doing business, he has a lot of people under him, and he has also done a lot of good deeds.”",
        "The remaining guards also added some information about Ming Jin.",
        "From what they described, this son of the retired emperor seemed to have remained principled and incorruptible despite his surrounding growth environment*. ",
        "On the star network, many people also talked about Ming Jin.",
        "“Ming Jin is indeed a very good person. Our school has a scholarship fund established by him.”",
        "“I’ve never heard of him before, but just now, I looked him up and found out that he has done a lot of charity work.”",
        "“He also has absolutely no criminal record.” ",
        "“I didn’t expect that there would be an innocent person among these people.”",
        "…",
        "The audience thought so, but after hearing about Ming Jin’s history, Jiang Ren said, “Is that so… This person is not simple. We need to investigate carefully later! Arrest all his subordinates and investigate separately.”",
        "The people watching the live broadcast were a little puzzled when they heard Jiang Ren’s words. “Is Jiang Ren overthinking?” ",
        "“This Ming Jin looks like a good person.”",
        "“Jiang Ren has a grudge against the imperial family, so it’s normal for him to ask people to investigate. If Ming Jin is innocent, he will be fine.”",
        "…",
        "People were discussing this when suddenly someone exclaimed, “Have you seen the revelations? Some people said that the surveillance cameras at Ming Qingyu’s house were sent to him by Qi Shiyan at Ming Jin’s request!” ",
        "“Good fellow, what a good fellow. This Ming Jin has done a lot of things in private!”",
        "“In fact, he has good relations with everyone, so it is impossible for him to be innocent… Birds of a feather flock together.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Those who are truly clean in the imperial family are those who stay away from the group of people led by the retired emperor!”",
        "… ",
        "Now, everyone in the empire knew that the imperial family was finished.",
        "Those people on the Capital Star who had previously worked for the imperial family but did not receive an invitation and did not board the spaceship began to look for a way out.",
        "Some people were alone and simply ran away.",
        "Some people had a large family behind them, so they decisively took all the blame on themselves. While confessing their crimes, they volunteered to act as witnesses, striving to make meritorious contributions, so as not to implicate their families. ",
        "In short, people made all kinds of choices. There were also many people who posted evidence online and reported using their real names.",
        "Among them was the person Ming Jin had arranged to contact Qi Shiyan, who spoke out about everything Ming Jin had asked him to do.",
        "The audience on the star network was stunned.",
        "“Jiang Ren was right. Ming Jin is not simple!” ",
        "“They must conduct a thorough investigation!”",
        "“Ming Qingyu is a scumbag, but he is obviously a scumbag with low IQ. He has been plotted against and doesn’t even know!”",
        "“Ming Qingyu is really stupid. Someone can actually put so many cameras in his own home without him knowing.”",
        "“His decision to send Qi Shiyan to the convalescent planet and do the live broadcast was also stupid. Maybe he was instigated by someone.” ",
        "…",
        "On the Capital Star, Ming Qingyu, who was still in the detention room and hadn’t been able to board the spaceship, was stunned when he saw the evaluation of himself on the star network.",
        "He might really be a little stupid.",
        "Thinking of something, Ming Qingyu pressed the call bell. “I really didn’t poison Qi Shiyan! It would be no good for me if Qi Shiyan died! The one who poisoned Qi Shiyan might be Ming Jin!” ",
        "***",
        "T/N: Do people still remember Ming Jin lol? He’s the mastermind who has been hiding in the dark and plotting the whole time – the one who sent the cameras to Ming Qingyu’s (the crown prince) house through Qi Shiyan and then posted photos and videos of Ming Qingyu and Qi Jianuo’s affair on the star network. He first appeared (through vague descriptions) in Chapter 20.2, and his name and background were revealed in Chapter 22. Thanks to 8oni for reminding me!",
        "",
        "*出淤泥而不染 (chu yu ni er bu ran) – literally to grow out of the mud unsullied. An idiom that means to be principled and incorruptible; to have grown up in a bad environment, but not be affected by it."
    ],
    "previous": "Ch63.2 - Was Broadcast Live_",
    "next": "Ch64.2 - Extra_ Behind The Scenes"
}