{
    "title": "Ch64.2 - Extra: Behind The Scenes",
    "content": [
        "Qi Shiyan was completely unaware of the turmoil going on outside.",
        "He slept with Ming Zheng for a day and a night. ",
        "In the middle, he actually woke up several times, but seeing that Ming Zheng was still sleeping, he closed his eyes and continued to sleep.",
        "Ming Zheng was the same. He woke up twice, and when he saw Qi Shiyan was still sleeping, he continued to sleep.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Finally, the two of them were awakened by the medical cabin.",
        "The medical cabin had sensed that they no longer needed to lie down. ",
        "“Ah Zheng, I’m starving. Shall we go take a shower and eat something?” Qi Shiyan suggested.\n\n",
        "“Okay.” Ming Zheng agreed.",
        "Qi Shiyan suddenly thought of something. “Shall we take a shower together?”",
        "Ming Zheng hesitated for a moment and was about to agree when he saw Qi Shiyan shake his head. “Forget it, let’s do it another time.”\n\n ",
        "If they took a shower together, he would definitely get very excited and would want to kiss Ming Zheng all over his body.",
        "But this would take a lot of time.",
        "There were still a lot of things to deal with outside right now, so they could just do it another time.\n\n",
        "Ming Zheng felt inexplicably disappointed, and then said, “You wash first.” ",
        "Qi Shiyan did not object and went to take a shower.",
        "Ming Zheng found a set of his own clothes from his closet and placed them in front of the bathroom door.",
        "When he first met Qi Shiyan, Qi Shiyan was very thin, but during this period of time, Qi Shiyan gained some weight and seemed to be taller.",
        "Qi Shiyan should be able to wear his clothes. ",
        "Ming Zheng was in a good mood when he thought about Qi Shiyan wearing his clothes.",
        "After the two of them got ready, they walked out together.",
        "Relying on the medical cabin, his supernatural powers and star worm meat, Qi Shiyan gained weight very quickly during this period, and his hair also grew faster than that of ordinary people.",
        "But no matter how fast it grew, it couldn’t grow all the way out in one day. ",
        "Qi Shiyan still had a bald head, and only some black spots could be seen on it.",
        "He stood out like this.",
        "",
        "Almost everyone’s attention was on him.",
        "Qi Shiyan didn’t care at all. He smiled and greeted these people. “Hello, everyone!” ",
        "“Hello, Young Master Qi!”",
        "“Has Young Master Qi eaten yet?”",
        "“Young Master Qi, we have broken the skin of the king worm. You can go and see if the meat of the king worm is edible.”",
        "… ",
        "Fpon learning that the king worm’s skin had been broken, Hi Shiyan went there ezcitedly.",
        "After he went there, he was even more surprised!",
        "There were also poison sacs containing star worm poison in the body of the king worm, but there was no star worm poison at all in its flesh!",
        "“This meat is edible!” Qi Shiyan walked around the three king worms, very excited. ",
        "These were not three worms. They were clearly three mountains of meat!",
        "“Ah Yan, do you want me to cook king worm meat for you?” Jiang Ren asked.",
        "Qi Shiyan looked at the medical kit on Jiang Ren’s back and asked, “Don’t you need to rest?”",
        "Jiang Ren said, “No, I’m in good health.” In the past, he had been much more tired and injured than he was now, so these little injuries were nothing. ",
        "He didn’t want to rest, so he decided to find something to do, such as cooking for Qi Shiyan.",
        "He was really grateful to Qi Shiyan.",
        "Jiang Ren cooked for Qi Shiyan very naturally, but Ming Zheng felt a little uncomfortable.",
        "There were some live broadcast cameras floating around them. ",
        "There was no doubt that they were being broadcast live again.",
        "When Qi Shiyan turned around, he noticed Ming Zheng looking at the live broadcast cameras.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He recognized these things from the original owner’s memory, so he waved toward the cameras and said, “Hello, everyone!”",
        "Qi Shiyan had been live broadcasting for so long, and this was the first time he had interacted with the audience. ",
        "Everyone watching the live broadcast was excited. “Hello, Qi Shiyan!”",
        "“Qi Shiyan interacted with us!”",
        "“You can tell that he really likes live broadcasting!”",
        "“I suddenly feel bald heads are very handsome.” ",
        "“Upstairs, I was so excited yesterday that I shaved my head.”",
        "…",
        "After Qi Shiyan greeted Jiang Ren, he asked, “Jiang Ren, how do you plan to cook the king worm meat?”",
        "“Try all kinds of methods. I will make whatever you like to eat.” Jiang Ren said. ",
        "Perhaps because he had taken revenge, he was in a peaceful mood now.",
        "He actually started to like cooking.",
        "When he was a child, he could only drink nutrient solution. When he left the laboratory and ate normal food for the first time, he was amazed.",
        "Although he was still young at the time, he told the children around him that he would learn how to cook in the future and then would make all kinds of delicious food for them. ",
        "Unfortunately, out of so many children, only two survived besides him.",
        "Jiang Ren set up his cooking table next to the sleeping cabins and started to cook for Qi Shiyan. He chatted with Qi Shiyan at the same time. “Qi Shiyan, when you landed on the convalescent planet, wasn’t there poison in your escape pod? The person who poisoned you has been caught.”",
        "“Who is it?” Qi Shiyan asked, “Since Ming Qingyu was the one who arranged the live broadcast for me, the person who poisoned me shouldn’t be him, right?”",
        "Jiang Ren said, “It’s Ming Jin.” ",
        "“It’s actually him?” Qi Shiyan was a little surprised.",
        "Ming Jin was one of the few members of the imperial family who was kind to the original owner.",
        "Please visit chrysanthemumgarden (dot) com",
        "The original owner liked this uncle very much, and had never expected that this man actually wanted to kill him.",
        "Jiang Ren said, “The mantis stalks the cicada, unaware of the oriole behind*. Ming Jin probably wanted to be the oriole, but unfortunately he does not have the strength and luck to do so.” ",
        "If Qi Shiyan was very weak and died on the convalescent planet, Ming Zheng would have also died soon after.",
        "If, at that time, Ming Jin made public all the bad things Ming Qingyu had done, Ming Qingyu would definitely not be able to ascend the throne smoothly.",
        "The military would want to change the heir, and the retired emperor would also want to ascend the throne again. With all the forces competing against each other, if Ming Jin handled it well, he might really be able to ascend the throne.",
        "He had a good relationship with everyone and a good reputation, so he was the most suitable candidate. ",
        "But even if he ascended the throne, so what?",
        "The retired emperor had been parasitized by a star worm. The star worms also had powerful hidden killer weapons, the king worms. In the end, Ming Jin would also die.",
        "Qi Shiyan agreed with Jiang Ren’s words, but he was even more impressed by Jiang Ren’s cooking skills. “Jiang Ren, the king worm meat you made is really delicious!”",
        "Not only was it delicious, the king worm meat also contained strong energy. After he took a bite, he felt full of strength! ",
        "“If it tastes good, eat more.” Jiang Ren said.",
        "Qi Shiyan nodded repeatedly, then picked up a piece and fed it to Ming Zheng.",
        "Ming Zheng looked at the live broadcast cameras and opened his mouth to eat.",
        "Forget it, his worst appearances had all already been broadcast live, so what did this matter now? ",
        "Thinking of this, Ming Zheng called over some crew members on the spaceship and asked them to move out the various ingredients collected by the retired emperor so that Qi Shiyan could eat them.",
        "“Ah Yan, the retired emperor is very particular about what he eats. In his kitchen, there are many things that ordinary people can’t eat. You can try them.”",
        "Jiang Ren did have a lot of good things in his hands, but he couldn’t compare with the retired emperor.",
        "Jiang Ren might not even have heard of some of the delicacies on the private planets owned by the imperial family. ",
        "Even he had never eaten those things.",
        "“Yes, Your Majesty!” The crew members responded.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ming Zheng said, “Since we are overthrowing the imperial family, don’t call me Your Majesty.”",
        "“What should we call you then?” Qi Shiyan asked. ",
        "Ming Zheng thought for a moment and said, “Marshal?”",
        "“Marshal Ming!” Qi Shiyan called out with a smile.",
        "Ming Zheng looked at him and couldn’t help laughing.",
        "After the two of them had eaten and drunk their fill, they both got busy. ",
        "Qi Shiyan had to help people eliminate star worm poison, and Ming Zheng also had a lot of work to do.",
        "They were busy with their own matters for several days, and by this time, the situation of the retired emperor was finally clarified.",
        "The asteroid that the retired emperor’s spaceship encountered on the way to the border was indeed a worm nest.",
        "The star worm inside that looked like a large silkworm was the ruler of the star worms. ",
        "In the Human Empire, people used to think that the king worm was the ruler of the star worms, and even gave it the title of the “star worm Queen Mother”, believing it to be very powerful.",
        "But in fact, the “star worm Queen Mother” who gave birth to the king worms and high-level star worms was very weak.",
        "The energy in its body had been exhausted. It had reached the end of its lifespan, and it wouldn’t have been able to live much longer even if they didn’t kill it.",
        "Researchers studied this asteroid and discovered that it had been built into a worm nest in the past twenty years. It should be that after the star worm army confronted humans, they built such a nest for their queen. ",
        "After studying the traces in the asteroid, they also concluded that the three king worms had been staying by their queen’s side for the past twenty years.",
        "As for why they left their nest this time and attacked Qi Shiyan, it was probably to protect their new queen.",
        "According to genetic comparison, the star worm in the retired emperor’s body was the new queen of the star worm colony.",
        "“Twenty years ago, didn’t the retired emperor go to the front lines? He fought with star worms at that time, but was quickly frightened and ran away. It was also at that time that we captured images of a king worm. If we haven’t guessed wrong, it was at that time that the star worms placed their future queen’s egg into the retired emperor’s body.” ",
        "“We found some human-like star worms in the star worms’ nest, and also discovered a lot of high-tech products. The star worms must have been trying to invade human civilization.”",
        "“Once the star worm Queen Mother in the emperor’s body hatched successfully, it should have been able to give birth to human-like king worms and high-level star worms. If that happened, humans might have become ruled by star worms and become their slaves and food.”",
        "",
        "“Fortunately, the Heavens favored humanity.”",
        "… ",
        "In the past few days, countless scientists had been studying the contents of that asteroid. The more they studied, the more frightened they became.",
        "Humanity had almost been wiped out!",
        "Fortunately, Qi Shiyan appeared out of nowhere and saved them all.",
        "Jiang Ren smiled and said, “Qi Shiyan, do you know that you are now the most popular person on the star network? Almost everyone in the empire is your fan.” ",
        "If the retired emperor and his lackeys were not still alive, he would not have to add the word “almost” when he spoke.",
        "Qi Shiyan was quite happy. “Then can I debut right here?”",
        "Jiang Ren’s eyes lit up. “Of course!”",
        "If Qi Shiyan made his debut, he would definitely become the most popular celebrity in human history. ",
        "Qi Shiyan thought for a while and said, “Forget about being a celebrity. I plan to open a large sanatorium and become the director. Then I can live broadcast everyday life in the sanatorium to everyone. I also want to visit various places. Oh, and I can also open an orphanage and raise a large group of children…”",
        "Being a celebrity was too tiring and left him no time to get close to others.",
        "It would be more interesting to open a sanatorium and an orphanage and be surrounded by countless people every day.",
        "He could interact with people in the sanatorium and orphanage during the day and sleep with Ming Zheng in his arms at night. It was simply a wonderful life. ",
        "***",
        "T/N: *螳螂捕蝉, 黄雀在后 (tang lang bu chan, huang que zai hou) – literally the mantis stalks the cicada, unaware of the oriole behind. An idiom that means to pursue a small gain unaware of lurking danger. Often used in situations where you think you’re scheming against someone, unaware that at the same time, someone more dangerous is scheming against you."
    ],
    "previous": "Ch64.1 - Extra_ Behind The Scenes",
    "next": "Ch65 - Extra_ Jealousy"
}