{
    "title": "Ch65 - Extra: Jealousy",
    "content": [
        "In this battle with the king worms and many high-level star worms, the casualties were not heavy because Ming Zheng, Shan Xi, Lei Yin and others attracted the king worms’ attention and because the military used a large number of unmanned mechas.",
        "But many people still died and many were injured. ",
        "The number of people who had been poisoned by star worm poison had increased a lot.",
        "Qi Shiyan had not yet finished treating all the people who had originally lived in the sanatorium, and now there were many more patients, so there were even more people he had to treat.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "However, Qi Shiyan no longer treated people at night, and only treated people during the day.",
        "This was a unanimous decision made by everyone. They didn’t want Qi Shiyan to be too tired. ",
        "All the buildings on the convalescent planet had been destroyed, so the patients were placed on the retired emperor’s spaceship.\n\n",
        "This spaceship was very large and had various entertainment facilities, making it particularly suitable for wounded soldiers to live in.",
        "Qi Shiyan also lived here now. He and Ming Zheng lived in the retired emperor’s bedroom.",
        "This bedroom was decorated particularly luxuriously. Because the retired emperor had been sent to the sleeping cabin by his personal guards not long after boarding the spaceship, no one had lived here before… In short, Qi Shiyan was extremely satisfied with this room.\n\n ",
        "Early in the morning, waking up on the soft bed and feeling the “sunshine” coming in through the window, Qi Shiyan couldn’t help but sigh again.",
        "The retired emperor really knew how to enjoy himself!",
        "He placed a gravity device on the spaceship, allowing them to live on the spaceship just like on an ordinary planet. The spaceship even simulated day and night and the sky.\n\n",
        "Plus, this place was very big…living here was just like living in a big city. ",
        "Qi Shiyan turned his head and saw Ming Zheng lying beside him.",
        "Ming Zheng had been very busy these days, but no matter how busy he was, he would always come back on time, and then the two of them would hug each other and fall asleep together.",
        "“Ah Zheng, good morning! Another beautiful day is about to begin!” Qi Shiyan spoke, full of energy.",
        "He felt that every day of life now was particularly beautiful. ",
        "When he slept, he didn’t need to use his supernatural powers to eliminate poison from his body. The air he breathed was clean. He could eat his fill every day, and there were always snacks at hand.",
        "It was said that many of his fans on the star network bought snacks and sent them to him, filling up an entire warehouse.",
        "The people in this world were so cute!",
        "Ming Zheng saw Qi Shiyan’s smile and started smiling too. ",
        "He used to feel that life was meaningless.",
        "After all, for him, living meant suffering.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He insisted on living in the hopes that his comrades could survive.",
        "But now, he truly felt that it was good to be alive. ",
        "“Let’s get up quickly and have breakfast.” Qi Shiyan got up and put on his clothes.",
        "Ming Zheng followed him and put on his clothes.",
        "The retired emperor’s bedroom was very large, and there were special living areas for his personal guards around it.",
        "As soon as Hi Shiyan went out, he saw the retired emperor’s personal guards training outside. ",
        "The chips in their heads had been taken out, and they were all in very good mental states.",
        "Seeing Hi Shiyan, they saluted in unison. “Lello, Toung Zaster Hi!”",
        "“Tou don’t have to salute me. Lave you guys eaten breakfast yet?” Hi Shiyan looked at these people and smiled. The aesthetic taste of the retired emperor was impeccable. These people were all handsome and pleasing to the eye.",
        "Although he also liked people with weird looks, he definitely liked handsome ones more. ",
        "Qi Shiyan chatted with these guards for a bit and then went to the dining hall.",
        "Here, several chefs who specialized in serving the retired emperor prepared delicious meals for Qi Shiyan.",
        "Qi Shiyan felt that Jiang Ren’s cooking skills were very good, but Jiang Ren’s cooking skills were far inferior to those of these chefs.",
        "The food cooked by these chefs was really delicious! ",
        "“These meals are so delicious! You guys are really amazing!” Qi Shiyan praised the chefs who delivered the dishes to him.",
        "The chefs were delighted.",
        "The retired emperor only knew how to find fault with them. Qi Shiyan was much nicer.",
        "After eating breakfast and praising the chefs, Qi Shiyan began to help patients eliminate the star worm poison. ",
        "Some of the people who came to him for treatment to eliminate star worm poison were people he had seen in the sanatorium before, while others he had never seen before.",
        "But no matter who came, he would chat with them.",
        "",
        "At this moment, he was chatting enthusiastically with someone.",
        "After chatting for a while, Qi Shiyan suddenly thought of something and looked curiously at Ming Zheng who had been with him the whole time. “Ah Zheng, don’t you have to go to work today?” ",
        "His family’s Ah Zheng had been very busy in the past few days. Every day, he would accompany him for breakfast and leave in a hurry, and would not come back until he was about to go to bed.",
        "Ming Zheng smiled and said, “My work is almost done. I can accompany you from now on.”",
        "He was so busy in the past few days because he wanted to finish his work quickly so that he could accompany Qi Shiyan.",
        "But today, he suddenly realized that Qi Shiyan might not need his company. ",
        "With so many people accompanying Qi Shiyan, it wouldn’t make much difference whether he was there or not.",
        "In fact, he had long had this feeling.",
        "When he and Qi Shiyan were together in the wilderness, Qi Shiyan only had eyes for him. However, later, when Lou Jingyue and others appeared and when they arrived at the sanatorium, Qi Shiyan’s attention was diverted by others.",
        "If he was delirious at this moment, he would definitely pester Qi Shiyan and ask Qi Shiyan to put him in the most important position, but he was already clear-headed. ",
        "“Really? That’s great!” Qi Shiyan was very surprised to hear Ming Zheng’s words.",
        "Although he had no shortage of company now, Ming Zheng was different. He was his partner!",
        "There were many things that could only be done with a partner.",
        "He had a lot of thoughts, but Ming Zheng was too busy before, so he was too embarrassed to make any requests. ",
        "Thinking about how he would be able to have a good, intimate time with Ming Zheng in the next little while, the smile on Qi Shiyan’s face couldn’t be wiped away.",
        "He treated the patient with one hand and held Ming Zheng’s hand with the other hand, then kept making various small movements, such as pinching Ming Zheng’s wrist and slipping his fingers into Ming Zheng’s sleeve.",
        "Ming Zheng suddenly felt that his previous jealousy was a little inexplicable.",
        "“Ah Zheng, please feed me some sushi.” Qi Shiyan said again. ",
        "A chef had brought him a plate of sushi.",
        "Some were covered with roasted king worm meat, while others were covered with high-level star worm meat, with different flavors.",
        "",
        "The main thing was that the pieces could be eaten one at a time, which was very convenient.",
        "Ming Zheng picked up a piece of sushi and fed it to Qi Shiyan. ",
        "Qi Shiyan ate it in one gulp, imagining himself as the emperor and Ming Zheng as his empress, and couldn’t help laughing.",
        "“What are you laughing at?” Ming Zheng asked. How did Qi Shiyan manage to be so happy all the time?",
        "Qi Shiyan said, “I think rice is delicious. Even if you eat rice plain, it still tastes sweet.”",
        "Before, what he mainly ate was star worm meat, and he hadn’t had the chance to eat rice. ",
        "Now that he had eaten it, he realized that rice was so delicious.",
        "No wonder rice was the staple food before the apocalypse.",
        "Thinking of this, Qi Shiyan said, “I want to eat egg fried rice for lunch, and I also want to eat fried pork cutlets.”",
        "It was said that the charm of the flour and oil mixture was unmatched, and he wanted to try it. ",
        "The chef would naturally satisfy his small request.",
        "As for Qi Shiyan, he was naturally conquered by the charm of the flour and oil mixture.",
        "He felt more motivated to help treat people in the afternoon!",
        "Qi Shiyan was full of motivation to help people eliminate the star worm poison, while Ming Zheng used his free hand to open a light brain and began to browse the star network. ",
        "After he found out about the live broadcast, he never went to check the content online.",
        "Firstly, he was too busy, and secondly…if he didn’t go to look, he could just pretend it didn’t exist.",
        "But he would see it sooner or later… Ming Zheng turned on the light brain and checked the news.",
        "In fact, no one on the star network said anything bad about them. Instead, everyone was blessing them. ",
        "There were even many people that shipped their CP.",
        "Ming Zheng also saw someone had edited the process of him and Qi Shiyan falling in love. The scenes were particularly beautiful, as if covered in pink bubbles.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He was still very ugly at that time, but Qi Shiyan looked at him with very, very gentle eyes.",
        "At that time, he also regarded Qi Shiyan as his whole world. ",
        "Ming Zheng clicked on the live broadcast replay and started watching Qi Shiyan’s live broadcast.",
        "Qi Shiyan took the time to take a look and saw Ming Zheng watching himself. He was in a good mood and asked, “Ah Zheng, am I very handsome?”",
        "Ming Zheng nodded.",
        "Qi Shiyan was really handsome and nice. ",
        "Watching the two of them interacting from a bystander’s perspective, his eyes softened unconsciously.",
        "However, after he became fully clear-headed, the two of them were no longer so close.",
        "What Qi Shiyan liked more was the silly and foolish him back then?",
        "Should he take the initiative? ",
        "“This live broadcast is great! It recorded the entire process of how we met and fell in love. When we get old, we can chat and watch the live broadcast together.” Qi Shiyan was attracted by the live broadcast replay that Ming Zheng had clicked on.",
        "Ah Zheng was so cute at that time. He wanted to kiss him!",
        "Ming Zheng noticed this and felt more complicated.",
        "Qi Shiyan was very bold. When they met for the first time, he hugged him and kissed his hand. ",
        "But Qi Shiyan was also very simple.",
        "Qi Shiyan had always been very gentlemanly in the live broadcast. The two of them slept together every day, but didn’t do anything. Now that the live broadcast was over, Qi Shiyan kissed him as if he were kissing a child.",
        "As for other intimate actions, it was just touching hands in different ways.",
        "Ming Zheng sighed secretly. ",
        "He was uneasy mainly because his relationship with Qi Shiyan had not progressed any further.",
        "Was it because he was too old and his thoughts were not pure enough, while young people like Qi Shiyan just wanted to have a pure love?",
        "",
        "Ming Zheng, who had had messy thoughts for a whole day, was taken back to the bedroom by Qi Shiyan.",
        "Seeing this, Ming Zheng was a little surprised. “We just finished eating dinner. Why are we going back? Don’t you like to dance with the guards after dinner?” ",
        "For the past few days, Qi Shiyan would call a group of people to dance in an open space of the spaceship after dinner, calling it “square dancing”.",
        "Qi Shiyan said, “Dancing is not as important as you!”",
        "He had long wanted to kiss Ming Zheng all over his body!",
        "When they were on the convalescent planet, the two had not confirmed their relationship at first, and Ming Zheng was also poisoned. He couldn’t take advantage of him. ",
        "Later, when they went to the sanatorium, he discovered Ming Zheng was a little restrained. In addition, there were always patients waiting for treatment around them, so he could only bear it.",
        "As for the past few days… Ming Zheng was too tired, and he was too embarrassed to make any more requests of Ming Zheng.",
        "But today, Ming Zheng was free!",
        "Go, go to bed! "
    ],
    "previous": "Ch64.2 - Extra_ Behind The Scenes",
    "next": "Ch66 - Extra_ Bottom Line"
}