{
    "title": "Ch66 - Extra: Bottom Line",
    "content": [
        "Ming Zheng only slept for three hours before he was awakened by the “sunlight” coming in from the window.",
        "He opened his eyes, feeling a little dazed. ",
        "The night was finally over…",
        "Yesterday, after dinner, the two of them returned to the bedroom. Then, Qi Shiyan looked at him seriously. “Ah Zheng, you know, I have skin hunger syndrome… I might do some things that are too excessive later. Can you not be angry?”\n",
        "",
        "Qi Shiyan was very serious when he said this, so much so that he became worried. “Is your condition very serious? What’s the situation? Will it hurt anyone?”",
        "If it wouldn’t hurt anyone, Qi Shiyan shouldn’t have to ask him so seriously not to be angry. ",
        "Qi Shiyan laughed. “Don’t worry about that. I won’t hurt anyone.” How could he bear to hurt anyone? He was even more reluctant to let Ming Zheng get hurt.\n\n",
        "Hearing Qi Shiyan say this, he felt relieved. “I won’t get angry.”",
        "Then, Qi Shiyan pestered him.",
        "Now that the night had passed, Ming Zheng finally understood why Qi Shiyan asked him that.\n\n ",
        "He indeed wasn’t angry, but his mood was a little complicated.",
        "How to put it…Qi Shiyan kissed him last night for at least five hours.",
        "He kissed slowly, inch by inch, trying not to miss any inch of skin.\n\n",
        "He felt like he was being stamped by someone and not a single area could be left out. ",
        "Qi Shiyan also kept praising him. Even his hair was praised over a hundred times.",
        "He was dumbfounded.",
        "It was nice to be close to Qi Shiyan, and it was nice to be praised, but this was really weird.",
        "He felt like a fine work of art, and there was a pervert who was madly obsessed with him. ",
        "It made him speechless.",
        "At the beginning, Ming Zheng was so excited that his face turned red, but in the end he became numb.",
        "This was a little different from what he had imagined.",
        "Ming Zheng almost thought that the evening would pass by so inexplicably, but fortunately, things got to the point later. ",
        "Thinking about what happened afterward, Ming Zheng began to doubt life again.",
        "Qi Shiyan was young and cute, and so thin when they first met.",
        "Please visit chrysanthemumgarden (dot) com",
        "Although he kept acting like a spoiled child toward Qi Shiyan when he was not clear-headed, when he was clear-headed, he always thought about taking good care of Qi Shiyan in the future and not letting Qi Shiyan suffer any grievances.",
        "He thought that he would be a very good husband. ",
        "There was no doubt that Qi Shiyan thought this way as well.",
        "Forget it, it was no big deal.",
        "Thinking about how he was originally going to die, but now not only was he alive and well, he also had a partner who loved him very much… there was nothing that he couldn’t accept.",
        "It was a pleasant experience anyway. ",
        "However, wasn’t Qi Shiyan hugging him too tightly?",
        "Ming Zheng, lying on the bed, felt unable to move.",
        "“Ah Zheng, are you awake?” Qi Shiyan kissed Ming Zheng on the face.",
        "Ming Zheng shuddered and was a little afraid that Qi Shiyan would do it again. ",
        "Qi Shiyan’s excitement last night had frightened him a bit.",
        "“I’m awake. It’s getting late. Let’s get up.” Ming Zheng sat up from the bed.",
        "The process was difficult, not because he was injured, but because Qi Shiyan refused to let him go.",
        "The two of them sat up together. ",
        "“It’s still early. There’s no rush to get dressed.” Hi Shiyan buried his face in Zing Iheng’s chest.",
        "Le didn’t want to go out and wanted to hold Zing Iheng in his arms all the time.",
        "It felt so good to hold a living person tightly in his arms!",
        "He used to be able to only hug a doll, but the doll had no heartbeat and couldn’t talk to him. ",
        "Ming Zheng was helpless. “Normally at this time, you would have already gotten up.”",
        "“Okay…Ah Zheng, you’re not working today, right?” Qi Shiyan asked.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng met Qi Shiyan’s expectant expression and said, “I’m taking a break today.”",
        "He told people the day before yesterday that he would take a few days off to accompany Qi Shiyan. ",
        "“That’s great! Ah Zheng, you must stay with me for a few more days.” Qi Shiyan hugged him tighter.",
        "It was easy for human beings to go from frugality to extravagance, but difficult to go from extravagance to frugality.",
        "Before, he was already very satisfied just being able to hold hands with Ming Zheng.",
        "But he was no longer the same person he used to be! ",
        "Now, he wanted to kiss, hug and cling to Ming Zheng, and then do something else. Only then would he feel satisfied.",
        "Thinking of this, Qi Shiyan asked, “Ah Zheng, how do you feel? Do you feel uncomfortable anywhere?”",
        "At the beginning yesterday, he only wanted to take a good look at Ming Zheng’s body, but later, he did all the things he should and shouldn’t do.",
        "The end result was that the two of them didn’t sleep until 4 a.m. in the morning. ",
        "If he wasn’t afraid of making Ming Zheng feel uncomfortable, he would have stayed up all night.",
        "“I don’t feel uncomfortable anywhere… I rested in the medical cabin before.” Ming Zheng said.",
        "Qi Shiyan was very careful and gentle. As soon as he was done, he put him into the medical cabin.",
        "For someone like him who had gone to the battlefield at the age of 18, such minor injuries were nothing at all and he didn’t need to go lie in the medical cabin. ",
        "Now, he didn’t feel any discomfort at all.",
        "“That’s good. Ah Zheng, let me help you put on your clothes.” Qi Shiyan suggested.",
        "“I can put them on myself.” Ming Zheng said.",
        "“Ah Zheng, I want to help you put on your clothes. I used to be alone and had no one to accompany me. I always wanted to know what it felt like to help others put on their clothes… Ah Zheng, you can also help me put on my clothes.” Qi Shiyan said. ",
        "Ming Zheng felt soft-hearted when he heard his words.",
        "Then, he indulged Qi Shiyan, letting Qi Shiyan help him dress, and take advantage of him in the process.",
        "",
        "If Qi Shiyan wasn’t so handsome and didn’t have such a pure look in his eyes, his salted pig hands* would have been chopped off several times.",
        "After finally getting dressed and going downstairs, Ming Zheng breathed a sigh of relief. Qi Shiyan then put his arm around his shoulders and leaned on him. “Ah Zheng, I really don’t want to be separated from you for even a moment.” ",
        "Ming Zheng just went downstairs with Qi Shiyan hanging on his shoulder like this.",
        "In the dining hall downstairs, the chefs who had already prepared breakfast looked at them with a gratified smile and asked Qi Shiyan. “Young Master Qi, do you want to eat something easy to digest?”",
        "Qi Shiyan didn’t think too much. “Okay, eat something easy to digest. That way, I can eat more.”",
        "Chefs: “…” That wasn’t what they meant… ",
        "His Majesty brought Young Master Qi back to his room early yesterday. The atmosphere between the two of them was different today. They were concerned about Young Master Qi’s health.",
        "But if they thought about it carefully, there was the medical cabin, so there was actually no need to worry.",
        "They piled various breakfast dishes in front of Qi Shiyan.",
        "Qi Shiyan looked at Ming Zheng again. “Ah Zheng, I want to feed you. No one took care of me before, so I want to take good care of others.” ",
        "The requests that Qi Shiyan made to Ming Zheng would not hurt Ming Zheng and were easy to achieve, though a little embarrassing.",
        "Ming Zheng took a deep breath and finally agreed.",
        "Forget it. The videos of Qi Shiyan feeding him meat were now everywhere on the star network. It was actually no big deal to let Qi Shiyan feed him food.",
        "After taking a few bites of the food that Qi Shiyan fed him, Ming Zheng suddenly realized that something was wrong. ",
        "His bottom line had been broken by Qi Shiyan time and time again. If this continued, what would he become?",
        "Would he accompany Qi Shiyan to dance those demonic dances without changing his expression?",
        "Would they feed each other in public?",
        "Ming Zheng’s movements froze for a moment. Then he felt that he shouldn’t be like this. ",
        "He still had some bottom line.",
        "For example, at this moment, he asked the chefs to leave the area and go somewhere else for breakfast.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "After breakfast, Qi Shiyan went to help people eliminate the star worm poison as usual.",
        "During this period, he always stuck to Ming Zheng. ",
        "Ming Zheng: It was sweet, but also shameful.",
        "But at least he was no longer jealous.",
        "Qi Shiyan still treated him differently.",
        "At noon, a few old friends brought a few people to see Qi Shiyan and had lunch with them. ",
        "Lou Jingyue brought Marshal Lou and his older sister, Lieutenant General Lou.",
        "Shan Xi brought Marshal Duan.",
        "Lei Yin brought one of her comrades.",
        "Finally, there was Marshal Ke Lun, who was all alone. ",
        "Marshal Ke Lun was seriously injured after fighting against the king worm on the convalescent planet and had to stay in a medical cabin for several days before coming out.",
        "“The doctor told me to do some light exercise to keep fit. I heard that you square dance every day? Can I join you?” Marshal Ke Lun asked.",
        "Qi Shiyan said, “Of course, you’re most welcome! But I don’t have time to dance recently…” Dancing was far less interesting than Ming Zheng, and he wanted to be with Ming Zheng.",
        "“It’s okay. I’m just dancing around casually anyway.” Marshal Ke Lun said with a smile. ",
        "At this time, Ming Zheng suddenly said, “He has time to dance.”",
        "He must have his own bottom line.",
        "It was too early to go back to the bedroom right after eating. It would be better for Qi Shiyan to go dancing first.",
        "Qi Shiyan glanced at Ming Zheng and said, “Yes, I have time. We can dance in the afternoon.” ",
        "This spaceship simulated sunrise and sunset, but it was not a real sunrise and sunset.",
        "He could dance with everyone in the afternoon.",
        "",
        "Having just experienced a big battle, the atmosphere on the front lines was actually very tense. If he led people to dance, it could help everyone relax a little.",
        "By the way, their dancing was also broadcast live. It was said that many soldiers would dance along with them. ",
        "“Okay.” Marshal Ke Lun laughed.",
        "Qi Shiyan immediately made an appointment with Marshal Ke Lun.",
        "After eating lunch, Qi Shiyan took Ming Zheng with him to continue eliminating poison from people.",
        "Before any patients arrived, Qi Shiyan asked, “Ah Zheng, you just said I have time to dance. Do you not want to be with me tonight? Did I go too far last night? You don’t like me treating you like that?” ",
        "Qi Shiyan looked a little pitiful when he spoke.",
        "Ming Zheng immediately said, “Ah Yan, you didn’t do anything excessive. I like the way you treat me.”",
        "“Really?” Qi Shiyan’s eyes lit up.",
        "Ming Zheng nodded. “Really.” ",
        "“Then I want to do it again tonight,” Qi Shiyan said, “I have only been surrounded by robots since I was a child. I really want to hug someone…”",
        "“Okay.” Ming Zheng agreed.",
        "After agreeing, he realized that when he faced Qi Shiyan, there was no such thing as a bottom line.",
        "In fact, there was nothing wrong with indulging Qi Shiyan. ",
        "Qi Shiyan had skin hunger syndrome. He was so much older than Qi Shiyan. What was wrong with giving in to Qi Shiyan?",
        "So, that night, Ming Zheng was tossed and kissed for a long time again.",
        "It… was quite torturous.",
        "He wanted to stop, but when he met Qi Shiyan’s pitiful eyes… forget it, just accept his fate. ",
        "Ming Zheng hugged Qi Shiyan and kissed him.",
        "Qi Shiyan became even more excited. “Ah Zheng, I like this! Kiss me again.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ming Zheng did not go to sleep until the middle of the night again",
        "Before sleeping, he lay in the medical cabin for a while. ",
        "He still woke up on time yesterday, but today he woke up late.",
        "Plus they still had to get dressed… by the time the two of them went downstairs, it was already three hours later than their usual breakfast time.",
        "They took so long to get up that Lu Yuan was a little worried. He came over with Jiang Jin to check on them.",
        "Seeing that Qi Shiyan looked like he wanted to hang on Ming Zheng and even fed him, Lu Yuan secretly sent a message to Ming Zheng. “Your Majesty, Qi Shiyan is still young. Don’t tire him out too much.” ",
        "He had heard that they had gone back to their room early these past two days. Now they got up so late… was His Majesty’s old house on fire* and couldn’t be stopped?",
        "Ming Zheng who received the message: “…” He felt that he was a little wronged.",
        "On the side, Jiang Jin saw Lu Yuan looking at Qi Shiyan with concern and thought Lu Yuan was a little stupid.",
        "Based on his understanding of His Majesty… it was probably His Majesty who suffered. ",
        "Although His Majesty looked cold and indifferent, he was actually very soft-hearted and could be easily taken advantage of.",
        "But he wouldn’t interfere in the affairs of this young couple.",
        "His Majesty looked at Qi Shiyan with such tenderness. It was obvious that he was willing.",
        "After breakfast, Qi Shiyan said to Jiang Jin, “Director Jiang, I want to change the procedure for treating patients today. I didn’t sleep well last night, so I need to catch up on sleep. Today, I will treat one person first, then go to sleep for a while, and then treat another person when I get up.” ",
        "He used to chat with the patients, but not today.",
        "He wanted to catch up on some sleep with Ming Zheng!",
        "Sleep was very important, and lack of sleep was bad for one’s health.",
        "Only when they were in good health could they live a long and happy life. ",
        "In the next few days, Ming Zheng felt that his life was extremely decadent.",
        "Apart from eating and sleeping, he spent his days accompanying Qi Shiyan. The times when Qi Shiyan went to help people eliminate star worm poison were only enough time for him to go to the bathroom.",
        "",
        "Fortunately, Qi Shiyan went dancing for an hour every day, which gave him some time to breathe.",
        "Now, he had begun to like dancing… ",
        "What about his bottom line?",
        "***",
        "T/N: *咸猪手 (xian zhu shou) – literally salted pig hands. Slang for pervert, particularly someone who gropes women in public.",
        "*老房子着火 (lao fang zi zhao huo) – literally old house on fire. Refers to a fiery and passionate love that is difficult to put out, just like it’s hard to put out the fire on a burning house. Usually refers to someone who has never been in love before. "
    ],
    "previous": "Ch65 - Extra_ Jealousy",
    "next": "Ch67 - Extra_ Going Home"
}