{
    "title": "Ch67 - Extra: Going Home",
    "content": [
        "Qi Shiyan liked square dancing very much.",
        "Firstly, he liked exercise, and secondly, he liked being in a lively environment. ",
        "In his previous life, he had little chance to exercise.",
        "Exercise required energy, but he didn’t have enough food.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Exercise also caused him to inhale large amounts of toxic air.",
        "In this world, he could exercise as much as he wanted, which was really great. ",
        "Qi Shiyan danced non-stop for an hour and worked up a sweat. He felt relaxed and walked toward Ming Zheng, who was standing on the side and watching them dance, with a smile on his face.\n\n",
        "Ming Zheng handed Qi Shiyan a drink and a wet towel.",
        "Qi Shiyan took the drink and looked at Ming Zheng with great interest. “Ah Zheng, please help me wipe the sweat off my face.”",
        "Ming Zheng did not object.\n\n ",
        "At this time, Lou Jingyue came over and said, “Your Majesty, why do you just watch and not dance every day? Do you want to dance with us?”",
        "Once Lou Jingyue found out that Qi Shiyan had previously carried a live broadcast device on him and that everything he had done around Qi Shiyan had been broadcast live, he wished he could dig a hole and bury himself.",
        "He was so stupid. He didn’t want to see anyone.\n\n",
        "But his father and older sister always dragged him to meet people. ",
        "When those people saw him, they kept praising him for his innocence and liveliness.",
        "Damn innocent and lively! In the past, others always praised him for his outstanding talent and strong strength!",
        "Lou Jingyue was very crazy at first, but after being crazy for a while, he decided to smash the already cracked jar* and let himself go.",
        "In fact, it was quite liberating after he let go. Now he could say whatever he wanted without having to put on airs anymore. ",
        "“I’m not interested.” Ming Zheng said.",
        "Lou Jingyue said, “You will start to like it as you dance more!”",
        "Ming Zheng ignored Lou Jingyue and looked at Qi Shiyan instead. “Ah Yan, I just received news that the retired emperor has died. Next, the passengers on this spaceship will be sent back to the Capital Star. Do you want to go see them?”",
        "“How did the retired emperor die?” Qi Shiyan was curious. ",
        "Ming Zheng said, “He was bitten to death by the star worm that parasitized his body.”",
        "The newborn star worm queen was very fragile. This star worm queen was especially fragile because she was actually driven out early by Qi Shiyan before she was ready to hatch.",
        "",
        "At the beginning, it was relatively well behaved and kept sending some signals that humans could not understand. Then some intermediate-level star worms that had slipped through the net would come and try to rescue it.",
        "Of course, those intermediate-level star worms couldn’t rescue it. ",
        "Now, half a month had passed since the decisive battle.",
        "After confirming that it was the only new queen, the researchers prepared to kill it.",
        "The hatred between humans and star worms was too deep. If they let it go, and it eventually gave birth to another colony of star worms, then they would all be sinners of humanity.",
        "Uerhaps realihing the choice made by humans, the new dueen became very angry and bit to death the retired emperor who had been shouting and clamoring for the new dueen to be removed from his body. ",
        "After the retired emperor died, the new queen also died.",
        "Qi Shiyan said, “What an unexpected ending…”",
        "After he came to this world, all those seemingly powerful villains behind the scenes suddenly disappeared one by one…",
        "“Indeed.” Ming Zheng said. ",
        "As soon as he received the news, he gave an order to the people in the laboratory to destroy the body of the retired emperor, and all the genetic samples and experimental records that had been obtained from the new queen.",
        "He didn’t want anyone to study this thing.",
        "“Ah Zheng, I want to go and see the imperial family members who came here on this spaceship.” Qi Shiyan said.",
        "He mainly wanted to meet Ming Jin, the person who killed the original owner of this body. ",
        "Since he used the original owner’s body, he must help the original owner take revenge and not let the original owner die in vain.",
        "But before he could do anything, the enemies of the original owner were all arrested. They had harmed more people than just the original owner, and were destined to receive the punishment they deserved.",
        "All he could do now was to go and see the other party and cause some trouble for him.",
        "The retired emperor’s spaceship had now been converted into a camp for wounded soldiers, where soldiers who were injured or disabled in the battle lived. ",
        "As for the future… Ming Zheng planned to turn this spaceship into a tourist attraction.",
        "In this way, the crew members and chefs who once served the retired emperor could continue to work on the spaceship.",
        "Please visit chrysanthemumgarden (dot) com",
        "As for the money earned, it would first be used to maintain the operation of the spaceship. If there was any extra, it would be used for military expenditures.",
        "Now, the former imperial family members and imperial dignitaries had all been arranged on other spaceships. ",
        "Those who had not committed any crimes had relatively good places to live, but Ming Jin and his group’s living environment was not so good.",
        "But that was only from the perspective of proud sons of heaven like Ming Jin.",
        "“This spaceship was previously used by the new recruits who came to protect the convalescent planet. Four people share a room, and every five rooms are equipped with a toilet and shower room. There is a dining hall for meals, which provides nutrient solution and several convenience foods.” Jiang Ren introduced to Qi Shiyan the place where those people lived.",
        "During this period of time, he had been staying here, and whenever he had time, he went to provoke those powerful people. ",
        "After the introduction, Jiang Ren sighed. “The military is so kind that they actually gave them such a good place to live.”",
        "Qi Shiyan nodded in agreement. “This place is indeed very good.”",
        "The place where those people lived was a bit like the sleeper compartment on a train.",
        "It was really nice for a large group of people to live together in a lively environment. There was also enough food and they didn’t have to worry about going hungry. ",
        "Jiang Ren said, “Yes, we shouldn’t give them such a good place to live.”",
        "Qi Shiyan said, “I also want to live in a place like this.”",
        "The guard who heard the conversation between the two: “…”",
        "This place was indeed not a bad place to live. After all, soldiers like him had always lived in places like this. ",
        "But those powerful people who were imprisoned here kept complaining and expressing dissatisfaction, thinking that this place was not a place fit for human habitation.",
        "It was said that the conditions in the imperial prison were a thousand times better than here…so sometimes, this world was really unfair.",
        "“Qi Shiyan, they are all in their respective rooms at this time. Shall we go over there?” Jiang Ren said excitedly.",
        "Qi Shiyan agreed immediately. “Okay!” ",
        "“I’ll lead the way!” Jiang Ren walked in front. “Qi Shiyan, I arranged the rooms for these people. I specially arranged people who have grudges in one room, so it has been very lively here these past few days.”",
        "These people were birds of a feather, but they were not close to each other. Some of them even had grudges against each other.",
        "",
        "Jiang Ren specifically arranged those with grudges in the same room.",
        "Ming Jin lived with Prince Renhe and two of his other brothers. ",
        "Among the four people, Ming Jin was the youngest, while the ages of the other three were not much different.",
        "When the retired emperor was in power, these three people had fought tooth and nail for the position of crown prince, and their hatred was as deep as the sea.",
        "As for Ming Jin… Jiang Ren told them how Ming Jin instigated Ming Qingyu to arrange a live broadcast, poisoned Qi Shiyan’s escape pod, and did some tricks behind the scenes. He also told them that Ming Jin planned to bring down Ming Qingyu and inherit the throne himself.",
        "These four people now had bruises on their faces and noses every day, with new and old wounds on their bodies. ",
        "Even princes could fight.",
        "When Qi Shiyan went in, they were fighting.",
        "The original owner had met these people before.",
        "Prince Renhe disliked the original owner and scolded him often. The other two princes had a grudge against Prince Renhe and did not have a good attitude toward the original owner either. ",
        "As for Ming Jin, there was no need to mention him.",
        "As soon as the door opened, Qi Shiyan greeted them with a smile. “Hello, everyone!”",
        "The four people standing in the narrow room looked particularly ugly when they saw Qi Shiyan.",
        "Qi Shiyan was in a good mood. “I didn’t expect that when we met again, it would actually be like this… I’m so happy to see that you guys are not doing well!” ",
        "He came here specifically for the same purpose as Jiang Ren, which was to cause trouble.",
        "And this obviously worked, as the four people became even angrier.",
        "They wanted to say something, but soon, Qi Shiyan’s mental power suppressed them so much that they could not speak.",
        "Qi Shiyan ignored Prince Renhe and the others, and only looked at Ming Jin seriously. “Ming Jin, I thought you were a good person before. I didn’t expect you wanted to kill me.” ",
        "Ming Jin was trembling all over.",
        "He always felt that he was a rare smart person among the imperial family members.",
        "",
        "He took two steps at a time, hoping that he would soar to great heights in the future.",
        "But Qi Shiyan disrupted his entire plan! ",
        "He knew the situation was hopeless and was afraid of being devoured by star worms, so he boarded the retired emperor’s spaceship. However, he never expected that the spaceship would actually sail to the border.",
        "When Ming Jin woke up from the sleeping cabin and saw a group of military personnel surrounding him, he almost collapsed.",
        "And this was just the beginning…",
        "Ming Jin’s eyes were filled with resentment. After Qi Shiyan used his mental power to do some things to Ming Jin, he looked at Ming Zheng and said, “Ah Zheng, we’ve already seen the people. Let’s go back.” ",
        "The things he did to Ming Jin would cause Ming Jin’s mental power to fluctuate from time to time, causing him extreme pain.",
        "Before the original owner died, he suffered a lot of pain and desperation.",
        "The original owner didn’t know that there was a live broadcast. He thought the spaceship was really broken and that he would be thrown into space, waiting for rescue that might or might not come.",
        "He entered the escape pod crying and making a fuss, trembling with fear. At this time, the poison hidden in the air entered his body. ",
        "This poison was very powerful. If it was injected, the original owner might have died quickly, but he inhaled it.",
        "He found himself short of breath, his whole body ached, he cried even harder, and the poison also spread faster.",
        "Qi Shiyan looked at Ming Zheng and said, “Ah Zheng, didn’t you say that the spaceship we are staying on now will be moved to the vicinity of the Capital Star in the future and used as a tourist attraction? Let’s go back now and drive slowly on the way.”",
        "There were many people on the spaceship with star worm poison who needed to be treated. ",
        "On the way back, he could slowly help them eliminate the star worm poison.",
        "There was nothing happening on the front lines now. The people from the Second Legion and Third Legion had already left. They could go back as well.",
        "It would be just in time for the original owner’s enemies to be put on trial. He could also marry Ming Zheng as soon as possible.",
        "They had already done this and that. Ming Zheng must be responsible for him. ",
        "“Okay, why do you suddenly want to go back?” Ming Zheng was a little curious.",
        "Qi Shiyan smiled and said, “I want to marry you soon!”",
        "",
        "Ming Zheng’s heart beat faster. He really liked what Qi Shiyan said.",
        "Qi Shiyan then said, “Ah Zheng, let’s go back quickly. We have wasted a lot of time today…” ",
        "Ming Zheng: “…” He actually didn’t mind staying outside for a while longer. He stayed in the bedroom with Qi Shiyan every day. Now the way people outside looked at him wasn’t quite right.",
        "***",
        "T/N: *破罐子破摔 (pu guan zi po shuai) – to smash an already cracked jar. A phrase that means to write a situation off as hopeless and act recklessly."
    ],
    "previous": "Ch66 - Extra_ Bottom Line",
    "next": "Ch68.1 - Extra_ Marriage"
}