{
    "title": "Ch68.1 - Extra: Marriage",
    "content": [
        "The retired emperor’s spaceship traveled very fast all the way to the border.",
        "But on the way back, it drove very slowly. ",
        "Driving too fast would cause certain harm to the bodies of the passengers on the spaceship. Since there was plenty of time, just drive slowly.",
        "In the morning, Qi Shiyan got up early as usual, then put his mouth on Ming Zheng’s face and didn’t move.\n",
        "",
        "This was like kissing all the time.",
        "Ming Zheng, who woke up almost at the same time as Qi Shiyan, felt a little helpless. It had been several days, so how come Qi Shiyan’s passion for him hadn’t diminished at all? ",
        "“Ah Zheng, are you awake? Let’s go look at the stars.” Qi Shiyan suggested.\n\n",
        "“Okay.” Ming Zheng agreed immediately.",
        "Qi Shiyan looking at the starry sky was better than looking at him with fiery eyes. He wanted to rest.",
        "There was a special place on the spaceship where people could observe the universe.\n\n ",
        "Qi Shiyan brought some food and looked at the stars with Ming Zheng.",
        "The universe was so magnificent and was constantly changing, which gave people a sense of yearning.",
        "Qi Shiyan held Ming Zheng’s hand and stared at the vast universe without blinking.\n\n",
        "This huge spaceship, which was about the same size as the satellites orbiting some planets, seemed very small in the universe. ",
        "Qi Shiyan looked at the boundless starry sky and thought of the planet where he lived in his previous life.",
        "Everyone on that planet had died.",
        "If their technology had been more developed at that time, they could have built such a large spaceship…",
        "Qi Shiyan felt a little sad when he thought about the people around him dying one by one. ",
        "Fortunately, he now had Ming Zheng.",
        "“Ah Zheng, you will never leave me, right?” Qi Shiyan asked.",
        "“Of course.” Ming Zheng said.",
        "“Once we get back to the Capital Star, I’ll go get a new identity chip, and then we’ll get married, okay?” Qi Shiyan asked. ",
        "Everyone in this world had an identity chip placed in their communication terminal after birth.",
        "All functions of the communication terminal could only be used if the genetic data in the identity chip matched the genetic data of the person wearing the communication terminal.",
        "",
        "Qi Shiyan’s previous communication terminal, along with his identity chip, had all been dissolved into nothing in the king worm’s stomach.",
        "There was no identity chip in the communication terminal on his wrist now. It was fine to use it to read online messages and play games, but it couldn’t be used to get married. ",
        "Ming Zheng felt that Qi Shiyan was rushing it a bit, but he was happy in his heart. “You are only twenty-one years old, still very young. If you get married now, will you regret it in the future?”",
        "Qi Shiyan was very sure. “No. Although I am only twenty-one years old, my mental age is very old, much older than you.”",
        "As he spoke, he deliberately showed a vicissitudes of life expression.",
        "Zing Iheng: Was this true or false? Why did he feel that Hi Shiyan’s mental age was three and a half year old and he was curious about everything? ",
        "The two of them had a warm and intimate time along the way, and also had a lot of fun.",
        "Finally, after a month, they arrived at the Capital Star.",
        "The spaceship was too large to be parked on the Capital Star, so it landed on a nearby planet with no life activity.",
        "Then, Qi Shiyan and Ming Zheng took a small spaceship and arrived at the Capital Star in a low-key manner. ",
        "“I checked online. To apply for an identity chip, I need to go to a government service hall, right?” Qi Shiyan asked Ming Zheng.",
        "“Yes, normally you have to go to a government service hall, but we can go to the Imperial Mental Power Center,” Ming Zheng said, “Your mental power level needs to be re-measured. After the measurement, you can also change your identity chip.”",
        "The identity chip of the empire’s citizens contained a lot of information, including their level of mental power.",
        "After re-measuring the mental power level, the identity chip needed to be updated, so they could complete everything in one trip. ",
        "“I think my mental power level is very high, probably the highest in the entire empire. Is there a reward?” Qi Shiyan asked.",
        "Ming Zheng thought for a moment and said, “No.”",
        "Qi Shiyan felt a little regretful. “I remember that there is no money in my account. If there is no reward, I will be a pauper. Ah Zheng, are you willing to marry a pauper?”",
        "Ming Zheng answered without hesitation. “Yes.” ",
        "Qi Shiyan couldn’t help laughing when he heard this.",
        "The two soon arrived at the Imperial Mental Power Center.",
        "",
        "Only people at A-level or above could undergo mental power testing here. In other words, one must have mental power tested at A-level or above elsewhere before being able to come here for re-testing.",
        "Qi Shiyan didn’t meet the requirements, but now everyone in the empire knew him, and he could get in by scanning his face. ",
        "The two were quickly taken to the testing site and met a group of acquaintances.",
        "Many of Qi Shiyan’s patients who had returned with them on the same spaceship were also here.",
        "“Young Master Qi, you are here too?”",
        "“Young Master Qi, we meet again!” ",
        "“Young Master Qi, is your mental power above 3S?”",
        "…",
        "These people asked questions one after another, and at the same time invited Qi Shiyan to undergo a mental power test first.",
        "They were all saved by Qi Shiyan, so it was only right for Qi Shiyan to cut in line. ",
        "What was more, they wanted to see Qi Shiyan’s test results.",
        "Ming Zheng explained to Qi Shiyan in detail the method of testing mental power, and only then did he allow Qi Shiyan to undergo the mental power test.",
        "Then everyone saw that the instrument for detecting mental power almost exploded.",
        "Qi Shiyan was very proud. “I can still release a little more mental power, but if I continue to release it like this, the device will break down, so I won’t release anymore.” ",
        "This instrument for detecting mental power didn’t look cheap.",
        "The person in charge of the test entered SSS+ on the optical computer.",
        "Qi Shiyan’s mental power far exceeded 3S, but the highest standard in the empire right now was only 3S.",
        "He wanted to write 4S, but this was not in compliance with regulations. ",
        "However, SSS+ was already the most powerful mental power in history.",
        "Ming Zheng had been poisoned with star worm poison before, and his mental power was suppressed, so he only barely reached the SSS-level.",
        "Please visit chrysanthemumgarden (dot) com",
        "Thinking of this, the person in charge of the test looked at Ming Zheng eagerly. “Your Majesty, do you want to retest your mental power as well?”",
        "Ming Zheng did not refuse. ",
        "Then, there was one more person whose mental power level was SSS+.",
        "The Imperial Mental Power Center was overjoyed and immediately issued an announcement to make the matter public.",
        "There were too many people in the empire and there were also many people on the star network, so this matter quickly attracted people’s attention.",
        "“Ahhhh! His Majesty and Qi Shiyan have such high mental power!” ",
        "“I heard that the mental power of these two is actually higher than this!”",
        "“Too strong!”",
        "“You are all paying attention to their mental power, but I am focusing on something different… Have they returned to the Capital Star? Then can I bump into them by chance?”",
        "… ",
        "While the people on the star network were talking non-stop, Qi Shiyan held his communication terminal and was a little bit unbelieving. “Where did I get so much money?”",
        "After he put the replacement identity chip into his communication terminal, he discovered that there was a huge amount of money in his account.",
        "Ming Zheng said, “It should be the compensation from the Qi family, and some other compensations.”",
        "Some time ago, he specifically learned about Qi Shiyan’s situation. ",
        "The Qi family took Qi Shiyan’s money and bought mental power enhancing potions, but did not give them to Qi Shiyan to drink. Instead, they gave them all to Qi Jianuo to drink.",
        "After the police investigated the truth, they sold the Qi family’s property and returned the money that belonged to Qi Shiyan to Qi Shiyan.",
        "The Qi family was also required to pay compensation to Qi Shiyan. Ming Qingyu was also required to pay Qi Shiyan compensation.",
        "In addition, Qi Shiyan helped military personnel eliminate the star worm poison, so the military also gave Qi Shiyan a large sum of money as payment for the treatment. ",
        "They couldn’t let Qi Shiyan treat them for nothing.",
        "Now, the money in Qi Shiyan’s account was several times the property Qi Yuncheng had left him.",
        "Please visit chrysanthemumgarden (dot) com",
        "All of a sudden, he became a rich man.",
        "Qi Shiyan looked at the source of the money and his eyes lit up. “Ah Zheng, this money is enough for me to spend for several lifetimes! Even if you are no longer the emperor or a marshal in the future, I can still support you.” ",
        "“En.” Ming Zheng chuckled and parked the new airship in front of the door of the Imperial Marriage Registration Office.",
        "Now, people didn’t have to go to the marriage registration office to register. They could fill in the information online, and once it was reviewed, they would automatically be married.",
        "However, that way of getting married was slower and it took several days to get the result. If people went to the marriage registration office, they could get married on the spot and get a paper marriage certificate.",
        "Qi Shiyan and Ming Zheng had already discussed it and decided to come directly to get the marriage certificate. ",
        "There were only some staff members at the marriage registration office, doing some review work.",
        "After Qi Shiyan entered, he looked around curiously.",
        "Ming Zheng didn’t rush him, but after seeing the staff excitedly taking photos of them, he discussed with them, “You can take photos, but can you not post them online for now? We don’t want to be surrounded.”",
        "Of course that was fine. The staff members all agreed, and some people even asked to take a photo with Qi Shiyan. ",
        "Qi Shiyan agreed immediately.",
        "Living people were so cute! They just made a small request. How could he refuse?",
        "Qi Shiyan held Ming Zheng’s hand, took photos with them, and asked them to help him and Ming Zheng take wedding photos.",
        "The whole process of getting the marriage certificate was very lively and Qi Shiyan was also very excited. ",
        "He finally got his and Ming Zheng’s marriage certificate.",
        "Qi Shiyan took the marriage certificate and looked at it over and over for a long time, with an especially bright smile on his face. “Ah Zheng! We are married!”",
        "“Ah Zheng, we are a family from now on!”",
        "“Ah Zheng, I’m really happy!” ",
        "…",
        "Ming Zheng was also very happy.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He had no good feelings toward the imperial palace, so he did not take Qi Shiyan to the imperial palace. Instead, he took Qi Shiyan to a small house he bought on the Capital Star when he was just 18 years old.",
        "After he was brought back to the imperial palace, he was ignored by the retired emperor. ",
        "The retired emperor would give money and property to his other sons and grandsons, but never to him.",
        "But he was a prince after all.",
        "The imperial family had set up a special fund that would distribute money to imperial family members every month. He also had a share.",
        "This amount of money might be a lot for ordinary people, but it was very little for most imperial family members, not even enough for them to buy a pair of shoes. ",
        "Ming Zheng spent almost no money, so he saved it all.",
        "When he was eighteen years old, he used the money that he had saved for several years to buy a small house in the suburbs of the Capital Star.",
        "He had wanted to move out of the imperial palace.",
        "But what he had never expected was that just after he bought the house, he inexplicably became the emperor and was sent to the battlefield. "
    ],
    "previous": "Ch67 - Extra_ Going Home",
    "next": "Ch68.2 - Extra_ Marriage"
}