{
    "title": "Ch68.2 - Extra: Marriage",
    "content": [
        "“Over the years, I have been paying the property fees, electricity bills and other bills for this house. I also remotely controlled robots to clean the house. Now it should be habitable.” Ming Zheng parked the airship in front of the house.",
        "Qi Shiyan was pleasantly surprised. “This house is really nice!” ",
        "This house was not a stand-alone villa, but a floor in a high-rise building.",
        "But because the building materials of this era were very strong and everyone’s main means of transportation was airships, every family had a large balcony where airships could be parked. Up to three airships could be parked on the balcony, and some flowers and plants could also be planted in the surroundings.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan thought the surrounding balconies were very beautiful.",
        "As for their house… ",
        "There was nothing on their balcony and the house was empty, but this was his and Ming Zheng’s home!\n\n",
        "Qi Shiyan looked at the marriage certificate in his hand, then at the house in front of him, and his eyes suddenly felt a little sore.",
        "He had a home now.",
        "God knew how much he wanted a home.\n\n ",
        "“Ah Yan, what’s wrong with you?” Ming Zheng felt that Qi Shiyan’s mood wasn’t quite right.",
        "“Ming Zheng, I’m actually not Qi Shiyan.” Qi Shiyan suddenly spoke.",
        "Ming Zheng was stunned.\n\n",
        "Qi Shiyan said, “The real Qi Shiyan is dead.” ",
        "He was not Qi Shiyan, and he would not tell outsiders about this.",
        "But he wanted to tell Ming Zheng.",
        "He hoped that there would be someone who could listen to him talk about his past.",
        "It was actually a bit risky to confess directly, but he trusted Ming Zheng. ",
        "Ming Zheng was actually a soft-hearted person who lacked love. He had already become the most important person to Ming Zheng.",
        "As long as he didn’t betray Ming Zheng, he believed that Ming Zheng would never betray him.",
        "Ming Zheng was stunned for a moment, then said, “Don’t tell anyone else this.”",
        "In fact, there were many suspicious points about Qi Shiyan. ",
        "Qi Shiyan’s mental power was so strong, and he was not the type of person who would suffer losses. Normally speaking, he shouldn’t have suffered so much injustice.",
        "Apart from anything else, as long as he ran off and joined the army when he became an adult, he could have completely gotten rid of everything on the Capital Star and lived a free life.",
        "",
        "In addition, Qi Shiyan was full of vitality. He had great love for life and everything around him.",
        "Just by staying around Qi Shiyan, one would be infected by Qi Shiyan and have more love for this world. ",
        "But when he watched one of the videos left by Qi Shiyan, there was no light in the child’s eyes, and his whole body gave off a sense of numbness.",
        "These were two completely different people.",
        "If the entire process had not been live-broadcasted, everyone would have thought that the Qi Shiyan who entered the escape pod and the Qi Shiyan who came out of the escape pod were two completely different people.",
        "“Ah Zheng, do you want to hear my story?” Qi Shiyan asked Ming Zheng. ",
        "Ming Zheng was somewhat helpless. “You just told me this directly? You aren’t guarded against me at all?”",
        "Hi Shiyan said, “Ah Iheng, I trust you.”",
        "Zing Iheng looked at Hi Shiyan with mized feelings.",
        "This child was too naive. ",
        "Low long had they known each other? Low could he pust casually tell him something so important?",
        "When Hi Shiyan began to talk about what happened before his transmigration, he became more and more certain of his thoughts.",
        "In his previous life, Qi Shiyan only lived to the age of twenty, and he lived alone for many years.",
        "No wonder he had no guard at all. ",
        "Ming Zheng felt extremely distressed and made up his mind – he must protect Qi Shiyan in the future.",
        "He thought that his life before adulthood was miserable enough, but compared with Qi Shiyan, it was still good.",
        "At least he could eat enough and wear warm clothes, but what about Qi Shiyan? In his previous life, from childhood to adulthood, he had never had a good meal.",
        "And the original Qi Shiyan was also very pitiful. ",
        "The empire had let him down and had also let his parents down.",
        "Ming Zheng’s heart felt heavy. He hugged Qi Shiyan and said in a hoarse voice, “Ah Yan…”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Qi Shiyan could feel Ming Zheng’s heartache for him. “Ah Zheng, the original Qi Shiyan was killed by Ming Jin, Ming Qingyu, and the Qi family. These people must be punished.”",
        "“I will help you.” Ming Zheng was determined. ",
        "The original Qi Shiyan was very pitiful. He had to help him get revenge.",
        "“I knew you were the best!” Qi Shiyan hugged Ming Zheng tightly and began to calm himself.",
        "He was very good at adjusting his mentality. If he couldn’t adjust it, he would have died long ago.",
        "Ming Zheng stroked Qi Shiyan’s back again and again, and was thinking about what to say to comfort Qi Shiyan, when Qi Shiyan suddenly let go of him and looked at him pitifully. “Ah Zheng, we got the marriage certificate, and today is our wedding night…Ah Zheng, I have always been alone before, and have always longed for someone to accompany me, so I can’t help wanting to kiss you. Ah Zheng, can you let me kiss you a little longer?” ",
        "Ming Zheng felt heartbroken when he heard what Qi Shiyan said.",
        "Now, he wished he could present everything he had to Qi Shiyan, and was reluctant to refuse any of Qi Shiyan’s requests.",
        "Then, Qi Shiyan kissed him many times.",
        "The feeling of being kissed so long that he couldn’t tell up from down was very tiring, but Qi Shiyan was so pitiful… ",
        "Ming Zheng was soft-hearted for a moment and didn’t get any rest the whole night.",
        "It wasn’t until morning that he was finally able to sleep.",
        "Ming Zheng took a look at the communication terminal before going to bed, and discovered that there was so much news about him that he was about to explode the star network.",
        "Some people congratulated him on his marriage, some asked him where he was, some wanted to meet him or treat him to a meal… ",
        "After he and Qi Shiyan left, the people at the marriage registration office posted photos of him and Qi Shiyan on the star network. Now, the whole network knew that they had gotten married, and countless people were congratulating them.",
        "“Ahhhh! Congratulations!”",
        "“I’m so happy they’ve gotten married!”",
        "“So sweet! After returning to the Capital Star, the first thing the two of them did was to get the marriage certificate!” ",
        "“I wish Ah Zheng and Ah Yan eternal happiness.”",
        "…",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He and Qi Shiyan would definitely be happy forever.",
        "“Ah Zheng, what are you looking at?” Qi Shiyan came over and saw the news on the star network. ",
        "So many people were blessing them? That was great!",
        "Ming Zheng spent the next few days in a trance again.",
        "He felt that he couldn’t go on like this.",
        "Ming Zheng looked at Qi Shiyan. “Ah Yan, do you want to meet Ming Qingyu and the Qi family?” ",
        "Qi Shiyan had specially gone to see Ming Jin before. After making Ming Jin angry, he did something to Ming Jin‘s body.",
        "A Qi Shiyan like this might want to meet the Qi family and Ming Qingyu.",
        "“I want to.” Qi Shiyan asked, “Can we meet?”",
        "“Yes.” Ming Zheng said. ",
        "It was not difficult to meet Ming Qingyu and the Qi family.",
        "“Then go and meet them.” Qi Shiyan said.",
        "Qi Shiyan met the Qi family first.",
        "Father Qi had confessed to all the charges, saying that it was his idea to abuse and use cold violence against Qi Shiyan, as well as to rob Qi Shiyan of his money. ",
        "But even so, Qi Jianuo and his mother knew about his crimes but did not report them. Qi Jianuo was also involved in the case of framing Qi Shiyan, so the entire family had to go to jail, just for different lengths of time.",
        "Soon, they would be sent to a special prison planet along with other people",
        "There was no star network over there, the food was terrible, and the prisoners had to do a lot of labor… Qi Shiyan suddenly thought of the convalescent planet.",
        "No wonder Lou Jingyue felt that being on the convalescent planet was like being in prison. It really was very similar. ",
        "“Qi Shiyan, we didn’t mean it…”",
        "“Qi Shiyan, Jianuo has always cared about you. It was Ming Qingyu who forced him and that was why he got together with Ming Qingyu. Please forgive him.”",
        "",
        "“Qi Shiyan, I have always regarded you as my own brother…”",
        "As soon as the three members of the Qi family saw Qi Shiyan, they began to beg for mercy. ",
        "Qi Shiyan sighed. “I am Qi Yuncheng’s son. I am very popular and talented. If you had been nicer to me back then, you would definitely be the envy of the entire empire now.”",
        "The three members of the Qi family who already knew what Qi Shiyan had done some time ago had regret in their eyes.",
        "If they had treated Qi Shiyan well, as Qi Shiyan’s relatives, they would have been loved by people all over the empire!",
        "If they had a good relationship with Qi Shiyan, even if Qi Jianuo and Ming Qingyu were discovered to be secretly together, Qi Shiyan would not necessarily do anything to them. ",
        "Qi Shiyan was actually a golden child. Why did they treat him like that in the first place?",
        "“The people of the empire like me very much, and they also hate you very much.”",
        "“All your properties have been auctioned off and used as compensation for me. I don’t know what life will be like for you when you are released from prison.”",
        "“Cousin, thank you so much for letting me see Ming Qingyu’s true face. Ming Zheng is really much better than him…” ",
        "…",
        "Qi Shiyan talked to the Qi family in a rambling manner, and at the same time tinkered with Father Qi’s mental power.",
        "The original owner was so miserable mainly because of Father Qi.",
        "When the original owner first arrived at the Qi family, Qi Jianuo was still young, and Mother Qi didn’t dislike Qi Shiyan. The cold violence against the original owner was entirely Father Qi’s idea. ",
        "Later, Qi Jianuo did not take the original owner seriously because he had seen Father Qi’s attitude and actions while growing up.",
        "After visiting the Qi family, Qi Shiyan went straight to visit Ming Qingyu.",
        "Ming Qingyu looked at Qi Shiyan with complicated eyes.",
        "He regretted it, regretted it very much. ",
        "If he had treated Qi Shiyan well, he would definitely have long learned that Qi Shiyan had very strong mental power.",
        "He could have taken Qi Shiyan with him to kill the king worms and rescue the people of the military. In this way, everyone would definitely support him.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Qi Shiyan, I was bewitched before and deceived by Qi Jianuo and Ming Jin. I really like you…”",
        "Qi Shiyan looked at Ming Qingyu with interest, and by the way, made some adjustments to Ming Qingyu’s mental power. ",
        "All the black materials relating to the original owner were fabricated by Ming Qingyu. This person could be described as vicious.",
        "“Qi Shiyan, can you forgive me?” Ming Qingyu asked.",
        "“No.” Qi Shiyan laughed. “I came here specifically to see your jokes.”",
        "Ming Qingyu was silent for a moment, then began to apologize again, looking extremely remorseful. ",
        "But the original owner was already dead.",
        "Qi Shiyan kept looking at Ming Qingyu and smiling. “You are so funny like this.”",
        "Ming Qingyu finally confirmed that Qi Shiyan would never forgive him.",
        "Thinking that he would have nothing in the future… he suddenly looked at Ming Zheng, whom he had been ignoring. “Little Uncle*, do you know how much Qi Shiyan loved me in the past? He was just like my dog…” ",
        "Qi Shiyan was a little angry and slapped Ming Qingyu with his mental power.",
        "The force was a bit too strong, directly knocking Ming Qingyu unconscious.",
        "Qi Shiyan was stunned for a moment, then looked at Ming Zheng. “Ah Zheng, let’s go.”",
        "These people were actually quite boring. His Ah Zheng was still the best. ",
        "The wedding night was over, and next, it was time for the honeymoon!",
        "***",
        "T/N: *小叔叔 (xiao shushu) – literally Little Uncle. 叔叔 (shushu) or just 叔 (shu) is the term for uncle that’s used for your father’s younger brother. Ming Zheng is the youngest of the retired emperor’s children so he is the Little Uncle."
    ],
    "previous": "Ch68.1 - Extra_ Marriage",
    "next": "Ch69.1 - Extra_ Honeymoon"
}