{
    "title": "Ch69.1 - Extra: Honeymoon",
    "content": [
        "Qi Shiyan wanted to go on a honeymoon with Ming Zheng, but Ming Zheng had to start working.",
        "The empire was preparing to abolish the imperial family. ",
        "Afterward, the privileges of imperial family members would be revoked, those who had committed crimes would be put on trial, and the imperial assets would also be dealt with.",
        "This was a huge project, and many things had to be handled by Ming Zheng.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Qi Shiyan felt a little regretful, but did not stop Ming Zheng.",
        "All in all, he had been sticking to Ming Zheng for two months. He was no longer like he was at the beginning, wishing Ming Zheng could grow on his body. ",
        "Besides, he also had a job.\n\n",
        "In the final battle, many people were poisoned by star worm poison. Up to now, he still had not treated everyone.",
        "After discussing with Jiang Jin who had come to work at the Capital Star’s Imperial Hospital, he decided to go to work at the Capital Star’s Imperial Hospital every day, treating two patients in the morning and two more patients in the afternoon.",
        "Many people hated working, but Qi Shiyan had never worked before and he wanted to try it.\n\n ",
        "Ming Zheng’s first day back at work was also Qi Shiyan’s first day of work.",
        "He flew the airship, first sending Ming Zheng to his workplace, and then heading to the Imperial Hospital.",
        "The Imperial Hospital was very large. Jiang Jin cleaned up one of the floors as Qi Shiyan’s office.\n\n",
        "“This was originally the hospital’s luxury ward. This entire floor is a single ward.” Jiang Jin took Qi Shiyan on a tour. ",
        "Qi Shiyan was stunned.",
        "This place looked even more luxurious than the presidential suite of a hotel. It had everything, including a living room, study, kitchen, and cloakroom. There were even two rooms for the caregivers. Was this a single ward for just one person?",
        "The house he and Ming Zheng lived in now was much smaller than this ward!",
        "Qi Shiyan asked, “What about the patients?” ",
        "“They’re waiting for you in the reception room.” Qi Shiyan entered the reception room and spent ten minutes treating a patient. Then he asked Jiang Jin, “Jiang Jin, is this hospital short of nurses? Can I work as a nurse here part-time? I’m a nursing major and I know how to take care of patients.”",
        "Jiang Jin was a little slow to react.",
        "Qi Shiyan added, “This office is too empty. I don’t want to stay here when I’m not treating patients.”",
        "People were really different… But Qi Shiyan really liked liveliness. Jiang Jin said, “Let me see where we need people… The emergency department is short of people, but you can’t go there like this. It’s better to wear a face-changing mask.” ",
        "If Qi Shiyan went there directly, he would easily be surrounded by onlookers.",
        "Qi Shiyan said, “I understand! The emergency department is also suitable for me.”",
        "",
        "Qi Shiyan put on a face-changing mask and gave himself a chubby, very likable round face.",
        "He was always very thin in his previous life, so he liked the chubby look. ",
        "Aiang Ain took Hi Shiyan to the emergency room.",
        "Hi Shiyan’s main pob was to help people eliminate star worm poison. Le couldn’t work in the emergency room for a long time, so Aiang Ain told him to be a volunteer to provide some help to patients.",
        "Zany people came to the hospital alone for treatment. Although robots could take care of them, they would feel much better if there was someone to accompany them and talk to them.",
        "After Qi Shiyan changed into a volunteer uniform and learned about his job content, he quickly got the hang of it. ",
        "It was also at this time that Qi Shiyan realized that the medical cabin was a high-end product with a very high cost of use. Ordinary people would not use it.",
        "He also noticed that surgeries were performed by robots.",
        "It was said that this was because these robots had accumulated enough experience, so they could perform surgeries quickly, well, and without making mistakes.",
        "This era was really good. Treating diseases was very simple. Diseases that were once incurable could now be easily treated. ",
        "There were a lot of people in the emergency room. Qi Shiyan released his mental power to observe the people here. When he realized that someone was in need, he immediately went over to help with a smile.",
        "“Auntie, do you feel uncomfortable?”",
        "“Uncle, don’t worry. I checked and you can get an appointment for surgery today.”",
        "“Grandpa, you’ve taken good care of your health. Do you have any experience to pass on?” ",
        "…",
        "He wandered around here for two hours, then went back to his office to treat patients and eat something.",
        "After eating, he continued to help as a volunteer. When the time came, he went back to his office to treat people.",
        "After a busy day, after getting off work, Qi Shiyan happily drove to find Ming Zheng. ",
        "Ming Zheng’s work was not finished yet, but he could take it home and work on it, so he left work on time.",
        "Then, the two went to Jingtian Pavilion to eat stewed pig‘s trotters.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Ah Zheng, I have collected the Capital Star Food List voted by netizens. Starting from today, we will find a restaurant to eat at every day. How about it?” Qi Shiyan asked.",
        "There were abundant interstellar resources and many kinds of dishes. He wanted to try them all. ",
        "“Okay.” Ming Zheng agreed.",
        "Qi Shiyan added, “Ah Zheng, because of me, Jingtian Pavilion is now ranked first on the food list, and the recommended dish is stewed pig’s trotters. My traffic is really huge.”",
        "Qi Shiyan was indeed the most popular person in the empire now. Ming Zheng glanced at Qi Shiyan who was in a good mood, and took a bite of the stewed pig’s trotter in front of him.",
        "The taste of this stewed pig‘s trotter was indeed really good. ",
        "While eating, Qi Shiyan discussed buying a house with Ming Zheng.",
        "Ming Zheng said, “Actually, we don’t need to buy a house. Most of the imperial family’s assets will be reclaimed by the state, but I will also receive a portion. There should be quite a few properties among them.”",
        "According to the Matthew Effect*, the poor would become poorer and the rich would become richer. This situation was even more vividly reflected in the interstellar era.",
        "From the very beginning, the imperial family controlled a large amount of assets and owned many private planets. ",
        "This gave them money for investment and research and development. Up to now, the imperial family had shares in almost all of the empire’s high-tech industries. Some industries even belonged entirely to the imperial family.",
        "The imperial family also owned countless resource planets and over a hundred habitable planets.",
        "Many people in the empire couldn’t afford interstellar travel. They would never leave the planet they lived on in their entire lives.",
        "They couldn’t even afford to buy a house and could only rent one. ",
        "In this kind of situation, the imperial family owned so many planets!",
        "The wealth of the imperial family was unimaginable. When these assets were reclaimed by the state, the government would have money to help those living in poverty.",
        "There were many people living in the Chaotic Zone, but the places where they lived were actually not suitable for human habitation. If possible, it would be best to move these people to other habitable planets to live.",
        "Ming Zheng’s thoughts drifted away, but he quickly pulled them back and talked about the current policies. ",
        "The assets that were reclaimed by the state were mainly assets that originally belonged to the entire imperial family. The personal assets of imperial family members would not be touched.",
        "The retired emperor had a lot of assets under his name. Now that he was dead, Ming Zheng would inherit a large sum of money, including a lot of real estate.",
        "",
        "Qi Shiyan said, “Then we won’t buy a house, and live in one of the properties you inherited. I believe in the vision of the retired emperor.”",
        "Ming Zheng also believed in his father’s vision. The properties under his father’s name would definitely be first-rate. ",
        "After the two of them had eaten and drunk their fill, they returned to their cozy little home together and lived their little lives in a sticky manner.",
        "In the blink of an eye, three months passed.",
        "During this period, Ming Zheng and Qi Shiyan lived a very regular life.",
        "Ming Zheng dealt with various issues left over from “overthrowing the imperial family”. As for Qi Shiyan, he was like a fish in water in the hospital. ",
        "Now, Qi Shiyan had become the most popular volunteer in the Imperial Hospital. Some patients receiving treatment in the hospital who did not want to be alone would specifically come find Qi Shiyan to chat.",
        "Then, Jiang Jin realized that it was a waste of Qi Shiyan’s talent to let him be a mere volunteer.",
        "There were many patients with psychological problems in their hospital, and some of them were extremely emotionally unstable.",
        "But after chatting with Qi Shiyan, their moods would improve. Some people who originally didn’t want to live anymore even found a new meaning to life. ",
        "Qi Shiyan was like a little sun in the hospital.",
        "However, this little sun had gained a little weight recently.",
        "Qi Shiyan used to be very thin, but when he arrived at the Capital Star, his body shape had already returned to normal.",
        "And now…although his weight was still within the standard weight range, if he gained another catty, he would be overweight. ",
        "The standard weight range determined by doctors was actually very large. For example, a girl who was 160 cm tall and weighed 60 kg was not considered overweight. She would be considered overweight if she was a little fatter.",
        "Jiang Jin was afraid that Qi Shiyan would become a fat man if he continued like this. “Qi Shiyan, you are very healthy now, but if you keep gaining weight like this, it will be unhealthy.”",
        "Qi Shiyan said, “Don’t worry, I will control my weight.”",
        "He could control his weight and wouldn’t let himself become overweight. ",
        "It was out of control now, mainly because he liked being chubbier.",
        "How nice to touch! He felt that he was particularly nice to touch now. Ming Zheng liked to touch him very much.",
        "Please visit chrysanthemumgarden (dot) com",
        "With his unrelenting training, Ming Zheng had become accustomed to kissing and hugging him. He couldn’t sleep well at night without a little kissing from him.",
        "“Just take care of yourself.” Jiang Jin said. ",
        "Qi Shiyan got off work from the hospital and prepared to go pick up Ming Zheng.",
        "On the other side, Ming Zheng saw that it was almost time, so he started packing up and preparing to go home.",
        "As soon as he went out, some people followed him.",
        "They were all fans of Qi Shiyan. They followed him just to say hello to Qi Shiyan, or to catch a glimpse of him from afar. ",
        "Ming Zheng came to the door and waited for a while, then Qi Shiyan arrived.",
        "He got in the airship. Qi Shiyan opened the window and waved to the people outside. “I’m taking Ming Zheng away. Goodbye!”",
        "“Goodbye!” People said one after another.",
        "After watching the two leave, they started chatting. “Marshal Ming and Young Master Qi have a really good relationship.” ",
        "“Yeah, it’s enviable.”",
        "“I heard that Young Master Qi has been helping people eliminate the star worm poison during this period, and has almost cured all those who need treatment.”",
        "“I don’t know what he will do next…”",
        "… ",
        "Next, Qi Shiyan wanted to go on a honeymoon.",
        "Upon learning that Ming Zheng would be done with his work soon and could apply for a vacation, Qi Shiyan immediately said that he wanted to go on a honeymoon.",
        "***",
        "T/N: *Taken from Wikipedia: “The Matthew effect of accumulated advantage, sometimes called the Matthew principle, is the tendency of individuals to accrue social or economic success in proportion to their initial level of popularity, friends, and wealth. It is sometimes summarized by the adage or platitude “the rich get richer and the poor get poorer”.” "
    ],
    "previous": "Ch68.2 - Extra_ Marriage",
    "next": null
}