{
    "title": "Ch7 - Someone is Coming",
    "content": [
        "The people in the sanatorium were extremely anxious, fearing that something might have happened to His Majesty outside.",
        "After all, His Majesty’s condition was very bad and he might die at any time. ",
        "Star worms, especially high-level star worms, were poisonous.",
        "It was a mysterious cosmic substance. The surface of high-level star worms was covered with this substance, and if they were injured, they would release a large amount of this substance.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Anyone who came into contact with this substance would be poisoned, then their body would slowly collapse, they would become delirious, and eventually die.",
        "The only way for humans to avoid being poisoned was to isolate themselves from contact with high-level star worms and protect themselves with warships and mechas. ",
        "But high-level star worms were not afraid of thermal weapons. These creatures, born and raised in the universe, were not even afraid of the universe’s cosmic rays and could adapt to the harsh environment in the universe. How could they be afraid of thermal weapons developed by humans?\n\n",
        "Human thermal weapons could kill low- and medium-level star worms and injure high-level star worms, but generally speaking, they couldn’t kill high-level star worms.",
        "High-level star worms were particularly good at fighting in space and could cause human fleets to run around in circles.",
        "The only advantage humans had when fighting against star worms was their mental power.\n\n ",
        "High-level star worms were afraid of mental power and would die after suffering a powerful mental attack.",
        "But if one wanted to launch a mental attack on a high-level star worm, they needed to get close to it.",
        "If they got close to high-level star worms, their warships and mechas might be destroyed. If they were injured by a high-level star worm, they would be poisoned.\n\n",
        "Mental power was indeed the nemesis of star worms. After being poisoned, one could use mental power to suppress the poison in their body, but this was not a long-term solution. If the poisoning was severe, they would still die. ",
        "The current emperor, Ming Zheng, was only eighteen years old when he first went to the battlefield twenty years ago.",
        "At that time, the Human Empire was steadily losing ground and the situation was very critical. The Human Empire didn’t know much about star worms… Many people went to the battlefield without receiving specific instructions.",
        "Ming Zheng was no exception.",
        "The first time he went to the battlefield, he encountered a high-level star worm. ",
        "The battlefield that time was not in space, but on a resource-rich planet that originally belonged to the Human Empire.",
        "The battle between the two sides was fierce. The high-level star worm, whose core was shattered by Ming Zheng’s powerful mental power, went berserk and smashed Ming Zheng’s mecha. Ming Zheng was then exposed to that kind of cosmic substance and was poisoned by star worm poison.",
        "Ming Zheng had strong mental power and could use his mental power to suppress the poison. The poison didn’t affect his daily life.",
        "But in the past twenty years, he had constantly been on the front lines, fighting against star worms. During this period, he had gradually come into contact with more and more of this substance. ",
        "The poison in his body became deeper and deeper.",
        "At the beginning, he could suppress the poison with his mental power and live a normal life. He would only be affected when he needed to go to the battlefield and had to use his mental power.",
        "Please visit chrysanthemumgarden (dot) com",
        "But six years ago, Ming Zheng was besieged by three high-level star worms. His mecha was destroyed in the universe, and he was poisoned again.",
        "His physical condition deteriorated rapidly, to the point where he was unable to maintain his sanity when using his mental power to fight the star worms. ",
        "In the past three years, he might even go crazy when he was not fighting.",
        "A few months ago, when the situation was critical, he went to the battlefield again. He had been delirious since then.",
        "But he instinctively used his mental power to suppress the poison in his body, and wouldn’t actively attack others unless he sensed danger, so he was relatively easy to get along with.",
        "Defore losing his mind, Zing Iheng had already given instructions to his subordinates. ",
        "Le told them to throw him over when they encountered multiple star worms.",
        "When he sensed danger, especially the presence of high-level star worms, he would frantically attack everything around him, and then die together with the high-level star worms.",
        "This was the method he had planned for his own death. The universe would be his graveyard, and the high-level star worms would be his burial objects.",
        "Although Ming Zheng’s subordinates were extremely sad, they still agreed to Ming Zheng’s request. ",
        "After all, even if Ming Zheng didn’t do this, given his current poor physical condition, he could only live deliriously for a year at most.",
        "They had just fought a battle with star worms and killed a high-level star worm. Right now, there were no major battles on the front lines and no high-level star worms, so they arranged for Ming Zheng to go to the convalescent planet so that Ming Zheng could live a better life before his death.",
        "Star worm poison was a mysterious cosmic substance that was contagious.",
        "It was still fine for people with strong mental power, but people with weak mental power would easily die after being poisoned. ",
        "Therefore, those who were severely poisoned could not return to their hometowns to live.",
        "Fifteen years ago, Ming Zheng, who had completely taken control of the imperial family, found an undeveloped habitable planet close to the front lines from the imperial assets and built a sanatorium on it for those who were poisoned with star worm poison to live in.",
        "Not many people were poisoned by star worm poison. They were all generals with high levels of mental power who had fought on the front lines.",
        "For fear of causing panic among the people, these things were not made public, and outsiders were not allowed to enter the planet. ",
        "In order not to attract the attention of star worms, there were very few high-tech products on this planet. They weren’t even connected to the star network.",
        "If a planet wanted to connect to the star network, it had to build many base stations, which cost a lot of money. The establishment of these base stations would undoubtedly tell the star worms that there were people living here.",
        "Please visit chrysanthemumgarden (dot) com",
        "Therefore, at this moment, the people in the sanatorium had no idea that Qi Shiyan had landed on this planet.",
        "They were all worried about Ming Zheng. ",
        "The delirious Ming Zheng was originally living well in the sanatorium, but last night, for some unknown reason, he actually ran away.",
        "He also broke the locator device on his body!",
        "The people in the sanatorium were anxious to find him.",
        "He was poisoned and had to use all his mental power to suppress the poison. If he encountered danger and used his mental power, he would probably die on the spot. ",
        "His Majesty was their hero. They were willing to help His Majesty die on the battlefield as His Majesty requested, but they couldn’t accept His Majesty dying quietly on this planet!",
        "The people in the sanatorium began to search.",
        "At this time, Qi Shiyan had already caught five gray rabbits.",
        "This was a great harvest! ",
        "Qi Shiyan swallowed his saliva, used his mental power to make the rabbits die without feeling anything, and then took two of them to the tiger. “Xiao Guai*, these are for you to eat! Don’t worry, you follow daddy to live, and daddy will never let you go hungry!”",
        "After saying this, Qi Shiyan touched the tiger several times.",
        "The tiger glanced at Qi Shiyan and began to eat the rabbits angrily.",
        "“My family’s Xiao Guai is so cute.” ",
        "“Daddy will definitely raise you to be fat and strong!”",
        "“You stay here obediently. Daddy will go deal with the rabbits.”",
        "Qi Shiyan gave the tiger some instructions, then took the remaining three rabbits to the stream to deal with them.",
        "He hadn’t gone far from the stream. After all, having a water source was important. ",
        "Holding the small knife that popped out from the all-purpose pen, Qi Shiyan happily dealt with the rabbits.",
        "People who were watching the live broadcast said all kinds of things. “The tiger took a bite of a rabbit while looking at Qi Shiyan. It seemed like what it really wanted to eat was Qi Shiyan.”",
        "",
        "“I always feel that Qi Shiyan’s mental state is not normal.”",
        "“He is so cruel! He actually killed the rabbits!” ",
        "“He is indeed a pervert!”",
        "“I’m speechless. Qi Shiyan is stranded on an undeveloped planet. If he doesn’t kill rabbits to eat, should he starve to death instead?”",
        "“You’ve never eaten meat? If you think it’s cruel, don’t eat meat in the future.”",
        "“Doesn’t Qi Shiyan have nutrient solution? Why did he kill the rabbits?” ",
        "“Only a fool would drink the nutrient solution that could save your life when you can find other food on an undeveloped planet, right?”",
        "…",
        "The barrage started arguing again, but not all of them were arguing. “Everyone said that Qi Shiyan doesn’t know how to do anything and would definitely starve to death, but it turns out that he not only knows how to hunt, but also how to process prey.”",
        "“Although he obviously has no experience in processing prey, his hands-on ability is quite strong. He’s dealing with the prey quite quickly.” ",
        "“Qi Shiyan is always happy. Looking at him makes me feel better too.”",
        "“Can he cook the rabbits?”",
        "“There’s no seasoning in the escape pod. It would be hard for him to make the rabbits delicious, right? He’s also picky about food. Maybe he won’t even eat the rabbits after they’re cooked.”",
        "… ",
        "When Qi Shiyan attended an event in the past, he once got angry and showed a gloomy face on the spot because the food provided by the event organizer was not tasty.",
        "Now that he had no seasoning, the rabbits he cooked would definitely be even more unpalatable. Could he swallow them down?",
        "For a while, a large group of people opened the live broadcast room, waiting to see Qi Shiyan unable to swallow his food.",
        "Qi Shiyan was indeed very fast in cleaning up the rabbits. Although he had no experience, he had mental power. ",
        "With the help of mental power, there was no problem dealing with prey.",
        "There was a lot of meat on the three rabbits. The more Qi Shiyan looked at them, the more excited he became. He even wanted to eat them raw.",
        "Please visit chrysanthemumgarden (dot) com",
        "But he soon gave up.",
        "With his supernatural powers, he would not die from eating raw rabbit meat, but doing so would slow down his body’s recovery. ",
        "Therefore, just roast them.",
        "They should be more delicious if they were roasted!",
        "After dealing with the rabbits, Qi Shiyan happily returned to the tiger’s side and gave the three rabbits’ internal organs to the tiger to eat. “Xiao Guai, I know you like to eat these things. I’ll give them to you!”",
        "Many beasts, including tigers, would eat the prey’s internal organs first after hunting, because the internal organs were rich in fat and nutrients. ",
        "“Xiao Guai, daddy will roast the meat later, and then I’ll let you taste my cooking skills!” Qi Shiyan said again, and came to the fire pit he had lit before, fixed one of the rabbits on a branch, and started roasting the meat.",
        "Rabbits had very little fat, so they didn’t taste good when roasted. They also burned easily.",
        "Qi Shiyan didn’t know this at first, but he kept using his mental power to observe the rabbit and soon discovered it.",
        "After taking the rabbit out of the fire and thinking for a while, Qi Shiyan began to use his mental power to control the flames, trying to get the rabbit heated evenly and roasted to perfection. ",
        "The aroma of roasted meat soon spread out.",
        "This was the most fragrant smell Qi Shiyan had ever smelled!",
        "The rabbit was not cooked all the way through yet, but Qi Shiyan couldn’t help himself. He took the roasted rabbit back, sliced ​​a piece of meat from it with a knife, and stuffed it into his mouth.",
        "The roasted rabbit meat was very tough and dry. ",
        "But this was meat! Fresh meat without poison or radiation!",
        "Qi Shiyan chewed slowly, looking as if he was eating a delicious delicacy.",
        "Meat was really delicious! If he had known that meat was so delicious, he would have gone to find meat to eat as soon as he transmigrated!",
        "Qi Shiyan was eating with his eyes shining when he suddenly sensed some movement. ",
        "Something was running toward him.",
        "Qi Shiyan stood up without thinking and looked in the direction of the thing running toward him. When he saw it, Qi Shiyan’s breathing almost stopped.",
        "",
        "A person! He saw a person!",
        "It had already been several years since he last saw a person. He had thought there were no people on this planet! ",
        "It turned out there was someone here. It was even a tall and handsome guy with long legs!",
        "The man who came running over was actually not handsome.",
        "The skin all over his face was discolored and he looked a bit scary. To ordinary people, he was not only not handsome, but also ugly.",
        "But in his previous life, the people around Qi Shiyan were a thousand times uglier than this person. ",
        "Some people had mutated to the point where they no longer looked like humans!",
        "The man in front of him had healthy limbs and intact facial features. In Qi Shiyan’s previous life, he could definitely be the second most handsome man in the world.",
        "***",
        "T/N: *Xiao Guai (小乖). You’ve probably encountered the word 乖 (guai) in other novels – it roughly means something like good, well behaved, obedient, etc. and is most commonly used when referring to children. 小 (xiao) means small/little and is commonly used in front of names to indicate affection. So if I were to translate this name, it’d be something like “Little Well-Behaved”, which sounds awkward, so I kept it in pinyin. "
    ],
    "previous": "Ch6 - Hunting",
    "next": "Ch8 - Hug"
}