{
    "title": "Ch8 - Hug",
    "content": [
        "After seeing this person, Qi Shiyan felt like the blood in his body was boiling.",
        "Every cell in his body was excited and clamoring. ",
        "He wanted to hug this person, kiss this person, and even better, tie this person to his side and never let go.",
        "Qi Shiyan had always known that his mental state was not normal.\n",
        "",
        "Among those who had experienced the apocalypse, how many were mentally normal?",
        "When he was fourteen, the last person around him died. When he was twenty, he himself died. ",
        "For six years, six whole years, he had always been alone, without even a bug around him!\n\n",
        "Extreme loneliness could drive people crazy.",
        "In his last few years, he even found some dolls, pretended that they were people, and took good care of them.",
        "At that time, he often suffered from hallucinations, thinking that these dolls were alive and could talk to him.\n\n ",
        "He had always craved companionship.",
        "Animals could keep him company, of course, but this wasn’t enough.",
        "When he was born in his previous life, almost all plants and animals had already become extinct. Only a very small number of humans with awakened supernatural powers could keep him company.\n\n",
        "They gave him the hope of survival, but then died one by one. ",
        "He still preferred people.",
        "He was glad that he landed on an undeveloped planet. If he had opened his eyes and found himself surrounded by people, he would probably become too excited and might be considered a lunatic because of his enthusiasm toward the people around him, hugging and kissing others in public.",
        "Qi Shiyan’s eyes were burning when he looked at the tiger before, but now, the way he looked at the person in front of him was a thousand times hotter than the way he had looked at the tiger.",
        "On the star network, those who were watching the live broadcast felt something was wrong when Qi Shiyan was roasting the rabbit. ",
        "“Aren’t these flames too well behaved? They seem to be controlled by someone.”",
        "“They are being controlled by someone. This is the first time I’ve seen someone use mental power to control flames, and it’s actually in order to roast a rabbit.”",
        "“I’m a chef. Wild rabbit meat has very little fat. If he doesn’t rub oil on it, even if he uses his mental power to control the heat, it won’t taste good when roasted.”",
        "“Qi Shiyan will definitely not be able to eat this kind of rabbit meat.” ",
        "“Why are you guys so obsessed with Qi Shiyan’s picky eating? Am I the only one who has been paying attention to Qi Shiyan’s mental power? He has been using his mental power to suppress the tiger this whole time. Qi Shiyan’s mental power is so strong!”",
        "“Qi Shiyan’s mental power isn’t necessarily strong. The amount of mental power he’s using is actually not much, but his control over mental power exceeds that of 99% of people in this world. This is definitely the result of long-term training in the use of mental power.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "…",
        "At this time, Qi Shiyan started eating the roasted rabbit. ",
        "He sliced ​​the meat off the rabbit, and when he ate it, it seemed as if he was eating some delicious delicacy.",
        "“Is rabbit meat so delicious?”",
        "“Seeing him eat the rabbit, I want to eat it too.”",
        "“I’ve already ordered rabbit!” ",
        "“Why does Qi Shiyan seem to be eating the most delicious food no matter what he eats?”",
        "“He is completely different from what I imagined.”",
        "“Yeah, wasn’t it said that he’s an extremely picky eater?”",
        "… ",
        "As the people watching the live broadcast were talking, those who zoomed out to see the overall situation noticed that a stranger had entered the view of the live broadcast room.",
        "Those who had their cameras fixed on Qi Shiyan’s face also noticed that there was something wrong with Qi Shiyan’s expression and eyes.",
        "“Hi Shiyan’s eyes seem as if they’re looking at a person he loves deeply.”",
        "“Isn’t this look a little too enthusiastic?” ",
        "“What’s going on with Hi Shiyan?”",
        "“Someone has come! Someone has come to Hi Shiyan’s live broadcast room!”",
        "…",
        "Sveryone noticed that someone had come into Hi Shiyan’s live broadcast room. They all looked at that person. ",
        "Many people were frightened the moment they looked.",
        "“What’s wrong with this person?”",
        "",
        "“Isn’t he too ugly?”",
        "“His face is so scary!” ",
        "…",
        "The man who just appeared had a crew cut and was wearing a dirty military uniform.",
        "He ran all the way over, but stopped about three meters away from Qi Shiyan, staring at Qi Shiyan blankly.",
        "Or maybe, he was not looking at Qi Shiyan, but the roasted rabbit in Qi Shiyan’s hands. ",
        "The man was tall and had long legs and a good figure, but his terrible, discolored and slightly swollen face and his dull eyes made people feel that he was not normal.",
        "People who were watching the live broadcast said that this person was ugly. Then, people who were diligently criticizing Qi Shiyan started to post barrages. “Will Qi Shiyan be frightened to tears?”",
        "“As everyone knows, Qi Shiyan is a face-con. He will definitely be shocked by this person’s ugliness.”",
        "“Qi Shiyan was frightened to tears when he saw the old soldier with a wound on his face. He even pinched his throat and told the crown prince that he was scared, which was extremely disgusting.” ",
        "“Don’t you have eyes? Looking at Qi Shiyan’s expression, you can tell that he is not afraid at all, nor does he find this person who suddenly appeared disgusting.”",
        "…",
        "Ordinary people were clamoring non-stop, but a high-ranking military general who had just turned on the live broadcast was so shocked that he gasped.",
        "The military top brass unanimously concealed the fact that Ming Zheng was poisoned. ",
        "Although people like Ming Qingyu could still find out some information, ordinary people knew nothing at all. Even in the military, most people did not know about this matter.",
        "Even fewer people knew what Ming Zheng looked like now.",
        "Ming Zheng was extraordinarily handsome when he was young.",
        "But after being poisoned by star worm poison, he was affected by the poison and his appearance was disfigured like everyone else. ",
        "In order to conceal this matter, Ming Zheng had been wearing a mask since he joined the military. The occasional photos that were leaked were all photoshopped using high-tech means.",
        "In other words, ordinary people had no idea what Ming Zheng looked like now.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Even Ming Qingyu and many people who knew about the matter of Ming Zheng being poisoned did not know what Ming Zheng looked like now.",
        "But coincidentally, the person watching the live broadcast happened to know. ",
        "His name was Lu Yuan. He and Qi Yuncheng had been good friends. He was also one of Ming Zheng’s adjutants.",
        "His mental power was only A-level and his military rank was not high*, but he was one of Ming Zheng’s most trusted people.",
        "Few people knew that Ming Zheng had gone to the convalescent planet. Lu Yuan and Ming Zheng’s other confidants had been helping Ming Zheng handle official business. They also deliberately created the illusion that Ming Zheng was recuperating on the front lines.",
        "The people of the retired emperor and the people of Ming Zheng’s older brothers were constantly looking for trouble with Ming Zheng. They were afraid that these people would disturb Ming Zheng. ",
        "There were a lot of things going on at the front lines. Lu Yuan was so busy every day that his feet couldn’t even touch the ground.",
        "This place was also very far away from the Capital Star… In the past, he didn’t have much time to pay attention to things on the star network.",
        "The army had its own internal network. People on the front-line garrison planets as well as people from the military would access this internal network instead of the star network.",
        "This internal network was strictly controlled, and the information on it was mostly positive, with very little messy content. ",
        "Some anti-military remarks on the star network didn’t exist in the military’s internal network.",
        "Those who were used to visiting the star network every day had long known about Qi Shiyan’s live broadcast, but not many people on the military’s side knew about it.",
        "Lu Yuan didn’t know about this matter before.",
        "Like Ming Zheng and many other high-ranking military officials, he had always been grateful to Qi Yuncheng and paid a lot of attention to Qi Shiyan. ",
        "But they were always on the front lines and couldn’t do much.",
        "Qi Shiyan was sent to live on the Capital Star and was taken care of by the Qi family. Judging from the news on the star network, he was living a good life… As time went by, they paid less and less attention to Qi Shiyan.",
        "After all, there were too many people on the front lines who were more miserable than Qi Shiyan.",
        "Every day, people died on the battlefield, leaving behind countless orphans. ",
        "Lu Yuan knew that Qi Shiyan had caused a lot of trouble in recent years.",
        "Like some people, he resented the Qi family and felt that they had failed to educate Qi Shiyan well.",
        "Please visit chrysanthemumgarden (dot) com",
        "For this reason, he had also contacted Qi Shiyan, but Qi Shiyan did not listen to his advice and scolded him instead.",
        "Qi Shiyan was already an adult and was the future crown princess, but he was just one of Ming Zheng’s adjutants. ",
        "It was impossible for him to straighten out Qi Shiyan.",
        "In the past few years, Ming Zheng had become seriously ill, and the star worms were watching covetously, so he had no energy to take care of Qi Shiyan.",
        "He was so busy that he didn’t even have time to get married and have children.",
        "Some of his comrades did find time to have children, but they had no time to take care of them. Many of their children grew up crooked. The son of a major general he knew was exiled to a mining planet to mine due to committing illegal crimes. ",
        "They couldn’t take care of Qi Shiyan, nor could they interfere in Qi Shiyan’s affairs.",
        "An hour ago, someone he knew from the Imperial Academy of Sciences called him and said that Qi Shiyan’s mental power level was not C, and that Qi Shiyan’s performance in the live broadcast was different from usual. He suspected that Qi Shiyan had been treated badly in the Capital Star before. Only then did he learn about the live broadcast.",
        "He was startled, and then immediately used his authority to connect to the star network to watch Qi Shiyan’s live broadcast.",
        "While watching, he searched online for clips of earlier parts of Qi Shiyan’s live broadcast, and immediately realized that something was wrong. ",
        "Someone was harming Qi Shiyan!",
        "Qi Shiyan used to be noisy and unlearned all day long, but that might just be his disguise!",
        "This child had definitely suffered great injustice!",
        "Lu Yuan immediately arranged for people to investigate Qi Shiyan’s past. At the same time, he planned to find someone to go find Qi Shiyan and take him away from the convalescent planet. ",
        "However, before he could do anything, he saw Ming Zheng appear in the live broadcast.",
        "The production team sent Qi Shiyan to a convalescent planet, and now His Majesty also appeared in the live broadcast. What was going on? Was there a conspiracy?",
        "Lu Yuan contacted the sanatorium immediately. At this time, Qi Shiyan moved in the live broadcast.",
        "Qi Shiyan knew that many of his thoughts were wrong. ",
        "If he hugged and kissed others casually, he would definitely be regarded as a pervert!",
        "He tried to control his thoughts, but he was still shaking with excitement.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Using his mental power to control his teeth from trembling, Qi Shiyan smiled at the person. “Hello, do you want to eat roasted rabbit?”",
        "Like the people watching the live broadcast, he noticed that there was something wrong with the eyes of the person who suddenly appeared. ",
        "This person seemed to have some mental problems.",
        "At the same time, Qi Shiyan also discovered that this person’s attention was on the roasted rabbit in his hands.",
        "This person must be hungry.",
        "Hungry was good! He could raise the other party! ",
        "It wasn’t very good to hug a delirious person, but he would give something in return. He could raise this person and he could also help this person cure his illness!",
        "Qi Shiyan discovered another thing. The person in front of him had a swollen face and blue and purple skin. He must have been poisoned.",
        "It was okay for him to hug this person and then help him heal, right?",
        "He really could no longer control himself. He even wanted to use his mental power to control the person in front of him, and then spend half an hour with this person like he kissed and caressed the tiger before. ",
        "No, half an hour wasn’t enough. He needed at least half a day.",
        "No, he couldn’t do this. This was too perverted…",
        "Qi Shiyan knew there was a type of illness called skin hunger syndrome*.",
        "He definitely had this illness, and it was very, very serious, so serious that it couldn’t be more serious. ",
        "Ming Zheng didn’t sense any ill intent, so he came to Qi Shiyan’s side and continued to stare at the roasted rabbit in Qi Shiyan’s hands.",
        "Qi Shiyan began to tremble again.",
        "He tried hard to control his hands and finally managed to slice a piece of meat from the roasted rabbit. Then he delivered the piece of meat to Ming Zheng’s mouth.",
        "Ming Zheng ate the meat obediently. ",
        "Qi Shiyan’s eyes when looking at Ming Zheng were almost burning.",
        "He needed company, but he actually had a certain desire for control.",
        "Please visit chrysanthemumgarden (dot) com",
        "Therefore, what he always thought about was raising others.",
        "He wanted someone who belonged to him alone. ",
        "He didn’t require that person to be very good, as long as they could stay with him forever.",
        "The well-behaved look of the person in front of him completely hit the soft spot in his heart. He was completely melted by it.",
        "Qi Shiyan could no longer control himself. He hugged Ming Zheng in front of him and held him tightly in his arms.",
        "He still maintained some sanity, so he did not kiss Ming Zheng’s face, but he grabbed Ming Zheng’s hand and buried his face in that hand, which was also discolored and swollen. ",
        "He had come into contact with a person, a person! A living person!",
        "Qi Shiyan felt like he was going to pass out drunkenly in this hand.",
        "This person didn’t struggle at all, which was really great!",
        "He kissed Ming Zheng’s palm several times before he raised his head and smiled at Ming Zheng again. “Don’t worry, I will take good care of you. Are you hungry? I’ll roast some meat for you.” ",
        "This was his person. He definitely couldn’t let his own person starve.",
        "He would raise this person well!",
        "If this person had been poisoned, he would help heal and restore his health, as long as this person stayed with him.",
        "Ming Zheng looked at Qi Shiyan without saying anything. ",
        "His mind was empty and he didn’t understand the current situation very well, but he could sense that this person had no ill will toward him, only fondness for him.",
        "If that was the case, he wouldn’t take action.",
        "***",
        "T/N: *It originally said Lu Yuan was a high-ranking military general, but then says that his rank isn’t high. I’m pretty sure it’s the latter since his title is Adjutant, meaning he’s more of Ming Zheng’s assistant than a military general, but I still left the translation as is since it’s a pretty minor inconsistency and these kinds of typos and inconsistencies are very common in Chinese webnovels (the authors are under a lot of pressure to publish one chapter a day). ",
        "*皮肤饥渴症 (pifu ji ke zheng) – literally skin hunger and thirst syndrome in Chinese. In English, this is commonly known as being touch starved – a condition that occurs when you don’t get as much contact with people as you should and crave contact with others.",
        ""
    ],
    "previous": "Ch7 - Someone is Coming",
    "next": "Ch9 - Live Streaming “Cheating”"
}