{
    "title": "Ch9 - Live Streaming “Cheating”",
    "content": [
        "Qi Shiyan really liked this person who had suddenly appeared!",
        "That innocent look and that well-behaved appearance made his heart itchy. He wanted to hold this person in his arms and take good care of him. ",
        "In fact, given his illness, even if the person who appeared in front of him today was a vicious villain, he would still like him and want to touch him.",
        "But he would definitely not think about protecting or caring for the other party.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "For that kind of person, he would probably treat them the same as the way he treated the tiger he had caught before.",
        "The person in front of him was different. ",
        "This person met his aesthetic standards in every way, making him like him from the bottom of his heart.\n\n",
        "Qi Shiyan was reluctant to let this person go, so he pulled him to the fire pit, let him sit on the fallen tree that he used as a stool, and then sat next to him.",
        "He put his left arm around the other person’s waist and held the other person’s right hand, as if he was hugging the person completely in his arms.",
        "If possible, he wanted to hold the other person’s left hand with his right hand, but he also had to roast and eat the rabbit.\n\n ",
        "Qi Shiyan hugged this person who had thrown himself into his net, stuck the stick with the roasted rabbit on it into the ground, then took the knife in his right hand and sliced ​​a piece of meat from the roasted rabbit.",
        "After slicing, he took the piece of meat and delivered it to Ming Zheng’s mouth. “Xiao Guai, come and eat meat.”",
        "Ming Zheng was hungry, so he opened his mouth and ate the meat obediently.\n\n",
        "Qi Shiyan was excited all of a sudden. “Xiao Guai, you are so great. You can eat meat by yourself!” His family’s Xiao Guai was so good. Those dolls he had “raised” before couldn’t eat meat. ",
        "Not far away, the tiger that had eaten all the rabbit meat given by Qi Shiyan bared its teeth at Qi Shiyan. This guy was calling it Xiao Guai not long ago, but in the blink of an eye, he was calling someone else that. This was really having a new one and forgetting the old. What a slag man!",
        "Those who were watching the live broadcast were stunned as they looked at the two people hugging each other and listened to Qi Shiyan calling “Xiao Guai” all the time.",
        "After Ming Zheng appeared in the live broadcast room, many people in the live broadcast room were frightened. After all, Ming Zheng looked a bit scary.",
        "Since they themselves were frightened by Ming Zheng, they felt that Qi Shiyan would also be frightened by Ming Zheng. ",
        "Although Qi Shiyan’s eyes and expression didn’t look like he was frightened, he was constantly shaking, so he must be very scared!",
        "Those who hated Qi Shiyan were very happy and were just waiting to see Qi Shiyan run away or make a fool of himself. Of course, there were also some people who were curious about who this person who suddenly appeared was.",
        "“Who is this person? Why does he look like this?”",
        "“Judging from his attire, he should be a soldier who was injured and is recuperating on this convalescent planet.” ",
        "“His appearance doesn’t look quite right?”",
        "“He must be sick.”",
        "Please visit chrysanthemumgarden (dot) com",
        "“Maybe it’s an infectious disease…”",
        "“If he is a soldier, then he is a hero of the empire! I hope Qi Shiyan won’t say nonsense in front of him.” ",
        "“Qi Shiyan is shaking with fear! Hahahaha!”",
        "…",
        "At this moment, Qi Shiyan asked the man if he wanted to eat meat, then approached the man and fed him a piece of meat.",
        "“Qi Shiyan’s reaction is really unexpected.” ",
        "“Qi Shiyan’s expression looks weird.”",
        "“Why do I feel like Qi Shiyan likes this ugly guy very much?”",
        "…",
        "As they were talking, they saw Hi Shiyan hugging the person in his arms. ",
        "That would still have been fine, but Hi Shiyan also grabbed the other person’s swollen and discolored hand and buried his face in it.",
        "“Is Hi Shiyan crahy?”",
        "“What is he doing?”",
        "“I hoomed in. I think he seems to be kissing that person’s hand?” ",
        "“It’s not necessarily a kiss, but his reaction is really weird.”",
        "“What on earth is going on?”",
        "“He thought he was stranded on a deserted planet, and didn’t expect to see anyone. So he became a little too excited?”",
        "“There’s still no need to come up and hug! That person looks sick!” ",
        "“If the person he was hugging wasn’t so ugly, I would have thought he was planning to cheat.”",
        "…",
        "",
        "As they were talking, they saw Qi Shiyan hugging the other person and feeding him meat.",
        "Qi Shiyan’s previous behavior was puzzling, but his current behavior was very clear. ",
        "He liked this person who suddenly appeared.",
        "This situation instantly caused the star network to explode. “What is Qi Shiyan doing? Live streaming his affair?”",
        "“Good guy, he came up and hugged the person, and even fed him!”",
        "“He keeps saying that he likes His Highness the Crown Prince, yet he hugs a random person!” ",
        "“Qi Shiyan should die. He is too disgusting.”",
        "“Qi Shiyan is still hugging this person. Is he in love with ugliness?”",
        "…",
        "For a while, no one discussed the matter of Qi Shiyan hiding his mental power. Everyone was condemning Qi Shiyan for cheating. ",
        "Qi Shiyan didn’t think he was cheating.",
        "He had no affection for the crown prince and had no intention of fulfilling the engagement.",
        "Rather than being with the crown prince, he would rather be with the fool in front of him.",
        "Well, this person shouldn’t be a fool. ",
        "After Qi Shiyan held the man in his arms, he used his mental power to briefly check the man’s condition.",
        "The body of the man who suddenly appeared in front of him was full of poison.",
        "The poison this man was infected with was somewhat similar to the toxins from the asteroid that had wreaked havoc on the planet he was from, but not exactly the same.",
        "Now he had a terrifying appearance and was delirious, all of which were caused by the poison. ",
        "Once he helped this man eliminate the poison, he would no longer be stupid.",
        "He didn’t know if this person was single. If this person was single and he could accept his flaws, he could become partners with this person.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This person should be a good person.",
        "This man had hundreds of wounds of varying sizes on his body, all caused by star worms. He should be a soldier who had fought on the battlefield for many years. ",
        "Qi Shiyan liked these heroes who fought on the front lines and protected the people in the rear.",
        "Besides, he also liked the man’s looks and figure.",
        "This man’s face was disfigured now, but his bone structure was very good. He would definitely be very handsome after being detoxified.",
        "Even if the other person always remained like this, he wouldn’t find it disgusting. He even felt closer toward him. ",
        "From childhood to adulthood, all the people around him were disfigured.",
        "As for his figure… the other person was full of muscles and had the figure he had always dreamed of.",
        "He thought it would be quite good to have a partner like this.",
        "The most important thing was that after they became partners, it would be normal for him to kiss and hug this person as much as he wanted. ",
        "Qi Shiyan didn’t know how this person appeared on this planet.",
        "Maybe, like him, he came to this planet in an escape pod, or maybe there was a military base on this planet.",
        "In any case, this was the first person he met after coming to the interstellar era. To Qi Shiyan, this person was different.",
        "The rabbit had been cooked on the outside but not on the inside. After slicing off all the cooked meat and eating it, Qi Shiyan put the rabbit back on the fire and continued roasting it. At the same time, he did not forget to talk to his little baby. “Xiao Guai, this rabbit needs to be roasted before we can continue to eat it. Let’s wait and then eat again, okay?” ",
        "Ming Zheng blinked and said nothing.",
        "Qi Shiyan asked again, “Xiao Guai, can you speak? What’s your name?”",
        "Ming Zheng still didn’t say anything. He was still hungry and just wanted to eat rabbit.",
        "“If you don’t say anything, I’ll just call you Xiao Guai from now on. After all, you are so well-behaved.” After Qi Shiyan said this, he leaned his head over and rubbed Ming Zheng’s chin with his face. ",
        "Now, the area of ​​skin contact between the two of them was still a little too small.",
        "But he would try harder!",
        "",
        "Netizens all felt that this scene was a bit eye-catching.",
        "“Qi Shiyan looks like a pervert.” ",
        "“What on earth does Qi Shiyan want to do?”",
        "“I previously always suspected that this live broadcast was scripted, but now I don’t think so. If it was scripted, why would he cheat on a live broadcast?”",
        "…",
        "Netizens simply didn’t understand, but Lu Yuan started to tremble unconsciously. ",
        "What was Qi Shiyan doing? What had he done?!",
        "He actually took advantage of His Majesty!",
        "Three years ago, when His Majesty realized that his health was failing, he planned to find an heir within the imperial family.",
        "There were many imperial family members, and many of them were talented, but most of them were like the retired emperor. They only wanted to hide in the rear to eat, drink and have fun, and didn’t want to go to the front lines at all. ",
        "They checked over and over again and found only a few people that were considered presentable.",
        "Among these people, Ming Qingyu, who had just gotten engaged to Qi Shiyan, waa considered pretty good.",
        "His Majesty no longer had the energy to choose an heir, so in the end, he settled on Ming Qingyu.",
        "Ming Qingyu was His Majesty’s heir and also His Majesty’s nephew. But now, Ming Qingyu’s fiancé was actually flirting with His Majesty! ",
        "What was this?!",
        "When Lu Yuan didn’t know what to do, he finally contacted the sanatorium.",
        "The planet where the sanatorium was located had no base station connected to the star network, and wasn’t even connected to the military’s internal network, but the military could still contact them.",
        "As soon as the call was connected, Lu Yuan asked, “Why didn’t you guys take good care of His Majesty?” ",
        "The person in charge of the sanatorium was a little surprised. “Adjutant Lu, how did you know that His Majesty is missing?”",
        "Because he saw it on the live broadcast!",
        "Please visit chrysanthemumgarden (dot) com",
        "Lu Yuan talked about the live broadcast.",
        "As they talked, he and the person in charge of the sanatorium both felt that something was not right. ",
        "Qi Shiyan appeared on the convalescent planet, the live broadcast started, and His Majesty ran away from the sanatorium. How did all these things come together?",
        "The person in charge of the sanatorium said, “The matter of His Majesty running away from the sanatorium is not right. There may be a traitor in the sanatorium.”",
        "Lu Yuan also said, “There is no base station on the convalescent planet, and it can’t connect to the star network, but Qi Shiyan can still broadcast live on it. This is using the military’s most advanced communication technology. There should be a spaceship carrying a base station as a connection point. I don’t know who is behind this. If they find out that the person next to Qi Shiyan is His Majesty, His Majesty may be in danger.”",
        "“Isn’t this technology supposed to be used only on the front lines? How could a live broadcast platform get it and use it for a live broadcast?” ",
        "“It should be related to Ming Qingyu. In the past few years, many people have shown goodwill toward him.”",
        "…",
        "As the two were discussing, the emergency communicator in front of Lu Yuan suddenly rang. “Adjutant Lu! A large number of star worms have appeared on the front lines!”",
        "The moment this voice finished speaking, the specific situation on the front lines had already been transmitted to Lu Yuan’s work terminal. ",
        "Lu Yuan immediately said to the person in charge of the sanatorium. “Be careful and first ensure the safety of His Majesty!”",
        "The person in charge of the sanatorium said, “I will not look for His Majesty for the time being. His Majesty may be safer staying under the live broadcast camera. I will first control the people on the convalescent planet and the nearby spaceship!”",
        "“Okay! I will arrange a substitute here. We can’t let anyone know that His Majesty is on the convalescent planet.” Lu Yuan said.",
        "Since His Majesty ascended the throne, he had been misappropriating imperial property to support the front lines. ",
        "Many members of the imperial family, including the retired emperor, wanted His Majesty to die.",
        "In addition, the star worms also possessed intelligence. The star worms also wanted His Majesty to die.",
        "They couldn’t let anything happen to His Majesty!",
        "In the live broadcast, Qi Shiyan was still happily eating roasted rabbit with Ming Zheng. ",
        "While eating, he kept talking to Ming Zheng. “Xiao Guai, next time I will definitely find something more delicious for you to eat.”",
        "“You are awesome, Xiao Guai. You are so good looking!”",
        "",
        "“Xiao Guai, you are the cutest person in the world!”",
        "… ",
        "Lu Yuan felt that Qi Shiyan looked like a slag man coaxing a little girl.",
        "Especially because he kept touching His Majesty’s hand.",
        "For a moment, Lu Yuan’s blood pressure was extremely high, but the deafening alarm from the front lines brought his blood pressure down again.",
        "Forget it, just bear with it. ",
        "In fact, he also knew that Qi Shiyan was not really teasing His Majesty. Qi Shiyan’s state seemed a little abnormal.",
        "But he couldn’t take care of this for the time being. Killing the star worms was more important!"
    ],
    "previous": "Ch8 - Hug",
    "next": "Ch10 - Poison Flare-up"
}