{
    "title": "Chapter 12",
    "content": [
        "The Pearl Coast does not simply refer to that cruise ship; it symbolizes absolute status and identity.",
        "The value of that invitation was worth more than a fortune. ",
        "Lu Yiman was dressed in a silver-white suit, with long, slim pants and a cinched waist. The jacket was an asymmetrical white blazer, highlighting his narrow waist and long legs. Underneath, he wore a black shirt, without a tie, and the slightly open collar just barely revealed the area near his Adam’s apple.",
        "A shining rose brooch was pinned to his left chest, with a long, delicate chain trailing down like a shooting star. The other end of the chain was attached to his ear.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "No one knew that he had an ear piercing.",
        "His medium-length hair was all gathered onto his right shoulder, tied into a braid the length of a finger. He smiled lightly, his gaze shifting elegantly, a blend of sophistication and sensuality that made him stand out. ",
        "“I thought I was the center of attention at this party, but it seems more people are looking at you than at me.”\n\n",
        "Beside him, a voluptuous and tall woman hooked her arm around his, fretfully brushing aside her wavy hair that cascaded down her chest. She wore a deep V-cut red floor-length gown that flowed gracefully with her every step.",
        "Lu Yiman looked down with a gentle smile, and gallantly helped her pull back the red chiffon that draped over her shoulder, speaking softly, “That’s because you’re standing next to me, Sister Haohao. They’re looking at me because they’re jealous.”",
        "“You always know just what to say,” the woman teased, rolling her eyes at him. With her arm still linked with his, she walked into the venue, dazzling as ever.\n\n ",
        "Peng Haohao wasn’t visiting the Pearl Coast for the first time, but it was the first time she had received so many astonished glances. Of course, part of the reason was the handsome young man at her side, but it was also due to the luxurious gown she wore.",
        "She had a fuller figure than most women and was taller too. This gown perfectly enveloped her, turning her into a magnificent work of art, her curves displayed without reserve.",
        "After basking in the admiration of the crowd for a moment, Peng Haohao patted his arm and said casually, “Alright, your sister has to go do some work now. Go have fun on your own.”\n\n",
        "Lu Yiman smiled brightly and cooperated, saying, “Okay, I’ll take my leave then.” ",
        "Peng Haohao laughed, raising her hand and lifting her chin gracefully, “Go on, go on.”",
        "Lu Yiman took her hand, bent down, and gently placed a kiss on his own fingers. “Thank you, Sister Haohao.”",
        "Watching his carefree figure walk away, Peng Haohao let out a small laugh, saying, “Heartless! Can’t even take the tiniest advantage.”",
        "After saying that, she lifted her skirt and, like a proud peacock, marched off confidently towards her “battlefield.” ",
        "…",
        "Lu Yiman declined the fifth person who approached him and had no choice but to head to the restroom after finishing a drink.",
        "He was an unknown figure, while Peng Haohao, at his side, represented the prestigious Peng family, one of the upper circles. Due to his youthful, handsome appearance, it was inevitable that people mistook him for a “kept man.”",
        "It also gave others the impression that this “dessert” was available for anyone to sample. ",
        "Even some powerful men weren’t exceptions.",
        "He stood at the sink, washing his fingertips when the door to one of the stalls opened. Through the mirror, a pair of deep, dark eyes stared back at him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Still dressed in his usual black suit, the man’s gloomy face and oppressive aura made him seem like a towering, dark mountain.",
        "Dut Ou Timan smiled. ",
        "Seeing his smile, Tu Jhuang’s brow furrowed, and he strode toward him with an air of hostility.",
        "Ou Timan raised his arm, droplets of water still clinging to his fingers, blocking the hand that was about to grab the back of his neck.",
        "“Mr. Yu, enough is enough.”",
        "With a twist of his wrist, he grasped Yu Chuang’s arm and pulled it down, his smile unwavering. “I don’t like repeating the same thing three times.” ",
        "The water droplets slid down his fingers and into Yu Chuang’s sleeve. Lowering his gaze, he noticed a sliver of white lining inside the cuff. His fingers twitched, but Yu Chuang coldly shook off his hand.",
        "“Where is Ziming!”",
        "His furious questioning came with a surge of uncontrollable anger.",
        "Lu Yiman retracted his gaze, calmly wiping his fingers as he softly replied, “Doesn’t Mr. Yu already know? Why ask me?” ",
        "Yu Chuang’s eyes instantly turned bloodshot, his rage bubbling uncontrollably beneath the surface.",
        "“It was you!”",
        "He turned back in confusion, “He wants to pursue his dreams, realize his life’s worth, what does that have to do with me? Mr. Yu, what you’re saying makes no sense.”",
        "Lu Yiman had always been refined and elegant. Even when deliberately hitting someone’s sore spot, his soft voice was as pleasant as a trickling stream. ",
        "But that didn’t hide the barbed edge in his words.",
        "As expected, Yu Chuang reacted intensely to his provocation, suddenly striding forward, raising his hand as if to grab Lu Yiman’s collar.",
        "However, today, Lu Yiman clearly wasn’t as accommodating as before.",
        "He sidestepped, avoiding Yu Chuang’s advance, but Yu Chuang continued pressing forward, his fingers accidentally catching on Lu Yiman’s brooch. The rose bloomed with a striking red. ",
        "Seeing the torn wound, Lu Yiman didn’t move further but also didn’t let Yu Chuang continue his rampage. Instead, he grasped Yu Chuang’s wrist and sighed softly, “Mr. Yu, the party isn’t over yet. If I show up with disheveled clothes, that would be quite rude.”",
        "Yu Chuang’s gaze burned intensely as he stared at him.",
        "",
        "And so?",
        "Lu Yiman smiled faintly. “So, could Mr. Yu perhaps resolve this a little more calmly?” ",
        "This time, his fingers rested on Yu Chuang’s wrist while his other hand took a tissue to wipe away the blood beads from Yu Chuang’s fingertip.",
        "His actions made Yu Chuang furrow his brow tightly, looking at him with a mix of wariness and confusion.",
        "He had to admit, he could never fully understand the man in front of him.",
        "Sometimes, Lu Yiman’s behavior left him at a complete loss on how to respond. ",
        "The uncontrollable emotions in him began to cool down imperceptibly, without him realizing it, and the sharp, icy anger in his eyes morphed into a frustrated sense of confusion.",
        "“No.”",
        "But he still answered Lu Yiman’s question one word at a time, and as he spoke, he kept his unwavering gaze fixed on him.",
        "Lu Yiman slowly pulled a silk handkerchief from his pocket, methodically wrapping it around Yu Chuang’s fingers and tying a neat, elegant bow. ",
        "“Well then, could I trouble Mr. Yu to refrain from doing anything reckless in public the next time you’re angry?”",
        "Yu Chuang hadn’t yet noticed the “damage” done to his hand. He stared into Lu Yiman’s eyes and realized that the man truly wasn’t angry; his tone was as soft as ever.",
        "For reasons he couldn’t explain, his turbulent emotions also began to settle, and he found himself seriously considering Lu Yiman’s request.",
        "“Alright.” He nodded solemnly. ",
        "He could refrain from acting impulsively in public, but he could always toss him into the ocean to feed the fish when the night was quiet!",
        "His tightly furrowed brows gradually relaxed. He lifted his slender, almond-shaped eyes slightly and cast a cool, indifferent glance at Lu Yiman.",
        "Lu Yiman also nodded seriously in return, even though his eyes carried a playful smile.",
        "“Thank you for your generosity, Mr. Yu.” ",
        "Unexpectedly receiving a positive response, Yu Chuang awkwardly looked away and rubbed his hands. But something suddenly felt off. When he looked down, the glaringly bright bow on his hand caught his eye.",
        "His movements froze, and he slowly lifted his eyes to look at Lu Yiman.",
        "",
        "The lowered brows and those dark, inky eyes clearly conveyed displeasure, but Lu Yiman simply bent down and smiled brightly.",
        "“No need to thank me, Mr. Yu.” ",
        "Yu Chuang’s brows furrowed, his expression sharpening.",
        "He didn’t say thank you!",
        "Yet somehow, he could never gain the upper hand in their exchanges.",
        "At that moment, the bathroom door burst open with a loud bang. A young man, holding another slender man in his arms, stumbled in, passionately kissing him as they crashed into the wall. ",
        "The sound of water dripping was accompanied by the visible darkening of Yu Chuang’s expression, with veins bulging on his forehead.",
        "“Yu Ci?”",
        "A cold voice cut through the air, and the taller man immediately froze, snapping out of his intoxicated daze. His sudden sobriety was so swift that even Lu Yiman couldn’t help but marvel at how Yu Chuang’s voice worked better than a calming spell.",
        "“Brother?” ",
        "Lu Yiman raised an eyebrow, a bit surprised at the familiarity in Yu Ci’s tone.",
        "But he had no interest in witnessing their family drama any further.",
        "“Mr. Yu, I’ll take my leave now.”",
        "He nodded politely, and Yu Chuang cast him a sideways glance but remained silent. Without lingering, Lu Yiman turned and walked away, deliberately ignoring the slightly amazed look the man by the door gave him. ",
        "As the bathroom door slowly closed behind him, Yu Chuang’s cold “Come here” echoed out, followed by a sharp thud as the man knelt down. Then came the slightly panicked and flustered voice of Yu Ci.",
        "Despite Yu Chuang’s seemingly harmless appearance, he had the younger members of the Yu family utterly subdued. That, it seemed, was the authority of the eldest brother.",
        "Lu Yiman chuckled to himself. If Yu Ci had heard his thoughts, he would have likely shouted in protest.",
        "Harmless? Not at all! ",
        "This was the same person who, at six years old, had broken his leg, at seven had silenced him with just a glance, and at eight had gotten a vicious neck tattoo without uttering a single sound of pain. Yu Chuang was the kind of person who haunted your dreams at night.",
        "It wasn’t just Yu Ci. All the children who had lived in the old Yu family residence during those years were terrified of him.",
        "Please visit chrysanthemumgarden (dot) com",
        "Even after reaching adulthood and living more calmly with Yu Chuang away from the family estate, Yu Chuang’s influence hadn’t waned.",
        "Yu Chuang was a complicated figure. Not even Yu Ci could fully articulate whether his feelings were more of respect or fear. ",
        "Of course, only the younger generation of the Yu family understood this complex emotion.",
        "As Lu Yiman entered the ballroom, he noticed that Peng Haohao was already surrounded by a group of people, effortlessly navigating the crowd with ease and grace.",
        "He felt entirely at ease, without the slightest bit of guilt that the lady was out there taking the lead while he relaxed.",
        "Finding a quiet seat in a corner, he failed to notice that sitting just across from him was Yu Chuang’s brother, Yu Chuan. ",
        "“Mr. Lu.”",
        "At the sound of his name, Lu Yiman turned around and saw Yu Chuan, also in a black suit but much slimmer and more striking. He couldn’t help but laugh.",
        "It seemed he was fated to encounter the Yu family today.",
        "Smiling with amusement, he raised his glass leisurely. ",
        "“President Yu.”"
    ],
    "previous": "Chapter 11",
    "next": "Chapter 13"
}