{
    "title": "Chapter 25.1",
    "content": [
        "When Lu Yiman returned to the hotel, he already had a rough framework in his mind.",
        "He had arrived relatively late, so time was tight. During the body measurements today, the white woman was very enthusiastic about exchanging contact information with him. ",
        "The two Black models, on the other hand, were shyer than expected.",
        "He didn’t refuse, also to prevent any unexpected situations before the competition started.\n",
        "",
        "However, the white lady was overly enthusiastic and is still inviting him to the bar tonight to “relax.”",
        "He declined and then turned off his phone. He planned to spend the next few days in his hotel room. ",
        "Meanwhile, that white lady sent a regretful expression to the other side.\n\n",
        "***",
        "Yu Chuang sat in a luxurious and lively bar, his cold face showing a very grim expression.",
        "First, the other party didn’t arrive on time.\n\n ",
        "Second, the other party had scheduled the meeting for 10 p.m.",
        "Third, the other party had chosen his least favorite place—a bar—to talk business.",
        "He only came to places like this when he was in a terrible mood, but that didn’t mean he was willing to talk business in such a smoky and chaotic place in a foreign country.\n\n",
        "Finally, the other party was late. ",
        "Yu Chuang disliked people who weren’t punctual.",
        "He sat there brooding, because he had been invited by the other party and there was no private room reserved. He could only sit near the bar, watching the wild dancing in the club and ignoring the occasional glances cast his way.",
        "His assistant was trying hard to negotiate with the bar but learned that the private rooms were members-only. Even if Yu Chuang wanted to become a member now, it was impossible to book a room on such short notice.",
        "The secretary on the side pushed his glasses indifferently and began calculating how to maximize the profit from this situation… or rather, how to milk the other party for money. ",
        "After more than half an hour, a man in a casual suit finally arrived, fashionably late.",
        "The man was very young, with striking blue eyes that were like the deep blue sea or dazzling gemstones.",
        "But that didn’t stop Yu Chuang from wanting to bury the man in the ground with a small shovel right now.",
        "“Reed.” ",
        "The man smiled, shook his hand, and even winked at him, throwing in some charm.",
        "Reed was currently an agent for the internationally renowned jewelry brand “Jennie” and the youngest son of the Roerche family.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "His enormous wealth had not only given him a privileged lifestyle but also brought about his arrogant sense of entitlement.",
        "Yu Chuang’s goal was to secure a partnership with Reed, hoping their Sun series could be placed in Jennie’s counters. ",
        "Yu Chuang lifted his eyes to glance at Reed, withdrew his hand, and pulled a silk handkerchief from his pocket to wipe the back of his hand.",
        "Eeed shrugged, unfahed.",
        "Naturally, he didn’t apologihe for being late either.",
        "“Zr. Eeed.” ",
        "Tu Jhuang spoke the name in a slightly hoarse voice while raising his hand. Lis assistant duickly placed the contract into his palm.",
        "Eeed, attracted by the sound of his voice, glanced over at him, then fized his gahe on Tu Jhuang’s neck.",
        "The tattoo there was striking, not quite matching the cold man’s demeanor, yet it oddly added a touch of allure.",
        "“As for our collaboration, I have a few points that need clarification… and due to your tardiness and rudeness, some of the contract terms will be amended…” ",
        "If Lu Yiman had been there, he would have been amazed at how fluently and smoothly Yu Chuang spoke.",
        "Even his expressionless face seemed more aloof and confident.",
        "So, he could be this calm and composed.",
        "This was a rarely seen side of Yu Chuang. ",
        "Yu Chuang had revised the original terms on the spot. For someone who would choose a bar as a business meeting location and arrive half an hour late, Yu Chuang did not believe they were sincere about cooperating.",
        "Therefore, his demands were reasonable.",
        "He also didn’t need to lower his stance.",
        "Reed looked at him with deep eyes, fixating on his moving Adam’s apple as he spoke confidently, and the flower tattooed on it. ",
        "Such a self-assured and unique man can easily captivate others.",
        "Especially for someone as unrestrained as Reed.",
        "",
        "Of course, he couldn’t say that the reason he was half an hour late was because he had wasted time in bed.",
        "Oh, this partnership—both sides were dissatisfied from the start. ",
        "So, his tardiness and Yu Chuang’s last-minute amendments to the contract, while seemingly absurd, were in fact part of a mutual power play.",
        "***",
        "In less than an hour, both parties parted ways harmoniously, though without reaching an agreement.",
        "Yu Chuang didn’t want to stay a second longer. As soon as he confirmed the deal had fallen through, he walked out without looking back. ",
        "It was as if even sharing the same air with the other party was unbearable.",
        "The other party’s tardiness and frivolous attitude had left Yu Chuang thoroughly displeased.",
        "Reed lazily followed behind, still maintaining the host’s etiquette, and politely extended another invitation to Yu Chuang.",
        "“I regret that we couldn’t reach a consensus on this collaboration, but I believe there’s still room for discussion. I wonder if Mr. Yu is available tomorrow evening. I hope we can…” ",
        "“No.”",
        "Yu Chuang’s attitude was even colder than before.",
        "Stepping out of the role of negotiator, he once again became a man of few words.",
        "Reed looked up at him, smiling and calmly said, “Alright, it seems we’ll have to reschedule after tomorrow night.” ",
        "The assistant had already driven the car over. On the neon-lit street, the revolving sign outside the bar made Yu Chuang’s sharply dressed black suit seem all the more out of place, even a bit ridiculous.",
        "But this was his trademark. He was always this purely black and overly serious person.",
        "“Mr. Reed,” Yu Chuang said politely, maintaining his role as a collaborator even at this moment. “Goodbye.”",
        "Although his expressionless face showed little sincerity. ",
        "Once he sat in the car and slammed the door shut, Reed watched the car window slowly roll up, obscuring Yu Chuang’s sharp jawline. Reed then burst out laughing.",
        "“What an interesting man.”",
        "",
        "He twirled the car keys in his hand and tossed them to the servant beside him, turning to head back into the bar.",
        "Meanwhile, inside the car, Yu Chuang irritably loosened the tie around his neck. ",
        "He felt like he was wasting his time.",
        "“Sir, President Yu reminded you to take your medicine on time.”",
        "The secretary beside him took out a bottle of pills from his pocket and opened a bottle of water for him.",
        "Yu Chuang stared at the pill bottle with his dark eyes, silently threw the pill into his mouth, but didn’t take the water from the secretary. ",
        "Instead, he crunched the pill as if it were candy.",
        "But it wasn’t candy, it wasn’t sweet, just bitter, leaving his mouth dry.",
        "Yet his face remained unchanged, as if he had really eaten candy.",
        "He turned his head to look at the fleeting scenery outside the window, a sense of confusion in his eyes. ",
        "It had been several days since he last saw Lu Yiman.",
        "When they had met on the plane, his emotions had been unprecedentedly complex, yet beneath it all was a faint sense of anticipation and excitement.",
        "He had truly believed that fate had connected them.",
        "Lu Yiman always said they were destined to meet. ",
        "But two days had already passed.",
        "Had their fate disappeared?",
        "***",
        "Lu Yiman finished the last stitch and looked at the striking red on the Black model. He had a fondness for such vibrant colors; among all the thousands of hues, the brilliant red was always the most eye-catching. ",
        "“Do you mind if I paint on your bodies?” he asked.",
        "He was wearing a loose silver-gray silk shirt, and black pants of the same material, which looked a bit like pajamas. Because of his tall and lean figure, it gave off a somewhat lazy and casual vibe.",
        "",
        "Even amidst such busyness, he showed no sign of disrespect; his clothes were neat, his smile gentle, and every strand of hair was perfectly combed. As he spoke, his handsome face radiated a captivating warmth.",
        "“Of course not, we are part of your work after all.” ",
        "The Black woman gave him a broad smile.",
        "Sometimes they needed to showcase their bodies, and they had to face their own bodies with greater confidence and poise.",
        "Professionally, excessive shyness would affect their work.",
        "“Thank you for your trust. I will treat you as a piece of art,” he said with a smile, taking out a slender paintbrush. ",
        "When the tardy white woman finally arrived, the two Black models had already finished rehearsing.",
        "To protect the privacy of each designer, the rehearsals were conducted privately. However, due to the large number of designers, each person’s rehearsal time was limited.",
        "The white woman arrived on the scene, only to find Lu Yiman packing up, ready to leave.",
        "She gasped, “Oh my god! Am I really that late?” ",
        "Lu Yiman glanced at her, his eyes catching sight of the kiss mark on her collarbone. He replied coolly, “Yes, miss, you are late. I’m about to leave now.”",
        "“But don’t I need to change clothes for the rehearsal?” she asked.",
        "“I don’t think that’s necessary, as the next designer is about to arrive. I don’t want to take up their time; after all, punctuality is a rule that we should all follow.”",
        "He smiled pleasantly, but his words were not as polite as his demeanor. ",
        "Of course, no one said that Lu Yiman had to be accommodating and deferential in every situation.",
        "His refined and gentle appearance was often just an expression of courtesy towards others.",
        "The white lady, who had always been treated gently, was momentarily stunned, and her expression stiffened.",
        "Seeing that he was really about to leave, she quickly said, “But if we don’t rehearse, what if the clothes don’t fit? What if there’s a problem tomorrow?” ",
        "Lu Yiman patiently replied, “I don’t think you need to worry about those things. After all, anything can happen before the show, and I will make sure to handle all these issues.”",
        "He turned to leave and just as he did, another designer walked in. The newcomer was a tall white man, but Lu Yiman could still meet his gaze evenly. Though slightly thinner, he appeared somewhat frail.",
        "",
        "The man glanced at him with an inexplicable expression.",
        "Lu Yiman noticed the kiss marks on the man’s neck and suddenly gave a faint, ambiguous smile. The man’s brow furrowed in response, but Lu Yiman said nothing, brushing past him as he walked out. ",
        "The remaining white lady stood there, exchanging a glance with the newly arrived white designer."
    ],
    "previous": "Chapter 24.2",
    "next": "Chapter 25.2"
}