{
    "title": "Chapter 14",
    "content": [
        "In a slightly tipsy state, Lu Yiman quickly felt a man walking toward him.",
        "The man carried a strong scent of perfume—the kind that smells expensive but doesn’t actually smell very good. ",
        "Raising his eyes, Lu Yiman’s intoxicated, hazy peach blossom eyes glistened with a watery depth under the chandelier.",
        "The man’s eyes seemed to be glued to Lu Yiman’s face. Lifting his hand, he tried to place it on Lu Yiman’s shoulder.\n",
        "",
        "“What’s wrong? Drunk?”",
        "His tone was so familiar that anyone who didn’t know better would think they were close. ",
        "But the truth was they didn’t know each other at all, except for when the man had tried to strike up a conversation about an hour ago.\n\n",
        "Lu Yiman shifted his body to avoid the man’s gesture, and once he stood straight, he was half a head taller than the man.",
        "The man’s gaze, which had been level with his, slowly lifted, now forced to look up.",
        "“None of your damn business.” Lu Yiman smiled slightly and strode away with his long legs.\n\n ",
        "“…”",
        "The man stood frozen, as if in disbelief that such crude words had just come out of Lu Yiman’s mouth. But soon, his expression turned dark and menacing.",
        "“How dare you embarrass me, Gao Qinchang. Fine, we’ll see about that!”\n\n",
        "He slammed the half-finished drink onto a tray, startling the nearby attendant into silence. ",
        "Lu Yiman politely waited for Peng Haohao to finish her small talk before heading over, but she spotted him first and waved him over. Looping her arm around his, she said affectionately, “You all can stop pestering me now. The designer himself is right here, and I’ve got him, he’s not getting away.”",
        "Her teasing remark made the ladies laugh behind their hands.",
        "Lu Yiman responded with a smile. He had had one too many drinks earlier, and since he wasn’t much of a drinker, he had loosened another button on his shirt. His single earring stood out conspicuously, and his peach blossom eyes curved slightly, giving off a subtle and sensual allure amidst his usual refined demeanor.",
        "“That’s only because Sister Haohao’s giving me face. It’s the dress that’s benefiting from such a stunning person.” ",
        "“I told you this boy’s got a silver tongue. Don’t let him sweet-talk you.”",
        "Despite her words, Peng Haohao’s smile never faded.",
        "In the past, she had brought male companions to events before, but none as outstanding as Lu Yiman.",
        "Though she had only helped him out as a favor to Peng Duoduo, she was getting a fair bit of attention herself today. ",
        "Several young women were blushing, unable to take their eyes off him, even deliberately standing close by.",
        "“I’ve heard of Mr. Lu before. Thanks to Haohao, I finally get to meet him in person today. Mr. Lu, don’t leave the rest of us out.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Yne of the women had already latched onto his other arm, her fragrance filling the air around him.",
        "Ou Timan gave Ueng Laohao a somewhat helpless glance. Le didn’t know what kind of tales she had spun about him, but his personal brand hadn’t even taken off yet, and his reputation had already preceded him. ",
        "Seeing him appear so out of place among the women, Peng Haohao burst into laughter, offering no sympathy.",
        "But Lu Yiman, ever the professional, pulled out his business cards, the black ink gleaming as if freshly printed.",
        "“Of course. Even the most beautiful clothes need someone even more beautiful to wear them.”",
        "With that, he smoothly withdrew his hand and took a step back, putting some distance between them. ",
        "Though his words were charming and his smile captivating, the ladies were utterly mesmerized, unable to tear their eyes away.",
        "In just a short while, he had handed out over a dozen business cards, and even passersby, seeing such a handsome man surrounded by women, came over to join the fun.",
        "In no time, the atmosphere was lively and harmonious.",
        "… ",
        "After some time, it truly felt like he had wandered into a spider’s web. From somewhere, a hand stretched out and touched his chest, nearly undoing another button on his already loosened shirt, nearly startling him.",
        "He finally managed to escape, drenched in sweat.",
        "Letting out a sigh, neither heavy nor light, he decided to leave this battlefield to Peng Haohao. After all, between the two of them, she was the true star of the evening.",
        "He wasn’t driven by any eager desire for success. He just wanted to use this opportunity to take his first step. ",
        "Have to be said, he really had an excellent mindset.",
        "At least since he turned seventeen, almost nothing had been able to throw him off balance.",
        "After all, for him, loss and gain had never equaled each other.",
        "A faint blush appeared on his pale skin, and near his shoulder, there was an inconspicuous lipstick mark—who knew who had brushed against him. ",
        "But fortunately, he was single.",
        "After amusing himself with a self-deprecating laugh, he simply took off his jacket. Underneath, he wore a black shirt paired with straight white trousers. He looked refined and tall, with a slender neck, and the slight opening of his collar revealed a glimpse of his collarbone.",
        "",
        "As he moved, the earring hanging near his chest shimmered in the light.",
        "When he turned around, his broad shoulders and the tapering waistline leading down to his pants made it hard for people to look away. ",
        "More eyes turned toward him, and even the movements of drinking and chatting became more absent-minded.",
        "Gao Qinchang almost crushed the glass in his hand.",
        "“I haven’t heard of any up-and-comer with the surname Lu,” he sneered, causing several of the young men around him to glance his way.",
        "“Indeed, no one with the surname Lu, and no one’s ever heard of him either. But it seems Peng Haohao brought him along, and he has some connections with the Yu family.” ",
        "The one who spoke was a second-generation young man, his eyes filled with doubt. His family didn’t rank among the top three generations like the Yu, Peng, or Gao families, but among the second generation, any little stirrings of gossip would spread immediately.",
        "“So what? Peng Haohao has brought men before,” Gao Qinchang said impatiently, though he didn’t mention anything about the Yu family.",
        "The second-generation young man glanced at Gao Qinchang, knowing that he was somewhat wary of the two Yu brothers, and said nothing more.",
        "But inwardly, he had his doubts—he suspected that man’s relationship with the Yu brothers wasn’t simple. ",
        "If Gao Qinchang wanted to provoke him, all he could do was wish him good luck.",
        "…",
        "Slowly, Lu Yiman began to feel drunk. He didn’t have a strong tolerance for alcohol, and this “Lu Yiman” had an even worse one.",
        "But his drunkenness was of the lucid kind, so it wasn’t too bad. ",
        "Pushing open the door, he planned to stand on the deck to get some fresh air. Suddenly, he spotted Yu Chuang standing alone under the moonlight.",
        "It was unclear what Yu Chuang was thinking, but the sea breeze had tousled his neatly combed hair, and the hem of his suit was fluttering.",
        "Facing the rising waves, his broad, upright back looked like a solitary mountain in the night.",
        "Lu Yiman leaned against the doorframe, quietly watching him. His gaze, clouded with a touch of drunkenness, gradually became more unfocused. ",
        "However, in this peaceful moment, the tranquil atmosphere didn’t last long. When that familiar perfume scent approached, Lu Yiman immediately furrowed his brow, straightened up, and dodged the hand reaching toward him.",
        "“Mr. Gao, is there something you need?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "When he wasn’t smiling, his pale face carried a hint of cold aloofness.",
        "“You know who I am. Looks like you did your homework before coming.” ",
        "It was unclear where the other man’s confidence came from, but the book did mention a short man with a weak appearance named Gao Qinchang.",
        "Without any expression, Lu Yiman looked down at him.",
        "“…”",
        "Gao Qinchang’s face shifted from arrogant to cold, and then to seething anger, with veins bulging. ",
        "“What’s with that look in your eyes? Do you know who I am? With just a snap of my fingers, I can make it impossible for you to stay in the capital!”",
        "Lu Yiman continued to look at him expressionlessly. From his perspective, Gao Qinchang—jumping up and down while yelling this—just looked utterly ridiculous.",
        "It was perfectly in line with the character described in the book.",
        "He didn’t feel like wasting time with him and tried to walk away. But Gao Qinchang, now completely enraged from being ignored, reached out to grab him, determined not to let him leave. ",
        "“Stay right there!”",
        "Lu Yiman was getting impatient.",
        "But before he could make a move, the sound of leather shoes on the floor stopped right behind him.",
        "Turning around, he saw Yu Chuang, wearing a cold expression, also looking down at Gao Qinchang. Yu Chuang then glanced sideways at Lu Yiman, silently asking: “Who’s this? Do you know him?” ",
        "Nope.",
        "Lu Yiman shrugged, suppressing a smile at how the wind had swept Yu Chuang’s hair into a slicked-back style.",
        "“Yu… Yu Chuang…”",
        "Gao Qinchang, about the same age as Yu, instinctively felt intimidated when facing someone like Yu Chuang, the eldest of the Yu family. ",
        "“Move,” Yu Chuang commanded with a cold glance.",
        "Gao Qinchang didn’t dare act up in front of him, so he quickly and obediently stepped aside.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The way he complied so quickly, with a hint of familiarity, somehow reminded Lu Yiman of Yu Ci. After all, this group of second-generation heirs always hung out together, and Yu Chuang’s reputation must have spread far and wide by now.",
        "Maybe in their school days, they had all been disciplined by him to some extent. ",
        "Yu Chuang took long strides forward. After a few steps, he turned back to glance at Lu Yiman.",
        "Not coming?",
        "Lu Yiman smiled, his eyes curving, as he casually draped his jacket over his arm and leisurely followed behind him.",
        "Seeing him move, Yu Chuang continued walking ahead. ",
        "Lu Yiman kept his amused smile, his pace unhurried.",
        "“Mr. Yu, wait for me.”",
        "Yu Chuang didn’t wait; in fact, he quickened his pace.",
        "After all, he had just delivered some harsh words not too long ago and was still feeling a bit emotional. For all his composure, Yu Chuang had a bit of a temper too. ",
        "Mostly, it was about keeping face."
    ],
    "previous": "Chapter 13",
    "next": "Chapter 15"
}