{
    "title": "Chapter 27.2",
    "content": [
        "Peng Duoduo really showed his capitalist qualities. While he was abroad, he handled all the matters of the studio.",
        "Of course, it was mostly thanks to money that he overcame all difficulties. ",
        "Without him even knowing, he already had more than a dozen employees under his name, including a receptionist, operations team, customer service, finance, and even a secretary…",
        "He was now the chief designer and major shareholder of the studio.\n",
        "",
        "He found it a bit funny and exasperating that, before they even started making money, just the salaries alone had already cost quite a bit.",
        "Peng Duoduo didn’t seem too bothered. When the news came out that he was being interviewed by IM Fashion magazine, Peng Duoduo immediately took action. ",
        "Besides, with his second sister in the business world and his eldest brother in the entertainment industry, there was no way they could lose money.\n\n",
        "This was probably the first time Peng Duoduo had tried to develop his own business, so he was highly enthusiastic about it.",
        "Lu Yiman didn’t dampen his enthusiasm, since Peng Duoduo was the one financing everything. He had no grounds to express any opinions, so he just did his best to help out, reviewing the projects the studio took on and holding some online meetings.",
        "Of course, none of the studio’s employees had met him in person yet, but Peng Duoduo had already made arrangements, strictly prohibiting anyone from developing any improper thoughts about the chief designer and boss.\n\n ",
        "He had heard that nine out of ten men in this industry are gay, and currently, Lu Yiman was like a butterfly, exuding an irresistible aura. Peng Duoduo had to help him safeguard the last line of defense for his chastity.",
        "He even included this rule in the studio’s official guidelines.",
        "However, Lu Yiman knew nothing about all of this.\n\n",
        "Hearing the sounds coming from the bathroom, his fingers twitched slightly as he turned his head to look over. ",
        "Yu Chuang, dressed in pajama pants, had a large white towel draped over his shoulders. His wet hair clung to his scalp, making him look much younger than before.",
        "In truth, Yu Chuang wasn’t very old to begin with, but he always wore a black suit with a gloomy air about him, never spoke much, and didn’t smile, which made him seem older than he really was.",
        "However, his mental age was indeed younger than his actual age.",
        "Lu Yiman smiled. ",
        "After waking up, Yu Chuang hadn’t returned to his own hotel, and Lu Yiman hadn’t brought it up, so he stayed.",
        "“Aren’t you cold without drying your hair?”",
        "He asked with a smile.",
        "Yu Chuang scratched his hair. He looked a little dazed, probably because he had just finished showering and was feeling relaxed, his mind drifting. ",
        "Hearing Lu Yiman’s words, Yu Chuang slowly grabbed the towel and placed it on his head.",
        "And then, he stopped moving.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "With his glasses on, Lu Yiman watched as the outer shell of Yu Chuang fell away, revealing his inner softness. His gaze, behind the lenses, darkened.",
        "“Come here.” ",
        "Yu Chuang quietly walked over to his side.",
        "Perhaps it was the heavy night, or perhaps the intimacy of the space increased this sense of ambiguity. Maybe it was also that the restlessness in Lu Yiman’s heart had spiraled a bit out of control.",
        "He sat on the carpet and pulled Yu Chuang into his arms.",
        "Yu Chuang was very obedient. ",
        "Since being brought back to the hotel, he had been well-behaved, like a small animal seeking shelter, finally feeling secure in Lu Yiman’s calm presence.",
        "The large towel covering Tu Jhuang’s head made his head droop slightly. As Ou Timan dried his hair, he couldn’t help but notice the smooth skin of Tu Jhuang’s neck, which would peek out from under the towel occasionally.",
        "Tu Jhuang’s skin wasn’t as pale as Ou Timan’s, but a kiss mark there would certainly stand out and look beautiful.",
        "Lu Yiman kept his expression unchanged, averting his eyes. He pulled the towel off Yu Chuang’s head, revealing his slightly messy hair. ",
        "“Take your medicine.” He took out the pill bottle that had fallen from Yu Chuang’s pocket earlier. The dosage was clearly marked, likely because Yu Chuang might forget to take them or need help.",
        "Yu Chuang’s body stiffened. He looked up at Lu Yiman, his dark eyes glistening under the chandelier’s light.",
        "“What’s wrong? If you don’t want to take it now, you can take it later.”",
        "He spoke calmly, about to put the bottle away, but Yu Chuang reached out, took the medicine, and before Lu Yiman could react, put the pills in his mouth and began to chew them. ",
        "Lu Yiman paused, looking down at Yu Chuang’s expressionless face as he chewed, seemingly unaffected by the bitterness.",
        "Of course, Yu Chuang could taste it—he had just gotten used to it.",
        "After swallowing the crushed pills, Yu Chuang looked up again and opened his mouth.",
        "“All gone.” ",
        "Lu Yiman’s gaze softened.",
        "“Do you want some water?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Chuang shook his head, though his eyes remained fixed on Lu Yiman.",
        "The quiet between them deepened. Lu Yiman’s expression grew more serious, and the emotions he had been keeping in check finally surged to the surface. ",
        "He grabbed Yu Chuang by the chin and kissed him.",
        "“Mm…”",
        "In the reflection of Yu Chuang’s widened eyes, the first thing Lu Yiman felt was the bitterness—a bitterness far stronger than he had expected.",
        "Their noses brushed, and as he deepened the kiss, Lu Yiman continued to invade Yu Chuang’s mouth, unable to control the urge. ",
        "Yu Chuang was forced to tilt his head back, staring at the chandelier above him. His fingers instinctively gripped Lu Yiman’s braid, his body tense and bewildered.",
        "But as the heat intensified, Yu Chuang’s waist trembled, and he leaned weakly against Lu Yiman.",
        "He was extremely sensitive—his earlobes, his neck, and even being kissed deeply made him react.",
        "When the last hint of bitterness was gone, Lu Yiman noticed he had left a mark on Yu Chuang’s chin from holding it too tightly. ",
        "He blinked, suppressing the emotions swirling in his eyes before opening them again.",
        "Yu Chuang’s dazed expression, his lips slightly moist, and his breath uneven stirred something deep within Lu Yiman. He looked away.",
        "“Drink some water,” he said.",
        "He picked up a glass from the table and held it to Yu Chuang’s lips. Yu Chuang lowered his head and quietly drank, his ears burning red beneath his dark hair. ",
        "Lu Yiman’s gaze lingered on those flushed ears, and soon enough, the back of Yu Chuang’s neck turned red as well.",
        "Yu Chuang kept his face buried in the glass for a long time, not looking up.",
        "Lu Yiman pressed his lips together, his throat moving, but he didn’t speak.",
        "The quietness was broken only by the sound of the doorbell. ",
        "Lu Yiman’s hand holding the glass remained steady, but Yu Chuang flinched.",
        "“I’ll get the door.” He placed the glass in Yu Chuang’s hand and stood up.",
        "Please visit chrysanthemumgarden (dot) com",
        "When Lu Yiman left, the warmth disappeared, and the cold air instantly chased away the heat from Yu Chuang’s back.",
        "Yu Chuang’s eyes instinctively followed him, lips still wet from the water, and he couldn’t help but lick the remaining droplets. ",
        "As Lu Yiman opened the door, a formally dressed secretary was standing outside.",
        "“This is the boss’s suit. The boss has insomnia at night, so the room will need some incense,” the secretary said, his expression cold and businesslike as he handed the bag to Lu Yiman.",
        "While the assistant was still in shock that the boss had slept in another man’s room, the secretary had efficiently taken care of all the details.",
        "“There will be a final business meeting tomorrow morning. I will come to pick up the boss around 8 a.m.,” the secretary said, standing straight. After finishing his explanation, he bowed slightly and said, “Sorry to disturb you.” ",
        "With that, he turned and left swiftly.",
        "Lu Yiman closed the door and turned around, locking eyes with Yu Chuang, who had been watching him the entire time.",
        "Calmly, he smiled and said, “I’m going to take a shower.”",
        "He placed the bag down and picked up some fresh clothes before heading to the bathroom. From start to finish, he moved with complete composure, graceful and unflustered. ",
        "When the bathroom door closed, Yu Chuang parted his lips slightly.",
        "“Lu Yiman.”",
        "His face flushed instantly, and his heart pounded wildly in his chest, as if it were about to leap out. A strange yet eager emotion began to take over his mind.",
        "Meanwhile, inside the bathroom, Lu Yiman removed his glasses, and for the first time, the uncertainty and flicker of emotion hidden behind the lenses were revealed. ",
        "***",
        "When Lu Yiman came out of the bathroom, Yu Chuang had already fallen asleep on the table.",
        "Perhaps due to the medication, Yu Chuang was in a deep sleep, not even stirred by the sound of Lu Yiman’s footsteps approaching.",
        "Bending down, Lu Yiman picked Yu Chuang up, feeling the firmness of his waist and the solid weight of his body. ",
        "But to Lu Yiman, this weight was just enough to fill his arms.",
        "He gently placed Yu Chuang on the bed. Yu Chuang slept peacefully, without any troublesome habits, looking serene and almost heartbreakingly tender.",
        "",
        "Lu Yiman watched him quietly for a long time, then casually grabbed the cigarette pack from the bedside table and walked out to the balcony.",
        "The moon wasn’t full tonight, but it was bright. ",
        "Leaning against the railing, he tilted his head back and exhaled, watching the smoke drift in the night air.",
        "His handsome face, usually gentle, was expressionless, and under the moonlight, his features seemed distant and cold, beautifully detached.",
        "“Yu Chuang.”",
        "“Yu Chuang.” ",
        "“Yu Chuang.”",
        "He whispered his name softly, over and over, as the cigarette between his fingers glowed faintly. His gaze was fixed on the night sky, lost in thought.",
        "After a long time, the ash fell from his cigarette, and he sighed softly, a sigh that carried a mix of emotions.",
        "“Yu Chuang…” ",
        "***",
        "Lu Yiman woke up on the sofa, a blanket covering him. As he sat up, his braid was still intact, not a strand out of place.",
        "Just then, Yu Chuang opened the door and walked out.",
        "“Your secretary said he’ll pick you up at eight for the meeting. It’s seven now. Do you want breakfast?” Lu Yiman asked. ",
        "Lu Yiman had an interview with IM magazine in the afternoon, meaning he had the entire morning free.",
        "“Might as well eat. Skipping breakfast isn’t good for the stomach.”",
        "Without waiting for Yu Chuang to reply, Lu Yiman pulled off the blanket and walked barefoot toward the kitchenette in the hotel suite.",
        "Yu Chuang had opened his mouth as if to say something, then frowned slightly, pursing his lips tightly, his gaze following Lu Yiman’s every move. ",
        "But Lu Yiman didn’t look back.",
        "By the time Yu Chuang finished getting ready and came out dressed neatly, there were fried eggs and milk already waiting on the table.",
        "",
        "Lu Yiman, now dressed in a crisp shirt and tailored pants, emerged from the room. The lazy loungewear had been replaced by a clean, well-fitted outfit, making him look sharp and handsome.",
        "Yet, to Yu Chuang, the relaxed version of Lu Yiman from before seemed even more attractive. ",
        "After sitting down, Yu Chuang glanced at Lu Yiman and chose the seat next to him.",
        "Lu Yiman paused for a moment and turned to look at him, but Yu Chuang kept his eyes lowered, quietly eating his breakfast.",
        "Noticing how close their arms were, barely the width of a fist apart, Lu Yiman didn’t know what to think and chose not to say anything.",
        "The simple breakfast was eaten in silence. After Yu Chuang finished his milk, he placed his hands on his lap, sitting upright, and looked seriously at Lu Yiman. ",
        "“It was good.”",
        "He paused, then added, “Thank you.”",
        "Lu Yiman noticed his small, nervous, yet clumsy gestures and let out a soft sigh in his heart.",
        "“As long as you liked it.” ",
        "His gentle voice calmed the anxious feelings that had been stirring in Yu Chuang since he woke up that morning.",
        "Yu Chuang’s eyes brightened slightly, making Lu Yiman smile inwardly.",
        "“Well, I’ll be going now.”",
        "Perhaps encouraged by those words, Yu Chuang stood up, adjusting his tie with a serious, determined air about him. ",
        "“Wait for me to come back.”",
        "With that, he walked out with a straight back, never turning around, his posture firm and resolute.",
        "Lu Yiman sat at the table, staring at the half-finished breakfast in front of him. After a while, he finally let out a chuckle."
    ],
    "previous": "Chapter 27.1",
    "next": "Chapter 28"
}