{
    "title": "Chapter 9",
    "content": [
        "Yu Ziming, who had been thrown to the ground over there, was both shocked and scared, and tears immediately welled up in his eyes. But when he lifted his head, he saw that Lu Yiman was smiling.",
        "He was always smiling, because he was inherently a gentle and kind person. ",
        "But there is a difference between smiling and laughing.",
        "Yu Ziming suddenly froze in place.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "The irritated Yu Chuan, after dealing with him, immediately wanted to go to Yu Chuang’s side, but noticed that Yu Chuang had already calmed down.",
        "Lu Yiman’s slender hand was covering his ears, shielding him from the disturbing noises, while Yu Chuang’s dark eyes stared at him unblinkingly, in complete silence. ",
        "The book had described what Yu Chuang looked like, and at that time, it was thought that a man who always had a cold expression and a striking tattoo on his neck must be very unique.\n\n",
        "But the first time he actually saw him, he realized that the first thing one would notice was his eyes.",
        "A deep black, like gems sunk in a deep pool.",
        "Yu Chuan involuntarily slowed his breathing, even his footsteps became cautious, not daring to disturb the current tranquility.\n\n ",
        "After Yu Chuang called his name, it seemed that he hadn’t yet recalled that Lu Yiman was the “adulterer” who had once been thrown onto the beach, and was only momentarily lost in the sight of his gentle smile.",
        "Lu Yiman patiently watched him. This man, so rigid, had surprisingly soft earlobes. Unable to resist, he gently rubbed them, but saw the other’s face twitch expressionlessly, realizing this might be a sensitive spot for him.",
        "His fingers paused, and he gazed into his eyes, slowly withdrawing his hand.\n\n",
        "Yu Chuan had already walked over, not daring to make a sound to disturb him. Holding some medicine in his hands, he coaxed softly, “Brother, take the medicine, okay?” ",
        "Lu Yiman straightened up and stood, but Yu Chuang’s hands, which had been restraining themselves, suddenly grabbed him, the warm palm covering his wrist.",
        "After a moment of silence, his Adam’s apple moved slightly, and he smiled.",
        "“Mr. Yu, what’s the matter?”",
        "Yu Chuang didn’t speak. He didn’t like speaking most of the time. ",
        "After silently gazing at him for a moment, that hand slowly loosened.",
        "He took two steps back, standing in the light, while Yu Chuan immediately took his place. As he turned, he paused again and glanced back, only to find Yu Chuang still staring at him intently.",
        "He glanced at him, then slowly withdrew his gaze.",
        "“Are you okay?” ",
        "Through the sleeve, he grasped Yu Ziming’s wrist and pulled him up.",
        "Yu Ziming was still lost in his own chaotic thoughts. His gaze was somewhat complicated as he looked at him, and he didn’t rush into his arms for comfort as he normally would.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“I’m fine.” He shook his head. As Lu Yiman withdrew his hand, Yu Ziming’s gaze followed those few fingers.",
        "It seemed that upon seeing Lu Yiman again, the sense of distance between them was more obvious. ",
        "He was still just as gentle, still just as concerned for him, but the warmth he used to feel in his gaze was gone.",
        "“It’s getting late. Tou two should rest here for the night. Tomorrow morning, I’ll have someone escort you both away.”",
        "Tu Jhuan didn’t look back, and with such a calm tone, there was no way to see his ezpression.",
        "After taking the medicine, Tu Jhuang was clearly out of sorts, naturally unable to spare any attention for Tu Iiming. ",
        "And at this moment, in his groggy mind, what he thought of wasn’t Yu Ziming.",
        "Hearing that they could still leave, Yu Ziming’s complexion improved significantly.",
        "The earlier chaos had left him physically and mentally exhausted. He muttered a response and, as he left, looked back at Lu Yiman, only to find Lu Yiman glancing sideways at Yu Chuang.",
        "That heavy, strange feeling in his heart deepened. ",
        "Sensing the gaze behind him, Lu Yiman raised the corner of his eye and glanced back out of the corner of his eye, only to see Yu Ziming’s slightly hunched back.",
        "He pulled out the cigarette that should have been lit during the day and walked straight toward the door, where the night was thick. The breeze flickered the flame, and as he lowered his head, he exhaled a puff of smoke when he raised his chin.",
        "The phone in his pocket lit up, with a message flashing by too quickly to read.",
        "… ",
        "Yu Chuan kept his word and let them leave the next day.",
        "Yu Ziming, basking in the long-awaited sunlight, was on the verge of tears.",
        "This time, he was utterly clear inside—he had to leave this place.",
        "Lu Yiman still looked refined, with nothing out of place except for his unchanged clothes. ",
        "As they were leaving, he glanced back and saw Yu Chuan standing at the door, bathed in light, while behind him was a pitch-black shadow.",
        "Who knows if Yu Chuang was hidden somewhere within that shadow.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Yu Ziming was still staying at Lu Yiman’s place for now, but the two were much more silent than before.",
        "On the way, Yu Ziming clutched his phone tightly, his entire body tense. ",
        "He looked like a pendulum swaying in all directions, unsure of where to settle.",
        "Understanding his state, Lu Yiman didn’t disturb him and naturally ignored his many glances that seemed like he wanted to speak but stopped.",
        "After dropping him off at the apartment, Lu Yiman received a call from Mr. Chen. Without lingering, he headed to the Chen family’s villa.",
        "Before leaving, however, he patiently reminded, “I might not be back for lunch. I don’t usually cook, but if you feel like it, there’s a supermarket just a kilometer away. If you don’t want to cook, there are plenty of restaurants nearby, though I’d suggest you order delivery.” ",
        "That little joke eased Yu Ziming’s nerves. Lu Yiman’s gentle and pleasant voice always had a way of soothing people.",
        "Yu Ziming smiled, but as something crossed his mind, the smile froze on his face. A bit awkwardly, he said, “Thank you, Yiman-ge. I’ll take care of myself.”",
        "The warmth in Lu Yiman’s eyes remained unchanged as he softly said, “If you’re tired, take a good rest.”",
        "Those warm words brought a lump to Yu Ziming’s throat, his emotions threatening to break free again. But this time, he didn’t look up to meet Lu Yiman’s gaze. ",
        "As the car drove away, he stood there, watching from afar.",
        "Sometimes, refined kindness can also signify a distant gap.",
        "…",
        "It hadn’t been many days since Chen Zizi’s birthday, yet it felt like a long time had passed without meeting again. A quiet silence lingered, carrying an invisible barrier. ",
        "As a busy senior in high school, Chen Zizi was always studying hard, even during holidays. Mrs. Song, worried about her, often brought her food, so at the moment, only Lu Yiman and Mr. Chen were present.",
        "A black-and-gold invitation card was pushed across the table.",
        "The matte black texture, with delicate golden lines outlining a luxurious cruise ship, looked quite elegant.",
        "Lu Yiman looked up at Mr. Chen across from him. ",
        "“I’m getting older and don’t care much for these things anymore. I figured you’re still young and might be interested, so if you feel like it, go enjoy yourself.”",
        "Mr. Chen took a sip of tea.",
        "",
        "Lu Yiman didn’t take the invitation from the table. He understood, and “Lu Yiman” also understood. There was a clear line between them. Aside from the help he had received from Mr. Chen and Mrs. Song during university, he had never gotten involved in any of Mr. Chen’s businesses.",
        "Besides, Mr. Chen was still in his prime, far from being “old.” ",
        "“No need to think about rejecting it. It’s just an invitation, after all. Compared to a favor, it’s actually more of a hassle, so whether you go or not is up to you.”",
        "Most of the so-called upper-class circles aren’t exactly clean. Over the years, the Chen family has kept a low profile, largely because Mr. Chen is focused on his family and prefers not to build too many connections.",
        "So, Mr. Chen really did see this as a hassle.",
        "Lu Yiman’s Adam’s apple moved slightly, and a faint smile appeared on his lips. ",
        "“Thank you, I’ll go.”",
        "The black-and-gold invitation was taken into his hand.",
        "“I thought you would refuse.” Seeing how calm and composed he was, Mr. Chen let out a soft sigh, but his expression relaxed.",
        "The old “Lu Yiman” would have certainly refused. ",
        "But sometimes, rejecting something has no meaning.",
        "Everything he had gained now, he would repay to Chen Zizi in the future.",
        "This was a collaboration.",
        "“Sometimes, if you refuse too many kind gestures, it comes off as insincere.” He smiled and stood up. ",
        "Though it wasn’t clear why he had changed so much, one undeniable fact was that the current Lu Yiman radiated even more brilliance.",
        "He was never meant to be an ordinary person.",
        "“Why don’t you stay for dinner? Chen Zizi will be back this evening,” Mr. Chen said with a kind expression.",
        "“No need, but thank you for the kind offer.” ",
        "He nodded politely, not yet inclined to dine with a “business partner.”",
        "…",
        "Please visit chrysanthemumgarden (dot) com",
        "For the next two days, Yu Ziming continued staying in Lu Yiman’s apartment. He didn’t go out at all, and although Yu Chuang had come once, he didn’t barge in violently like last time.",
        "Still, this left Yu Ziming feeling uneasy. ",
        "If Yu Chuang didn’t still have some affection for him, Yu Chuan probably wouldn’t have let him off so easily after he smashed a vase over Yu Chuang’s head last time.",
        "That night, it started pouring rain. Thunder and lightning crashed outside, the sky heavy and oppressive. The sudden storm made the anxiety on Yu Ziming’s face all the more obvious.",
        "He was waiting for a phone call.",
        "Lu Yiman knew, because the usually confused and restless Yu Ziming had seemed quite busy over the past two days. ",
        "And today, something else was different.",
        "Because Yu Chuang had come again.",
        "A black umbrella stood downstairs, motionless in the storm, like a silent statue.",
        "Lu Yiman stood at the window, having just finished working on his computer. He hadn’t yet taken off his glasses, and the cool, silver frame outlined his pale, sharp features under the soft light. ",
        "There was a hint of unattainable restraint in his refined appearance.",
        "He glanced at the nervous Yu Ziming sitting on the sofa and smiled faintly.",
        "“Your phone’s ringing.”",
        "Yu Ziming jolted and quickly answered the phone. Instinctively, he headed toward the balcony, but after taking a step, he pursed his lips and turned toward the study instead. ",
        "Lu Yiman, holding a cup of hot tea with one hand in his pocket, quietly watched Yu Chuang standing in the storm below and let out a soft sigh.",
        "“Poor thing.”",
        "His murmured words carried a hint of amusement.",
        "“But cute.” ",
        "Turning away, he placed the teacup on the round table and picked up a long black coat. As he passed by the study’s open door, Yu Ziming looked lively and a little shy, his eyes brighter than ever.",
        "He didn’t stop, but the smile in his eyes deepened.",
        "",
        "Lately, his comic account had been doing quite well.",
        "After all, everyone is lovable, and everyone has a beautiful future ahead of them. "
    ],
    "previous": "Chapter 8",
    "next": "Chapter 10"
}