{
    "title": "Chapter 35.2",
    "content": [
        "Lu Yiman quietly and calmly watched the performance on stage, finished his fruit wine, and grabbed his coat from the back of the chair as he stood up to leave.",
        "Peng Duoduo noticed that Lu Yiman was about to leave and hurriedly finished his drink, chasing after him. ",
        "“Why are you leaving so soon?”",
        "Lu Yiman glanced back at him, smiling. “I just came out for a bit of nightlife, that’s all.”\n",
        "",
        "Peng Duoduo was confused, looking at the fruit wine that even a kid would find bland. He couldn’t help but ask, “One drink and that’s it for nightlife?”",
        "He paused for a moment, then mumbled, “How does one drink not count as nightlife?” ",
        "Lu Yiman smiled as he put on his coat, holding an unlit cigarette between his fingers as he walked out of the bar.\n\n",
        "Watching his retreating figure, Peng Duoduo suddenly felt a strange sense of unfamiliarity creep in. The Lu Yiman from a few months ago wouldn’t have smiled so often or spoken in such a light, breezy tone.",
        "His mind buzzed, and he shook his head hard, convincing himself it was the slap from his mom earlier that had messed up his brain. Lu Yiman is just Lu Yiman—who else could he be?",
        "He chased after him and found him standing at the mouth of an alley, smoking. The light was dim, with only the neon glow from the signs casting colorful hues over his body.\n\n ",
        "Peng Duoduo used to think those gaudy signs were tacky and lowered the bar’s class. But now, Lu Yiman wasn’t doing anything—one hand in his pocket, the other holding a cigarette, standing lazily with his gaze lost in the misty night ahead. He didn’t speak or make any unnecessary movements.",
        "As the vibrant lights danced across his face, highlighting the sharp lines of his features, the tendrils of smoke traced the contours of his face. From afar, he looked like a vivid painting against the hazy backdrop of the night.",
        "Peng Duoduo couldn’t help but slow down his steps. He felt as if Lu Yiman had his own world now, one that no one could enter.\n\n",
        "A sudden pang of anxiety cleared his mind instantly. ",
        "He quickly strode over, bringing life back to the still picture.",
        "“Why are you standing here? Not heading back?”",
        "Lu Yiman lowered his eyes, glanced at him, and flicked the ash off his cigarette. The wind quickly blew it away.",
        "“I’ll leave after finishing this cigarette.” ",
        "“Did you drive here?”",
        "“No, I took a taxi.”",
        "“Oh.”",
        "Peng Duoduo suddenly didn’t know what to say. The eerie sense of unfamiliarity still lingered, refusing to leave. The Lu Yiman who smiled earlier and the Lu Yiman standing here now, not smiling, seemed like two completely different people, creating a stark contrast in his mind. ",
        "A vast, dark chasm seemed to open up before him, and he didn’t dare think about it too much, fearing that if he fell in, he’d never be able to climb out.",
        "He quickly brushed off that unsettling feeling. But when he looked at Lu Yiman again, he found himself, for some reason, quickly averting his gaze.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Scratching his head, he accidentally touched his swollen cheek and winced in pain. The sharp sting brought his thoughts back into focus.",
        "“Yiman, do you have any plans right now?” ",
        "Seeing how calm and unhurried Lu Yiman was made Peng Duoduo even more anxious for him.",
        "“No.”",
        "“How can you not have any!” Peng Duoduo was suddenly worked up. If he liked Yu Chuang, shouldn’t he be doing something about it? “Aren’t you anxious? Aren’t you going to fight for him?”",
        "Seeing how flustered Peng Duoduo was, Lu Yiman smiled again. “I’ve been fighting for him from the very beginning.” ",
        "Ueng Guoduo was stunned. Low had he been fighting for him? Le seemed so laid-back every day.",
        "Ou Timan stubbed out his cigarette, hands in his pockets, and smiled, saying, “Now is the time to wait for results. Eushing won’t help.”",
        "Ueng Guoduo watched him walk off into the night, wondering if his sister was right—maybe he really should read more and stay informed, since he couldn’t understand a word either Ou Timan or his sister had said.",
        "*** ",
        "After a couple of days of back-and-forth, Miss Gao was finally brought back for a meeting with Yu Chuang at a Western restaurant. Though reluctant, she still showed up.",
        "Miss Gao, sitting across from Yu Chuang, felt her dissatisfaction growing, but while she could throw a tantrum at home, she maintained her composure in public.",
        "“I’ve heard that Mr. Yu has been on quite a few arranged dates with young ladies before.”",
        "Indeed, one of them was even her classmate’s older sister. ",
        "Their social circle was small. Even if you hadn’t met someone, after a few rounds of gossip, you could gather a fair amount of information.",
        "“Mm,” Yu Chuang responded indifferently.",
        "Miss Gao was really young, with a hint of youthful naivety still visible on her face. It was said that she was only twenty, still in college.",
        "But to Yu Chuang, she was no different from the other women he had met. There was no distinction, no unique impression. ",
        "Once they walked out of that door, he wouldn’t remember what she looked like.",
        "“Are you always this boring?” Miss Gao pouted, casting a somewhat critical gaze at him.",
        "",
        "Yu Chuang’s eyes shifted, fixing on her face. The cold, detached look in his eyes made Miss Gao squirm in her seat, and she averted her gaze, feeling uneasy.",
        "“What is it?” she asked, hiding her discomfort by taking a sip of her coffee. ",
        "Creepy, she thought.",
        "“Miss Gao,” Yu Chuang began, this being the longest sentence he had spoken since they met.",
        "“Regarding this marriage alliance, I can see your disapproval, so I—”",
        "“So, you can talk!” Miss Gao exclaimed in surprise, staring at him. She had thought he might have some sort of issue with speech, given how slowly his words had been coming out. ",
        "Yu Chuang frowned slightly, pressing his lips together but quickly regaining his composure. He wasn’t bothered by her interruption and continued to look straight at her.",
        "This time, his words were more concise. “Good. I also don’t agree with this marriage.”",
        "Miss Gao froze, meeting his gaze directly.",
        "She hadn’t wanted to marry him either, but she was well aware of the business interests at play. ",
        "“Do you have a say in this?” she asked.",
        "Yu Chuang’s sharp phoenix eyes lifted slightly, a streak of decisiveness cutting through his gaze. “I do.”",
        "Miss Gao stared at him, shocked by his certainty. But soon enough, his confidence gave her a sense of reassurance as well.",
        "“Alright, I believe you.” ",
        "***",
        "On the way back, Yu Chuang sat in the car, staring out at the passing traffic. Suddenly, something flashed in his mind.",
        "“Stop the car,” he said.",
        "The driver quickly hit the brakes and turned around, saying, “Sir, we can’t stop here. Do you need to buy something? I can send someone to—” ",
        "Before he could finish, Yu Chuang had already stepped out of the car, heading straight towards a jewelry store across the street.",
        "The driver glanced at the large billboard advertising engagement rings and stood there, momentarily stunned. He opened his mouth as if to say something but ended up saying nothing.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Welcome, sir,” the store attendant greeted as Yu Chuang stepped inside.",
        "Under the brilliant lights, bright and dazzling, the light seemed to follow Yu Chuang as he made his way to the counter. With each step, his previously calm heart began to race more and more. By the time he reached the counter, his heart was pounding intensely. ",
        "Before meeting Miss Gao, he had met many other women.",
        "Back then, he approached marriage with apathy and annoyance.",
        "Yu Chuang had never been one to be easily swayed, and until now, all of his moments of hesitation had been for Yu Chuan.",
        "But now, his life wasn’t just defined by lilies and crabapple blossoms. ",
        "He had always said he wanted Lu Yiman, that he desired Lu Yiman deeply—and those words were always sincere.",
        "Yu Chuang never lied.",
        "Now, the time had come for him to take action. He didn’t like overly complicated processes; now that things had reached this point, he wanted to approach it directly.",
        "When it came to marriage, the kind of person to choose was obviously up to him. ",
        "Yu Chuang’s eyes gleamed with a stubborn, almost obsessive determination as he pointed at the cold glass counter.",
        "“This one.”",
        "***",
        "When Yu Chuang returned to the villa, it was rare that Yu Chuan had arrived before him. ",
        "Lately, Yu Chuan had been busy, always coming and going early and late, making it hard for them to even cross paths during the day.",
        "Yu Chuan was avoiding him—Yu Chuang could sense that.",
        "But tonight, Yu Chuan was already waiting by the door, his eyes lighting up with joy when he saw him, his face breaking into a radiant smile.",
        "“Brother, you’re home!” ",
        "For a brief moment, Yu Chuang was reminded of the younger Yu Chuan, who used to light up with joy whenever he returned home.",
        "He walked over, his face expressionless in contrast to Yu Chuan’s enthusiasm, his demeanor cold.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But Yu Chuan still smiled with eyes full of joy.",
        "After stepping inside, Yu Chuan followed closely behind, his gaze fixed on Yu Chuang’s back, filled with deep affection. ",
        "When Yu Chuang turned to look at him, Yu Chuan flashed another bright, sunny smile.",
        "“I’m not as busy today, so I finally get to have a proper meal with you.”",
        "Yu Chuan had an unexplainable attachment to Yu Chuang. No matter how busy he was, he always made sure to come home for dinner with Yu Chuang, to share a hug before bed, and to have breakfast together in the morning. It made him feel less alone, knowing Yu Chuang was by his side.",
        "He had always believed that he and Yu Chuang were connected by the same heart, sharing blood and the same pulse. This connection, born of bone and blood, could never be severed. ",
        "But now, he had to try to cut it.",
        "He lowered his eyes, hiding his emotions, but when Yu Chuang sat down, he smiled brightly again.",
        "“Since I got home early today, I learned a few dishes from the housekeeper. Can you guess which ones I made?”",
        "Under Yu Chuan’s expectant gaze, Yu Chuang calmly picked up his chopsticks and reached for a dish of steamed eggplant. ",
        "Yu Chuan was slightly surprised, but quickly softened into a gentle smile.",
        "“It seems I never have any secrets from you.”",
        "Yu Chuang glanced at him quietly and said softly, “It tastes good.”",
        "“Really?” Yu Chuan’s eyes lit up with joy. ",
        "He leaned affectionately towards Yu Chuang, eating and sharing the events of his day with excitement.",
        "In front of Yu Chuang, he never bothered with the formalities of silence during meals.",
        "After the meal was finished, and his stories came to an end, the atmosphere around them grew quiet.",
        "Yu Chuang remained seated, calmly observing the silence. ",
        "“Brother, I promised you just a little more time. I will keep that promise.”",
        "Yu Chuan then pulled out a document and a contract.",
        "",
        "If Yu Chuang signed his name, all the burdens weighing him down would disappear. The pressure of power and status that had bound Yu Chuang would shift entirely onto Yu Chuan’s shoulders.",
        "The rope that had tethered Yu Chuang would turn into the wings that allowed Yu Chuan to fly. ",
        "Yu Chuang’s dark eyes silently gazed at him.",
        "Under that gaze, all of Yu Chuan’s composure crumbled.",
        "No one knew that the young head of the company was, at heart, a crybaby.",
        "“Brother, can we still celebrate our birthdays together?” ",
        "As soon as he said it, he couldn’t hold back the tears, his voice trembling and mixed with sobs as he hung his head, wiping his eyes in a futile attempt to stop the flow of tears.",
        "Yu Chuang pressed his lips together, giving him a deep, penetrating look.",
        "“Yes.”",
        "His face remained calm, almost devoid of emotion, and his heart, strangely at peace. Yet, when he picked up the pen, his fingers trembled uncontrollably. ",
        "Finally, he signed his name on the equity transfer contract.",
        "From this moment on, apart from sharing the same surname, he and the Yu family would have no further ties of interest."
    ],
    "previous": "Chapter 35.1",
    "next": "Chapter 36.1"
}