{
    "title": "Chapter 34.2",
    "content": [
        "Even at the age of six, Yu Chuang’s training as an heir had already begun. He was often taken away, and when he returned, he was still the same, but Yu Chuan noticed the changes.",
        "Because Yu Chuang had been forcibly pulled out of his own world. ",
        "The calm and lifeless look in his eyes had changed, becoming chaotic and violent.",
        "No one knew what he had gone through.\n",
        "",
        "But to Yu Chuan, Yu Chuang was still his Yu Chuang.",
        "He would climb into his bed and hold him when he was scared, soothing him to sleep by patting his back in this strange, dark place. When Yu Chuan woke up from nightmares, Yu Chuang would calmly wipe away his tears. ",
        "Yu Chuan simply couldn’t live without Yu Chuang.\n\n",
        "At that time, Yu Chuang’s neck injury was severe, so he wore bandages for a long time and took a long time to recover.",
        "Old Master Yu always thought that Yu Chuang’s silence was because of the wound on his neck.",
        "Even though the scar looked hideous, Yu Chuang’s indifferent attitude made Old Master Yu extremely satisfied.\n\n ",
        "The Yu family needed someone just like that.",
        "But everything changed when Yu Ci provoked Yu Chuan. To the Yu family members like Yu Ci, the two of them were always treated as outsiders.",
        "But because Yu Chuang’s status was different, even as a young child, he understood the stakes and didn’t let anyone mess with him. So, instead, they targeted Yu Chuan, who was always following behind Yu Chuang.\n\n",
        "Yu Ci kicked a stone, hitting Yu Chuan in the head and causing blood to drip down immediately. ",
        "Yu Chuan’s face changed instantly.",
        "Witnessing all of this, Yu Chuang completely lost control. His dark eyes fixed on Yu Ci, and as terror filled Yu Ci’s gaze, Yu Chuang lifted a chair and broke Yu Ci’s leg with it.",
        "Once wasn’t enough—there was a second, a third strike!",
        "Yu Ci was so terrified that he wet himself, scrambling on the ground, desperately trying to escape. But Yu Chuang wasn’t about to let him go. ",
        "If the butler hadn’t arrived in time, Yu Chuang might have beaten Yu Ci to death.",
        "Yu Chuan stood frozen in place, but there was a gleam in his eyes—a different kind of light.",
        "That was his Yu Chuang, the one who protected him.",
        "Old Master Yu was strict with all of the children, and such a violent incident involving his chosen heir led him to immediately question Yu Chuang’s actions. ",
        "But Yu Chuang gave no response. He silently stared at the ground, refusing to speak or explain.",
        "Old Master Yu finally sensed something was wrong. His face darkened, and he ordered a medical examination for Yu Chuang.",
        "",
        "Of course, Yu Chuang was a smart child with a strong capacity for learning.",
        "Dut apart from that, he was not a normal child. ",
        "Yld Zaster Tu’s ezpression shifted immediately. Le couldn’t accept the diagnosis. When he looked at the scar on Tu Jhuang’s neck again, he saw it as an insult, a mockery.",
        "“Tu Jhuang got that tattoo around that time. Le didn’t cry once as the needles pricked his skin, but I knew it must have hurt terribly.”",
        "Yu Chuan’s fingers curled tightly. The vine-like tattoo that bound him like a lock was etched onto Yu Chuang under the cold, unfeeling gaze of Old Master Yu, ingrained into his very bones and blood.",
        "“He abandoned Yu Chuang, just like he had abandoned Yu Ci and the others, discarding him without a second thought. And I became his new target.” ",
        "It was only then that Yu Chuan realized what Yu Chuang had been learning all this time.",
        "The overwhelming and unbearable pressure grew heavier and heavier by the day.",
        "From that moment on, it was no longer Yu Chuan waiting for Yu Chuang to come home; it was Yu Chuang waiting for Yu Chuan to return.",
        "But after being forcefully pulled out from his world, Yu Chuang could never go back. He found himself stuck between two worlds, his emotions spiraling increasingly out of control. ",
        "Old Master Yu had a new heir, and he no longer paid attention to a child he had discarded.",
        "During this time, Yu Chuang was looked after by the housekeeper’s wife, a warm and kind-hearted woman.",
        "The first time Yu Chuang lost control and tore his clothes, she embroidered a flower on them.",
        "“—‘Maybe this will make you feel a little better,’ she said.” ",
        "Yu Chuang stared blankly at the tiny flower, no bigger than a fingernail, as the woman gently told him, “Today, little Chuang didn’t break the cup on the table. This is your reward—a little red flower.”",
        "It was the first time Yu Chuang’s eyes showed a glimmer of light.",
        "***",
        "Those days in the Yu family were suffocating and cold. They didn’t have time to grieve their parents’ deaths, nor did they have the chance to process the upheavals in their lives. Instead, they were thrust into adulthood at a terrifying pace, forced to mature far too quickly. ",
        "They were forced to endure the heavy, unfamiliar burdens placed upon them—subjected to strict education and bound by the rigid etiquette of propriety.",
        "From that time onward, Yu Chuan grew up rapidly.",
        "Please visit chrysanthemumgarden (dot) com",
        "Perhaps he always felt that both the hideous scar and the indelible tattoo on Yu Chuang were wounds he himself had inflicted upon his brother.",
        "“Once a person has a firm belief, the passage of time no longer feels painful. I want to claim everything from the Yu family, whether it be wealth or power.” ",
        "There was a cold, ambitious gleam in Yu Chuan’s eyes, like a bloodstained blade.",
        "And indeed, he gained many things. These gains allowed him to take Yu Chuang away from the Yu family and granted him the power and status to climb to the top.",
        "Even now, he continues to engage in a battle of wits with Old Master Yu.",
        "“But the sacrificial lamb is Yu Chuang, isn’t it?” Lu Yiman’s calm gaze pierced into Yu Chuan’s soul with a quiet but chilling force. ",
        "Yu Chuan froze. His fingers began to tremble, and a look of pain appeared in his eyes.",
        "“I never wanted this. I really just wanted to protect him in the beginning!”",
        "Desire is a bottomless pit. Once Yu Chuan tasted the allure of power, he craved more. He wanted to consume everything, even Old Master Yu.",
        "Yet, he couldn’t bear to let go of Yu Chuang. Driven by guilt and a secret selfishness, he bound Yu Chuang to himself, sharing the power he had seized and forcing Yu Chuang into the quagmire along with him. ",
        "In his eyes, his brother was smart and capable, and it was only Old Master Yu’s bias that made him abandon Yu Chuang!",
        "He wanted to prove everyone wrong, to show that Yu Chuang was no less than anyone else.",
        "Of course, that was just his grand excuse.",
        "In truth, he was terrified—terribly lonely. He feared that if Yu Chuang ever gained his freedom, he would leave him behind. He also feared that he himself would be lost forever in the sea of desire. ",
        "As long as Yu Chuang remained by his side, all the dark turbulence could be driven away.",
        "But in doing so, he pushed Yu Chuang right back into Old Master Yu’s grasp.",
        "Everything he did was a direct challenge to Old Master Yu’s authority. How could someone as cold and selfish as Old Master Yu tolerate a chosen heir turning against him?",
        "Once Old Master Yu noticed his loss of control, he began taking action, and Yu Chuang became the first target. ",
        "Yu Chuan refused to surrender, unwilling to give up everything he had achieved, and so a tug-of-war began between him and Old Master Yu.",
        "Caught in the middle, Yu Chuang bore the brunt of the pain from their power struggle.",
        "",
        "“I never wanted it to be this way,” Yu Chuan recalled the words Old Master Yu had once spoken to him.",
        "—”Because what you desire is with me, you are the one truly imprisoning him.” ",
        "He had been too greedy. He wanted everything—power, control, and for Yu Chuang to remain by his side. His guilt, which he thought was for Yu Chuang’s sake, was really just a cover for his own selfish demands.",
        "It was Yu Chuang who bore the cost of Yu Chuan’s hunger for power.",
        "“I’ve been hurting him.” Yu Chuan was consumed with pain, unwilling to accept this truth. For so many years, Yu Chuang had been his emotional anchor, the one he relied on.",
        "As long as Yu Chuang was still there, his life had color, meaning. ",
        "“If he ever found out that I was the one who trapped him in the Yu family, that I was the reason he could never escape, he would never forgive me.”",
        "Yu Chuan clenched his fists, his nervous, fearful expression resembling that of a child afraid of being scolded.",
        "Lu Yiman glanced at Yu Chuang across the room, letting out a soft sigh.",
        "“You think he doesn’t know?” ",
        "Yu Chuan jolted, lifting his gaze to meet him.",
        "After all these years, even though he had taken Yu Chuang away from the Yu family, he had still trapped him in that small villa. ",
        "Every demand Yu Chuan had made, every burden Yu Chuang silently bore without complaint—was it really because he didn’t know anything? ",
        "Or was it that he knew? Because it was Yu Chuan, the only person who had accompanied him through those lonely years, so he understood—and he accepted. ",
        "Yu Chuang loved Yu Chuan.",
        "It was a love full of the weight of responsibility that an older brother carries, a love both immense and profound.",
        "Yu Chuan broke down, crying uncontrollably, his emotions spilling out in a chaotic mess.",
        "He loved Yu Chuang so deeply, but within that love, he had selfishly deceived himself, using noble-sounding reasons to trap Yu Chuang. Yet, it was the realization that Yu Chuang had willingly endured the pain he inflicted that made him grieve the most. ",
        "Lu Yiman watched him sobbing, his body shaking, and calmly pushed the tissue box across the table. “Yu Chuan, sometimes you’re really childish.”",
        "Yu Chuan hiccuped through his tears, his vision blurry as he looked at Lu Yiman.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Lu Yiman stood up, looking down at him from above.",
        "“Everyone needs to learn to bear the consequences of their actions.” ",
        "If Yu Chuan was unwilling to give up everything he had, then he should have been the one to become the bargaining chip in his struggle against Old Master Yu.",
        "If it weren’t for his presumptuous decision to bind his power to Yu Chuang, Yu Chuang wouldn’t have, and shouldn’t have, suffered what he did.",
        "“Stop crying. You look awful.”",
        "Lu Yiman cast a sidelong glance at Yu Chuan, then turned and left without looking back. ",
        "He knew everything about Yu Chuang.",
        "But hearing it from Yu Chuan’s mouth—the reality of that vibrant, living person—still tugged painfully at his heart.",
        "Yu Chuan sat there, dazed, watching Lu Yiman’s departing figure. He sniffed, wiped his tears, and after crying, it felt like a heavy, dark part of his heart had cracked open, letting in fresh air.",
        "He turned his head and saw Lu Yiman walking straight towards the café across the street. ",
        "Yu Chuang, who had been staring out the window, brightened the moment he saw Lu Yiman.",
        "It was the same light that had appeared in Yu Chuang’s eyes the first time he saw the flower on his sleeve as a child."
    ],
    "previous": "Chapter 34.1",
    "next": "Chapter 35.1"
}