{
    "title": "Chapter 2",
    "content": [
        "This could be considered a battlefield of carnage in the book.",
        "But Lu Yiman is Lu Yiman, yet not that “Lu Yiman.” ",
        "So, amid the tense confrontation with Yu Chuang and the nervousness of Yu Ziming, he had only a bit of laziness from the effects of alcohol.",
        "He removed the hand from his shoulder, and at the same time, he raised his hand to take the cigarette from his mouth. Yu Ziming had no choice but to let go of him as well.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Lu Yiman.”",
        "A somewhat hoarse voice called his name. ",
        "The other party didn’t have a deep, seductive voice; it was even slightly raspy, perhaps from not speaking often, and there was a bit of a stilted forcefulness when pronouncing his name.\n\n",
        "He lifted his head, with the upper half of his face exposed under the halo of light, strikingly pale.",
        "“It seems Mr. Yu doesn’t need me to introduce myself.” His voice was soft, gentle, and pleasant.",
        "However, the other party’s sharp hawk-like eyes continued to fix on him, and with a grim expression, he opened his mouth, “You’re quite something.”\n\n ",
        "The looming threat carried with it an extreme sense of danger.",
        "He lifted his eyelids slightly, and a faint glimmer appeared in his amber eyes.",
        "“Mr. Yu is also quite impressive.”\n\n",
        "Yu Chuang’s gaze darkened, a cold glint emanating from it, making it hard for anyone to breathe. ",
        "Yu Ziming hurriedly stepped between the two, his voice sharp with anxiety, “Yu Chuang, what are you going to do? This is a society ruled by law!”",
        "Yu Chuang paused and looked down at him.",
        "Maybe because Lu Yiman was here today, Yu Ziming found some confidence and, with a pale face, slightly moved his lips and spoke, “Yu Chuang, let me go. We’re different. I can’t handle this. I’ll go crazy!”",
        "Hearing the faint pleading in his voice, Yu Chuang’s pupils contracted, and he almost immediately pursed his lips tightly, his Adam’s apple unmoving. ",
        "But he still stared at the other person, and in the cold, tense atmosphere, he opened his mouth and said, “Ziming, go home.”",
        "“Can’t you let me go?!”",
        "Yu Ziming shouted in despair, “You don’t allow me to meet strangers, forbid me from physical contact with others, and can’t even tolerate normal conversations! What do you want from me? Are you trying to drive me crazy?!”",
        "As Lu Yiman watched Yu Chuang’s tense body and the bulging veins emerging during Yu Ziming’s questioning, he furrowed his brow tightly. In the night, his stern face exuded a hint of murderous energy. ",
        "He didn’t speak either, just breathed heavily, grabbing Yu Ziming’s hand forcefully and dragging him toward the car.",
        "Yu Ziming struggled desperately, “Let go of me! I’m not going back! We’ve already broken up!”",
        "Please visit chrysanthemumgarden (dot) com",
        "The last few words cut through the honking on the road.",
        "Yu Chuang suddenly turned his head, his pitch-black eyes deep and unfathomable in the shadows. ",
        "“Refused.”",
        "The two cold words completely extinguished any hope Yu Ziming had.",
        "As he struggled and cried, he looked back at him with tear-filled eyes.",
        "A soft sigh was heard. ",
        "At some point, Ou Timan had picked up the lighter and lit another cigarette, now half-smoked amid the swirling smoke.",
        "Le sighed gently and softly stopped Tu Jhuang’s hand.",
        "“Zr. Tu, perhaps it’s better to let go. Xripping like this will easily cause inpury.”",
        "Tu Jhuang frowned and looked at him, but hearing Tu Iiming’s sobs, he lowered his head and loosened his grip. ",
        "A noticeable purple-red mark appeared around the other’s wrist.",
        "His brow twitched slightly as he pressed his lips together, somewhat dazed, his fingers dropping to his side.",
        "“Yiman-ge.” Yu Ziming carefully leaned toward him.",
        "This action made Yu Chuang instantly tense, his cold, glowing eyes locking onto him. ",
        "After taking one last drag of his cigarette, Lu Yiman extinguished the butt with his fingers, keeping it in his hand instead of discarding it.",
        "“Mr. Yu, Ziming is my junior, so it’s rude for me to interfere in your relationship, but perhaps giving each other some time to cool off would be better right now.”",
        "Lu Yiman didn’t completely close off the conversation.",
        "After all, this was the protagonist. ",
        "Yu Chuang looked at him coldly, the corners of his mouth lifting into a mocking smile.",
        "“……”",
        "",
        "He coughed lightly into his fist and continued to speak patiently, “It’s very late now, and staying here won’t lead to any outcome. Since Ziming doesn’t want to go home with you, maybe it’s better to let him stay outside for the night.”",
        "Facing Yu Chuang’s dark, bottomless eyes, Lu Yiman strangely understood his intention. He paused for a moment and said, “I have no intention of getting in the way between the two of you.” ",
        "Unfortunately, the other person didn’t believe him.",
        "Lu Yiman only felt his collar tighten as he faced the other person’s enlarged, handsome face. A rush of warm breath hit him, but the voice that followed was icy cold.",
        "“Enough.”",
        "As Yu Ziming screamed in shock, everything went black before Lu Yiman, and he collapsed instantly. ",
        "Well, it seems the label of “adulterer” is firmly attached now.",
        "Peng Duoduo, half-drunk, walked out of the bar, intending to call for a driver, only to see a black car across the street slamming its door shut, hiding a pair of long, straight legs inside.",
        "The car windows rolled up, and the vehicle sped off, leaving a trail of exhaust behind.",
        "He looked intently and then rubbed his chin. ",
        "“Huh, this car is pretty cool.”",
        "He thought about asking his dad to buy him one too!",
        "…",
        "Lu Yiman felt the dull pain at the back of his neck as he frowned and woke up in the car. ",
        "He was lying alone in the back seat, while Yu Ziming was slumped in the front passenger seat, still unconscious by the looks of it. However, their treatment was different—at least Yu Ziming had a soft pillow under his neck.",
        "With some effort, Lu Yiman sat up and sighed, thinking how the novel never mentioned the protagonist’s ability to chop down with a hand like that.",
        "Looking out the window, he saw the dim, desolate streets, a wide and isolated road, and the sound of ocean waves crashing in the quiet night.",
        "Was he going to be thrown into the sea to feed the fish? ",
        "His expression turned strange, and he glanced surreptitiously at Yu Chuang in the driver’s seat, only to be caught off guard by a pair of eyes staring back at him in the rearview mirror.",
        "Then came a cold smile.",
        "",
        "He paused slightly and then chuckled wryly.",
        "“Mr. Yu, what are you trying to do? Ziming is just my junior, really.” ",
        "As true as gold.",
        "Besides, that’s “Lu Yiman’s” true love, not his. It had nothing to do with him.",
        "Yu Chuang didn’t say a word, gripping the steering wheel tightly with his slender fingers as the flickering street scenes swiftly passed by.",
        "With his hands tied by a necktie, Lu Yiman leaned against the driver’s seat, tilting his head, and spoke in a soft, sincere tone, hoping to awaken some trace of conscience in the man. ",
        "“Mr. Yu, please believe me, there’s no way my feelings for Ziming could ever compare to yours. Given time, your sincerity will surely move him. I’m just a bystander, not worth your worry.”",
        "He tilted his head like that, speaking next to Yu Chuang in the driver’s seat at a slow and deliberate pace, his words full of earnestness.",
        "Yu Chuang, irritated by what sounded like chanting, felt the warmth of Lu Yiman’s breath constantly entering his ears. His brow furrowed as he glanced at him in the rearview mirror with his dark eyes.",
        "Then, the window rolled down, and the wind howled in, slapping the side of Lu Yiman’s face, messing up his neatly styled hair. ",
        "Even the small ponytail at the back of his head was caught in the wind, flying upward.",
        "After a brief moment of surprise, Lu Yiman chuckled helplessly, letting his disheveled hair cover his eyes.",
        "“Mr. Yu, there’s no need to get so worked up.”",
        "That soft voice drilled into Yu Chuang’s ear again. ",
        "Seeing that Lu Yiman wasn’t angry, but was instead smiling lightly, his peach-blossom eyes bent in a gentle and tolerant expression, as if he were the one being unreasonable, Yu Chuang’s chest swelled with frustration.",
        "He slammed on the gas pedal, and the car sped dangerously through the night.",
        "Yet Lu Yiman continued speaking beside him in that same calm tone.",
        "“Mr. Yu, although there are no traffic cops here, there could still be speed cameras.” ",
        "“Mr. Yu, you’ve already exceeded the safe driving limit.”",
        "“Mr. Yu, driving like this is dangerous. Any accident would also put your own safety at risk.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Mr. Yu…”",
        "“Mr. Yu…” ",
        "As the nagging voice continued in his ear, Yu Chuang’s frown deepened more and more.",
        "“Shut up!”",
        "As soon as those angry words left his mouth, not only did Lu Yiman freeze, but even Yu Chuang pursed his lips, looking somewhat regretful.",
        "Lu Yiman smiled lightly, maintaining that refined and handsome appearance. The disheveled hair didn’t diminish his good looks in the slightest. ",
        "“Alright, Mr. Yu, I suppose I’ve disturbed you.”",
        "Even Yu Chuang couldn’t help but think this guy had too good of a temper.",
        "He lifted his eyes and caught a glimpse of the rearview mirror. His irritation flared, and his lips tightened even more.",
        "What’s with that smile! ",
        "Sure enough, Lu Yiman stopped talking after that. He tried to bite off the tie binding his hands, but every time he moved, Yu Chuang’s sharp, knife-like gaze appeared in the rearview mirror, staring at him intently.",
        "Lu Yiman didn’t bother struggling, nor did he attempt to grab the steering wheel, knowing full well that he didn’t want to die in a car accident before even being thrown into the ocean to feed the fish.",
        "So, he sat quietly in the back seat, turning his head to gaze at the night scenery outside.",
        "The closer they got to the seaside, the wilder the wind blew, scattering his hair across his face. The cool moonlight fell on his slender brows, the corners of his eyes, and his high-bridged nose. ",
        "He was as still as a painting, and the kind of heart-stirring beauty he possessed was highlighted by the moonlight, clearly framed within the narrow rearview mirror.",
        "Yu Chuang’s glance lingered, and gradually, the restlessness inside him began to calm down.",
        "They drove to the desolate edge of the road, and with a sudden brake, Lu Yiman’s body lurched forward. He happened to catch Yu Chuang gently supporting Yu Ziming, slowly settling him down in a more comfortable position.",
        "Yu Chuang rarely displayed emotions like gentleness, but the focused look in his eyes was enough to convey deep affection that most people couldn’t match. ",
        "Once Yu Ziming was taken care of, Yu Chuang turned his cold gaze toward Lu Yiman. Lu Yiman paused, pulling himself together, and offered a polite smile.",
        "Seeing him smile, Yu Chuang’s brows furrowed.",
        "Please visit chrysanthemumgarden (dot) com",
        "The car door opened, and Lu Yiman braced himself, preparing to be thrown into the sea. His tall frame was pulled out by Yu Chuang.",
        "His hands were still tied, and Yu Chuang’s shirt collar was slightly open, revealing part of his neck. Without the tie, his sharp jawline gave him a wild, fierce look. ",
        "“Mr. Yu, isn’t this a bit much?”",
        "Lu Yiman sat on the beach with a bitter smile, watching as Yu Chuang, with the utmost seriousness, began burying his legs in the sand.",
        "It was a bit of a challenge since Lu Yiman’s legs were quite long.",
        "But Yu Chuang remained focused, almost solemn, turning this somewhat absurd act into a matter of great importance through his stern expression. ",
        "Seeing such a grim man doing something only a three-year-old might do, Lu Yiman couldn’t help but watch intently.",
        "When the sand had reached his thighs, Yu Chuang stopped and looked at him. Under the moonlight, his eyes appeared even deeper.",
        "Suddenly, Yu Chuang’s sandy hands gave him a strong push, and Lu Yiman fell back onto the ground, stunned as he watched Yu Chuang leave with a cold smile and brisk strides.",
        "By the shore, the waves crashed, and the outburst of frustration in that push left Lu Yiman momentarily frozen. ",
        "After a long while, lying on the ground, he burst into laughter.",
        ""
    ],
    "previous": "Chapter 1",
    "next": "Chapter 3"
}