{
    "title": "Chapter 34.1",
    "content": [
        "The one who was to marry into the Yu family was Gao Qinchang’s younger sister, his biological sister. She was in her early twenties, still of university age.",
        "Born into a family like theirs, marriage alliances were almost a lifelong destiny, so Gao Qinchang quickly accepted it. However, it was his biological sister, and he did have some genuine feelings for her. ",
        "For reasons unknown, he selectively shared a few of Luo Ding’s words with his sister.",
        "Gao’s sister was already dissatisfied with the marriage arrangement and had a spoiled temperament. Upon hearing these words, she immediately threw a fit.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Under Mr. Gao’s intimidating gaze, she retorted, “If you want to marry him, then go ahead yourself.” She stormed out, and she wasn’t found until the next day.",
        "Yu Chuang put down his phone and didn’t answer any of the calls coming through. ",
        "Whether from the Gao family or the Yu family, he ignored them all, sitting alone by the window, drinking coffee.\n\n",
        "Outside, in the open-air seating, there was a huge ginkgo tree. Its golden leaves covered the ground, creating a painting of the transition from autumn to winter on the empty wooden chairs.",
        "He turned his head to look out the window and couldn’t help but think, “It would be nice if Lu Yiman were here.”",
        "***\n\n ",
        "Yu Chuan looked at Yu Chuang’s face, somewhat lost in thought.",
        "Just by looking at their appearances, they really didn’t resemble each other. No one would think they were twins. But in fact, they were only born one minute apart.",
        "Yet that one minute determined Yu Chuang’s position as the older brother, burdening him with those heavy responsibilities.\n\n",
        "“I really hate the tattoo on his neck,” Yu Chuan murmured. ",
        "Lu Yiman raised his eyes to look at him, adjusting his posture into a listening position.",
        "Yu Chuan glanced at him, then lowered his gaze. When he lifted his head again, the arrogance and pride that belonged to him returned.",
        "“Lu Yiman, how could it be you?” he laughed, though the emotion behind it was unclear.",
        "He had known Lu Yiman even earlier than Yu Chuang. ",
        "After all, back when Yu Chuang was passionately pursuing Yu Ziming, he had of course investigated everyone around Yu Ziming. That’s how Lu Yiman caught his eye.",
        "To be honest, even back then, Yu Chuan wasn’t satisfied with Yu Ziming, because he didn’t like the ambiguous relationship Yu Ziming had with others.",
        "“Wasn’t it you who chose me?” Lu Yiman said emotionlessly, looking at him.",
        "Yu Chuan’s movements paused, and he quickly turned to look into his eyes, then suddenly laughed. ",
        "“So, it was then that you had your sights set on Yu Chuang?”",
        "Lu Yiman lazily glanced at him, brushing back the long hair by his temples.",
        "",
        "“My choices have nothing to do with yours.”",
        "The sharpness in Yu Chuan’s eyes finally receded. ",
        "Back then, Yu Ziming brought Yu Chuang so much struggle and pain, yet Yu Chuan didn’t get rid of Yu Ziming because he understood that Yu Chuang needed a pillar, someone to accompany him.",
        "But Yu Ziming was too weak. He couldn’t support all of Yu Chuang’s emotions, so what he brought to Yu Chuang was nothing but the pain of falling into the abyss.",
        "Ou Timan, however, was different. This man, who appeared different from what he was inside, could stabilihe Tu Jhuang and provide all the emotional value he needed.",
        "It was something Tu Jhuan couldn’t provide to Tu Jhuang. ",
        "That’s why he thought Ou Timan was more suitable for Tu Jhuang. Le chose him.",
        "Otherwise, on that day at Pearl Coast, he wouldn’t have suddenly told Lu Yiman the secret of the flowers hidden in Yu Chuang’s sleeve.",
        "He just hadn’t expected their relationship to spiral out of control. Yu Chuang lost control, and he fell in love with Lu Yiman.",
        "This was something that never happened with Yu Ziming. Yu Chuan had always considered Yu Ziming to be nothing more than a toy accompanying Yu Chuang. ",
        "He even thought Yu Chuang would never understand what love was.",
        "But Yu Chuang fell for Lu Yiman.",
        "Perhaps from the moment he allowed Lu Yiman to cross the line, he should have realized that this man was never under his control.",
        "In fact, no one could control him. ",
        "Looking at the person across from him, Yu Chuan knew all too well that behind Lu Yiman’s gentle and refined appearance lay extreme danger.",
        "In their silent stare-down, it was Yu Chuan who finally gave in.",
        "Perhaps from the moment he came here today, he had no choice. He couldn’t help Yu Chuang, nor could he help himself. The pain and fear buried deep in his heart were tormenting him, too.",
        "“Yu Chuan, tell me everything you want to say,” Lu Yiman’s eyes, which saw through everything, pierced into Yu Chuan’s heart. ",
        "This was the second time they had met in a café. The first time, Lu Yiman’s gaze and the words he said had echoed in Yu Chuan’s mind almost every night, haunting him like a nightmare.",
        "Back then, Lu Yiman had been highly aggressive, his gaze stabbing into Yu Chuan’s heart like needles, exposing all his selfish thoughts.",
        "",
        "But now, Lu Yiman was so gentle, filled with patience, yet still carrying that dangerous allure.",
        "Yu Chuan’s suppressed and self-tormenting heart couldn’t bear it anymore. ",
        "Sometimes, a gentle knife is the deadliest weapon.",
        "He pursed his lips, his gaze beginning to struggle. After a long time, he finally opened his mouth.",
        "“Did you know? That tattoo on his neck isn’t just to cover the scar.”",
        "He clenched the coffee cup in his hand. As he tried to open up to Lu Yiman about the past, he was also trying to peel back his own layers. ",
        "***",
        "The Yu family’s relations were relatively simple since Old Master Yu had only one daughter, Yu Chuan and Yu Chuang’s mother.",
        "Perhaps because she lost her mother at a young age and couldn’t receive love from Old Master Yu, their mother was highly rebellious and extremely stubborn.",
        "That only daughter of the Yu family, the only jewel in their hands, ran off with an ordinary man when she was very young. ",
        "Perhaps it was to rebel against Old Master Yu, or maybe at that age, she still held onto fantasies of love.",
        "After they got married, they quickly had children. Before that, they lived a very happy life, but everything changed after the children came along.",
        "Daily necessities, trivial matters of life, began to wear down her patience, along with poverty.",
        "She had never imagined that one day, when shopping, she would need to pick out the cheapest sale items, keep track of every day’s expenses in a ledger, and after having kids, even buy the cheapest can of baby formula! ",
        "That’s when the arguments began.",
        "The man felt he was working hard, but the world doesn’t treat you any differently just because of your effort. She was born into privilege, and these things were beyond his reach for a lifetime.",
        "But now, because of life’s problems, she blamed him, as if his work and his worth were being denied.",
        "Once the first argument happened, there were countless more. ",
        "“From as early as I can remember, they were always fighting. The house was a mess. Sometimes, there were shards of glass everywhere and the sharp smell of alcohol.”",
        "Once they both lost their passion for life, everything turned cold.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Naturally, they didn’t notice anything unusual about Yu Chuang.",
        "It wasn’t until he was three years old that they suddenly realized Yu Chuang couldn’t speak, couldn’t cry, or even smile. ",
        "He was an unhealthy child.",
        "This realization hit their lives like another heavy blow.",
        "“Mother began relentlessly blaming Father. She thought he was useless, that if it weren’t for him, things wouldn’t have turned out this way, and her life wouldn’t be so miserable.”",
        "Yu Chuan glanced towards Yu Chuang sitting across the café and let out a cold laugh. “From then on, it seemed like they started to hate us, too.” ",
        "When children no longer brought joy but instead became burdens, all the hardships were thrust upon them.",
        "The fights intensified, and everything spiraled into an even darker abyss.",
        "At some point, the arguments turned into constant blame, and when conflicts escalated, they would smash everything in the house until there was nothing left.",
        "Such violent behavior never took into account that there were two young children enduring it all. ",
        "Yet, she still clung to the marriage, refusing to let go.",
        "Perhaps she didn’t want to lose to Old Master Yu. She didn’t want to crawl back in disgrace, didn’t want to admit that her life after leaving the Yu family had become this miserable.",
        "So, any minor issue in life could explode into intense conflicts, leading to inescapable torment.",
        "“Everyone thought Yu Chuang couldn’t speak, but that’s not true. I’ve heard him.” ",
        "Yu Chuan gazed deeply into Lu Yiman’s eyes and spoke in an unusually gentle tone. “He would cover my ears during their fights and tell me, ‘Don’t be afraid.'”",
        "That was the first sentence Yu Chuang ever spoke.",
        "The child who was despised by his parents opened his world to Yu Chuan.",
        "Yu Chuan suddenly became emotional, his eyes reddening. He leaned on the table and said, “We curled up like that for six years, and even when I was completely unaware, he was protecting me!” ",
        "His intense emotions made his chest rise and fall slightly. He calmed down and sat back down again.",
        "“When I was six years old, they finally seemed to grow tired of the relationship. At that point, they didn’t even want to see each other anymore, nor did they want to see us.”",
        "",
        "Yu Chuang wasn’t accepted by regular schools, and they couldn’t afford to send him to a better place.",
        "Amidst endless arguments and mutual blame, they finally wore down all their stubbornness and decided to end the marriage, opting for divorce. ",
        "They took Yu Chuang and Yu Chuan along, planning to split up the children after the divorce, with each parent taking one.",
        "But the ridiculous thing was, even on the way to divorce, they were still arguing about who would take Yu Chuang.",
        "Neither of them wanted to take this burden.",
        "Yu Chuan sat in the backseat, quietly listening, a little confused. When he heard they were planning to separate him from Yu Chuang, he got scared and couldn’t help but feel nervous. ",
        "Yu Chuang, however, remained expressionless, not crying or smiling. When their parents saw his face through the rearview mirror, both felt annoyed.",
        "That’s when the accident happened.",
        "In the midst of their argument, they didn’t see the red light at the intersection.",
        "When the crash occurred, Yu Chuan didn’t even have time to react before Yu Chuang pulled him into his arms. ",
        "Always lost in his own world and slow to respond to everything, Yu Chuang moved with incredible speed to protect Yu Chuan.",
        "“The glass cut his neck, and blood splattered on my face. When I looked up, I saw the terrifying wound and the trembling in his eyes. That’s when I realized he was scared, too.”",
        "Yu Chuan stared blankly at the coffee on the table, tears streaming down his face without him realizing it.",
        "Lu Yiman’s eyes lowered slightly, and the hand resting on his lap tightened. ",
        "“Afterward, we were taken back to the Yu family and had our surnames changed. As for our old surname, I’ve forgotten it.”",
        "He gazed blankly at Lu Yiman. He had forgotten his old surname and what his parents looked like.",
        "The only thing he remembered was Yu Chuang covering his ears and telling him not to be afraid for the first time, as lilies from a shattered vase fell before them.",
        "That was the only thing his mother ever took care of with great care. ",
        "When he returned to the Yu family, he discovered there was a garden filled with lilies.",
        "If you trace it back, Yu Ci and Yu You, the others in the family, were from the branch of Old Master Yu’s younger brother.",
        "Please visit chrysanthemumgarden (dot) com",
        "He raised Yu Chuang and Yu Chuan, perhaps truly for the future of the Yu family.",
        "But once he brought them back and changed their names, Old Master Yu no longer needed them. ",
        "Because what he needed most was his own direct bloodline.",
        "“At first, he didn’t want me; he chose Yu Chuang.”",
        "Yu Chuan wiped the tears from the corners of his eyes and leaned back in his chair, resuming his usual noble demeanor.",
        "“He thought that Yu Chuang, as the elder brother, still calm and composed after all that had happened, was exactly what he needed.” ",
        "Yu Chuan laughed, his tone dripping with sarcasm."
    ],
    "previous": "Chapter 33.2",
    "next": "Chapter 34.2"
}