{
    "title": "Chapter 29.2",
    "content": [
        "The last bit of ash fell, and his eyes, under the moonlight, grew deep and dark.",
        "Reconstructing the past was like reconstructing himself. ",
        "Extinguishing the cigarette, he turned around and, through the glass, saw Yu Chuang quietly sitting on the cushion.",
        "His heart gave a sudden jolt, and the darkness inside him retreated like a tide.\n",
        "",
        "This time, even he didn’t realize the softness that appeared in his eyes.",
        "“What are you doing here?” ",
        "Yu Chuang, sitting obediently on the cushion, lifted his gaze to him. His dark eyes reflected the moonlight from behind.\n\n",
        "“Keeping you company.”",
        "His fingertips trembled slightly. Although the cigarette had been snuffed out, it felt as if he’d been burned.",
        "He opened his mouth, but no sound came out for a moment.\n\n ",
        "He just stared into Yu Chuang’s eyes, those eyes fixed entirely on him, and he kept telling himself.",
        "Be rational, Lu Yiman.",
        "***\n\n",
        "The issue they had argued about at the hotel entrance still hadn’t been resolved. ",
        "Lu Yiman truly had no intention of sharing a bed with Yu Chuang.",
        "Suppressing the emotions bubbling up inside, he turned back, his demeanor poised and gentle—still the Lu Yiman that Yu Chuang knew.",
        "“I’ll sleep on the couch. You should get some rest.”",
        "He picked up a blanket and turned to leave. Yu Chuang watched his every step as he walked out, his emotions hidden in the dim light from the bedside lamp. ",
        "Lu Yiman could feel Yu Chuang’s intense gaze on him, and the journey from the closet to the door felt slow.",
        "One, two, three…",
        "A hand pressed against the door, blocking the light from the living room. The door shut tightly, and the wind stirred the curtains.",
        "Lu Yiman sighed softly and turned to him, “What’s wrong?” ",
        "His tone was natural, his gentle voice tugging at that growing, uncontrollable feeling in Yu Chuang’s heart.",
        "The little book didn’t say whether what he was doing now was right, but his instincts told him that he didn’t want Lu Yiman to leave.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He stared into Lu Yiman’s eyes, enunciating each word, “Sleep with me.”",
        "He was serious when he said they would sleep together. ",
        "Lu Yiman looked at him and replied, “Yu Chuang, we can’t sleep together. I’m not used to sleeping with anyone else.”",
        "Yu Chuang frowned. He didn’t like the term “anyone else”!",
        "An unavoidable frustration began to bubble up inside him.",
        "But Lu Yiman had been unhappy, sitting alone on the balcony earlier—he had worries. ",
        "Yu Chuang fought to suppress his agitated emotions, his hand on the door clenched tightly, veins bulging across the back of his hand.",
        "“Sleep with me.”",
        "Le stood in the shadow, glaring at Ou Timan, his tone heavy with menace, looking every bit like the strong, intimidating person he could be.",
        "Ou Timan leaned back against the door, a bit taller than Tu Jhuang and standing straight, he could look down and see Tu Jhuang’s face clearly. ",
        "Hmm, right now Yu Chuang looked quite fierce.",
        "He gazed into Yu Chuang’s dark eyes that seemed to blend into the night and calmly said, “No.”",
        "Yu Chuang’s hand clenched tightly, his eyes fixed on Lu Yiman as a surge of frustration built up in his chest.",
        "He didn’t like being rejected, and he liked it even less when the rejection was repeated. ",
        "He also hated the feeling of wanting something and not being able to get it—the more unattainable, the more he desired it.",
        "“Sleep with me!”",
        "This time, his voice was louder, and he grabbed Lu Yiman by the wrist, pulling him toward the bed.",
        "Lu Yiman didn’t resist as he was pulled onto the bed. He watched silently, saying nothing. ",
        "Yu Chuang’s emotions were a mess, stirred by his own irrational side.",
        "“Sleep with me.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He repeated the phrase again, turning to spread the blanket over Lu Yiman, staring at him with intense seriousness. “Sleep with me.”",
        "After what felt like an eternity, his voice cracked as he struggled to say, “Is that okay?” ",
        "Yu Chuang half-squatted beside the bed, looking at him, as though he was trying to hide away a precious treasure by tucking him beneath the covers.",
        "No matter how noble and aloof Yu Chuang appeared on the surface, his deeply rooted insecurities were always there.",
        "When cared for patiently, he was like a delicate rose, but the moment he faced resistance, he bristled with thorns.",
        "In Lu Yiman’s mind, a voice screamed at him, coaxing him softly. ",
        "Just agree with him. Just agree.",
        "Don’t reject him. Don’t hurt him. Don’t make him sad or angry.",
        "But another part of him, the darkness stirring in his chest, whispered to him as well, tempting him.",
        "Yu Chuang wouldn’t hurt you. How could someone who sneaks away to get angry in secret ever hurt anyone? ",
        "He’s nothing but a paper tiger, looking fierce but harmless. You could do whatever you want.",
        "“If I say no, what will you do?” Lu Yiman asked.",
        "Yu Chuang clenched his teeth, clearly frustrated.",
        "He didn’t understand why Lu Yiman was being like this. He was angry, upset, and… hurt. ",
        "“Don’t!”",
        "He grabbed onto the blanket, but even then, he didn’t raise his voice.",
        "If one looked closely enough, they would see the deep, hidden hurt and frustration in his cold eyes.",
        "Lu Yiman slipped out from beneath the covers effortlessly. ",
        "Yu Chuang reached out to grab him, but Lu Yiman pulled his hand away. Yu Chuang’s eyes widened, but he made no move to escalate things with violence.",
        "He only watched in silence, staring at him with those dark, pitiful eyes.",
        "",
        "He looked so pitiful.",
        "Yu Chuang began to tremble, glaring at Lu Yiman, the veins in his forehead bulging. His hand stiffened, fingers spreading wide as if trying to grab hold of something, but in the end, he only managed to clutch onto himself—returning to that familiar posture, arms crossed in front of his chest. ",
        "Lu Yiman had seen that pose a few times now, and it was clear to him. This was a sign of self-restraint.",
        "The gesture, locking his own wrists, was like putting on a pair of invisible handcuffs.",
        "He had already been tamed.",
        "Yu Chuang was incapable of harming anyone. ",
        "His aggression only intimidated those who were faint of heart. In truth, he was a pitiful, blustery coward.",
        "Lu Yiman gazed at him quietly for a long time, seeing the sadness flicker behind Yu Chuang’s dark, stormy eyes. There was even a trace of hurt mixed in with his frustration.",
        "Suddenly, Lu Yiman chuckled, a soft sigh escaping his lips.",
        "His gentle smile was the most vivid image Yu Chuang had of him in his memory. ",
        "Yu Chuang froze for a moment, then stared blankly at his face, lost in thought.",
        "“Yu Chuang.” Lu Yiman said his name with a complex tone.",
        "He wasn’t a coward, nor was he a harmless lamb. He was a fox that could swallow wolves.",
        "He loved to play hard to get and would always push things further. ",
        "Yu Chuang loosened his grip, staring at him nervously, saying, “Sleep with me.”",
        "Lu Yiman rubbed his forehead and patiently explained, “Yu Chuang, you don’t understand. You don’t understand what I’m thinking right now.”",
        "Yu Chuang furrowed his brow and asked, “What are you thinking?”",
        "Lu Yiman looked at him, smiled slightly, but said nothing. ",
        "Yu Chuang didn’t understand, but the frustration of not getting what he wanted was overwhelming him.",
        "He just wanted Lu Yiman, that’s all. He just wanted him!",
        "Please visit chrysanthemumgarden (dot) com",
        "“Why!”",
        "He wanted to grab Lu Yiman again, but forcibly stopped himself. ",
        "Was there something he hadn’t done well enough?",
        "The emotional turmoil tormented him, and he looked at Lu Yiman, with a pleading look in his eyes that he didn’t even realize.",
        "“Don’t go.” He pressed his lips tightly together.",
        "Lu Yiman saw the desire in Yu Chuang’s eyes, and the emotions he had been suppressing began to rise uncontrollably. ",
        "His throat moved as he swallowed, and he took a step forward. His captivating eyes were now filled with an intense darkness.",
        "Yu Chuang stared back into his eyes, not backing down, still filled with eagerness for him.",
        "Suddenly, his hair was grabbed, forcing him to tilt his head back.",
        "“Yu Chuang, sometimes you’re really too naive.” ",
        "With that, Lu Yiman’s lips pressed down on his.",
        "Yu Chuang opened his mouth, and what followed was a relentless, consuming kiss.",
        "He had never experienced such a rapid heartbeat and a fiery kiss, almost as if he was offering his entire heart.",
        "Lu Yiman’s fingers tangled in his hair, and the sense of control and the intensity of the kiss nearly made Yu Chuang lose his consciousness. ",
        "“Mm…”",
        "The brief moments when they paused for breath lasted only a second, and Yu Chuang barely had time to let out a soft moan before being consumed by Lu Yiman’s kiss again.",
        "He started to retreat, sitting on the edge of the nightstand, one hand gripping the edge tightly, while the other, unsure of what to do, clutched at Lu Yiman’s clothes.",
        "His fingers brushed against the braid on Lu Yiman’s chest, and instinctively, he spread his fingers and grabbed onto it, pulling Lu Yiman closer to him. ",
        "He didn’t know or understand what he was doing; he was acting purely on instinct.",
        "His long legs pressed against Lu Yiman’s slim frame, realizing just how strong his narrow waist was.",
        "",
        "Yu Chuang’s legs began to tremble, his face flushed as though he were drunk, completely lost and immersed in Lu Yiman’s kiss.",
        "His grip on the nightstand tightened, his knuckles turning white, while his fingertips turned pink. His nails scraped against the wood, the faint creaking sound like a burning flame. ",
        "The kiss was so deep that it made one’s mind spin.",
        "The faint sounds of exchanged breaths lingered between their lips, and Yu Chuang was completely unable to refuse, sinking deeper into it.",
        "It wasn’t until Lu Yiman felt a tight grip around his waist that he suddenly snapped out of it. He opened his eyes and realized his hand had already slipped beneath Yu Chuang’s shirt, feeling the taut muscles underneath.",
        "The kiss immediately broke apart, though their hot breaths were still mingling. Yu Chuang sat on the nightstand, his legs hooked around Lu Yiman’s waist, his head resting against the wall. ",
        "Lu Yiman was breathing lightly. His pale skin, once touched with the slightest hint of red, became very noticeable. His almond-shaped eyes had a faint pink hue, and at some point, one of the buttons near his collar had come undone, revealing part of his collarbone.",
        "He looked at Yu Chuang’s dazed eyes, and the water on his lips still unknowingly captured his gaze.",
        "Yu Chuang’s breathing was hot, and the skin under his palm was even hotter.",
        "Lu Yiman lowered his head to steady his breath and quickly withdrew his hand. ",
        "But Yu Chuang’s legs were still wrapped around him, preventing him from stepping back immediately.",
        "Once Yu Chuang had calmed down, his entire face flushed red. When he opened his eyes and saw Lu Yiman, he blinked quickly in embarrassment.",
        "Seeing that he had come to his senses, Lu Yiman withdrew the hand supporting the back of his head, looked away, and after a long moment of silence, said hoarsely, “I’m going to take a shower.”",
        "Only then did Yu Chuang, belatedly, release his legs, but just as Lu Yiman was about to leave, he instinctively tightened them again. ",
        "Lu Yiman turned back and patiently asked, “What’s wrong?”",
        "Yu Chuang didn’t want him to leave, but the frantic beating of his heart made it hard to bear.",
        "In the end, he trembled slightly and released his legs.",
        "Lu Yiman looked away, turned around, and strode into the bathroom. ",
        "When the sound of the door closing echoed, Yu Chuang’s lashes trembled. After a long moment, he suddenly raised his hand to cover his face, hiding in the crook of his arm, leaving only his reddened ears trembling slightly.",
        "Meanwhile, under the cold water, Lu Yiman closed his eyes, his hand pressed firmly against the wall.",
        "Please visit chrysanthemumgarden (dot) com",
        "He knew that, at this moment, he was far from calm. The overwhelming desire rising within him threatened to consume Yu Chuang entirely.",
        "He had lost control. "
    ],
    "previous": "Chapter 29.1",
    "next": "Chapter 30.1"
}