{
    "title": "Chapter 30.2",
    "content": [
        "“It’s such a pity. I had originally planned to auction off that piece, the ‘Black Swan.’”",
        "Hearing the title once again, Lu Yiman couldn’t help but feel a bit exasperated. ",
        "It wasn’t just the editor-in-chief. For people of wealth and leisure like them, there was always a passion for collecting what they deemed to be valuable “artifacts.”",
        "The stunning piece Lu Yiman had created that day had clearly left an impression on them.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Many people expressed their regret at not being able to win the auction for the piece and began to speculate about the identity of the actual buyer, wondering who could have made even Reed step aside.",
        "While discussing, they inevitably turned their gazes toward him, asking if he knew who the mysterious buyer was. ",
        "He smiled and said, “It seems the other party doesn’t want me to know either.”\n\n",
        "They were puzzled and asked why, since the piece had already been purchased, the buyer wouldn’t want to meet the designer in person.",
        "Lu Yiman blinked and said with a meaningful smile, “Maybe they’re shy.”",
        "***\n\n ",
        "As the standout new designer at the event, it was hard for him to avoid the attention of most people, so he couldn’t enjoy peace and quiet for long.",
        "By the time the banquet was nearing its end, he had no idea how much alcohol he had consumed. Heat surged through him, bringing with it a wave of fatigue, and a hint of daze showed in his eyes.",
        "Avoiding the crowd, he glanced at the time—it was already 11:30.\n\n",
        "He then looked out the window, where the sky was pitch-black with no moonlight visible. Large raindrops pelted the glass, starkly contrasting the cold darkness outside with the bright warmth inside. ",
        "A car was quietly parked at the entrance, reflecting dim, cool tones under the streetlights. The vehicle was entirely drenched in rain, suggesting it had been there for quite some time.",
        "He watched quietly as the minute hand ticked slowly but rhythmically forward. Though he couldn’t see who was in the car, he could see the rain growing heavier.",
        "It wasn’t until the time reached 11:55 that he finally moved.",
        "At this point, the banquet was almost over. The previously glamorous men and women had shed their polite façades, and bodies tangled freely in the intoxicated revelry. ",
        "He didn’t see Reed, who had probably left with someone earlier. Glancing at the disordered scene, he figured there was no need to say goodbye.",
        "He stepped outside and approached the elevator. The time had already shifted to 11:57.",
        "From here, it would only take about a minute to get to the first floor.",
        "He watched the empty elevator doors open before him but didn’t step in. ",
        "The time jumped to 11:58.",
        "The elevator he had missed began its slow ascent again. With a “ding,” the doors opened once more, and this time, he stepped inside.",
        "",
        "In the enclosed space, the alcohol in his system seemed to intensify. His face remained expressionless, his eyes half-covered by his hair, looking both lazy and distant, with a trace of indifference.",
        "The second hand continued its relentless ticking, the faint sound almost matching someone’s heartbeat. ",
        "The elevator doors opened at 11:59.",
        "Tu Jhuang, with water droplets on his shoulders, stood at the entrance, his umbrella still dripping.",
        "Le looked up at him and said, “It’s midnight.”",
        "Aust moments ago, Ou Timan’s mind had been as calm as still water, but now it was stirred into motion, as if awakened by a fish’s sudden ripple. ",
        "He tilted his head, looking at the watch on his hand, and said, “There’s still a minute left. Is my watch broken?”",
        "Yu Chuang pressed his lips together, silently looking at him, meeting his gaze without saying a word.",
        "After the elevator behind them had gone up and down again, Yu Chuang said once more, “It’s midnight.”",
        "Alright, now it really was midnight. ",
        "Lu Yiman smiled.",
        "Yu Chuang glanced at him, a bit puzzled. Seeing him standing still, Yu Chuang reached out to pull him.",
        "The rain outside was still falling. Yu Chuang held his hand and led him to the door, opening the umbrella.",
        "Raindrops splashed on Lu Yiman’s face, and after opening the umbrella, Yu Chuang reached out again to pull him. Noticing the water droplets on his face, Yu Chuang’s expression grew serious, and he raised his sleeve to wipe his face. ",
        "Lu Yiman stared at him, asking softly, “Did you come by yourself?”",
        "“Yes,” Yu Chuang replied, then pushed Lu Yiman’s hair, which had fallen over his forehead, behind his ear. In the process, he noticed the rose earring Lu Yiman was wearing again, which had been hidden under his hair earlier.",
        "For a moment, Yu Chuang couldn’t look away from the earring.",
        "“Why didn’t you bring your assistant with you?” ",
        "Yu Chuang moved the umbrella to cover Lu Yiman’s head more fully and answered seriously, “I came to pick you up.”",
        "That’s why he didn’t bring an assistant, or call a secretary.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He wanted to pick up Lu Yiman himself.",
        "The rain outside was heavy, so Yu Chuang adjusted the umbrella closer to Lu Yiman and led him out into the rain. ",
        "Lu Yiman’s dazed eyes narrowed slightly. Suddenly, he raised his arm to wrap around Yu Chuang’s waist, and with his other hand, took the umbrella from him.",
        "Yu Chuang stumbled into his chest, his heart fluttering, and a tingling sensation shot down his spine.",
        "He swallowed, listening to the low, husky voice by his ear.",
        "“Be careful not to catch a cold.” ",
        "The scent of alcohol on Lu Yiman made Yu Chuang feel as though he too was drunk.",
        "Walking into the rain, Lu Yiman’s hand tightened around Yu Chuang’s waist, and under the umbrella, they stood intimately close together.",
        "Yu Chuang’s heartbeat was completely out of rhythm, and the anxiety and gloom he’d felt while waiting alone in the rainy night suddenly vanished, replaced by an entirely different, more hopeful feeling.",
        "When the car door opened, Lu Yiman first helped Yu Chuang into the driver’s seat, but instead of walking around to the other side, he closed the umbrella and climbed onto Yu Chuang’s lap. ",
        "Yu Chuang froze, hardly daring to move as he stared at him.",
        "“Move your legs,” Lu Yiman said lazily, barely lifting his eyelids. He didn’t feel like walking through the rain, so he simply climbed over Yu Chuang to get to the passenger seat.",
        "Their legs were tightly pressed together, their breaths mingling with each other’s.",
        "Lu Yiman’s body was still damp from the rain, and even his braid was wet. As he lowered his head, his breath shamelessly brushed against Yu Chuang’s face, and the end of his braid swept across Yu Chuang’s neck and collar. ",
        "Yu Chuang gripped the seat tightly, his long fingers turning completely red.",
        "He swallowed hard, staring at Lu Yiman without blinking. The car’s interior lights were off, but the dim streetlights from outside faintly illuminated the scene. In this moment, Lu Yiman, straddling him, exuded an indescribable allure.",
        "It lasted less than two minutes before Lu Yiman swung his long legs over and sat in the passenger seat.",
        "Yu Chuang remained in the driver’s seat, still in a daze. ",
        "An indescribable impulse surged within him, though he didn’t know how to handle it.",
        "Suddenly, Lu Yiman’s presence enveloped him again, and instinctively, Yu Chuang turned his head, his lips brushing against Lu Yiman’s chin.",
        "",
        "“Why aren’t you wearing your seatbelt? What are you thinking about?”",
        "Lu Yiman was different from usual, even his tone had become much more languid. ",
        "Yu Chuang couldn’t find the words to speak, only feeling his mouth dry and his tongue tied. In the confined space of the car, his vision seemed to blur.",
        "“Why aren’t you saying anything?”",
        "Lu Yiman pinched his chin, lowering his head to ask.",
        "Yu Chuang’s entire face flushed red, but he still couldn’t speak. ",
        "Yet sometimes, silent waiting can be even more torturous.",
        "Yu Chuang had never felt such a strong urge to say something—anything—just to stop Lu Yiman from looking at him with those sparkling, intoxicating eyes.",
        "“Hmm?” Lu Yiman lowered his head again, his lips almost touching Yu Chuang’s cheek.",
        "“Lu Yiman.” ",
        "All he could do was call his name.",
        "“What is it?” Lu Yiman’s voice was gentle, yet with a hint of deliberate seduction, unlike his usual self.",
        "Maintaining this posture was too much, so Lu Yiman rested one hand on Yu Chuang’s thigh.",
        "Yu Chuang’s entire body trembled, his legs clamping together almost immediately. His neck turned as red as his face. ",
        "But Lu Yiman continued to look at him.",
        "With those alcohol-tinged, focused, and hazy eyes.",
        "“Don’t look.”",
        "Yu Chuang raised his hand to cover his face, hiding behind the crook of his arm. ",
        "Lu Yiman’s gaze lightly grazed over him, leaving something imprinted in his mind but at the same time leaving nothing at all.",
        "The corners of his mouth curled up, his upward-tilted peach blossom eyes carrying a lazy hint of desire.",
        "",
        "“You won’t let me look?”",
        "Yu Chuang shook his head, his Adam’s apple bobbing as he swallowed repeatedly. Still, he honestly replied, “No.” ",
        "“Then why are you hiding?”",
        "Today, Lu Yiman wasn’t the considerate person he usually was. Instead, he revealed the sly, relentless side of himself, like a fox closing in on its prey.",
        "Poor Yu Chuang, strapped into the seatbelt, had nowhere to go.",
        "Lu Yiman’s gaze swept over his tailored suit, the neatly tied tie, and the gold tie clip. ",
        "Lu Yiman himself didn’t like dressing so formally; he disliked tie clips and garter straps for socks. They always made him feel like he was being bound.",
        "Meanwhile, Yu Chuang, trembling behind his arm, couldn’t even keep his waist from shaking. All Lu Yiman had done was place his hand on his thigh.",
        "“Yu Chuang.” Lu Yiman called his name softly, his vision starting to blur.",
        "Yu Chuang, body tense, didn’t dare relax for fear of embarrassing himself in the car. ",
        "“Hmm…”",
        "But when Lu Yiman called him, he still responded obediently, even though his voice trembled.",
        "He really was a sensitive person.",
        "If that day ever came… ",
        "Lu Yiman’s body unknowingly grew heavier, and his breaths grew hotter.",
        "Suddenly, he lowered his head, resting his forehead against Yu Chuang’s shoulder, and slowly spoke.",
        "“Yu Chuang, you’re burning up.”",
        "Yu Chuang paused, looking down at him. ",
        "It wasn’t Yu Chuang who was hot—it was Lu Yiman’s body that was burning.",
        "Please visit chrysanthemumgarden (dot) com"
    ],
    "previous": "Chapter 30.1",
    "next": "Chapter 31.1"
}