{
    "title": "Chapter 8",
    "content": [
        "When Lu Yiman woke up, he instinctively touched the back of his neck, only to find there wasn’t the pain he expected.",
        "He raised an eyebrow and sat up from the bed. ",
        "This was a very minimalist guest room, and it was clear that no one usually lived here.",
        "The door wasn’t locked, so he easily walked out, but upon hearing footsteps, he retreated back in, leaving the door slightly ajar to observe through the crack.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "“Where’s the young master?”",
        "“He’s been in the room for quite a while.” ",
        "Yu Chuan’s footsteps were a bit hurried, and the butler clearly wanted to say something, but hesitated due to Yu Chuan’s displeased expression.\n\n",
        "In just a moment, Yu Chuan had already climbed the stairs to the second floor and walked past Lu Yiman’s door.",
        "Without slowing his pace, his anxious voice followed.",
        "“Brother, the hospital said you went home on your own!”\n\n ",
        "“Mm.”",
        "Compared to Yu Chuan’s emotional urgency, Yu Chuang seemed indifferent.",
        "But Yu Chuan wasn’t disappointed. Instead, he let out a sigh of relief, clearly very familiar with Yu Chuang’s personality. Then, with a hint of grievance and a touch of anger in his voice, he added, “Brother, that old man actually gave the suburban project to Yu Ci!”\n\n",
        "His raised tone was like a child tattling to his older brother. ",
        "Lu Yiman couldn’t help but recall the other party’s lofty and noble demeanor in the hospital that day.",
        "“Yu Ci?”",
        "Yu Chuang’s voice was still as low and hoarse as ever, carrying a cold, dangerous edge.",
        "“Yes, you know what a fool Yu Ci is. Even if you give him billions to mess around with, it’s just like handing money over to others. In the end, I’ll still have to clean up his mess!” ",
        "This arrogant attitude was nothing like the ruthless and self-reliant Yu Chuan described in the books.",
        "“Hah!”",
        "Upon hearing this sneer, Lu Yiman inexplicably felt like laughing.",
        "This was probably Yu Chuang’s most common way of expressing displeasure toward someone. ",
        "“Brother, you have to back me up. In a few days, there’s going to be a banquet on a cruise at Pearl Coast, and that fool Yu Ci will be there too. You have to stay by my side.”",
        "Even his tone turned coquettish as he spoke.",
        "Please visit chrysanthemumgarden (dot) com",
        "“Mm.”",
        "A very brief word, perfectly in line with Yu Chuang’s personal style. ",
        "But Yu Chuan was still very happy.",
        "“Brother…”",
        "The door creaked open, and Lu Yiman, tall and imposing, stood at the entrance. Facing Yu Chuan’s suddenly cold expression, he calmly greeted him.",
        "“Good afternoon, Mr. Yu.” ",
        "He didn’t think there was anything wrong with a younger brother acting spoiled toward his brother who had always been there for him. He was just worried that if he listened any longer, he might not realize when he’d be assassinated in the night.",
        "Tu Jhuan wouldn’t pust leave him stranded on a beach like Tu Jhuang, but would truly sink him to feed the fish.",
        "“Zr. Ou.”",
        "Tu Jhuan, who had been about to seek comfort in his brother’s arms, immediately stood up straight, adpusting his shirt and tie meticulously. Lis ezpression changed to a false yet cold smile. ",
        "He cast a glance at the butler standing nearby, who felt a chill down his spine and dared not speak.",
        "No need to guess—Yu Ziming was likely also dragged back here.",
        "“Apologies for the awkward scene, Mr. Lu. I didn’t expect you to be a guest here.”",
        "Yu Chuan’s smile curled at the corners of his mouth, but his eyes remained completely devoid of warmth. ",
        "Lu Yiman, however, smiled sincerely, maintaining his cultured and proper demeanor at all times.",
        "“Mr. Yu, you’re too polite. It’s an honor to be invited to your home.”",
        "As he spoke, he glanced at Yu Chuang.",
        "Yu Chuan took a step to block Yu Chuang, turning to the side and saying, “It’s only right. I should be the one thanking you for taking my brother to the hospital last time. It’s only proper for me to express my gratitude in person, right, brother?” ",
        "He looked up at Yu Chuang.",
        "“Mm.” Yu Chuang nodded in acknowledgment.",
        "Please visit chrysanthemumgarden (dot) com",
        "However, at this moment, his expression seemed somewhat distant, with a white bandage wrapped around his forehead, looking quite different from his usual sharp and cold demeanor.",
        "He only lowered his head and listened attentively and seriously when Yu Chuan spoke. ",
        "But when Lu Yiman stepped out of the room, Yu Chuang merely glanced at him briefly, without much focus.",
        "This kind of gaze made Lu Yiman’s eyes darken slightly, and his smile deepened.",
        "Originally, he intended to say a polite farewell, but now he reached for the cigarette tucked behind his ear, brought it to his nose for a sniff, and said with a faint smile, “No need to be so courteous, I was merely benefiting from someone else’s favor.”",
        "His pale fingers twirled the slender cigarette before he leisurely slipped it into his pocket. ",
        "Yu Chuan’s gaze shifted, filled with a cold and threatening air.",
        "However, Lu Yiman remained all smiles, and the small braid by his shoulder added a touch of sensuality to his handsome face under the soft glow.",
        "The autumn evening darkened quickly after the rain, and the corridor lights had already come on.",
        "Yu Chuan smiled, and in that radiant moment, his beauty was even more breathtaking. ",
        "He turned his head and softly asked Yu Chuang, “Brother, have you eaten? You didn’t take your medicine properly today, did you?”",
        "Yu Chuang’s brows furrowed, and his face showed evident irritation.",
        "“No.”",
        "He grabbed at his hair, his loose sleeves and pants failing to hide his broad shoulders and narrow waist, with his chest partially exposed. ",
        "At this point, there were signs that his emotions were becoming somewhat unstable again.",
        "“Alright, alright, let’s skip the medicine for now and eat first, okay?”",
        "Yu Chuan quickly began to comfort him.",
        "After speaking, he turned his head and said, “Mr. Lu, why not stay and join us for a simple meal?” ",
        "Even if Lu Yiman wanted to leave now, Yu Chuan wouldn’t let him go easily.",
        "“Sure.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Lu Yiman responded with a smile.",
        "“Let’s eat.” Yu Chuang suddenly said, striding forward barefoot, heading straight for a locked room. He pulled a key from his chest, and as he opened the door, he said, “Ziming, it’s time to eat.” ",
        "Yu Chuan’s smile didn’t falter as he said, “My brother has always had this habit since he was young. He likes to bring things he’s fond of home and hide them.”",
        "As he said this, his gaze fixed on Lu Yiman like a venomous snake.",
        "“A very unique hobby.”",
        "Lu Yiman smiled pleasantly, and even when he saw the pale and weak Yu Ziming inside the room, his expression remained unchanged. ",
        "This made Yu Chuan stare at him even more deeply, and in a low voice, he muttered, “Mr. Lu is quite interesting.”",
        "But the words were so soft that no one heard them.",
        "Yu Chuang’s dark eyes gleamed as he looked at Yu Ziming, and he hung the key around his neck, tucking it back into his chest.",
        "He reached out to take Yu Ziming’s hand, but Yu Ziming recoiled violently. ",
        "Especially after seeing Lu Yiman, his expression collapsed even further, and he almost instinctively wanted to throw himself into Lu Yiman’s arms.",
        "But after seeing Yu Chuan’s warning gaze, he stopped himself abruptly, his face pale, trembling as he extended his hand.",
        "However, the suppression and fear in his heart tormented him endlessly.",
        "He couldn’t bear any physical contact with Yu Chuang, so he shrank back, hiding his pale fingers inside his sleeves. Yu Chuang merely grabbed his sleeve, yet even this made a trace of satisfaction appear on his cold face. ",
        "With this strange atmosphere hanging over them, they all moved to the dining table in the living room.",
        "Once the dishes were served, the butler and maid retreated, leaving just the few of them under the bright chandelier in the spacious first-floor living room.",
        "“Ziming, eat.”",
        "Yu Chuang pushed a bowl of soup towards him. ",
        "Yu Ziming, his face ashen and on the verge of tears, looked desperately at Lu Yiman across the table, hoping for some comfort.",
        "But Yu Chuang remained focused solely on Yu Ziming.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Lu Yiman squinted slightly, wearing only a perfectly tailored and stylish black shirt, the buttons a lustrous white.",
        "He was tall and slim, with a particular fondness for wearing various well-designed shirts. His unique artistic aura was especially strong, and because of his refined appearance, even when he was quietly sitting there, he was a striking scene. ",
        "Catching Yu Ziming’s gaze, he softly looked back and said in a gentle voice, “Ziming, you probably didn’t have a proper meal at lunch. Drinking some soup tonight will be good for your health.”",
        "The same action, but with different words and a different tone, instantly brought great comfort to Yu Ziming’s heart.",
        "He nodded, his tense expression easing, and he obediently lowered his head to take a sip of the soup.",
        "Yu Chuang was satisfied. His expression turned somewhat vacant as he began eating, seemingly unaware of Lu Yiman’s words from start to finish. ",
        "But Lu Yiman understood that this was simply because Yu Chuang didn’t care about him—he only had eyes for the person he cared about.",
        "The meal was eaten in unusual silence. After both hosts had finished, Lu Yiman politely put down his chopsticks as well.",
        "Yu Ziming, however, ate very little, only finishing the bowl of soup that Lu Yiman had comforted him into drinking earlier.",
        "After the meal, Yu Ziming became even more restless, almost as if he had written his desire to leave on his face. ",
        "If he had still harbored some guilt for injuring Yu Chuang earlier, and had been soft-hearted enough to hesitate, today, after being locked in this oppressive place again—and even involving Lu Yiman—he now only wanted to escape as quickly as possible.",
        "The butler, who had been silently standing by, brought medicine and water to Yu Chuang.",
        "Yu Ziming’s face turned pale, as though recalling something terrifying, and he uncontrollably stood up, knocking his chair over with a loud crash, a sound that pierced through the silent atmosphere.",
        "Yu Chuang’s once calm face immediately changed. ",
        "He jerked his head up, and under the shifting light, his sharply defined face was cold to the bone, like the coming of a storm.",
        "“Ziming, sit down!”",
        "Yu Ziming couldn’t bear the pressure Yu Chuang exerted, or perhaps the repressed fear had reached its peak. He broke down and shouted, “Yu Chuang, please let me go! Let me leave!”",
        "The word “leave” triggered something in Yu Chuang. The veins on his forehead throbbed, and the concussion from his illness made him dizzy and groggy. His hand flung out, accidentally knocking over a glass on the table. ",
        "It was like a signal. The shards of broken glass caused Yu Ziming to scream, and Yu Chuang, clutching his head, was in visible pain, repeatedly hitting his head with his hands.",
        "“Shut up, shut up!”",
        "",
        "His voice grew louder, and his hands pounded on the table unconsciously. His uncontrollable emotions made his cold face and tall body even more terrifying.",
        "“Brother!” Yu Chuan stood up, his expression changing drastically. ",
        "But Yu Ziming’s panicked retreat further provoked Yu Chuang.",
        "He reached out to grab him, but his movement made the highly sensitive Yu Ziming mistake it for an act of violence. The fear on his face deepened.",
        "With a loud smack, Yu Ziming struck the back of Yu Chuang’s hand.",
        "Yu Chuang froze, standing stiffly in place. His dark eyes silently gazed at Yu Ziming, looking at the fear and rejection on his face. His mouth twitched slightly, and he trembled as he lowered his head, crossing his hands and gripping his wrists so tightly that the veins on the back of his hands bulged. ",
        "That gesture again.",
        "Lu Yiman watched him intently.",
        "Meanwhile, the panicked Yu Ziming had already been roughly grabbed by the hair and thrown aside by Yu Chuan.",
        "“Shut your mouth!” Yu Chuan’s expression was chilling. ",
        "Lu Yiman sighed. Here, the true embodiment of violence and cruelty was never Yu Chuang.",
        "None of the servants dared to approach. Lu Yiman walked across the floor littered with broken glass, his long fingers pinching Yu Chuang’s chin, forcing him to look at him.",
        "“Mr. Yu, do you remember me?”",
        "His gentle voice was paired with a pleasant smile. ",
        "Yu Chuang slowly turned his dark eyes, gradually focusing on Lu Yiman’s face.",
        "“Lu Yiman.”",
        "“Yes.” Lu Yiman responded with a bright, arched smile.",
        "Author’s Note:\nTo emphasize once again, do not confuse the novel with reality. Lu Yiman is not someone to be easily bullied, and Yu Chuang is not a frightening person. This story is tagged as a sweet romance, so there won’t be any melodramatic or tragic events. Yu Chuan may be a brother-obsessed character, but he won’t be the one to break up any couples. It’s just that in a crowd of wolves and foxes, Yu Ziming, being a sheep, doesn’t quite fit in, so it’s normal that Yu Chuan doesn’t hold him in high regard. ",
        "",
        ""
    ],
    "previous": "Chapter 7",
    "next": "Chapter 9"
}