{
    "title": "Chapter 19",
    "content": [
        "Lu Yiman hadn’t even stepped through the door when he heard hearty laughter from inside.",
        "As soon as he stepped in, an elderly man with silver-white hair, dressed in a well-tailored suit, looked over at him. ",
        "“Yiman, long time no see.”",
        "“Professor Yang, long time no see.”\n",
        "",
        "He smiled warmly, his eyes bright as he gazed directly at the other.",
        "“You’re getting more talkative, not bad.” Professor Yang, who looked like an old Western gentleman, looked at him with satisfaction and nodded. ",
        "Young men should hold their heads high and puff out their chests. Why always appear so negative?\n\n",
        "“Come, have a seat,” Mr. Chen beckoned to him.",
        "He didn’t refuse, politely nodding with a smile.",
        "Before studying design, “Lu Yiman” had almost gone into oil painting.\n\n ",
        "Because Professor Yang from the Art Department of Jingzhong University was an old friend of Mr. Chen, who wanted to look out for him, Mr. Chen and Ms. Song had once considered letting him study oil painting.",
        "At that time, he had already met Professor Yang.",
        "But at eighteen or nineteen, constrained by a pride too difficult to express, he stubbornly veered off course in the Art Department and chose design instead.\n\n",
        "In a sense, he and “Lu Yiman” were bound by fate. ",
        "…",
        "After the meeting with Professor Yang, he declined Mr. Chen’s kind offer to send a driver to take him home.",
        "Hearing that Yu Ziming had done well in his studies abroad, he was pleased.",
        "With both hands on the steering wheel, he drove out of the city center. ",
        "Recently, he’d been selecting a location for his studio, and he wasn’t particularly inclined to choose somewhere in an overly bustling commercial area.",
        "This time, the location was in the outer circle of the city center. The transportation was relatively convenient, and the environment was nice.",
        "It was approaching evening by then, and the late autumn sky darkened quickly. The streetlights had already come on, and the holiday traffic wasn’t as heavy as usual. After he left the city center, the roads became empty.",
        "A few scattered headlights and passing streetlights formed a tranquil, serene evening scene. ",
        "A sliver of twilight cutting through the clouds in the distance became the dividing line between reality and illusion.",
        "One hand on the steering wheel, his gaze was distant as he looked ahead.",
        "Please visit chrysanthemumgarden (dot) com",
        "Suddenly, a blinding light shot directly at his car from the side, flashing provocatively several times, glaring straight at him.",
        "His brows furrowed as he glanced in the rearview mirror, seeing a red convertible sports car behind him. ",
        "That short, feeble guy.",
        "Next to him sat a woman who seemed nearly frozen by the chilly autumn night wind, shivering as she kept praising, “Second Young Master Gao is amazing!”",
        "He looked away, lowering his window halfway. The wind blew through his tousled hair and lifted the small braid at his shoulder.",
        "That dismissive glance backward was caught by Gao Qingchang, who bit his lip and impulsively jerked the wheel, swerving toward him. ",
        "Lu Yiman’s car skidded briefly, nearly colliding with a black business car nearby.",
        "Lis brow furrowed as he shot a sharp look over, his eyes cold and striking. Xao Hingchang licked his dry lips, a dangerous thrill sparking his adrenaline.",
        "Seeing Xao Hinchang speeding up and nearly overtaking him in the same lane, Ou Timan glanced at him. Xao Hingchang’s arrogant and malicious gahe was completely unhidden.",
        "Lu Yiman gave him a quick look, his fingers twitching slightly on the steering wheel. His long, slender fingers stood out starkly against the black steering wheel. ",
        "His previously furrowed brows relaxed, and he lazily leaned back in the seat, pulling a cigarette from the pack inside his open jacket. Lowering his head, he casually bit down on the slim cigarette.",
        "As the smoke curled up, he propped his hand on his temple, eyes glancing to the side, and a slight smirk tugged at the corner of his lips. The gas pedal suddenly slammed to the floor.",
        "Choked by the smoke and left in a cloud of exhaust, Gao Qingchang’s eyes reddened, his excitement only heightened by Lu Yiman’s dangerously seductive demeanor.",
        "“A race? Interesting!” ",
        "Ignoring the woman beside him, whose face had gone pale from the cold wind, he gripped the steering wheel and chased after with a vicious expression.",
        "The driver of the business car, which had nearly been hit earlier, rolled down the window and glanced back at Yu Chuang in the rear seat, whose expression was unreadable. The driver respectfully asked, “Young Master?”",
        "Yu Chuang, legs crossed, sat solemnly in his straight, dark suit, his figure obscured by the dim shadows.",
        "“Follow them.” ",
        "With those cold words, the driver didn’t ask more questions and followed the two cars.",
        "…",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The wind scattered the sparks from his cigarette, and as Lu Yiman saw the car approaching in his rearview mirror, he flicked the ash and quickly turned the car into a sharp corner.",
        "At first, Gao Qingchang was thrilled with the chase, confident that his sports car was superior in performance to Lu Yiman’s. ",
        "He was tightly chasing behind, creating a tense cat-and-mouse atmosphere.",
        "But he soon realized that Lu Yiman’s car was veering further off the main road, heading onto a deserted mountain road.",
        "The car he had been tailing suddenly started accelerating madly, as if it had gone insane.",
        "“Lu Yiman, are you crazy?!” Gao Qingchang was shocked as he watched the car continue to accelerate. A few sharp turns later, the tires were almost sparking against the ground. ",
        "“Mr. Gao, want to place a bet?”",
        "The clear voice carried a hint of amusement.",
        "Gao Qingchang, still close behind despite starting to feel fear, sped up to keep up—his pride was on the line.",
        "“What are we betting on?!” ",
        "“Anything you want.” Lu Yiman leaned back in his seat, his deep, bright eyes narrowing slightly.",
        "Feeling provoked, Gao Qingchang tightened his grip on the steering wheel and spat through clenched teeth, “Fine, let’s bet!”",
        "Lu Yiman took a drag from his cigarette, watching the faint white smoke dissolve into the night. The mountain road ahead was as dark as a pitch-black tunnel. The pale, distant moonlight hung overhead, and the only thing breaking through the darkness was the beam of his headlights.",
        "His gaze grew distant. He held the cigarette between his fingers, resting it on the window ledge as the wind blew the embers into sparks. ",
        "In the roaring wind, his braid had long come undone, and his slightly long hair fluttered wildly in the wind.",
        "In the interplay of light and shadow, a hint of confusion flashed in his eyes.",
        "And at the same time, he pressed the accelerator to the floor.",
        "“Second Young Master Gao, isn’t this too dangerous?” His female companion’s face had gone pale with fright, her once crimson lips drained of color. ",
        "The wind lashed against Gao Qingchang’s face, stinging painfully. He was scared too. After all, racing and fooling around in bars were just their ways of flaunting wealth and seeking thrills.",
        "But that didn’t mean they didn’t value their lives.",
        "",
        "In fact, pampered and privileged people like them were especially afraid of death.",
        "He stared fixedly ahead, not understanding how Lu Yiman dared to challenge his sports car. The further they went, the darker and quieter the road became. ",
        "Tension gripped him, and he didn’t dare relax, holding his breath.",
        "The woman next to him clutched the seatbelt tightly. As they approached a sharp turn, she screamed in terror.",
        "“We’re going to crash! Brake! Brake!”",
        "Gao Qingchang’s pupils constricted as he watched Lu Yiman suddenly spin the steering wheel during the turn. He nearly ground his teeth to dust. ",
        "How could he still be speeding up at this point?",
        "Does he have a death wish?",
        "His teeth clenched tightly, veins bulging on the back of his hands as he gripped the wheel. In a flash, he slammed on the brakes. But the sudden deceleration caused him to lose control, and the car swerved toward Lu Yiman’s.",
        "His female companion was still screaming beside him. ",
        "“Shut up!”",
        "Sweat poured down Gao Qingchang’s forehead, and his eyes were bloodshot.",
        "He pressed down hard on the brake, not daring to let go, watching as Lu Yiman’s car accelerated past him at the last second, while his own car smashed into the guardrail.",
        "With a deafening crash, everything came to a standstill. ",
        "Gao Qingchang collapsed weakly in the driver’s seat, completely drained.",
        "Thankfully, he had hit the brakes in time.",
        "A sense of barely escaping death left his limbs numb and powerless.",
        "“Mr. Gao, are you alright?” ",
        "The strong scent of tobacco brought the dazed Gao Qingchang back to his senses.",
        "He stiffly raised his head, only to see Lu Yiman standing there with a cigarette between his lips, a relaxed smile on his face. A surge of rage suddenly broke through Gao Qingchang’s rationality.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Are you insane?! You knew you couldn’t outrun my sports car! Why did you keep speeding up?!”",
        "He shoved open the car door and charged at Lu Yiman like an enraged beast. ",
        "Lu Yiman easily sidestepped him, the half-burnt cigarette still emitting smoke, the tobacco scent blending with the cold wind.",
        "Standing tall, Lu Yiman casually asked, “Wasn’t it Mr. Gao who wanted to race with me?”",
        "“Then why did you keep speeding up?! Do you realize that if I hadn’t hit the brakes just now, we would have died! We could’ve died!”",
        "Gao Qingchang’s eyes were red, his hair disheveled, and he looked completely unhinged, a picture of utter humiliation and panic. ",
        "By the time he reached the last sentence, his voice cracked multiple times, and he was on the verge of tears.",
        "Lu Yiman looked down at him, raising an eyebrow as he asked, “Mr. Gao, you’re not… about to cry, are you?”",
        "“Did you even hear a word I said?!”",
        "Gao Qingchang was so furious he was nearly jumping in place, torn between fear and rage, teetering on the edge of a breakdown. ",
        "Lu Yiman had no real racing experience, and his car wasn’t built for racing, yet he acted so recklessly!",
        "Gao Qingchang was genuinely terrified. Who could’ve guessed that this seemingly gentle and handsome man could be so utterly mad?",
        "“Oh.”",
        "Lu Yiman took one last drag from the cigarette before flicking it at Gao Qingchang. The extinguished butt bounced off him, and out of reflex, Gao caught it. ",
        "He caught it.",
        "Damn it, seriously?!",
        "“…”",
        "The autumn wind felt like it was piercing holes all over his body, chilling him to the bone. ",
        "And then Lu Yiman started laughing, as if completely unfazed by their brush with death moments ago.",
        "Not even a hint of guilt for littering the cigarette butt!",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Gao Qingchang was shaking with rage.",
        "Or maybe it was the cold. ",
        "“Mr. Gao, you can only blame your bad luck.”",
        "Lu Yiman suddenly leaned in, softly chuckling into his ear.",
        "With that, he turned gracefully and walked away, his gaze lazily flicking toward the black business car hidden in the shadows.",
        "… ",
        "Reaching his own car, Lu Yiman realized that his reckless driving had rendered it completely totaled.",
        "He thought for a moment and then decided to abandon it.",
        "Under the cool, clear moonlight, he walked straight toward the black business car quietly parked nearby. With a knuckle, he tapped on the window.",
        "Yu Chuang looked up at him, still replaying in his mind that dangerous yet carefree smile Lu Yiman had shown earlier. Unconsciously, he adjusted his posture, crossing his legs. ",
        "“Mr. Yu, my car’s broken down. Could you give me a ride?”",
        "Yu Chuang didn’t say anything, but there was a flicker in his eyes as he stared at Lu Yiman.",
        "How did he know I was here? How did he know it was me?",
        "Lu Yiman bent down, pointing at the window. “Mr. Yu, your window’s been open the whole time.” ",
        "So, when the car followed him earlier, he had noticed.",
        "Yu Chuang: “…”",
        "Watching as the car window slowly rolled up, blocking Yu Chuang’s sharp, cold profile and the wind-reddened tips of his ears, Lu Yiman raised an eyebrow slightly, patiently waiting.",
        "Soon enough, the tightly closed car door opened for him. "
    ],
    "previous": "Chapter 18",
    "next": "Chapter 20"
}