{
    "title": "Chapter 33.1",
    "content": [
        "After Yu Chuang agreed, of course, he wouldn’t give him any chance to argue back.",
        "Almost immediately, he stepped forward and locked the door behind him. ",
        "They were so close that their noses touched, and they could feel each other’s breath. Yu Chuang gazed at him intensely, his eyes filled with strong desire.",
        "The desire to have Lu Yiman all to himself had never changed.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Lu Yiman saw himself reflected in Yu Chuang’s eyes, and in the intertwining of their breaths, the heat between them rapidly increased.",
        "His eyes were deep and captivating, always carrying a look that seemed like it could swallow someone whole. ",
        "Yu Chuang was drawn in again, his face flushed, and he couldn’t help but lean in. However, just as their lips touched, Lu Yiman turned his head away.\n\n",
        "“I don’t usually have guests staying over, so I don’t have extra toiletries. I’ll go downstairs to buy some for you now.”",
        "He straightened his disheveled clothes, grabbed the coat from the bed, and left.",
        "Yu Chuang, left behind in the room, turned his gaze coldly, staring at his retreating figure with a stubborn determination.\n\n ",
        "Meanwhile, downstairs, Lu Yiman lit a cigarette, looking up at the moon, and rubbed his brow deeply.",
        "What a bother. He was running out of patience.",
        "***\n\n",
        "In the end, Lu Yiman didn’t return to the apartment because he received a call from Peng Duoduo. The other party was drunk, rambling incoherently, and in the background, there were sounds of Gao Qinchang yelling wildly. ",
        "Peng Duoduo had beaten him up, and it seemed like a serious beating too.",
        "“You bastard, Lu Yiman! Get over here and take Peng Duoduo away! If you don’t come, I’ll have my bodyguards throw him out on the street!”",
        "The last sentence was shouted, followed by the sound of Peng Duoduo cursing and the noise of fists hitting flesh, along with Gao Qinchang’s pained gasps.",
        "The phone call ended in chaos, likely because it was dropped during the fight. Amidst the commotion, Gao Qinchang managed to tell him the address, leaving a final threatening remark, “If you don’t get here in half an hour, I’ll knock out Peng Duoduo’s teeth!” ",
        "But judging by the screams, it was more likely Gao Qinchang’s teeth that were at risk.",
        "After hanging up the phone, Lu Yiman extinguished his cigarette. He looked up at the lit apartment above and thought for a moment but didn’t send a message to Yu Chuang.",
        "Maybe he didn’t know, or maybe he did. Standing by the floor-to-ceiling window, Yu Chuang was staring straight down at him as he left.",
        "The car that had been wrecked last time had been repaired. Lu Yiman was quite frugal; he didn’t plan on replacing it, even though it didn’t accelerate as smoothly as before. ",
        "The phone kept ringing intermittently. From the angry shouts and arguments, he pieced together the cause of the incident.",
        "The root of the problem was that Peng Duoduo, the naive fool, wanted to stand up for him.",
        "",
        "Based on Yu Chuang’s strange behavior, Peng Duoduo had reluctantly accepted their relationship after some internal struggle.",
        "In his eyes, even though Yu Chuang wasn’t part of their circle, he was still Lu Yiman’s man. ",
        "But recently, rumors had surfaced that Yu Chuang was about to marry into the Gao family. Although it wasn’t confirmed, it wasn’t hard for them to find out the truth.",
        "He had just returned to the country with Yu Chuang today, and already these rumors had spread!",
        "Peng Duoduo couldn’t accept it!",
        "Dut Ou Timan was sick, and Ueng Guoduo couldn’t burden him with his frustrations, so he called Ouo Ging out for drinks. ",
        "The more they talked, the more they drank, and Ueng Guoduo, drunk and muddled, began recalling how no one came to see Ou Timan when he had fallen down a slope and was inpured for a month, and also the bitter entanglements between him and Tu Iiming. The more he thought about it, the more he cried.",
        "Even though it was surprising that Lu Yiman and Yu Chuang ended up together, at least it seemed like things had worked out!",
        "Who would have thought that the Gao family would turn up as a roadblock!",
        "Peng Duoduo was heartbroken. To him, Lu Yiman was just like a pitiful, helpless cabbage! ",
        "As Lu Yiman’s only true friend, Peng Duoduo felt he couldn’t let this go!",
        "But he miscalculated, not realizing that Luo Ding was someone who loved to stir up trouble.",
        "After hearing his tale, Luo Ding wasn’t moved by his emotional outpouring at all; instead, he egged him on to challenge Gao Qinchang to a fight.",
        "It wasn’t that Luo Ding had a personal grudge against Gao Qinchang—he just couldn’t stand people who were more arrogant than him! ",
        "Peng Duoduo, being the fool he was, believed him and immediately called Gao Qinchang to deeply provoke him.",
        "Gao Qinchang was easily triggered. Typical of someone who forgets past lessons after healing, he immediately drove out alone in the dead of night to face the challenge.",
        "One person easily provoked, the other drunk and acting wildly—when the two met, they immediately started fighting!",
        "What no one expected was that Luo Ding, who had been there just for the fun, actually jumped in to fight as well when he saw Peng Duoduo losing. ",
        "According to Gao Qinchang’s account, Luo Ding even pinched his waist several times during the fight.",
        "He reasonably suspected Luo Ding was trying to take advantage of him.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Damn it, that pervert!",
        "When their eyes met, they nearly started fighting again. ",
        "Lu Yiman stood between them, separating them, frowning slightly in frustration.",
        "“Alright, I get it. Stop fighting. Luo Ding, can you take Duoduo home? If his sister finds out he was out drinking and fighting, she’s definitely going to teach him a lesson.”",
        "“And that’s it? Just let it go?” Luo Ding, clearly riled up, glared at Gao Qinchang with fire in his eyes.",
        "Lu Yiman turned to glance at the bruised and swollen Gao Qinchang, sighed, and said, “They shouldn’t have started fighting in the first place.” ",
        "If it weren’t for Luo Ding instigating things.",
        "Luo Ding knew this himself but refused to admit it. He stubbornly held his head up and retorted, “It’s the Gao family’s shady dealings!”",
        "“Say that again! How exactly is my family shady?” Gao Qinchang acted as though he was about to charge forward again, but it was just for show. After all, he was the one who had suffered, so when Lu Yiman raised his hand to stop him, he immediately cooperated and halted.",
        "Luo Ding scoffed, and Gao Qinchang’s face turned beet red. ",
        "“The Yu family is a deep pool of water, not something your family can just wade into. Let’s not even talk about Yu Chuang—he’s absolutely not suited for your sister. And Yu Chuan? He’s not someone to mess with. If your family does even the slightest thing to upset Yu Chuang, Yu Chuan will flatten your house in no time.”",
        "Luo Ding crossed his arms, casting a sidelong glance at Gao Qinchang, whose brows furrowed deeply.",
        "“But business marriages are quite normal…” Gao Qinchang muttered.",
        "“Normal? Is your family normal? Is the Yu family normal? Let’s not even mention your father marrying three wives, your second brother landing in jail for drug use, and you being pushed into the role of the second heir. As for the Yu family, they’re far from peaceful right now—they have a tough battle ahead.” ",
        "At this point, Luo Ding glanced at Lu Yiman, who was standing off to the side, smoking as if he had nothing to do with the situation.",
        "He stood tall and lean under the streetlight, the cigarette held between his slender fingers, and his face, slightly cold and restrained when not smiling, was striking. The soft light cast half of his face into shadow, making him look so sensually attractive it could make someone’s legs go weak.",
        "Damn it! He’s even handsome just smoking a cigarette!",
        "Luo Ding forced himself to look away, maintaining his haughty stare at Gao Qinchang. ",
        "“I’m not the one who makes decisions about this,” Gao Qinchang’s tone was bad, but it was clear he had taken Luo Ding’s words to heart.",
        "Luo Ding sneered, dripping with contempt.",
        "",
        "“So you’re just useless? Pushed into being the second heir, and you can’t even speak up?”",
        "That hit the mark, and Gao Qinchang was visibly irritated. ",
        "“What the hell did you just say?”",
        "“I said you’re useless.”",
        "“Screw you, I…” Gao Qinchang started to move as if to attack, but when he glanced at Lu Yiman, who had no intention of stopping him, he tugged at the corner of his aching mouth and backed down.",
        "A wise man doesn’t fight a losing battle, humph. ",
        "“Just wait, when this marriage alliance is finalized, you’ll see what happens to you.” Luo Ding shot a cold look at him.",
        "Gao Qinchang didn’t quite believe it; he was still holding onto hope.",
        "“Why do you say that? Two of the top families joining forces—our Gao family is just as strong as any other!”",
        "Luo Ding looked at him as if he were a fool and raised one finger. ",
        "“First, Yu Chuan is a wolf who eats people and doesn’t spit out the bones. Even though he’s temporarily held back right now, if he gets the chance, your Gao family will be the first course he devours.”",
        "Then he raised a second finger.",
        "“Second, strong families joining forces? You’re way too naive. Once the balance is broken, why do you think anyone would let your two families team up instead of ganging up on you?”",
        "Facing Luo Ding’s icy and penetrating gaze, Gao Qinchang shuddered, suddenly jolted into clarity. ",
        "The top three families had only maintained their position by catching the right opportunity years ago, but the Chen family, the Zhao family, the Wang family—these unseen forces…",
        "And the Luo family… His gaze met Luo Ding’s cold eyes.",
        "The Luo family was never a prominent force in the capital, not because they had fallen from grace, but because their main battleground was overseas. Now that Luo Ding had returned to the country, as a direct descendant of the Luo family, his presence in the capital signified that the Luo family…",
        "Gao Qinchang didn’t dare to think further. He was just a second-generation rich kid who spent his days indulging in food, drink, and entertainment. These weren’t matters he needed to concern himself with. ",
        "Even though he tried to convince himself of this, a cold chill continued to linger inside him.",
        "“I don’t believe a word you said. Just wait, I’ll get my revenge sooner or later!”",
        "",
        "Leaving behind this harsh declaration, Gao Qinchang hurriedly got into his car and left. However, it was clear to anyone with sharp eyes that he was both flustered and shaken.",
        "Luo Ding withdrew his two fingers and pointed his middle finger in the direction of Gao Qinchang’s retreating car, muttering under his breath. ",
        "“Idiot.”",
        "Lu Yiman, holding a cigarette between his fingers, turned his head to look at him, his eyes dark under the streetlight, hiding any clear emotions.",
        "Just as Luo Ding thought Lu Yiman might ask him something, he simply said, “Take Duoduo home.”",
        "With that, Lu Yiman flicked his cigarette butt into the trash and walked off into the night without looking back. ",
        "Luo Ding froze for a moment, watching his retreating figure, and muttered to himself, “Trying to act all cool.”",
        "He turned around to pick up the drunken, drooling Peng Duoduo, but after a moment of hesitation, his face flushed as he squatted down.",
        "Damn it! He really was cool!",
        "Luo Ding hated men who were more handsome than him but unattainable! ",
        "***",
        "It was already late at night, and there were far fewer cars on the road. The neon lights were gradually dimming, leaving only a few scattered headlights and the occasional streetlight passing by.",
        "Lu Yiman gripped the steering wheel with one hand, holding a cigarette in the other.",
        "His phone, resting on the dashboard, kept ringing. Even without a contact name, he knew it was Yu Chuang calling. ",
        "Just before the call was about to go to voicemail, he picked up.",
        "“Yu Chuang, I’m on my way home.”",
        "In the rearview mirror, his face showed no expression, but his voice was gentle.",
        "On the other end, he could hear Yu Chuang’s rapid breathing, intense and filled with raw emotion that flowed through the phone. In the silence, Lu Yiman could sense Yu Chuang’s unstable frustration. ",
        "“Are you alright?” Lu Yiman asked softly, his voice dropping, almost like a lover’s whisper, sending a shiver down Yu Chuang’s spine.",
        "Sitting on the sofa, Yu Chuang stared down at the pink carpet, his hand tightly gripping his pants.",
        "",
        "“Come back.” His voice was hoarse.",
        "“Come back.” ",
        "He repeated it again.",
        "Lu Yiman silently pressed down on the accelerator, his eyes fixed ahead.",
        "“Alright.”",
        "*** ",
        "The lights in the apartment complex were mostly out, save for one stubborn light still shining in the deep night.",
        "He stepped out of the elevator, and before he could even open the door, it was pulled open from the inside.",
        "“What—”"
    ],
    "previous": "Chapter 32.2",
    "next": "Chapter 33.2"
}