{
    "title": "Chapter 32.1",
    "content": [
        "Yu Chuang had not stepped into the Yu family’s old residence for a long time, this place like a cage.",
        "Yu Ci, waiting at the door, immediately walked up to him when he saw his figure and called out, “Brother.” ",
        "But soon, he couldn’t say anything else, and the sudden silence only added to the oppressive atmosphere of this place.",
        "Yu Chuang walked in without glancing sideways, while Yu Ci clenched his teeth hard and followed behind him.\n",
        "",
        "Passing through the front hall and entering the backyard, despite the freezing cold, Old Master Yu was still persistently fishing for the fish he raised himself.",
        "The old man had once said that when some things become unbearable, one must find other distractions to divert attention. ",
        "But after Yu Chuang turned eight, the old man never said such things to him again.\n\n",
        "Old Master Yu had stayed here year-round—was there something he had never gotten over, or perhaps it was the unforgettable past?",
        "“You two brothers don’t even bother to call your grandfather anymore.”",
        "Old Master Yu lifted his fishing rod, and unsurprisingly, caught nothing.\n\n ",
        "He set down the rod, and Yu Ci immediately stepped forward to pour him a cup of hot tea.",
        "Yu Chuang watched all of this coldly, indifferent, as if he had never grown up here.",
        "The once small child, not even as tall as Old Master Yu’s thigh, always silent and lonely, had now grown into a tall and upright figure.\n\n",
        "Old Master Yu’s sharp eyes sized him up and down; ever since leaving the old residence, he hadn’t seen Yu Chuang for a long time. ",
        "The silence was somewhat unbearable. Yu Ci clutched his pant leg, a hard-to-express anxiety brewing inside him.",
        "Old Master Yu withdrew his gaze and said indifferently, “Tomorrow, go meet the Gao family and finalize the wedding date as soon as possible.”",
        "He cast out the fishing rod again, but it floated lightly on the water—it turned out he had forgotten to bait it.",
        "Yu Chuang clenched his hand tightly, his previously numb heart suddenly beating fiercely, as if awakening. ",
        "“I refuse.” He opened his mouth, biting down hard on his teeth.",
        "Old Master Yu paused, not turning his head.",
        "“What right do you have to refuse?”",
        "Such a cold sentence gripped Yu Chuang’s heart like iron pincers. ",
        "His breathing grew tight, then quickly became rapid.",
        "“I said, I refuse.”",
        "",
        "His unstable emotions lent intensity to his tone, and even though he stood firmly and wore a cold expression, the gradually narrowing pupils hinted at dangerous aggression.",
        "The shadow of Yu Ci still feared this side of Yu Chuang, but Old Master Yu merely glanced at him, his slanted phoenix eyes filled with cold mockery. ",
        "“In all these years, I’ve never heard you say so much. Why are you starting to refuse now? Is it because you finally have something you want?”",
        "Yu Chuang’s heart pounded wildly, and his hanging fingers trembled slightly.",
        "Le looked down at Yld Zaster Tu but couldn’t bring himself to answer the duestion.",
        "Dut even if he didn’t speak, Yld Zaster Tu would. ",
        "“So naive. What makes you think that pust because you want something, you will get it? Sverything you have now comes with a price. Go you think you have any real value?”",
        "Old Master Yu stood up. He was very tall, and still, he could slightly look down at Yu Chuang. He approached, cold and oppressive like a cloud that never sees sunlight, like an insurmountable mountain casting a crushing weight.",
        "“Yu Chuang, your only value now is to dedicate your body, your life, everything, to the Yu family.”",
        "At that moment, Yu Chuang’s scalp felt like it was about to explode. His eyes turned blood-red, and the veins on his face pulsed menacingly. ",
        "Old Master Yu placed one hand on his shoulder, saying coldly, “Think about it carefully—your only use.”",
        "He left, taking with him all the air in the room.",
        "Suddenly, Yu Chuang knelt on one knee, clutching the stone floor tightly. His nails broke, exposing the flesh, and blood oozed out. Sweat dripped down, and his body, trembling from tension, desperately suppressed something.",
        "But this suppression was never a lock he had placed on himself. ",
        "“Brother… Big Brother…”",
        "Yu Ci was frightened by his appearance. He hesitated to approach, but when Yu Chuang lifted his head, those cold, lifeless eyes scared him into taking a step back.",
        "He didn’t dare move again.",
        "The wind blew, knocking leaves from the trees, which floated down onto the water, spreading icy ripples. ",
        "After a long, long time, Yu Chuang finally stood up, hiding his bloodied, trembling hands behind his back, his pale face expressionless.",
        "He closed his eyes, and when he opened them again, they were darker and colder than usual.",
        "",
        "“Big brother…” Yu Ci anxiously followed behind him, wanting to say something, but when he looked at Yu Chuang’s face, the words stuck in his throat.",
        "Just as they reached the front courtyard, they ran into Yu You and Yu Yuan, the brother and sister pair. ",
        "A proud, young man and a cold, arrogant woman.",
        "“Yu Chuang, long time no see,” the man smiled as he approached, carrying an air of arrogance, looking down on him from the side.",
        "Of course, this arrogance came from the opportunity he now had to take back everything.",
        "Before Yu Chuang and Yu Chuan returned to the Yu family, he had thought that everything within the family was his for the taking. He had always excelled, and every look of approval from Old Master Yu was the pillar of his life’s efforts. ",
        "But everything changed after Yu Chuang and his brother returned.",
        "Just because he wasn’t a direct descendant of Old Master Yu, he was forever relegated behind Yu Chuang and his brother.",
        "For someone so proud and self-assured, this utterly destroyed his will!",
        "He would never forgive Yu Chuang and Yu Chuan, nor could he accept the time he had been overlooked. ",
        "Facing his cold, resentful eyes, Yu Chuang glanced at him indifferently, without any emotion.",
        "But it was precisely this glance that reminded Yu You of the humiliation of never being acknowledged, no matter what he did!",
        "He grabbed Yu Chuang by the collar, his anger completely shattering his composure.",
        "“What is that look in your eyes? What gives you the right to look at me like that!” ",
        "The years abroad had been nothing short of a nightmare for him!",
        "The memories and his stubbornness gnawed at him constantly, tormenting him and triggering his sensitive nerves.",
        "Yu Chuang coldly stared at him, then raised his hand to grip Yu You’s wrist. Sticky blood smeared onto Yu You’s hand as Yu Chuang tightened his grip.",
        "He didn’t look down, didn’t check the miserable state of his hand, nor did he seem to feel the pain. ",
        "“Don’t provoke me,” he said in a low, hoarse voice.",
        "The immense strength was almost crushing Yu You’s wrist bone.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "His eyes seemed like black holes that could swallow everything, mixed with chaos and uncontrollable madness.",
        "“Or else, I’ll kill you.” ",
        "The cold whisper seeped into Yu You’s ear. As his pupils trembled, Yu Chuang flung his body aside and strode away.",
        "Yu You stood there, feeling the searing pain in his wrist, slowly turning his head to glare darkly at Yu Chuang’s departing figure.",
        "***",
        "Yu Chuan stormed back to the villa, almost throwing his coat on the floor the moment he stepped inside. ",
        "The servant standing nearby dared not speak and silently retreated.",
        "He grabbed the teacup on the table and smashed it onto the ground, shouting angrily, “Lu Yiman, who do you think you are? What gives you the right to lecture me!”",
        "But after the rage subsided, he slumped powerlessly into the chair.",
        "The look Lu Yiman gave him in the café earlier would become the nightmare he dared not revisit that night. ",
        "Helplessness and vulnerability surrounded him. He covered his face with his hands and painfully whispered, “Brother, brother…”",
        "The room was quiet, with only his own voice echoing.",
        "He didn’t know how much time had passed when the soft sound of a door opening made him jolt. He looked up quickly and saw Yu Chuang standing upstairs, quietly watching him.",
        "Yu Chuan immediately stood up, frantically picking up his coat, and then awkwardly nudged the glass shards on the floor with his foot, trying to hide them behind him. ",
        "“Brother, you… why are you home?” The moment he said it, he choked on his words.",
        "Right, Yu Chuang had returned to the country today, but he hadn’t told him, so Yu Chuan didn’t know and couldn’t go to the airport to pick him up.",
        "It wasn’t until he saw Lu Yiman that he suddenly realized Yu Chuang had returned!",
        "Learning this fact from someone else nearly made him lose control of the anger in his heart. ",
        "So, he failed to keep his composure when talking to Lu Yiman, and of course, in the end, he lost—he lost his temper, and he lost face.",
        "Yu Chuan lowered his head, not daring to look at Yu Chuang’s expression at this moment.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "But Yu Chuang said nothing. After coming downstairs, he walked straight past him.",
        "Yu Chuan panicked and immediately reached out to grab his hand, but he felt Yu Chuang tremble sharply, and his hand was wet. ",
        "Under Yu Chuang’s expressionless gaze, Yu Chuan looked down and saw his brother’s hand wrapped in bandages, with blood seeping through.",
        "Had Yu Chuang been resting just now? Had he woken him up?",
        "But how did he get injured?",
        "Confused, he stared at the wounds on Yu Chuang’s hand and then watched him pull away. ",
        "“Brother!” His heart raced, and he wanted to grab him again, but now he didn’t dare to touch him too forcefully.",
        "Yu Chuang’s face was pale. Even though he tried to ignore the blood on his hand, the symptoms of faintness still affected him.",
        "“Brother, where are you going?” Yu Chuan tried to soften his voice, forcing a smile to make himself seem like nothing was wrong.",
        "“Out.” ",
        "Yu Chuang curled his fingers, hiding them inside his sleeves.",
        "“Is that so.” The expression on Yu Chuan’s face stiffened. Perhaps because he knew exactly who Yu Chuang was going to meet.",
        "A mix of anger and frustration welled up inside him.",
        "Why is he still going to meet him? That person had just bullied him! ",
        "Yu Chuang silently observed the shifting emotions on Yu Chuan’s face. His fingers loosened slightly, and in the end, under his brother’s direct gaze, he gently hugged him, patting his back slowly and softly.",
        "Yu Chuan froze, then suddenly buried his head in his brother’s chest. His eyes instantly reddened and welled up with tears.",
        "“Brother…”",
        "He opened his mouth, but his voice seemed stuck in his throat, unable to say anything more. ",
        "Lowering his head and seeking comfort, he naturally didn’t see Yu Chuang’s eyes, which, staring forward, were empty and lost.",
        "After what felt like an eternity, Yu Chuan sniffled, forcing down the urge to ask Yu Chuang to stay. He took a deep breath and, smiling, said, “Brother, I’m fine now. You can go.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He let go, his beautiful face lit with a lighthearted smile.",
        "Yu Chuang glanced at him one more time, moved his lips slightly, but said nothing. After a brief pause, he opened the door and left. ",
        "As his figure disappeared, the smile on Yu Chuan’s face immediately vanished.",
        "“Damn it!”",
        "In his rage, he kicked the door, only to nearly break his toe, bending over in pain as he clutched his leg, gasping for breath."
    ],
    "previous": "Chapter 31.2",
    "next": "Chapter 32.2"
}