{
    "title": "After Picking up the Fallen Female Zerg General 捡到落魄雌虫上将后",
    "raw_title": "捡到落魄雌虫上将后",
    "author": "草帽小羊",
    "total_chapters": "94 Chapters + 16 Extras (Complete)",
    "description": "Ye Er first saw that female zerg in an advertisement. He was cheap, and significantly damaged, with only a pair of golden eyes that remained beautiful.\nLater, when he saw him again, it was in the female slave exchange live broadcast, where he was trampled, his spine crushed, shamelessly humiliated, his eyes silently enduring the pain and embarrassment. Yet, he shed not even a single teardrop.\nLater on, Ye Er picked up that dying female zerg back home.\nNursing the female zerg back to health was like repairing an old, rusty machine. He was severely mutilated, had lost his bone wings, was blinded in one eye, and had his legs broken, unable to walk.\nBroken and tattered, completely lacking in value, silent yet sharp.\nYe Er cared for him like a stray dog he had picked up, changing bandages, feeding, caressing his head to appease, turning on the lights at night to drive away spasms and nightmares… striving to be a qualified keeper.\nHowever, after continuous nursing, the female zerg who unknowingly grew powerful and returned to the peak of power, surrounded him with his newly grown bone wings, gently and cautiously with matchless devotion.\nFive years after the war ended, the empire and the military welcomed back their “sacrificed” general, leading to a strong reshuffle, resulting in the dismissal of numerous noble military officers.\nOn the surface, the scene was of foul wind and blood rain, with fear and trepidation.\nWhile the media was subtly pointing fingers at the arrogant and cold-blooded tyrant, the tyrant was wearing a soft pink warm apron, skillfully baking matcha cookies with a gentle expression as he called Ye Er to wash his hands before eating.\nNo one could have imagined that during the day, the general, who was violent and unparalleled, skillfully tearing mechas apart on the military training ground—\nWould obediently open up his heart completely with his own hands, trembling all over, his eyes red and moist from being bullied, hoarsely voicing his forbearing affection.\n“Only you can do anything to me.”\n\n＊\n\nBeautiful Gong X Strong Shou\nGentle and powerful, beautiful Gong X Fallen Iron-blooded General Shou\n＊\nIn likeness to you, as I am, have experienced a broken, painful life but have not fallen apart\nEvery day from the suffering endured\nOnce again, dip our foreheads in the light.\n– Hermann Hesse, “Freude am Garten”\nREADING GUIDE:\n1. This story is set in a fictional background and is not related to reality. Please do not relate it to real life.\n2. Hurt/Comfort, HE, mutual pampering/two-way devotion & redemption.\n3. [The general is lynched and tortured by shameless political enemies, resulting in damage to the womb, which will be healed later, but be cautious as it may be triggering!!! However, there is no third-party involvement during that period.]\n4. No secondary CP, there are side stories with egg-laying. If you do not like it, don’t read it.\n5. The synopsis is the same as the story. The author’s experience can be clearly seen from the synopsis xp. If you do not like the synopsis, you will definitely not like the story, so it is recommended to stop in time.\n6. For fans of mutual pampering, politely decline extreme control, territorial marking behaviors, and slandering. I do not appreciate fighting. No need to inform if you decide to abandon the story. Thank you all. (bow)\nTranslator’s Note: This novel contains triggering subjects such as self-harm, suicide attempts, child abuse (physical and psychological), and detailed descriptions of torture, among other potentially sensitive topics. I will include a trigger warning in every chapter where these subjects are present.\nDespite the heavy themes in the story, it is ultimately a sweet and healing narrative, so there is no need to be afraid to read it!",
    "chapters": [
        {
            "title": "Chapter 1",
            "filename": "Chapter 1.json"
        },
        {
            "title": "Chapter 2",
            "filename": "Chapter 2.json"
        },
        {
            "title": "Chapter 3",
            "filename": "Chapter 3.json"
        },
        {
            "title": "Chapter 4",
            "filename": "Chapter 4.json"
        },
        {
            "title": "Chapter 5",
            "filename": "Chapter 5.json"
        },
        {
            "title": "Chapter 6",
            "filename": "Chapter 6.json"
        },
        {
            "title": "Chapter 7",
            "filename": "Chapter 7.json"
        },
        {
            "title": "Chapter 8",
            "filename": "Chapter 8.json"
        },
        {
            "title": "Chapter 9",
            "filename": "Chapter 9.json"
        },
        {
            "title": "Chapter 10",
            "filename": "Chapter 10.json"
        },
        {
            "title": "Chapter 11",
            "filename": "Chapter 11.json"
        },
        {
            "title": "Chapter 12",
            "filename": "Chapter 12.json"
        },
        {
            "title": "Chapter 13",
            "filename": "Chapter 13.json"
        },
        {
            "title": "Chapter 14",
            "filename": "Chapter 14.json"
        },
        {
            "title": "Chapter 15",
            "filename": "Chapter 15.json"
        },
        {
            "title": "Chapter 16",
            "filename": "Chapter 16.json"
        },
        {
            "title": "Chapter 17",
            "filename": "Chapter 17.json"
        },
        {
            "title": "Chapter 18",
            "filename": "Chapter 18.json"
        },
        {
            "title": "Chapter 19",
            "filename": "Chapter 19.json"
        },
        {
            "title": "Chapter 20",
            "filename": "Chapter 20.json"
        },
        {
            "title": "Chapter 21",
            "filename": "Chapter 21.json"
        },
        {
            "title": "Chapter 22",
            "filename": "Chapter 22.json"
        },
        {
            "title": "Chapter 23",
            "filename": "Chapter 23.json"
        },
        {
            "title": "Chapter 24.1",
            "filename": "Chapter 24.1.json"
        },
        {
            "title": "Chapter 24.2",
            "filename": "Chapter 24.2.json"
        },
        {
            "title": "Chapter 25.1",
            "filename": "Chapter 25.1.json"
        },
        {
            "title": "Chapter 25.2",
            "filename": "Chapter 25.2.json"
        },
        {
            "title": "Chapter 26.1",
            "filename": "Chapter 26.1.json"
        },
        {
            "title": "Chapter 26.2",
            "filename": "Chapter 26.2.json"
        },
        {
            "title": "Chapter 27.1",
            "filename": "Chapter 27.1.json"
        },
        {
            "title": "Chapter 27.2",
            "filename": "Chapter 27.2.json"
        },
        {
            "title": "Chapter 28.1",
            "filename": "Chapter 28.1.json"
        },
        {
            "title": "Chapter 28.2",
            "filename": "Chapter 28.2.json"
        },
        {
            "title": "Chapter 29.1",
            "filename": "Chapter 29.1.json"
        },
        {
            "title": "Chapter 29.2",
            "filename": "Chapter 29.2.json"
        },
        {
            "title": "Chapter 30.1",
            "filename": "Chapter 30.1.json"
        },
        {
            "title": "Chapter 30.2",
            "filename": "Chapter 30.2.json"
        },
        {
            "title": "Chapter 31.1",
            "filename": "Chapter 31.1.json"
        },
        {
            "title": "Chapter 31.2",
            "filename": "Chapter 31.2.json"
        },
        {
            "title": "Chapter 32.1",
            "filename": "Chapter 32.1.json"
        },
        {
            "title": "Chapter 32.2",
            "filename": "Chapter 32.2.json"
        },
        {
            "title": "Chapter 33.1",
            "filename": "Chapter 33.1.json"
        },
        {
            "title": "Chapter 33.2",
            "filename": "Chapter 33.2.json"
        }
    ]
}