{
    "title": "Chapter 25.2",
    "content": [
        "Thinking back to that scene, Ye Er was both angry and amused.",
        "Xi Ze smiled and then asked curiously, “Why did it suddenly run out?” ",
        "“It was because the neighbor across the street made braised pork, and the delicious aroma made Tangyuan greedy. It wanted to beg for a piece, but it had a terrible sense of direction. It completely lost its way after wandering in circles for a long time. During its wandering, it nearly got caught and sterilized again.”",
        "However, after complaining, Ye Er fell into a daze, and after a while, he spoke softly.\n",
        "",
        "“It’s been adopted by a friend now. I don’t know if it’s still as gluttonous as before. Fortunately…”",
        "He wanted to say that, fortunately, he had entrusted Tangyuan to his friend. Otherwise, after his sudden death, Tangyuan would surely become a stray again, forced to miserably rummage through garbage bins for food. ",
        "However, a surge of intense longing welled up within him, warming the rims of his eyes and causing a slight sourness to rise to his nose.\n\n",
        "Noticing the male zerg’s downcast mood, Xi Ze reached out uncertainly, patting his shoulder through the quilt. He tried to comfort him, somewhat clumsily. “You can go see it anytime you want later. Or should we bring it back to raise?”",
        "“It’s okay, this is good enough.”",
        "Ye Er blinked, pushing down his emotions. Then, he suddenly asked, “Speaking of later, what do you plan on doing next?”\n\n ",
        "They both tacitly understand what this “later” referred to, but they had been deliberately avoiding the topic. Now that they were talking about it, there was no harm in discussing it.",
        "Xi Ze fell silent for a moment.",
        "“There are indeed some things I needed to do…”\n\n",
        "Countless considerations and deliberations circled in his mind. Finally, he lowered his gaze and said seemingly casually, “Perhaps I can first go find the culprit who made me suffer so much?” ",
        "“Then you better get well soon.”",
        "Ye Er’s tone was as natural as if he were asking what’s for dinner. “Then kill all those guys.”",
        "Xi Ze was probably shocked by his ruthless words. He remained silent for a while before saying in disbelief, “I thought you would tell me to forget or forgive, after all…”",
        "The male zerg was an amicable and gentle zerg, as if he could understand and forgive all the difficulties and suffering, unwilling to witness war and bloodshed. ",
        "“Do you have some misconceptions about me?”",
        "Ye Er frowned. “An eye for an eye, a tooth for a tooth. Do you think I’m some kind of saint?”",
        "To return harm with sharp blades, and repay love with tenderness, that was his code of conduct.",
        "Xi Ze almost sighed as he said, “You’re right.” ",
        "After a long silence, he whispered, “Okay, I’ll kill them all, then I’ll bring Male Lord to the Main Star to live, okay?”",
        "It felt like something strange was spreading.",
        "",
        "Te Sr directly refused without hesitation. “No, you kill them. That’s your freedom. I’ll stay here. I’m not going anywhere.”",
        "Le said it decisively, leaving no room for the female herg to probe further. ",
        "After that, they didn’t speak anymore. The awakened night settled back down, deep and warm.",
        "Ye Er turned over and buried his face in the quilt, ending their indescribable and abrupt nighttime chat.",
        "“Alright, it’s very late. Let’s get some rest.”",
        "Half an hour later. ",
        "Ye Er lifted the quilt, tousled his messy hair, and glanced at the female zerg beside him. He was equally awake, his expression silent.",
        "“It’s not a good idea to waste time like this. I’m going to get some medicine.”",
        "He propped himself up, turned on the bed lamp, threw back the covers, and got out of bed. Then he pulled open the drawer beside the bed.",
        "The small space was crammed with various medicines. Ye Er crouched there for a minute, finally working up the mental preparation to pull out the sleeping pills. ",
        "He had always had trouble sleeping. In his childhood, he would be woken up and beaten while he was asleep, causing his mental state to become increasingly sensitive and tense. One day, he suddenly realized he could no longer sleep at all.",
        "Even after escaping that high-pressure environment, peaceful sleep never returned. He would always mentally prepare himself every time he took a sleeping pill, and after doing so for over a decade, it had become a habit.",
        "He stood up again and poured two cups of hot water. He handed the female zerg one of the cups, along with his medication.",
        "“It’s almost dawn. Thank goodness it’s the weekend. No need to go to work.” ",
        "Then, remembering something, Ye Er creased his brow. “But we have an appointment at a new hospital tomorrow afternoon, so we need to get enough sleep.”",
        "“Can you…” Xi Ze swallowed the pill, his expression hesitant. He pursed his lips, but swallowed the rest of his words.",
        "“What?” Ye Er looked up at him, about to get into bed. “Say it.”",
        "Xi Ze rubbed his nose, seemingly finding the request unreasonable. He lowered his voice insecurely and said, “Can you… hug me?” ",
        "The air suddenly grew quiet, as if time itself had frozen. He unconsciously breathed lightly.",
        "The disordered beating of his heart disrupted his judgment of time. It could have been minutes, or maybe only a few seconds.",
        "Please visit chrysanthemumgarden (dot) com",
        "“If you can’t…”",
        "“Okay.” ",
        "Ye Er thought for a moment, then readily agreed.",
        "He didn’t know why the female zerg proposed this request, but after experiencing such intense pain, perhaps a hug was truly needed to fall asleep peacefully.",
        "Those golden eyes, initially lowered, suddenly lit up upon hearing his answer, like a dog eagerly awaiting a rub.",
        "It was obviously a merciless and cold-blooded beast, like a snow leopard, but it had somehow subdued its deep aggression. By the time Ye Er returned to his senses, only silent tameness and gentleness remained. ",
        "He reached out, sinking his hand into the fluffy white hair of the female zerg, stroking it from time to time. The pads of his fingers occasionally brushed against the soft corners of her eyes, leaving a faint pink mark.",
        "Perhaps even Xi Ze himself didn’t realize that whenever he was treated like this, a subtle expression of both fear and longing would flicker across his face. It wasn’t particularly obvious, but Ye Er could always tell.",
        "A shallow cut, barely noticeable just now, bled near the female zerg’s ear. Ye Er pressed his fingertip against it. “Does it hurt?”",
        "Xi Ze looked at him blankly, then unconsciously rubbed his head against Ye Er’s palm, letting out a muffled purr like a cheetah comfortably petted. ",
        "Ye Er smiled softly, but his gaze involuntarily drifted to the female zerg’s neck. There, a cold metal ring clasped tightly around his delicate and sensitive throat.",
        "This thing…",
        "After that argument, they never brought it up again. But the female zerg couldn’t have simply forgotten about it. Even if he had toned down his sharpness, he couldn’t possibly be content with breaking his own spine and bowing down to become some bullshit “female slave.”",
        "How on earth can he get rid of this thing? Ye Er furrowed his brow but was only a little lost in thought for a moment. ",
        "The priority now was to appease the female zerg.",
        "He blinked, looking a bit lost as he spread his arms and shifted into several different positions. None of them felt quite right. “Um… how do I hold you?”",
        "Ye Er felt like the mother hen in a game of Eagle Catches the Chicks, except instead of chicks, in front of him was a mighty eagle that could swallow him whole in a few bites.",
        "He managed to amuse himself quite successfully. ",
        "But a hand with prominent knuckles grabbed his wrist, and then a powerful force came—",
        "Ye Er was caught off guard and lunged forward, his knee landing in the female zerg’s open □□, his face sinking into a soft, creamy expanse.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He unconsciously took a deep breath, instantly filling himself with the familiar, sweet, and delicate scent.",
        "So… so bouncy, so soft. ",
        "His waist was encircled by two strong arms, a searing warmth radiating from his front. The female zerg held him so tightly that he was completely confined in his embrace, unable to break free.",
        "Ye Er blinked slowly, feeling Xi Ze bury his face in his neck and draw a deep breath, almost like a sigh.",
        "The body in his arms wasn’t delicate, but supple and lean, like a vibrant, tenacious Red Jade Vine, which could release a sap of life with a single bend.",
        "But Xi Ze repeatedly loosened his strength, unwilling to hurt him. ",
        "Soft silver hair brushed against his cheek, the heat of another living being radiating through the thin gauze and fabric, burning against his skin. Meanwhile, the snow-covered wasteland silently began to melt.",
        "Sensing the sincerity and solemnity of this embrace, Ye Er hesitated for a moment before reaching out to caress the female zerg’s shoulder.",
        "His fingertips brushed against the soft, thin fabric of the pajamas. The skin beneath was segmented by gauze, yet could not hide the soft, thick, and beautiful muscle contours as well as the clear, slightly protruding spine bones.",
        "His fingers slid down little by little, reaching the shallow indentations of his waist, where the hollow of his palm rested before naturally pinching that lean waist. ",
        "It’s truly similar to humans.",
        "Ye E suddenly thought.",
        "His gaze unconsciously shifted to the female zerg’s back, where he could vaguely see the gorgeous patterns of the zerg markings through the loosened neckline.",
        "And going deeper, within the butterfly bone, lay the soft wing sacs that held the wings. ",
        "Ye Er reached out to touch it. The texture of the wing sac felt very unusual—a thin and soft layer that was both fragile and sensitive.",
        "Xi Ze nearly trembled all over, yet he didn’t pull away. Instead, he allowed Ye Er’s fingertips to brush back and forth, even sweeping across the tiny, densely packed nerve endings.",
        "The female zerg had his bone wings uprooted, so there was nothing inside. They wouldn’t suddenly unfurl and flap, and unless stimulated, he wouldn’t half-transform to his original zerg form and scare him.",
        "This cruel truth unexpectedly brought him an unprecedented sense of relief. A string that had been taut within him finally relaxed. ",
        "Ye Er closed his eyes, adjusted his arms, and completely embraced the female zerg.",
        "Hugging before sleeping was indeed a mystical but effective method. Or maybe the sleeping pills had taken effect. By the time Ye Er lay back under the quilt, he was too drowsy to keep his eyes open.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The storm outside seemed to have gradually subsided, no longer pounding against the glass with a crackle and rattle. In the complete darkness and warmth, a thick sleepiness billowed and surged, like a gentle tide slowly engulfing him.",
        "Ye Er’s breathing grew long and even. ",
        "In his semi-conscious state, he seemed to hear a soft, slightly hoarse voice coming from above his head.",
        "“I haven’t figured out how to open up about those things yet… Give me some time, okay?”",
        "His dreamland disturbed, he furrowed his brow and unconsciously turned over to completely fill the gap.",
        "With arms suddenly filled, Xi Ze stiffened from head to foot. After a long while, he carefully reached out and pulled the blanket up a little. ",
        "Ye Er then sighed contentedly.",
        "This position enveloped him completely in warmth. The breath that was originally covering his nape now rested against his ear, blending with the muffled heartbeat in front of him, an intimacy that was stepping on the borderline.",
        "The tip of his nose was filled with the faint smell of blood on Xi Ze, along with a slight, barely perceptible sweetness. This scent, melting with the cold, harsh scent of snow and wind, was unexpectedly pleasant.",
        "He let out a soft hum, burying his slightly chilled face further into the soft, fluffy hair, sinking completely into the warmth. ",
        "The scorching temperature was incredibly snug, but it felt a bit stiff, making him unable to resist nuzzling his head against it and mumbling something indistinctly."
    ],
    "previous": "Chapter 25.1",
    "next": "Chapter 26.1"
}