{
    "title": "Chapter 4",
    "content": [
        "Translator: Deyonna",
        "The lights in the hospital are still bright, as it is not particularly late yet. ",
        "The female zerg has been taken in for surgery. Ye Er, who got out of the car, was taken by a sub female nurse to pay the various miscellaneous fees and bills, which were then stuffed into his pocket.",
        "Ye Er looked at the bill, then checked his balance, and sighed.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Picking up a female zerg really costs money. If this continues, the balance in his terminal will truly hit rock bottom.",
        "“Before thinking that it’s expensive, maybe you shouldn’t have been so ruthless… Now he’s already in the operating room, whether they can save his life is still uncertain…” ",
        "The female zerg who was giving him a receipt on the other side of the glass partition suddenly spoke in a low voice. The light on the floating screen reflected in his eyes, and his eye sockets even turned slightly red.\n\n",
        "The sub female on the side nudged him under the table, subtly hinting him not to speak carelessly. If the male zerg held grudges, it wouldn’t lead to good results. The female zerg bit his lower lip and shut up.",
        "Ye Er glanced at him and casually stuffed the receipt into his pocket.",
        "“I picked him up on the road. I don’t even know what his name is.”\n\n ",
        "After saying that, he followed the nurse and left without looking at the expression of the female zerg again.",
        "The female zerg had already been pushed into the operating room, and the red light turned on. Ye Er kneaded his brow and sat down on the nearby chair.",
        "Not long after, a medical staff hurried over and anxiously whispered, “Your Excellency, you can wait in the exclusive reception room. We have already prepared…”\n\n",
        "“Thank you, but no need.” ",
        "Ye Er tilted his head to look at the tightly closed door, his voice soft. “Let me sit alone for a while.”",
        "From passing through the black market to encountering the female zerg, only a few tens of minutes had passed. The surge of blood receded, and the inexplicable impulse dissipated, with reason once again taking the upper hand.",
        "The momentary impulse seemed insufficient to support the actions just now, yet he could not find any deeper motive or purpose.",
        "The momentary impulse did not seem strong enough to justify the actions he had taken just now, yet he could not find any deeper motive or purpose behind those actions. ",
        "Whether it was when he saw the advertisement or when he was disgusted by the live broadcast, he never had the intention of buying the female zerg.",
        "On one hand, there was a psychological resistance as he could not accept the buying and selling of zergs.",
        "On the other hand, he had transmigrated here through unknown means, the principles of which were unclear. Since he could suddenly come here, there was a possibility that he could return at any time, making it unsuitable to establish intimate relationships.",
        "……Forget it. ",
        "Ye Er interlocked his fingers and pressed them against his forehead, taking a deep breath.",
        "Let the female zerg recover from his injuries in the hospital, and then encourage him to find a job and become self-reliant.",
        "",
        "There’s no need to bring him home or establish unnecessary relationships; consider it as his one act of chivalry.",
        "Five hours later, the female zerg was transferred to a general ward. ",
        "Ye Er followed up and saw the female zerg lying naked on the hospital bed.",
        "The full and flexible lines on the female zerg’s body resembled undulating mountains, exuding a calm yet gentle softness. The crisscrossing wounds had already stopped bleeding, exposing the bright red flesh and white bones inside, appearing extremely sinister.",
        "“Why isn’t he covered with a blanket?”",
        "Ye Er frowned, recalling the extremely humiliated expression of the female zerg during the live broadcast. He then pulled the curtain by the hospital bed, blocking any potential views from the outside. ",
        "In the hospital room, there stood a female zerg doctor with brown hair and brown eyes, wearing a pair of rimless glasses, checking the data on the machine. When he heard what he said, he looked at him apologetically.",
        "“It’s just for observation purposes… My apologies, Your Excellency. I didn’t consider that you were already fed up with this female slave’s body.”",
        "Ye Er movements paused, feeling a bit puzzled. “Don’t make unnecessary assumptions. He’s not my female slave.”",
        "“Eeally?” ",
        "The doctor asked duihhically. “Dut your information has been recorded on his collar; indeed, he is your female slave.”",
        "Te Sr looked even more puhhled. “I found him on the road; there’s no way my information is recorded…” What information?",
        "Wait, collar?!",
        "An unclear, ominous feeling washed over him, and Te Sr almost gasped for a mouthful of cold air. ",
        "He did indeed touch the collar on the female zerg’s neck, but he gave up when he couldn’t find an opening. Could it actually automatically recognize and record information?!",
        "He woke up his terminal and started to search for entries on collars and female slaves on Baidu.",
        "“When a male zerg fiddles around the collar, it is considered as a confirmation of data entry. The female slave’s collar that recorded a male zerg’s information will belong and be loyal to his male lord for life… The male zerg is responsible for providing basic living conditions, not abandoning or abusing…”",
        "He quickly skimmed through it and finally understood one thing— ",
        "The female zerg he rescued, by some twist of fate, was now bound to him, with the bond lasting a very ridiculous term of “a lifetime”.",
        "It’s like an agreement that needs to be signed for adopting stray cats or dogs.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ye Er’s mood became complicated.",
        "This was completely contrary to his earlier thought of letting the female zerg go. ",
        "The doctor standing on the side lifted his eye at him. “Your Excellency, if you don’t want to bother yourself any further, it’s okay. You have already shown great kindness by bringing him to the hospital. You can hand over to us the follow-up and we will handle it.”",
        "“Handle?” Ye Er detected a hint of unusual implication and furrowed his brow slightly. “What do you mean?”",
        "“Once it’s daytime or when this female zerg wakes up, we can just drive him out to fend for himself. Since you don’t want him, and the hospital isn’t a charity, they won’t naturally offer shelter to a seriously injured female slave.”",
        "The doctor smiled indifferently and placed the pen into the pocket of his white coat. “This is how it’s usually handled.” ",
        "“Moreover—whether from the hospital’s standpoint or from my perspective, I don’t recommend you take him back, Your Excellency.”",
        "The doctor’s smile faded slightly as he looked at the unconscious female zerg on the hospital bed and said in a low voice, “Because he’s already useless.”",
        "“The eyes of this female zerg are severely inflamed and infected, with the right eye nearly blind. The bone wings on his back have been uprooted, with their roots completely necrotic. The area of injury is very large. Both legs have been shot by bullets containing cosmic dark matter, and the right leg has been completely broken. The left leg is slightly less injured than the right one, but it’s also difficult for him to stand again. These are the main injuries, along with various other wounds of different sizes…”",
        "The horrors and suffering seemed to gain weight, pressing heavily on the listener’s heart. Ye Er pursed his thin lips and gazed at the female zerg’s face, enduring the pain. ",
        "After talking, even the doctor, who was accustomed to countless situations, couldn’t help but show an expression of distress and sighed.",
        "“The most critical issue is that during the surgery, I noticed that he seemed to have undergone illegal zerg body experiments… And he has lost most of his self-healing abilities.”",
        "The female zergs’ innate physical advantage is their terrifying self-healing ability, which enables them to survive for extended periods on the battlefield and endure all kinds of deliberate abuse from male zergs.",
        "“He should have died earlier, but he was picked up by Your Excellency, which allowed him to survive until now. But to do more… the hospital is powerless.” ",
        "This is already like handing a death sentence to the female zerg.",
        "The ward fell into complete silence as the blizzard outside intensified, banging against the glass, with the cold seeping in relentlessly.",
        "The sound of his finger joints cracking brought Ye Er back to his senses abruptly. “Is there really no way at all?”",
        "Although he didn’t want to care too much at the beginning, after going through so much trouble to rescue him, no one would be willing to let him die just like that. ",
        "Moreover, he had inadvertently marked the female zerg, making him his “possession” and responsibility.",
        "After a moment of contemplation, the doctor glanced at Ye Er and suddenly said, “There is one way. I won’t dare say it can cure him, but at least it can prolong his life. However, it requires Your Excellency’s cooperation.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Apart from the significant gender differences, there are two other important reasons for the formation of the zerg’s social structure.",
        "One reason is that female zergs goes into estrus regularly every year. Without the comfort of a male zerg’s pheromones, their body will gradually deteriorate. This process is irreversible, and enduring it without help is futile. ",
        "The second reason is that the mental power of female zergs will become disordered shortly after reaching adulthood, and the situation worsens over time. Without the mental power guidance from the male zerg, it can lead to a riot, ultimately resulting in death from extreme suffering.",
        "Although synthetic pheromones and mental power replacements exist, the soothing effect of the male zerg remains the strongest and purest, making it irreplaceable.",
        "“Just now, it was detected that this female zerg is already in the late stage of the mental power riot.”",
        "The doctor’s suggestion is, “You can give him mental power guidance to delay the collapse of his mental landscape.” ",
        "“Feeling unfamiliar? It doesn’t matter, mental power guidance is an innate ability of every male zerg. You don’t need to worry. The situation of this female slave probably won’t get any worse.”",
        "“Alright…” Ye Er looked at the female zerg on the bed, his expression turning serious. “I will try my best.”",
        "He sat sideways on the hospital bed, closed his eyes, and went over everything about mental power in his mind.",
        "[Your level is D, and your mental power activity is not ideal.] ",
        "The worker zerg in charge of the assessment showed disappointment and shook his head at all the zergs waiting outside.",
        "While the male zerg is indeed precious, the upper-class does not lack an ordinary D-level male zerg.",
        "After that, nearly half of the zergs that lingered around his hospital bed disappeared, and no aristocratic family showed any intention of getting involved with him.",
        "[When there’s a deficiency in mental power, guidance should avoid extensive spreading. Learn to feel with your heart and search for the “eye” of the mental landscape.] ",
        "The mental power of a D-level male zerg cannot support complex guidance. The mentor who taught him how to use mental power only explained the general method without letting him practice it.",
        "[It’s very simple, just like brushing off the dust on a blade, and beautiful light will burst forth… You will understand it instantly.]",
        "He didn’t tell any zerg that in his mind—there was no mental landscape, meaning there was no place where mental power could be stored.",
        "But when he calmed his mind to concentrate his mental power, they would appear out of nowhere as if summoned, obediently and warmly allowing him to control them. ",
        "Invisible fluctuations ripple out, like the ripples caused by a stone dropping into water. Countless mental power threads entwine around his fingertips.",
        "Ye Er closed his eyes, reached out, and touched the female zerg’s forehead, attempting to probe into the mental landscape—",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He opened his eyes amidst a howling wind.",
        "The sky overhead was upside down, devoid of stars and the moon, shrouded in a dense blackness that could not be dispelled. ",
        "He found himself in a vast and desolate snowfield, where all he could see was the raging blizzard, chaotic and mournfully desolate.",
        "The mental landscape can reflect the strength of the main body’s mental power. The broader the area, the stronger the mental power.",
        "This place is a vast emptiness, but it was enough to see that the female zerg’s mental power was once terrifyingly strong.",
        "“But… why is it snow?” ",
        "Ye Er struggled to move forward in knee-deep snow, like a small fish swimming upstream against a river’s current, almost on the verge of being engulfed by the blizzard.",
        "“Is it because he nearly died in the snow, and the fear projected into the mental landscape that constructed this violent snow wasteland?”",
        "He took a deep breath of the icy cold air, and his mind became clear.",
        "No, that’s not the case. ",
        "When their mental power instantly blended, he did feel fear, but it was only a small part. The fiery anger, the faint pervasive sadness, the silent and restrained hatred… various emotions painted vividly, like sea waves engulfing him.",
        "A female zerg with such a vast mental landscape is definitely not weak, at least, does not tend to self-destruct due to fear. The emergence of the riot seems to have another cause.",
        "This also means that it will be very difficult to find the “eye” of the landscape.",
        "“Clang!” ",
        "A piece of metal was kicked away.",
        "Ye Er realized he had entered a ruin.",
        "Steel bars, wooden boards, glass… erected haphazardly in the snow, indicating that there was once a building standing in the area.",
        "He stopped walking and searched for a long time, but instantly, upon looking up, his eyes were drawn to an unusual color. ",
        "A faded red cloth strip hung on a steel bar, with a round piece of metal tied at the end, swaying in the wind.",
        "Borrowing the faint light of the sky, Ye Er could barely see the ears of wheat and wings above.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "It unexpectedly turned out to be a rusty and dirty medal.",
        "Ye Er stared at that medal for a long time, suddenly understanding the bloody and humiliated pride that came from a warrior who had once fought on the battlefield, only to tragically fall into such a state. ",
        "He could feel that the “eye” of the mental landscape was right in this medal.",
        "But like the main body, the “eye” was already blind. It represents those past glories and memories, symbolizing everything that had been completely destroyed.",
        "It will be buried in the ruins along with the past.",
        "Whether it is removed, repaired, or destroyed, it will have no effect on the main body. The collapse and destruction are irreversible, and the female zerg is doomed to die. ",
        "No, perhaps there is another way…",
        "[Finding the “eye” of the mental landscape is a way to externally awaken the main body. In addition, there is another way, which is to make the lost main body generate self-awareness and the will to survive, striving to wake up on its own.]",
        "The cold words in the book seemed to have a voice ringing in his ears.",
        "Ye Er looked towards the distant wasteland. As far as the eye could see, there seemed to be an outline of an undulating mountain, blending gently with the thick black night. ",
        "It took him a long time to climb up that mountain.",
        "Wind and snow rage the mountain top, but the landscape was more broader, easily encompassing the entire snowfield, including the ruins and the fluttering red ribbon above.",
        "With a single thought, Ye Er transformed his mental power into the desired shape, and soon several thick wooden boards appeared on the snowy surface, accompanied by some simple tools.",
        "He picked up a long wooden board and inserted it into the snow, assembling them together like building blocks. After a series of knocking and hammering, a small wooden house took shape in his hands. ",
        "The small house was only slightly taller than him, due to limited conditions it was made very crudely. However, it stood firmly on the ground, unafraid of the ravages of the mad wind and violent snow.",
        "The core of the mental power that condensed in the body was already faintly aching. The longer he stayed in the mental landscape, the more discomfort and even harm he would feel.",
        "As if he couldn’t feel it, Ye Er’s slender fingers moved incessantly, swiftly cutting and assembling something. It took him a while to finish, and then he bent down—",
        "He hung a lamp on the window of the small wooden house. ",
        "The mental power circulating in his body condensed into a ball of light, which was then infused into the round belly of the lamp.",
        "The faint warmth melted the cold blizzard, and the warm, pale yellow halo was small and round, like a newborn small hedgehog.",
        "Please visit chrysanthemumgarden (dot) com",
        "Before, he made a decision on behalf of the female zerg without authorization, but ultimately, whether he could wake up or not would still depend on the female zerg himself.",
        "“Try to find your way and wake up…” ",
        "Ye Er squeezed out the last bit of mental power into the lamp, ensuring that it would remain bright for a long time. Finally, he relaxed and no longer resisted the strong rejection of the mental landscape.",
        "The body formed by mental power gradually dissipated. He closed his eyes and sank completely into darkness.",
        "It was unknown how long had passed.",
        "The raging blizzard on the snowfield finally subsided, and the lamp hanging on the window sill stopped issuing a “clink clink,” sound as it tapped against the window, was no longer swaying. ",
        "The warm ball of light, separated by the glass, was carefully touched by a finger.",
        "The pitch-black night gradually faded.",
        "And the first light of day appears."
    ],
    "previous": "Chapter 3",
    "next": "Chapter 5"
}