{
    "title": "Chapter 21",
    "content": [
        "Translator: Deyonna",
        "Axon First Research Institute, Dean’s Office. ",
        "“Knock, knock.”",
        "The gray-haired dean didn’t even lift his head as a rhythmic knocking sound rang. He simply said, “Come in.”\n",
        "",
        "“Dean.”",
        "The one who came in was a young female zerg, still in research robes, with a special-shaped stud earring sparkling on his right earlobe. ",
        "“What’s the matter?”\n\n",
        "Norman finally lifted his head away from the documents, pushed his reading glasses up, and looked at the fourth-year level top student of this institute. “Adelaide.”",
        "“I heard that problem has been solved?”",
        "Adelaide cut to the chase and said, “He’s not from our institute, doesn’t have accreditation from any other institute, and reportedly even lacks three years of education.”\n\n ",
        "Norman remained noncommittal. “What are you trying to say?”",
        "“The algorithm involved in that problem is quite unique and is related to the topic we are currently researching in our team. Since he’s not a student of the institution, I would like to ask the dean to help us contact him for further communication.”",
        "Adelaide softened his cold tone. “The authentication of the terminal will never go wrong. I believe the dean also doesn’t want a good seedling to be abandoned outside and gradually go to waste, right?”\n\n",
        "“It’s possible…” ",
        "Norman pondered for a moment, before finally nodding. “Alright, I’ll contact them and try to win them for you.”",
        "“Good.” The extremely indifferent young female zerg finally curled the corners of his mouth slightly.",
        "“I’ve troubled the dean.”",
        "Not far from the research institute is the First Legion military base. As Norman came out from the office, a wave of riots had just been quelled at the base entrance. ",
        "During this period, there have been more and more incidents in the First Legion. Despite the new general’s years of efforts to suppress them, he still cannot control those iron-headed soldiers who pledge with their lives to follow the former general.",
        "A message passed on by his old friend also hinted at the impending turmoil within the royal family. It’s best to be cautious recently and avoid taking sides randomly to prevent accidental harm.",
        "Norman cautiously evaded the escorting guards and sighed with a wavering tone. “I wonder if I can still have a peaceful year…”",
        "A hover car stopped at the gateway of the base, surrounded by tight security. A few zergs were coming and going, making it seem rather desolate. ",
        "But as the car drove into the star trail of the central urban area, an incomparably vast and resplendent world unfolded.",
        "But Norman had seen too much and had long been accustomed to it. At this moment, he just closed his eyes to rest.",
        "",
        "“Di, di, congestion ahead. Estimated waiting time is 10 minutes. Please be patient…”",
        "He opened his eyes to see the situation outside, but he saw a few familiar zergs standing at the entrance of the banquet venue not far away. His expression gradually became serious. “That is…” ",
        "Then a stream of mysterious silver light, displaying incomparable arrogance, crossed half of the traffic network before drifting and stopping at the entrance. Shortly after it came to a halt, two other vehicles also parked beside it.",
        "Antoine, dressed in a neat military uniform, was the first to hop out of the car. A hint of ezcitement flashed in his eyes when he saw the hovercar that belonged to that person.",
        "“Good evening, Your Highness Gano.”",
        "Le eagerly took a few steps forward to open the door for the herg in the hovercar. Le intended to eztend his hand to help but was peporatively shrugged aside. ",
        "A pair of immaculate shoes emerged from the car door, stepping directly onto Antoine’s military boots, using him as a “stepping stone” to exit the car.",
        "“Get lost.”",
        "The moment the young male zerg appeared, it was as if the surroundings brightened a few degrees, and all eyes were naturally drawn to him, unable to look away.",
        "With delicate and noble features, wavy red hair like fire, and an exquisite, custom-made suit that looked expensive, his green eyes glanced at Antoine. “What’s with your delusional idea that you can touch me? ",
        "Gano Monte squinted as he surveyed the magnificent building in front of him, his face expressing disbelief. “What is this terrible place? A grand general can only afford to book this garbage dump?”",
        "A flash of embarrassment crossed Antoine’s face, but he quickly perked up a smile. “Limited abilities. Your Highness has been wronged. It’s an honor to have Your Highness’ presence tonight. It is truly a pleasant surprise to me…”",
        "“You’re not even one percent as good as my good-for-nothing elder brother.”",
        "Gano sneered. “I originally thought of supporting you. What a drunken and thoughtless decision I made. It was a big loss.” ",
        "“Nono.”",
        "A gentle and hoarse voice sounded, and a female zerg came down from the other side, walking up behind Gano.",
        "Dressed in a complicated suit, with soft white hair tied behind his head, he exuded a gentle and elegant aura. When he smiled, his light golden eyes squinted slightly, giving zergs a comfortable feeling, as if basking in a spring breeze.",
        "“Don’t get angry. The eldest prince is also attending the banquet this time. We can’t let him slip away.” ",
        "“Duke Lance.”",
        "Antoine saluted to the female zerg, only receiving a meaningful smile in return. “Work hard, your future is bright… General.”",
        "Please visit chrysanthemumgarden (dot) com",
        "They did not linger at the door for long before attendants escorted them into the banquet.",
        "Walking down the noble-exclusive pathway lined with a red carpet to the end, one could overlook the incredibly spacious banquet venue from above, like a supreme ruler, gazing down upon all decadence and extravagance with detached eyes. ",
        "Gano couldn’t be bothered to look outside and went straight into the core small banquet hall.",
        "The noble guests coming and going were all high-ranking officials, with some even related to the royal family. They maintained a harmonious appearance on the surface, but to those in the know, they were like the separate Jing and Wei rivers, completely divided into two different factions.",
        "Standing in the center of the banquet hall, surrounded by numerous supporters, was a female zerg named Felix Lott.",
        "The second prince of the current royal family, favored and indulged by the emperor, is clearly an idiot, yet he also has the qualifications to compete for the throne. ",
        "On the slightly quieter side of the banquet hall stood the eldest prince, who appeared more reserved and steady compared to the proud and arrogant female younger brother. He was once the undisputed heir to the throne.",
        "As for why it is said “once” and how he fell to this point in just a few short years…",
        "Gano narrowed his eyes and let out a sneer.",
        "—It is naturally related to his “sacrificed” elder brother, who is the biggest supporter of the eldest prince. ",
        "As long as he is alive, the entire legion is as unbreakable as an iron bucket, and the eldest prince’s status as the heir is unquestionable. Even if some nobles have different thoughts, they cannot shake this fact.",
        "But in the end, he still died.",
        "Gano curled his lips slightly, adjusted his bow tie casually, and walked in the direction of the second prince.",
        "Tonight he will capture this female zerg and become his male lord. Only then can he smoothly intervene in royal affairs and vie for more power. ",
        "After all, idiot puppets are easier to control.",
        "“The road ahead is clear. We are about to set off, so please fasten your seat belt, passenger…”",
        "The traffic destroyed by the arrogant noble male finally cleared.",
        "Countless hovercars that were forced to stop continued to travel on the track, gradually leaving the glorious splendor of the golden and jade palace behind. ",
        "Norman wearily closed his eyes, but in his mind, an extremely upright figure appeared.",
        "Always fighting on the front lines of war, standing up to prevent outrageous proposals in the parliament, and tirelessly working on the most barren and miserable borders.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He is the most indestructible line of defense in this crumbling empire.",
        "It’s a pity. ",
        "It’s a pity…",
        "This old man, who has weathered the vicissitudes of life for most of his years, could not help but feel his eyes turn red, his heart filled with an almost unspeakable bitterness and sadness.",
        "“It’s no wonder the soldiers of the First Legion can’t forget. They have been clamoring to thoroughly investigate that incident from the beginning. It’s really unfortunate, sigh…”",
        "This sigh drifted out of the car window with the wind, dissipating in the boundless snowstorm. ",
        "*",
        "Afterward, they never mentioned that kiss again, as if nothing had ever happened.",
        "But because pheromones have pervading properties, after the waterproof sheet was removed that night, Ye Er was enveloped in an impossible to get rid of bitter tea fragrance, tossing and turning all night without falling asleep.",
        "The scene then shifted to the location of the sofa. ",
        "Xi Ze did not lose control like the first time, but he still blushed intensely almost every time during the process. His limp and feverish body sank into the rumpled sheets, like a warm, steaming jujube cake.",
        "…Looks very biteable.",
        "Ye Er’s Adam’s apple rolled, pondered for a while, and decided to have a late-night snack, feeling so hungry that he was starting to hallucinate.",
        "That night, 015 was forced to work overtime and steamed a few soft sponge cakes under the guidance of the male zerg. ",
        "Although it was the same taste in his memory, it seemed to be lacking something. Ye Er took a bite and then picked up a piece to feed the female zerg.",
        "“Thank you… I’ll do it myself.” Xi Ze hastily took a bite of the cake from the male zerg’s hand and said in a slightly embarrassed voice.",
        "Ye Er endured and endured, but still couldn’t help reaching out to touch the female zerg. It was indeed soft and hot, just like he had imagined.",
        "The cake in his mouth suddenly wasn’t so appetizing anymore. ",
        "When the female zerg’s condition improved a bit, Ye Er was also not as busy and didn’t have to work overtime until six or seven o’clock.",
        "Every time he came back relatively early before 015 had prepared dinner, he would sit on the sofa and accompany the female zerg to listen to the news.",
        "",
        "“In recent days, His Majesty Agnelia has contracted a cold, and despite several days of treatment, there has been no improvement. Many imperial physicians who were negligent in their duties have been punished… It is unknown whether His Majesty will attend this year’s prayer ceremony…”",
        "Ye Er was adjusting the heating to a higher temperature. ",
        "Recently, for some reason, there seems to be a problem with the heating system. Upon hearing the news, he looked at the screen with some surprise.",
        "“One week later, His Royal Highness, the Second Prince, will hold a press conference to publicly announce his engagement.”",
        "“Rumors suggest that the mysterious engagement partner is the Duke’s male offspring, the esteemed A+ level male zerg, His Highness Gano!”",
        "This is not an official news broadcast; they often gossip about insider information. The TV host zerg on the screen looked gossipy and didn’t forget to say, “Let’s congratulate them!” ",
        "Finally fixed it, Ye Er nestled back into the sofa, and out of the corner of his eye, he noticed that the female zerg’s expression seemed off.",
        "“What’s wrong? Are you feeling unwell?”",
        "Xi Ze came back to his senses from the news he had just heard, lowered his eyes to conceal his emotions, and softly said, “…It’s nothing.”",
        "After a few jokes from the host zerg on the news, they had already moved on to the next topic. Everything was in disarray, yet all subtly conveyed a certain feeling— ",
        "Soon, things will undergo changes.",
        "However, Aitar is too distant from the main star; all the blood and fire are unrelated to this little planet where snow gently cascades down.",
        "The cold wind outside the window drummed ardently against the glass, seeping through the cracks with its pervasive chill, yet it could never penetrate this warm defense line.",
        "“Quilt.” ",
        "Ye Er was absentmindedly playing with his terminal, and before he could come to his senses, a soft quilt was already draped over him.",
        "The female zerg beside him had unfocused pupils, fumbling to pull the quilt and wrap it around him. His slender fingertips brushed across the thin shirt on the male zerg’s body, unconsciously caressing it.",
        "During this period, it seems like the heating is a bit faulty, and the house is not very warm. It would be bad if they caught a cold.",
        "Ye Er let out a delayed “oh” as one corner of the quilt slipped to the floor. He quickly reached out with his foot to hook it back up, but was suddenly scalded on the inside of his ankle. ",
        "The female zerg’s wide palm was scorching hot as it covered the delicate skin. The light honey color contrasted with a patch of paleness, inexplicably giving off an ambiguous feel.",
        "Xi Ze seemed to pause for a moment, but quickly picked up the corner of the quilt, tucking it into the sofa along with his slender ankle, wrapping himself into an airtight roll.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Don’t catch a cold.”",
        "After completing all of this, he said softly. ",
        "The news on the screen was still playing, intertwined with the sounds of pots and pans in the kitchen.",
        "Ye Er sniffed the faint bitter tea fragrance at the tip of his nose, and the lingering fatigue in his body melted away, leaving only a lazy warmth.",
        "Ah, he doesn’t feel like moving at all."
    ],
    "previous": "Chapter 20",
    "next": "Chapter 22"
}