{
    "title": "Chapter 11",
    "content": [
        "Translator: Deyonna",
        "“Shaa—” ",
        "Cool water flowed between the gaps of the fingers, freezing the pale fingertips and turning them a bright color red.",
        "The sticky sensation on top has been washed away, but that wonderful feeling still lingers and hasn’t faded.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "The hidden itch in the seams of his fingers made Ye Er really want to continue rinsing them with cold water or to rub them vigorously.",
        "The sudden onset of the female zerg’s estrus seriously disrupted his expectations, leaving him feeling very bewildered at the moment. ",
        "They haven’t had a good talk yet, but the progress bar inexplicably moved a long way, and what he had done earlier doesn’t seem much different from the female zerg’s previous proposal.\n\n",
        "But the knowledge urgently supplemented last night flashed through his mind——",
        "According to social conventions, it is the responsibility of the male zerg to relieve the female zerg’s estrus period. Regardless of the purpose for which he picked Xi Ze back, he has the obligation to take on this responsibility.",
        "Ye Er supported the sink with both hands, closed his eyes, and took a deep breath.\n\n ",
        "Forget it. Let’s take one step at a time.",
        "Waiting for the female zerg’s pheromones on his body to dissipate, Ye Er left the bathroom and returned to the living room.",
        "The female zerg remained as he was when he left, quietly curled up with his back to him on the sofa.\n\n",
        "The estrus period came on menacingly, but due to timely discovery and clearance, it did not spread out wildly. The tide urgently halted before breaking through the precarious dam, gently and slowly receding back. ",
        "The expression on the female zerg’s face was somewhat absentminded, and the slight blush at the corners of his eyes softened his features.",
        "He looked like a snow leopard with its belly exposed, bearing numerous scars on its body, slightly weary as it licked its paws to rest.",
        "“Are you okay?”",
        "Ye Er felt somewhat reluctant to break the silence, but he needed to confirm the female zerg’s condition. “Are the wounds bleeding?” ",
        "Xi Ze silently opened his eyes but did not answer his question. Perhaps he had not yet come to his senses until Ye Er reached out and held his shoulder, trying to check the situation of the wounds.",
        "“…Dirty.” He shuddered sensitively and hoarsely said, “Don’t touch.”",
        "Ye Er paused in surprise and looked somewhat hesitantly at the female zerg, keenly sensing the female zerg’s wavering attitude. The tall, thick city wall seemed to have a faint crack.",
        "“But it’s necessary to change the dressing, otherwise the wounds will get infected.” ",
        "He carefully chose his words and asked in a probing manner, “Or would you like to take a bath? Let 015 help you.”",
        "“…No need.”",
        "Please visit chrysanthemumgarden (dot) com",
        "The female zerg’s tone was even more hesitant than his. After refusing, he pursed his lips and fell silent for a while, then whispered a thank you. “Thank you.”",
        "Not sure why the female zerg’s attitude softened, but now is obviously a good opportunity to calmly discuss some matters without intense conflict. ",
        "“What are you worried about? Can you tell me?”",
        "Xi Ze was slightly stunned.",
        "What is he worried about?",
        "The collar choking his throat made him almost suffocate several times, but his entire heart was easily held by a gentle hand. ",
        "Dut the intense struggle seemed like a superficial, childish tantrum, easily suppressed by a gentle hand, while the male herg remained calm and collected throughout, always leaving room for escape.",
        "Now still uncertain, he asked him what he was worried about.",
        "This is exactly what he was worried about.",
        "Xi Ze self-deprecatingly tugged at the corner of his mouth, his field of vision filled with impenetrable darkness, as if it were an eternal night and he would never see the dawn. ",
        "…But it cannot be denied that his heart was filled with untimely gratitude.",
        "The male zerg did not whip him until his blood splattered, nor did he turn away and leave him to endure and suffer. Instead, he awkwardly but gently comforted him, and was not at all stingy in giving his male zerg pheromones.",
        "It was already enough to make him incredulous.",
        "In the confused and hazy emotional turmoil just now, the intense peak of joy turned into pain. He absentmindedly thought as if he was still being tortured in that interrogation room. ",
        "As the unfamiliar tide flooded over his head, he screamed in a battered and exhausted state under intense suffocation. The depressing dread and hidden desires completely tore his soul in half…",
        "When he regained consciousness, those shameful performances played back frame by frame in his mind.",
        "Amidst overwhelming embarrassment and self-loathing, the only thing worth being grateful for was probably the male zerg who had seemed not to mind anything throughout and never mentioned a word afterward.",
        "“……” ",
        "Xi Ze exhaled heavily in exhaustion and silence.",
        "The male zerg sitting beside him remained silent, without urging, quietly and patiently waiting for an answer.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He suddenly relaxed the pent-up tension, voluntarily raising the white flag in the silent confrontation.",
        "“…At least tell me the price I need to pay.” ",
        "Xi Ze’s voice was low and hoarse. “And what exactly is the reason for Your Excellency to pick me up?”",
        "“Regardless of whether I can bear it or not, at least I will die with clarity.”",
        "It has come full circle again. This question is indeed an unavoidable core issue.",
        "Ye Er paused for a moment, his expression gradually becoming serious. He recalled what he felt at that time, then muttered to himself. ",
        "“I did save you at that time out of impulse, whether it was taking you to the hospital or deciding to bring you home, it was all because I wanted to, there was no zerg directing me from behind, I can guarantee you that.”",
        "Ye Er spoke slowly, casting a sidelong glance at the female zerg, then quickly lowered his gaze.",
        "“I can’t completely say I had no motive. I am not a philanthropist, it’s just that the rewards I receive are not those in the material sense.”",
        "“In other words, I want to receive emotional value from you.” ",
        "Ye Er squinted his eyes. “I have met you a total of three times, and each time was quite ingenious, don’t you think so?”",
        "“Life here is very dull. It needs some new things to pour in, like novelty and vitality.”",
        "“I want to save you, slowly heal those wounds, and in this gradual healing process, I will obtain joy and satisfaction. I think this can be considered a mutual benefit in a sense.”",
        "His gaze shifted away from the female zerg and towards the empty small balcony not far away. ",
        "In that spot, there used to be a cold-resistant and drought-resistant plant similar to a cactus in that spot, which he deliberately bought and planted.",
        "At that time, he thought that he would live as long as the plant lived, but it seemed like he was naturally unable to keep these little things alive. The small sprout, known for its vitality, died within half a month, so he bought another pot…",
        "As a result, pot after pot, a total of fifty-four tragically dead plants piled up in the corners of the balcony.",
        "Struggling to live without any spiritual support is truly lonely. Ye Er felt that impulsively picking up the female zerg to raise might have been driven by a ridiculous idea that “plants die easily, so it should be fine to pick up a female zerg with strong resilience.” ",
        "He wished that Xi Ze could live well, tenaciously and relentlessly fighting to survive by any means necessary, like an inexhaustible and unstoppable weed that thrives and grows wildly at the sight of a little sunlight—",
        "He wanted to see his will to live.",
        "",
        "Ye Er asked 015 to bring the inhibitor over. “That’s probably it. There’s nothing else. I don’t want to deceive you, either.”",
        "It wasn’t until the cold needle punctured his skin and the medication was injected that Xi Ze barely came to his senses. ",
        "So it’s… like that.",
        "The male zerg seemed to be nurturing him like one would care for a paper-cut zerg in a game, or perhaps like caring for a pet. Just from this process, he could already gain satisfaction and a sense of accomplishment.",
        "To ensure that the pitch-black desires would not be vented on him, that life and flesh would not be devoured, it may sound overly naïve, but… it is not without gentleness and beauty.",
        "At least for him now, it is the best way out. ",
        "“Or rather, can you cook?” Ye Er muttered for a moment, then suddenly added.",
        "Xi Ze was stunned again. “…What?”",
        "“015’s cooking module is broken. The food it makes always has a burned taste, but I don’t really want to replace it.”",
        "Ye Er fantasized about the scene after the female zerg’s injuries were healed. “You can stay here, and once your injuries are healed, you can be responsible for providing three meals a day to offset the rent or food expenses.” ",
        "“It’s like I’m hiring you in advance as a chef, or something else, exchanging labor for food and shelter. After all debts are paid off, we can discuss whether you want to stay or leave.”",
        "His voice was calm and unhurried. “This is a fair deal.”",
        "As the male zerg’s voice fell silent, the air suddenly became quiet, and he was almost able to hear the trembling sound of the heartbeat in his chest.",
        "Xi Ze opened his mouth, but his throat felt blocked, unable to make a sound. ",
        "Between the two options of “being driven out to die” and “selling one’s body for benefits,” the male zerg offered another path.",
        "Is the zerg in front of him really a male zerg? It was not the first time he had sincerely doubted it.",
        "“How about this proposal?”",
        "The female zerg’s expression in front of him was strange, and Ye Er suddenly thought of another possibility. Sounding somewhat incredulous, he asked, “It’s not that your cooking is also bad, is it?” ",
        "Xi Ze snapped out of his daze and pursed his chapped lips. “No, my cooking skills are very good.”",
        "“That’s good then.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Only when the wandering mental power felt the gradually diminishing aggression did Ye Er finally breathe a sigh of relief.",
        "He realized belatedly that a layer of cold sweat had broken out on his back, and when the wind blew, his whole body shivered from the cold. ",
        "The feeling was like stepping on an extremely thin tightrope, escorting a porcelain with countless cracks in hand across a cliff ten thousand meters high in the sky, and slowly landing on level ground.",
        "So his heart, which had lingering fears, gradually felt at ease.",
        "The soiled sofa cover was quickly washed clean, dried, and then put back on the sofa.",
        "The sofa was too small, and uncomfortable to sleep on, so Ye Er intentionally measured the height again, bought a new long sofa, and put two together to barely expand the narrow space into a bed. ",
        "Xi Ze’s serious injuries have not healed, and his legs are not in good condition. Even without chains, he can only be confined to the sofa.",
        "Fortunately, next to it is the charging station for 015. The little robot housekeeper has to charge there for a long time every day, so Xi Ze can directly find it if he has any needs.",
        "And ever since that night—",
        "Ye Er yawned as he came out of the room, faint morning light shone in the living room. He saw the female zerg on the sofa tidying up the collar of his pajamas. ",
        "“Why do you wake up even earlier than me? You don’t have to go to work.”",
        "He sat down on the other side of the sofa, supporting his chin with one hand, and looked at the female zerg with a lazy smile on his face.",
        "Xi Ze had a strict daily routine. He did everything neatly and efficiently. Basically, every time Ye Er got up, he had already seen Xi Ze fix himself.",
        "And next to him is a quilt folded neatly into a tofu-like block. ",
        "That is a silk-cotton quilt with a particularly soft and fluffy texture, but in the hands of the female zerg, it obediently transformed into new edges and corners, like a new recruit disciplined by a strict officer.",
        "Ye Er spiritedly patted the tofu-like block. The once neatly pressed quilt regained its softness, bouncing like jelly in his hands. “Hmm?”",
        "“Good morning, Your Excellency.”",
        "Xi Ze tilted his head slightly, his face devoid of expression, yet it didn’t appear cold or indifferent, just a bit unnatural. ",
        "He pursed his lips, his voice low. “I’m just used to getting up early… it’s hard to change for a while.”",
        "It was only after that night that Ye Er realized belatedly—",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The female zerg is not particularly inarticulate and boring in character. On the contrary, he’s cautious and sharp, carrying the usual calmness and seriousness of a military female. It’s just that he occasionally appears overly serious.",
        "It’s… a very amusing personality. Ye Er curved his lips with interest. ",
        "But for now, he can only think about it. The female zerg has improved slightly compared to when it was first picked up, but its body, which has suffered heavy damage, is still on the verge of collapse and needs careful recuperation.",
        "“Your Excellency?”",
        "Xi Ze didn’t hear a response, so he tilted his head in doubt.",
        "“Ah?” Ye Er was still lost in thought, staring absentmindedly at the female zerg’s face. “What did you say?” ",
        "“I said…”",
        "Xi Ze intended to repeat himself, but suddenly stopped in mid-sentence.",
        "The male zerg reached out his hand and touched his hair. His fingertips, carrying a faint warmth, traced along the sideburns, stopping at the newly healed wound on the earlobe.",
        "“I forgot to tell you.” Ye Er’s eyes were full of smiles, and he quietly said, “Good morning.” "
    ],
    "previous": "Chapter 10",
    "next": "Chapter 12"
}