{
    "title": "Chapter 26.2",
    "content": [
        "Translator: Deyonna",
        "Even though reason clearly told him that these military females were giant zergs with thick skin, he couldn’t help but recall the soldiers and firefighters from his previous life, who were admirable and respected. ",
        "However, despite defending the territory and protecting the people, the identity of these military females doesn’t seem particularly special here.",
        "The number of female zergs in the Zerg race is so vast, it’s practically overflowing. So much so that losing a large number on the battlefield doesn’t cause any regret; it’s even seen as a way to lighten the burden on the planet.\n",
        "",
        "Furthermore, because male zergs are scarce, only high-ranking military females can pair with them. Synthetic pheromone replacements and soothing agents are expensive, and many ordinary military females, while surviving the battlefield, die from pheromone deficiency and mental power instability.",
        "Such a cold and cruel law of social elimination. ",
        "Ye Er had crossed over into the Zerg race for a long time, and though he intentionally avoided deep social interaction, he still knew most of their common knowledge. But knowing and accepting are two different things.\n\n",
        "Elaine, however, seemed to regard this scene as a common occurrence, with a smile on his face that didn’t diminish in the slightest. His tone remained cheerful and upbeat.",
        "“Your Excellency, this way, please! The VIP lounge is just down this corridor…”",
        "His voice wasn’t loud, but in the extremely quiet corridor, it carried quite clearly. Several military females were awakened and looked up towards them.\n\n ",
        "Ye Er happened to lower his head and meet a pair of miserable eyes, deep and clear, stained with blood and dust. They stared silently back at him from a meter away.",
        "The blinding, vague white light outside the window casts a hazy veil over the chaos, making it seem quiet and solemn.",
        "In this unusual silence, he could clearly hear his own heart beating like a drum.\n\n",
        "It felt very… strange, like a detached NPC who had been following the script, finally acknowledging and slightly integrating into this real world. ",
        "He could sense the sadness and pain of the natives, truly beginning to empathize with their complex and vast social emotions.",
        "He stood there in a daze until that military female lowered his head and closed his eyes.",
        "“Doctor! Doctor…!”",
        "A hoarse, urgent cry suddenly erupted. The next second, the door to the ward next to Ye Er was flung open with force. ",
        "“Where’s the doctor?! Alvin can’t hold on much longer! Have the pheromone replacements arrived yet?”",
        "A military female with bloodshot eyes strode out. The few soldiers staying by the door instantly stood up. Hearing the pained groans from inside, their expressions turned extremely grim.",
        "“Get out of the way! Don’t block the door!”",
        "The doctor, arriving at top speed, swept into the ward like a whirlwind. He didn’t even have time to close the door before connecting the equipment and starting emergency treatment. ",
        "The military female who had initially burst through the door had a tough look on his face, but his voice trembled uncontrollably. “…It’s useless. Without the pheromone replacement this time, Alvin won’t last a few days.”",
        "The tough, iron-blooded military females standing around looked at each other, their eyes red-rimmed, unable to utter a word.",
        "",
        "Pheromones on the market are all luxury goods. Even in peacetime, they are in short supply, and during wartime, it’s almost impossible to find even a few bottles.",
        "The hospital’s reserves weren’t much to begin with, and they’ve been depleted during the past few days of war. The supply from the Main Star was also completely out of the question. ",
        "They were already fed up with hearing the hospital’s excuses, but the truth was, there simply weren’t any pheromones. They could only watch helplessly as their comrade died before their eyes.",
        "The emergency treatment only lasted a few minutes. When Ye Er looked up, the doctor’s hand had already stopped. The military female named Alvin was hidden behind a stained blue curtain, making it impossible to see his specific figure or appearance.",
        "Only one hand hung limply from the bed, its knuckles hard and defined. Veins snaked across the back of the hand, stained with mottled gunpowder and blood, casting a light gray shadow on the floor.",
        "Elaine, unsure when he arrived behind Ye Er, was also looking into the ward. His usual exaggerated smile was gone, replaced by a hidden sadness in his eyes. ",
        "His voice was very light. “Shall we go in and take a look?”",
        "Ye Er’s eyelashes trembled as he shifted his gaze to the female zerg who had been so out of tune just moments ago. A slight expression of understanding crossed his face, but in the end, he silently nodded.",
        "Seeing that the male zerg was willing to go in, he quickly stepped forward, pushing aside the military females and doctor crowding around the bed, creating a spacious spot.",
        "“No unauthorized zergs allowed… Little Director, why are you here?” ",
        "The doctor’s irritation morphed into surprise. He glanced at the female zerg, then at the zerg behind him, before taking a step back.",
        "No matter what, this military female named Alvin was doomed to die soon. There was no way to conjure up pheromones out of thin air.",
        "And it wasn’t just the pheromones. Mental power riot, damaged foundations, complications… any one of them could be deadly.",
        "Don’t even mention the director’s own second female child. Even if the director himself came personally, he wouldn’t be able to save him. ",
        "He sighed, defeated, and set down the emergency medical equipment in his hand. Turning to the indignant and grieving female zergs around him, he said, “There’s nothing the hospital can do… I mourn for your loss.”",
        "Those words set the military females off completely. The military female who had initially rushed out to call for the doctor abruptly stood up, roaring like a wounded beast in violent rage.",
        "“He’s not dead yet! What are you mourning for?! If you can’t cure him, get out! We don’t need your fake sympathy… Who are you, standing here watching the show? Get the fuck out of here!”",
        "“Calm down!” ",
        "Elaine spoke coldly, shielding Ye Er behind him with a hand, preventing him from being accidentally injured by the ignorant military female. At the same time, his peripheral vision kept darting towards the male zerg’s expression, his brow furrowed with anxiety.",
        "“How am I supposed to be calm?! It’s not your comrade that is dying. This lousy hospital can’t even get a few vials of pheromones, and those male zergs are too busy getting drunk and wasted to even provide that much value! I see, this empire is rotten to the core…!”",
        "",
        "His comrades on the side tried to restrain him with their combined efforts. The scene was chaotic, and the struggle nearly escalated into a full-blown brawl.",
        "Ye Er seemed unable to hear the dispute, his hand gripping the rusted bedside rail. He lifted a corner of the curtain, his attention fixed on the military female in the bed. ",
        "It was a military female with a crew cut and a determined face. He was tall and strong, barely fitting in the narrow bed.",
        "His □□ upper body was crisscrossed with countless bone-deep wounds. For no reason, it reminded him of a whale caught in a propeller, its flesh torn apart brutally.",
        "When he first picked up Xi Ze, the wounds from the torture were still fresh.",
        "However, with each treatment, the injuries he sustained during the war began to surface more prominently—more severe, deeper, and numerous, piling up in a way that was almost ghastly to behold. ",
        "Ye Er snapped out of his thoughts, suddenly wrinkling his brow. He bent down slightly and sniffed the air.",
        "The military female emitted a scent that was both unfamiliar and strangely familiar. Based on what the doctor had said earlier, this military female was in a weakened state, having forcibly suppressed his estrus period after it went out of control.",
        "The area surrounding the bed was filled with a volatile yet weakened mental power, clearly in the later stages of a mental riot.",
        "“Shut up!” ",
        "Elaine finally snapped, his loud bellow silencing the military females in the ward.",
        "He glared at the military female, who had an expression of indignation and grief, and quietly warned, “If you keep making trouble, Alvin will really be beyond saving!”",
        "He glanced at Ye Er, standing by the bedside, out of the corner of his eye.",
        "The meaning of his words, along with his subtle gesture, was so clear. ",
        "Those military females froze, almost incredulously following Elaine’s gaze towards the “sub-female” who had been brought into the ward.",
        "No, maybe it wasn’t a sub-female, but…",
        "But could it really be possible?",
        "On this barren planet, one that even the dogs of the nobles would disdain, in this old battlefield hospital, beside the bed of a tormented military female on the verge of death— ",
        "Could a male zerg actually show up?",
        "Elaine’s eyes had already provided the answer.",
        "",
        "But compared to the arguments and misery filling the room, the male zerg’s expression was undeniably cold. His pure black eyes were clear, yet like a frozen lake without waves or ripples, there was nothing that could be reflected within them.",
        "The expression of the military female, who had been roaring in indignation just moments ago, turned stiff. Without doubt, he scorned those rotten male zergs who wallowed in luxury and extravagance. He had practically insulted the male zerg to his face. One can imagine how difficult it would be to obtain even a bit of his pheromones. ",
        "…but that was the only way to save Alvin.",
        "In the extremely quiet, narrow space, a dull thud suddenly struck through the silence, like a mountain collapsing with a resounding crash.",
        "Ye Er snapped out of his contemplation, only to see a military female kneeling straight before him. His face was very pale, but the shine in his eyes was determined.",
        "His voice, soaked in exhaustion and grief, was hoarse and unpleasant, stumbling over the words as he pleaded in a low, humble tone. ",
        "“Your Excellency, please save him. He only needs a bit of pheromones… Alvin is an outstanding soldier. He saved many people during the war. He has always…”",
        "He was completely different from his earlier tough and cold demeanor; there wasn’t much humiliation in his expression. Kneeling for the life and death of a comrade wasn’t really a difficult choice.",
        "Realizing that the male zerg might not be interested in this, the military female abruptly stopped and changed his approach.",
        "“We can buy it. You can name any price in star coins… I have lots of military merits from this war. You can take them all if you want…!” ",
        "“I’ll also give you my military merits. Please save Alvin!”",
        "“You can also have mine…”",
        "“Mine too…”",
        "“We b-beg you…” ",
        "The ward was filled with a sea of kneeling figures, their begging and confirmations rising in a chorus. The scene was even awe-inspiring. And at the center of attention, carefully watched by dozens of eyes, was Ye Er.",
        "But the male zerg’s face remained indifferent, revealing nothing of his mood. With each passing moment, Elaine’s heart lurched and sank further.",
        "…He was still too hasty.",
        "Although their time of interaction had been short, it was clear that the male zerg’s temperament was not easily swayed. ",
        "Now, the situation had become so embarrassing; in his eyes, it was probably nothing more than blatant calculation and threats.",
        "However, that was indeed true. After learning from Hughes that there was a male zerg in the hospital, with a good temperament and character, and a certain probability of obtaining pheromones, he had gone to great lengths to bring the zerg here.",
        "Please visit chrysanthemumgarden (dot) com",
        "The path they had taken earlier was not the one leading to the VIP lounge, but one he had deliberately chosen to deceive the male zerg.",
        "He had intended to take things slowly, but Alvin couldn’t wait any longer. However…perhaps he had been too hasty. ",
        "It was his fault. If the male zerg was truly angered by this, not only would Alvin not be saved, but all the military females who had knelt for him would be punished.",
        "Elaine closed his eyes, about to turn back, when he saw Ye Er move, taking a step back.",
        "He didn’t look at the numerous military females kneeling at his feet, his expression calm as he lowered his gaze.",
        "“Let’s go.” "
    ],
    "previous": "Chapter 26.1",
    "next": "Chapter 27.1"
}