{
    "title": "Chapter 32.1",
    "content": [
        "Translator: Deyonna",
        "“Did he agree? Did he agree? … What did the email say?” ",
        "Several professors from different colleges eagerly stared at the dean’s terminal, but they saw the dean’s expression gradually freeze, and he finally sighed helplessly. “He declined.”",
        "“Impossible! Absolutely impossible! Did you not send the email sincerely, Old Nor? Or did you forget to attach our school’s prospectus?”\n",
        "",
        "“Did someone leak the news and let the Imperial Star Military Academy poach him first? That’s clearly a good seedling for research. He should come to us!”",
        "“Quiet down.” ",
        "Norman adjusted his monocle and said softly, “The kid mentioned in the email that he has social phobia and has already resolved his financial crisis, so he won’t be coming.”\n\n",
        "The meeting room fell silent for a moment before an old professor spoke in a rough, shaky voice, “How about we don’t ask him to come in person and continue our exchanges online?”",
        "“We can’t rush this matter!”",
        "Norman found it both funny and frustrating, so he waved his hand to dismiss the meeting. “I’ll try to contact him again later.”\n\n ",
        "The small temporary meeting ended quickly. Only one highly respectedprofessor remained seated. Seeing Norman’s solemn expression, he offered a few words of comfort.",
        "Norman put down the documents in his hands and sighed at the old professor. “I think it won’t be that easy.”",
        "“What makes you say that? Is there any other reason?”\n\n",
        "Norman brought up another matter, his voice filled with regret. “I wonder if you still remember the male zerg named Ye Er that appeared before?” ",
        "“That one male zerg who was picked up from the battlefield, knew nothing about the Zerg race, didn’t even understand the language, and yet completed advanced education courses in two years?”",
        "The professor recalled that the incident had caused quite a stir at the time. Many minor nobles became motivated, wanting to recruit him to their camp.",
        "“But a D-level male zerg… his skill level is what it is, and his upper limit won’t be much higher. In fact, no one has attached much importance to him.”",
        "“Unexpectedly, that male zerg rejected all invitations and even seemed to drop out of school. After leaving the Main Star, he completely disappeared.” ",
        "“His abilities and talent are exceptional, and his character was also pretty good.”",
        "Thinking back to the examination video he had watched before, the professor made a conclusion, but seeing Norman’s complex expression, he was suddenly startled. “You mean…?”",
        "“Yes, it’s him.”",
        "The professor lamented, “Then it’s really difficult. I remember that because of that certain incident, he was placed on the red alert protection list. An alarm would go off wherever he went, which must have been very vexing. That’s probably why he chose to leave the Main Star.” ",
        "Norman kneaded his brow somewhat wearily. “I’ll think about it again. That kid, Adelaide, is so stubborn… none of them are easy to deal with!”",
        "“Axon is a reputable research institute. It is the lifeblood that supplies the academic world with high-quality, fresh talent. Its reputation and status are almost comparable to those of the Imperial Military Academy… Won’t you reconsider?”",
        "",
        "Xi Ze glanced at the familiar logo and then looked up at the male zerg with a troubled expression. After a moment of thought, he softly advised him.",
        "After all, it was a pity to give up an opportunity to improve oneself. The resource supply between the Zain Star and a marginal star like Aitar was like heaven and earth. ",
        "Te Sr hesitated for a moment. Le had already checked the information about this school when he received the payment. It was indeed a very good school, but…",
        "“Forget it.”",
        "Confirming that the email had been sent, he tossed his terminal aside, feeling a sense of hopeless resignation, like a rebellious teenager who hated school.",
        "“I don’t want to go to a place full of zergs and interact with all kinds of Zerg races. It feels too draining. I’d rather just stay home and study.” ",
        "Catching a hint of annoyance and fear in the male zerg’s eyes, Xi Ze was slightly startled and unconsciously softened his tone. “It’s okay. You don’t have to go if you don’t want to.”",
        "Ye Er hummed vaguely through his nose and slowly slid down, skillfully settling into a comfortable position on the sofa.",
        "“I stayed up late again last night. I’ll take a nap first. You can just find something you want to do…”",
        "Xi Ze picked up the terminal that had rolled onto the floor. Glancing at the male zerg’s sleepy face, his fingertips subconsciously stroked the terminal’s glossy surface. ",
        "But after a moment’s hesitation, he placed the terminal on the coffee table and reached out to tuck the quilt around Ye Er. “Okay, you rest first.”",
        "When Ye Er woke up in a daze, bright sunlight streamed in from outside. The female zerg was leaning against the sofa, arms crossed, with his eyes closed as he rested.”",
        "But even while resting, Xi Ze kept his shoulders and back tense, lacking any appearance of weakness or powerlessness. His slightly furrowed brow looked serious and unapproachable, as if he were a bit uncomfortable.",
        "Ye Er felt a bit embarrassed for hogging the other’s bed. His ears turned slightly warm, yet he also felt inexplicably at ease and relaxed. ",
        "“Male Lord?”",
        "Xi Ze opened his eyes when he heard the movement, then pinched the bridge of his nose to drive away the drowsiness. His somewhat cold expression gradually melted. “You’re up? Are you hungry?”",
        "“Not really. What time is it now…” Ye Er lifted the quilt and got out of the sofa and suddenly remembered he had things to do today. “I have an important matter to attend to now.”",
        "Xi Ze hesitated for a moment. “Where are you going?” ",
        "“To the war zone hospital. It’s the day for the agreed pheromone exchange. I’ll also pick up your test results while I’m there.”",
        "Ye Er put on the coat draped over the back of the sofa. “Tell 015 not to make lunch for me.”",
        "",
        "“Okay, be careful on the road.”",
        "Ye Er turned to look at him. The female zerg on the sofa was looking intently at him, making him feel a little dazed for a moment. ",
        "This scene looked like every time he had gone out before, Tangyuan would already be waiting at the doorway, its dark eyes moist and its nose making whimpering sounds of reluctance. Its soft tail would rub against his pants longingly.",
        "“I’ll be back soon.”",
        "He subconsciously whispered, then curved his lips into a smile. “…See you later.”",
        "After he left, the room became quiet. ",
        "The balcony curtains swayed and slipped off the hooks, casting a large, light shadow in the living room.",
        "Ye Er pulled the hood of his coat further down. The fluffy hood, mask, and scarf wrapped him up tightly.",
        "Soon, a silver hovercar descended from the sky.",
        "A female zerg jumped out of the driver’s seat and eagerly helped him open the door. “Please get in, Your Excellency. I’m the driver responsible for picking you up this time.” ",
        "Ye Er thanked him, stooped down to get in, and then the car door was gently closed.",
        "The hovercar traveled very smoothly, and the heater was turned up very high, making Ye Er feel a bit stuffy. It was a temperature that would easily make one drowsy.",
        "But when he inadvertently glanced up, he caught a pair of eyes in the rearview mirror that quickly looked away. There seemed to be an unknown shadow flashing through those eyes, making the female zerg’s expression look a bit terrifying.",
        "“What are you looking at?” ",
        "“Nothing. I was just making sure your seat belt was fastened. Your Excellency’s safety awareness is exceptional.”",
        "It was supposed to be just a small incident, but the dark, obscure gaze—vague and elusive—clung to him like slime, making Ye Er feel quite uncomfortable.",
        "His finger hovered over the emergency call button on his terminal. Ye Er looked up at the rearview mirror again and, this time, met a pair of pitch-black eyes directly.",
        "Without averting his gaze, he slowly said, “What are you looking at this time?” ",
        "The driver had a flustered and apologetic expression as he quickly looked away.",
        "“It’s because Your Excellency is so good-looking, I couldn’t help myself… I’m really sorry, Your Excellency… If you don’t like it, I’ll stop looking…”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "As expected, the clinging gaze disappeared completely for the rest of the journey, but Ye Er’s hand remained on the emergency call button until the hovercar came to a smooth stop at the hospital’s entrance.",
        "The female zerg got out first and opened the door for him, respectfully saying, “We’ve arrived, Your Excellency.” ",
        "Ye Er said nothing, unbuckled his seatbelt, and directly got out of the car, walking immediately into the hospital.",
        "“I’m really sorry, Your Excellency.”",
        "The voice came from behind, carrying a strangely gloomy smile. “But I’ll probably be the one to pick you up next time.”",
        "Ye Er didn’t say a word and walked towards Elaine, who was standing at the hospital entrance to greet him. Before the female zerg could smile, he said coldly, “Replace this driver immediately.” ",
        "He didn’t even avoid the driver who hadn’t left yet. His slightly low voice was cold and sharp.",
        "Elaine was stunned and subconsciously wanted to ask why.",
        "But the moment he met the male zerg’s gaze, he realized that Ye Er wasn’t consulting him, but simply informing him of the predetermined conclusion.",
        "He nodded respectfully and said in a deep voice, “Of course, if that’s what you want.” ",
        "Given the unpleasant incident that had just happened to the male zerg, Elaine was very cautious all the way.",
        "He was afraid that if the male zerg was unhappy, he would withdraw from the agreement, which would be a real disaster.",
        "But in fact, that episode didn’t affect Ye Er’s efficiency. In less than ten minutes, the extraction was completed, and he was invited into the VIP lounge after leaving the collection room.",
        "“The female zerg’s examination reports are all in. I’ll call the doctor so he can give you a specialized explanation.” ",
        "Elaine, who had successfully obtained the pheromones, was overjoyed. He woke his terminal to call the zerg who had been waiting outside.",
        "“Currently, your female zerg’s condition is not too optimistic.” The attending physician handed the examination reports to Ye Er.",
        "“You mentioned that his eyes have healed preliminarily. This was much faster than we expected, which proves that his damaged self-healing ability was gradually recovering. That’s excellent news for subsequent treatment.”",
        "“However, the female zerg’s leg bones are dislocated, and one of her kneecaps is perforated. She may need surgery, but before that, we need to further assess the condition of her legs and rehabilitate them to a stage where surgery can be performed.” ",
        "The doctor observed Ye Er’s expression. Seeing that he had nothing to say, he continued.",
        "“As for the bone wings on his back, there’s really nothing we can do. Although there have been cases of bone wing regeneration, those typically involve broken or damaged wings, which are far from being completely uprooted.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er looked at the few reports, his brow slightly knitted.",
        "Elaine sighed. “If only there were a treatment cabin. That thing heals wounds very quickly and leaves no residual effects.” ",
        "“But treatment cabins are so pricey that one could buy ten hospitals like ours. There’s no way to get one… so we still have to treat him slowly.”",
        "Ye Er lowered his eyes thoughtfully and hummed. “Continue.”",
        "An hour and a half later.",
        "The doctors who had come in succession began to walk out and returned to their respective posts. ",
        "“Would Your Excellency like to stay for lunch? If not, I can drive you back…”",
        "Compared to the grand and imposing manner in which male zergs were usually received on the Main Star, the current situation was incomparably crude and direct, making Elaine feel a strange sense of guilt and unease.",
        "He tried to make amends in various ways. “Or I can just send you to the entrance.”",
        "Ye Er lowered his eyes, put on his mask, and waved his hand casually, stopping Elaine, who was trying to follow. ",
        "Instead of leaving the hospital, he walked slowly along the corridor.",
        "It had been a few days since his last visit, and most of the military females had been properly settled, no longer crowded in the corridors covered in blood as before.",
        "He subconsciously passed by that same ward as last time and looked through the narrow glass embedded in the door. There were no military females inside, probably because they had all gone to eat lunch.",
        "Just as Ye Er was about to look away, a faint sound of collision came from inside. He instinctively looked at the source— ",
        "And met a pair of sea-blue eyes.",
        " "
    ],
    "previous": "Chapter 31.2",
    "next": "Chapter 32.2"
}