{
    "title": "Chapter 30.2",
    "content": [
        "Translator: Deyonna",
        "The voice from the terminal was gentle and calm, without any ripples. However, after working together for so long, Adelaide could still discern the subtle differences. ",
        "He was angry, very angry. But why?",
        "“Help me solve this matter, and I’ll increase my daily online time by one hour.”\n",
        "",
        "The online time that Ye Er was referring to was the ‘exchange learning,’ which was rather stingy–only three hours a day. Adelaide had scorned this unreasonable arrangement for quite some time.",
        "Hearing this condition, he cast aside all logic, laws, and morals, agreeing readily— ",
        "“Say, how can I help?”\n\n",
        "After a series of tedious steps, Adelaide followed the path from the email account that Ye Er provided, traced it to several terminals, and with incredible speed, breached their defenses and completely took them over.",
        "Through the micro-camera on the terminal, one could see that the holders were a few unruly female zergs. They looked violent and were wearing uniform work vests, and there appeared to be a tiny text on their name badges.",
        "Adelaide narrowed his eyes and read the text aloud. “… Exchange?”\n\n ",
        "His screen was shared with Ye Er’s terminal, so the scene he was seeing was also displayed in Ye Er’s eyes.",
        "The female zerg in the camera had a distorted expression as she questioned the scar-faced female zerg in front.",
        "“Andrey, what do we do now? Even if you beat me to death, I dare not believe that person would want to see these videos…”\n\n",
        "“How much stock footage is left?” ",
        "Andrey, biting on a cigarette, looked gloomy and perverse. “We can drag this out for as long as possible. That female slave can’t run away. We’ll just wait for the chance to snatch him back.”",
        "This was the one who had his finger bitten off in the video. The identity matched.",
        "Ye Er lowered his gaze and carefully pondered for a moment.",
        "“I’ll transfer 5,000 star coins to you. You will then transfer them to his terminal, change the date to December 22nd, mix it in with the previous transaction entry, and label it as No. 36. Make sure not to leave any trace.” ",
        "Adelaide raised his eyebrow slightly but didn’t ask why. After manipulating the panel for a while, he swiftly transferred the money as instructed. “Done.”",
        "“Then?”",
        "“They’ve bombarded me with threatening emails. Don’t look at the content, just delete all those initial emails.”",
        "Ye Er went silent for a moment, then continued, “Can you implant a virus in their chips to prevent them from contacting me in any way? Or maybe I can install something on my end to completely cut off my connection with them.” ",
        "“I can install a blocker on your end, preventing any zerg except those you specify from sending you any messages.”",
        "Ye Er nodded decisively. “That’s pretty good.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "A series of tapping sound followed, then after a long beep, Adelaide’s voice sounded.",
        "“The emails have been deleted, and the blocker has been installed. Then—” ",
        "“Then—”",
        "Ye Er’s words overlapped with his.",
        "Adelaide’s words paused as he heard the voice in his ear grow calm to the point of coldness.",
        "“Dlow up their terminals.” ",
        "Adelaide’s eyes showed surprise, but he duickly snorted in amusement before deftly tapping a key with his fingertips",
        "“As you command.”",
        "“Deep—!!!”",
        "The moment his finger bounced back, the terminals immediately entered self-destruct mode, and the bright red progress bar loaded fully in a second. ",
        "“Andrey, what’s wrong with your terminal? It’s been flashing red…”",
        "“Bang—!!!”",
        "“Bang, bang, bang, bang, bang—!!!”",
        "“Ahhhhhhhhhhhhhhhhhhhhhhhhh!!!” ",
        "“My hand, ahhh! The terminal… gone. My hand is gone, ahhh! Quick, call an ambulance, go quickly!”",
        "“Hurts! It hurts so much!! How could the terminal suddenly explode? My hand, ahhh—!!!”",
        "One after another, deafening explosions rang out. The advanced terminal’s defense power was so immense that it could blow off an entire hand.",
        "The scene was momentarily filled with flying flesh and blood, and horrific screams mingled with roars, echoing in all directions. ",
        "It was as sweet as heavenly music.",
        "Ye Er narrowed his eyes, feeling his heavy, clogged chest finally clear a bit.",
        "",
        "Adelaide, who was equally enjoying the scene, had a look of faint understanding, as if he had finally guessed something.",
        "After the terminals are blown up, they will definitely purchase new ones and transfer the data into them. The forged transaction records will also be mixed in, leaving no trace of intrusion behind. ",
        "“Using fraudulent transactions and sending fake videos to deceive their superiors. If this gets exposed, it would be a serious dereliction of duty.”",
        "He stopped there, then curled his lips and praised. “You’re really cunning.”",
        "“Thanks for today.”",
        "Ye Er didn’t comment on his words but simply replied briefly, receiving an equally satisfied response. ",
        "“You’re welcome. Remember to stay an extra hour tonight.”",
        "Closing the communication with Adelaide, Ye Er stroked the surface of the terminal and made a voice call.",
        "“Hello, may I ask if this is the city machine’s unified control center?”",
        "For the first time, he used his privileges as a male zerg. With just a few words, he replaced the surveillance footage of him picking up Xi Ze on a snowy night and the footage of the city machine chasing the female zergs, and he requested that the archives be deleted. ",
        "Without taking a rest, he continued to make calls—",
        "“Dr. Hughes, do you have access to the hospital’s surveillance?”",
        "“Director Elaine, could you do me a favor?”",
        "Ye Er walked to the window, closed it, and relaxed slightly after receiving an affirmative answer. He smiled gently and said, “Yes, that’s right… Alright, thanks a lot.” ",
        "Only after finishing all these things did his expression soften. He also deleted the video sent in the email, ensuring that the terminal was completely clean and left no trace.",
        "After calming down for a while, he picked up everything on the floor and put it back on the table, making sure that 015 wouldn’t discover anything unusual.",
        "Finally, Ye Er withdrew the surrounding mental power barrier and opened the door to leave the room.",
        "The living room was empty, looking somewhat vacant and lonely. ",
        "“Okay, do you see the red wire inside? One end is connected to… pull it out and plug it into the port next to…”",
        "The female zerg’s voice came from outside the small balcony, and 015’s voice seemed to be mixed in as well. Ye Er paused for a moment and walked outside.",
        "",
        "On the balcony, 015’s belly was wide open, revealing the complex circuitry and interlocking gears inside. A small mechanical heart was beating rhythmically.",
        "And the ground was littered with its dismantled parts, creating a somewhat frightening scene. ",
        "“Oh, oh, okay, let me look.”",
        "Hearing the female zerg’s instructions, it quickly lowered its head to find the corresponding circuit, rummaging around inside.",
        "The weather was fine, and the sunlight poured in like water, casting a shimmering light on the small balcony’s floor as a breeze swayed and billowed the curtains.",
        "Xi Ze was sitting in his wheelchair, at the far left side of the small balcony. ",
        "The golden light blurred the female zerg’s outline, and tiny specks of light danced on his hair and eyelashes.",
        "His eyes were half-closed, as if he were completely immersed in the sunlight, only occasionally issuing simple instructions.",
        "Hearing the sound of him coming over, Xi Ze turned his head and called out with a light smile, “Male Lord.”",
        "The scene from moments ago flashed before his eyes, making Ye Er’s breathing sluggish. ",
        "But when he came to his senses, the female zerg’s face was clean, with no trace of blood.",
        "The numerous unsightly scars on his body had healed for the most part and were neatly hidden under decent clothing.",
        "The scenes in the video had truly been left in the past.",
        "“Okay, what’s next?” ",
        "015’s voice cut through the silence between the two of them, drawing Xi Ze’s attention.",
        "The constant dread that had been haunting him finally began to dissipate a little.",
        "Ye Er leaned against the balcony door, somewhat exhausted, watching as Xi Ze continued to guide 015 in reorganizing its parts.",
        "He was indeed a military female. ",
        "Fit, strong, neat, and honorable. This was how he should have looked.",
        "It was completely different from the way he appeared in the video—naked, arbitrarily tortured and humiliated, and crushed into the mud.",
        "",
        "The derailed train, after stumbling over a muddy path, finally returned to the right tracks and gradually revealed its original dazzling radiance.”",
        "It should have been this way all along. ",
        "Ye Er took a deep breath, his heavy heart finally lightening, and his mood gradually livening up.",
        "“What are you doing?”",
        "He asked, and although he had already guessed, he still asked symbolically.",
        "“I’m helping 015 simplify some programs. This version of the smart housekeeper was phased out because it had too many redundant programs. A moderate modification can make it run more smoothly.” ",
        "Xi Ze’s familiarity with machinery and modifications was exceptionally high. After all, he was a military female who had been dealing with mecha and advanced weaponry for many years.",
        "“I’ve passed most of the mechanical certifications, and they’re all at the highest level.”",
        "Xi Ze coughed lightly, looking a bit embarrassed by his boasting. “So you don’t have to worry about 015 being damaged. Moderate modifications can extend its lifespan by at least twenty years.”",
        "Ye Er looked at the harmonious scene before him, lost in thought. After a while, his lips curved up slightly as he chuckled and said, “So amazing.” ",
        "Sensing the male zerg’s slightly off mood, Xi Ze turned his head slightly.",
        "But all he saw was a large patch of warm yellow. The male zerg’s figure appeared as a blurry gray shadow, looking inexplicably downcast and lonely.",
        "He curled his fingers around the wheels of the wheelchair and rolled forward a few circles to approach the male zerg, asking softly, “What’s wrong? Did something happen?”",
        "“Nothing.” ",
        "Ye Er didn’t want to talk about it, his eyelashes drooping slightly. “Nothing at all. Don’t worry.”",
        "“Is that so…”",
        "Sensing the male zerg’s evasion and perfunctory response, Xi Ze pursed his lips but couldn’t ask anything further. His hands on his knees tightened up slightly.",
        "Ye Er raised his eyes again, looking at the female zerg in front of him, and smiled. “Can I have a hug?” ",
        "Without waiting for Xi Ze’s answer, he bent down and opened his arms, wrapping the female zerg in his embrace.",
        "The warm body filled every corner of his arms, as if he was completely buried in the belly of a fluffy snow leopard, soft and warm. Ye Er let out a somewhat contented sigh.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Male Lord, what’s wrong…?”",
        "Xi Ze’s voice was very soft. His fingertips spasmed for a moment as he hesitantly caressed the male zerg’s thin back, patted it lightly, and after hesitating for a long time, restrainedly tightened his arms and hugged him back. ",
        "Xi Ze’s voice was very soft, and his fingertips spasmed for a moment as he hesitantly caressed the male zerg’s thin back and patted it lightly. After a long hesitation, he restrainedly tightened his arms and hugged him back.",
        "“It’s nothing. I came across some filthy things, but I’ve already cleaned them up.”",
        "His downplaying voice came from the side of his ear, soft and with an almost coquettish lilt at the end.",
        "“I’m a little tired… so give me a hug.” ",
        "“…Okay.”",
        "The air gradually quieted down, the afternoon glow gradually lost its vivid color, lightly dyeing the rolling clouds.",
        "Fine snow drifted down from the sky, reflecting a bit of golden light, like falling twinkling stars.",
        "The embracing shadows, which had originally reflected their own clear outlines, gradually melted and overlapped with the shifting sunlight, becoming indistinguishable from one another. ",
        "After a while, 015’s head suddenly popped up, blinking its pea-like eyes.",
        "“Are you done hugging? Which line should I take next?”"
    ],
    "previous": "Chapter 30.1",
    "next": "Chapter 31.1"
}