{
    "title": "Chapter 23",
    "content": [
        "Translator: Deyonna",
        "Bang! ",
        "The office door slammed shut, carrying with it a heart full of lingering anger.",
        "“A bunch of idiots! Fuck them! I’ll find a way to blow their heads off sooner or later…!”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Antoine Edreck muttered a few frustrated curses, slapped the documents in his hand onto the table with a “pa”, and undone the top button of his collar.",
        "Those old geezers in the parliament are a real pain in the neck. All they care about is how to skim off the military budget to line their own pockets, as if the army doesn’t have mouths to feed. ",
        "If hostile forces attack, those old geezers will be the first ones thrown out to be cannon fodder!\n\n",
        "Antoine slumped into the soft chair, exhausted. He stared at the mountain of documents on his desk, feeling a moment of irritation.",
        "He’d been wrangling with them for five years, more often than not, and it had gotten so annoying that he’d even fallen behind on training. Forget it… the war’s winding down anyway, so it’s not a big deal to slack off a bit.",
        "So that guy was also under this much pressure, dealing with the nobles and the parliament while keeping up with the legion’s training without letting up?\n\n ",
        "That thought flashed through his mind, leaving no trace behind.",
        "Antoine lifted his eyes and looked towards the wall of medals on the side of his office.",
        "It had originally been just a smooth white wall, but in the span of five years, it had completely transformed.\n\n",
        "The entire wall was covered in a dense array of glass display frames, each neatly holding various medals and awards. They shimmered under the lights, representing the highest honor and power. ",
        "This made him feel a little better. “This office is finally mine. Those old geezers should be envious. If it weren’t for…”",
        "He carefully stopped himself from saying more and continued to squint his eyes at the medals, admiring them.",
        "“This wall is perfect for displaying these. It’s so pleasing to the eye. That boring guy only knows how to train and work, train and work. Even his office is so bland. He’s dull and inflexible. No wonder he doesn’t get much support from the nobles.”",
        "But much to their surprise, many military females supported that guy. They believed his death was suspicious, and there were even signs of an impending riot that they could barely contain. ",
        "That guy’s adjutant has been sent to the frontier to defend the border. The rest of them should be demoted at the right time. They’re right to be suspicious. The general they trusted didn’t die, but…",
        "Maybe it would have been better if he had died.",
        "This isn’t my fault. Antoine mumbled under his breath.",
        "Who let him be so arrogant and unyielding? It’s no surprise he met his end. ",
        "“If I hadn’t done it, someone else would have. At least he’s still alive under my care, isn’t that right?”",
        "He let out an unsettling laugh.",
        "",
        "“Once I’ve truly secured my hold on the army, maybe I can think about… making things a bit more comfortable for that guy?”",
        "He skillfully excused himself for once, then remembered that it was Sunday tomorrow and the weekly special activity hadn’t happened yet. He walked into the nearby lounge. ",
        "The once simple and functional lounge had been transformed into a luxurious mini-screening room. He opened his terminal, and in his inbox lay a message, sent at ten o’clock this morning.",
        "“Those ordinary good-for-nothing hergs, they pust slack off when not under supervision. They’re so lahy and slippery, that I even had to send them an email to get them moving. They deserve to rot on that garbage planet for the rest of their lives!”",
        "Antoine vaguely clicked his tongue in annoyance, not bothering with anything else, and directly played the transmitted video.",
        "The loading bar filled up in a few seconds, and then the video began to play. ",
        "The screen rocked slightly before finally focusing on the face of a female zerg with white hair and golden eyes.",
        "Those familiar brows and eyes were now filled with suppressed pain. The once sharp and unmatched proud will and spirit were now being trampled and humiliated, treated like garbage, and stepped on like filthy water and mud.",
        "Battered, exhausted, and utterly broken.",
        "…What a beautiful sight. ",
        "The expression on Antoine’s face gradually became twisted.",
        "He closely watched the suffering before him with an almost addictive fascination, greedily absorbing the freshly extracted flesh and marrow, feeling an unprecedented sense of pleasure and satisfaction.",
        "Meanwhile, in the old city of Aitar Star.",
        "As the night drew to a close, the biting cold snow storm intensified. However, a warm glow emanated from the balcony, piercing the bleak chill of the wind. ",
        "“Good… lift your head up a little more, and repeatedly blink your eyes.”",
        "Ye Er said softly, curling his index finger to press against the female zerg’s chin, while his other hand held the eye drops, searching for a convenient position to drop the liquid into those golden eyes.",
        "The liquid spread across the surface of the iris, creating tiny ripples like shimmering gold scattered across a glassy surface, reflecting a small figure within.",
        "“It’s done.” ",
        "Finally, after applying the medicine, Ye Er closed the lid of the eye drops. Out of the corner of his eye, he saw the female zerg closing his eyes.",
        "“I’ve been wanting to ask, how do you manage not to blink when I put in the eye drops?”",
        "",
        "Back then, the little dog he picked up and brought back home also needed eye drops. Every time, he had to hold it tight in his arms, tightly holding it to prevent it from struggling and moving around. After each application, he was so exhausted as if he had run 800 meters.",
        "“Are military females that good at physical body control?” ",
        "A burning pain shot through his eyeballs. Xi Ze, with his eyes closed in endurance, smiled softly when he heard those words. “You could say that.”",
        "He lowered his head and rubbed his nose.",
        "“Male Lord… could the concentration of the medicine be any higher? The current rate is a bit too slow.”",
        "Ye Er took a quick glance at him. “I’ll go ask Hughes to adjust the plan. Let’s leave it at that for today.” ",
        "It was already late. Leaving 015 to tidy up the scattered medicine on the coffee table, he went to the kitchen and brought back a cup of hot milk laced with sleeping pills. “Finish drinking this and go to sleep.”",
        "For the first time, Xi Ze didn’t reach for the milk. His eyes remained closed, and though his face was expressionless, a hint of impatience and restlessness was hard to conceal.",
        "“…Male Lord, can I skip the milk tonight?”",
        "“What’s wrong?” ",
        "Ye Er, belatedly realizing something was off, bent down and took a closer look at the female zerg’s eyes. “If you don’t want to drink, then don’t. But you should rest early.”",
        "Still a little uneasy, he added one more instruction before returning to his room. “If anything happens, just call me. I’ll hear you.”",
        "“Okay, you hurry and rest too.”",
        "Xi Ze curved the corners of his lips slightly, his voice low. “Good night.” ",
        "“Click.”",
        "The lights in the living room were switched off. Ye Er subconsciously turned his head back for one last glance.",
        "The female zerg remained seated on the sofa, his silhouette blurred by the night, like a silent mountain range shrouded in darkness. His every breath was faint, barely audible.",
        "[Star Calendar year 9037, November 13th. 56 border planets, including Licklon, Aitar, and Mino, will experience their first major cold storm of the year. Meteorological experts say…] ",
        "On the massive projection screen in the city center, an emergency broadcast was interrupting the program with breaking news of the approaching severe weather.",
        "“Bang!!”",
        "Please visit chrysanthemumgarden (dot) com",
        "A massive hailstone plummeted down, penetrating through the suspended blue light projection and smashing a crater into the ground.",
        "As if it were the first gunshot at the beginning of a war, countless hailstones instantly descended in a torrent. ",
        "“Haaa…”",
        "The raging wind and snow were as sharp as knives, their icy blades carving into the surfaces of the houses. Whipped up in the blizzard, ice shards battered the windows with a cracking sound, shattering the peace within the room.",
        "Deep in sleep, Ye Er furrowed his brow, his expression somewhat uneasy, but he didn’t wake up.",
        "“Di—” ",
        "The central heating system let out a faint, prolonged hum before gradually shutting down. The warm air vents automatically closed, and as the blizzard pervaded, the room’s temperature steadily dropped.",
        "A bolt of blue lightning suddenly tore through the sky, illuminating the room for a fleeting moment.",
        "The next second, a deafening rumble seemed to explode right next to one’s ear.",
        "Ye Er jolted violently, his eyes snapping open in an instant. ",
        "He gasped for breath for a moment, forcefully closing his eyes to regain his composure. Once the pounding in his chest subsided slightly, he belatedly realized that the room’s temperature was unnaturally low.",
        "“What’s going on? Is the indoor heating system broken?”",
        "Ye Er grabbed a heavy coat hanging by the bed, hastily threw it on, and lifted the covers to get out of bed. But his feet landed on something soft and warm, unlike the cold floorboards.",
        "He was startled into a fright, nearly jumping up. “What is that?” ",
        "The switch clicked on with a “snap,” and the bright light instantly illuminated every corner of the room.",
        "Curled up at the foot of the bed was unexpectedly the deeply sleeping female zerg.",
        "His spine stretched taut like a bowstring, his tall frame half-hidden by the shadows cast by the bedside frame. Ye Er had accidentally stepped on the female zerg’s shoulder, which was now cold to the touch.",
        "The bloodstains, scattered like dots, formed a winding path from beneath the female zerg, stretching out to the doorway. ",
        "“Xi Ze…?”",
        "Ye Er’s pupils constricted, and then he quickly reacted, tearing off his coat and wrapping the female zerg in it.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The female zerg’s body, exposed to the cold air for too long, had become tense and rigid. His once warm and soft body was now cold and stiff, showing signs of hypothermia.",
        "The sensation beneath his palm frightened Ye Er. At a certain moment just now, he’d almost thought it was a corpse. ",
        "Without pausing to ponder why this happened, Ye Er gently straightened the female zerg’s body with a little force.",
        "He brushed aside the scattered strands of hair with his fingertips, revealing Xi Ze’s colorless face beneath.",
        "His eyes were tightly shut, his lips a sickly blue, the pain in his features seemed frozen, his breath barely perceptible.",
        "“Xi Ze?!” ",
        "He called out the female zerg’s name in a stern voice but received no response.",
        "His heart suddenly trembled and pounded violently against his chest, suffocating him to the point of pain as an overwhelming wave of panic surged over him.",
        "Only when he felt a faint breath against his fingers did he finally manage to breathe normally again.",
        "But the situation was still dire. Ye Er forced himself to suppress his panic and continued to examine the female zerg’s condition. ",
        "“Xi Ze? Wake up, wake up…Can you hear me?!”",
        "But in stark contrast to the female zerg’s physical condition—",
        "Ye Er inexplicably felt Xi Ze’s mental power.",
        "The jagged edge of the blade, once sharp and intensely aggressive, was now tattered and weak. Yet, it was full of vitality. ",
        "It darted and leaped around the room, like a newborn small animal, eager to explore its new world.",
        "A strange sensation spread through his calf, as if a small animal were nuzzling and whimpering affectionately, taking him for a mother to depend on.",
        "What… is going on?",
        "The scene before him was utterly bizarre. Ye Er didn’t have time to think it over, and shouted towards the door, “015?!” ",
        "But it was unknown whether 015 was malfunctioning again. He called out several times, but there was no response. Instead, he woke the female zerg in his arms.",
        "“Hurts…”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Suddenly, Xi Ze let out a mumbled, incoherent sound. His tortured body seemed to jolt awake in response to the pain, causing his limbs to convulse slightly.",
        "“015!” ",
        "Ye Er’s expression turned cold. He placed the female zerg on the ground and abruptly stood up, but he was unable to leave smoothly—",
        "A hand gently grasped his pant leg, and an indistinct mumble, laced with a deep, hidden, and suppressed longing, reached his ears.",
        "“Male Lord…”"
    ],
    "previous": "Chapter 22",
    "next": "Chapter 24.1"
}