{
    "title": "Chapter 1",
    "content": [
        "Translator: Deyonna",
        "“Roads can be very slippery with snow. Your Excellency, walk slowly.” ",
        "A reminder came with the sound of the umbrella opening.",
        "Ye Er turned around and saw almost all female zergs in the bookstore looking at him with a smile, all kinds of eyes shining brightly. “Wishing you a pleasant evening!”\n",
        "Please visit chrysanthemumgarden (dot) com",
        "This kind of greeting happens every day. Ye Er pursed his lips into a smile, opened his umbrella, and walked into the snow.",
        "“Hoo…” ",
        "Moist white mist emanated from his mouth and nose, dissipating into the air.\n\n",
        "It was already evening, and the massive projections and neon lights were lighting up successively. Countless streaks of light resembling stars crisscrossed the sky, outlining the beautiful yet cold silhouette of this high-tech city.",
        "He had been looking at the scene in front of him for over three years, yet he still felt unfamiliar and at a loss.",
        "Three years ago, he transmigrated.\n\n ",
        "After suddenly dying from staying up all night to finish an experiment, he woke up in a society of the zerg race, realizing that not only was the language incomprehensible, but the species had also changed.",
        "In the world of the Zerg race, there is no distinction between male and female, only by male and female gender identifiers, yet all of them possess the physical structure and appearance of human males.",
        "Similar to a bee’s hierarchical social structure, the majority of the population comprises female zergs and sub-females, who hold lower social status, while male zergs, being rare, occupy an incredibly prestigious position.\n\n",
        "He was considered lucky to have transmigrated into a male zerg. So, when he was discovered on the battlefield, he was taken to the hospital for treatment instead of being shot in the head. ",
        "And a year ago, he came to Aitar to settle and found a job as a librarian, allowing him to study and support himself. The female zerg who greeted him just now was his colleague.",
        "But—",
        "“Your Excellency, are you off work? Wishing you a pleasant evening!”",
        "“Your Excellency Ye Er, can I invite you for a date tonight… Oh well, I knew it. I’ll come back next time.” ",
        "“Your Excellency…!”",
        "As Ye Er stepped out of the library, a surge of enthusiastic greetings hit his face like a giant panda placed in a crowd, arousing a wave of screams and commotion.",
        "He resisted the urge to sigh, nodded in acknowledgment, and turned down every invitation to spend the night together.",
        "“Yes, thank you.” ",
        "“I’m sorry.”",
        "“……”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But his responses were far behind the questions, so without any better option, he kept walking forward, trying to end the conversations quickly.",
        "Little did he know that his helpless yet consistently gentle demeanor caused the female zergs’ eyes to glow green with excitement. They eagerly crowded to the front, itching to pack up the male zerg and take him home in one go. ",
        "Ye Er took nearly twenty minutes to walk a few hundred meters of road.",
        "Finally reaching the fork in the road with great difficulty, he suddenly saw two figures wrestling with each other in front of him. “I□□…”",
        "“Thump.”",
        "In their peripheral vision, they saw a pair of boots stop in front of them. The two savage female zergs turned their heads fumingly, ready to beat up this clueless fool together. ",
        "As they turned their heads, they were stunned, their eyes wide open, and their ezpressions frohen, looking somewhat comical.",
        "“Ulease make way,” Te Sr said as he furrowed his brow, feeling somewhat helpless.",
        "“Tour, Tour Szcellency. It’s you, I’m really sorry…”",
        "The female herg pumped up from the ground, hastily patting the dust off his clothes and combing his messy hair with his fingers. ",
        "“Good evening, Your Excellency. Where are you headed? If you don’t mind, I can be of service!”",
        "The zergs on the street side were not surprised by this scene. A female zerg even chuckled and reprimanded them, “You two rude fellows, this is not the way to make His Excellency, the male zerg, like you.”",
        "The reprimanded female zergs turned red, then looked at one of the few male zergs on this remote planet, feeling a bit discouraged.",
        "The male zerg in front of them had suddenly arrived here a year ago. ",
        "A precious, rare, and stunningly beautiful male zerg that had not undergone secondary differentiation caused a huge sensation as soon as it appeared.",
        "But what the female zergs were more concerned about was… whether he would choose a few female attendants here.",
        "With this speculation, all the female zergs were eager to try. However, contrary to their imaginations, the male zerg in front of them had settled here for almost a year without getting close to any female zerg, let alone making any of them his female attendants.",
        "Gentle and noble, casual yet distant. ",
        "This was the impression that the female zergs on this planet had of Ye Er.",
        "He stood in the snow, his porcelain-white fingers holding the umbrella’s handle. His face beneath the soft black hair was clear and elegant. Even his long eyelashes were interspersed with tiny ice crystals, making him stunningly beautiful, as if outshining the snow and frost.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Anyone who saw him couldn’t help but be amazed and softened, wishing to immediately protect him under their bone wings.",
        "“Excuse me, please make way.” ",
        "Ye Er spoke up again, reminding the female zergs who were mesmerized by the male zerg’s appearance. They immediately snapped out of their trance and made way for him, like how Moses parted the sea.",
        "Unfortunately, they had the heart of a thief, but not the courage of one. After a year, all they could do was look from afar, approach to greet and become familiar, and then watch the male zerg leave with reluctance.",
        "Ye Er disappeared at the end of the road, and the surrounding zergs gradually dispersed.",
        "“How can there be such a beautiful and gentle male zerg! I really doubt if what we’re witnessing is just a delusion of us single folks who have been single for too long…” ",
        "A young female zerg stood still, looking in the direction the male zerg had left, not moving. He nudged his companion next to him with his elbow, sighing deeply.",
        "“But His Excellency, the male zerg, doesn’t have a single female attendant by his side. Will he really not feel lonely? Even if he has the ability to live independently, it still feels too lonely…”",
        "His companion glanced at him and teased. “That’s true. The New Year is coming soon. Why don’t you sneak out in the middle of the night and climb up to His Excellency, the male zerg’s window, to give him some warmth?”",
        "“Get lost!” ",
        "“Finally, out…”",
        "Ye Er hurriedly walked quite a distance before slowing down his footsteps. His expression relaxed slightly, and he couldn’t help but let out a sigh.",
        "He didn’t expect that even a D-level male zerg like him would be so popular, considering he had no noble status or anything noteworthy about him.",
        "“Your Excellency, are you here to purchase ingredients again?” ",
        "A questioning voice interrupted Ye Er’s contemplation. Behind the supermarket door, the female zerg boss was sloppily sitting behind the cash register. When he saw him, he straightened up like a startled carp.",
        "Remembering the repeated instructions from the little robot housekeeper, he folded up his umbrella and entered the supermarket. “En, I’ll buy some vegetables and bread.”",
        "“Your Excellency, you’ve come at the perfect time. We’ve just received a new batch of tomatoes and corn!”",
        "The female zerg boss led the way in front. “The rest are also fresh arrivals today. Take whatever you like.” ",
        "Ye Er casually glanced around, and suddenly caught sight of a sign. The drawing on it seemed familiar, and just as he was about to take a closer look, the boss blocked his view.",
        "“?”",
        "",
        "“That’s just a little marketing strategy.” The female zerg showed an awkward expression, his eyes darting around uneasily.",
        "“Of course, if you don’t like it, I’ll remove it right away!” ",
        "By now, he had already figured out what it was—",
        "A small blackboard with a Q-style figure drawn on it, with black hair, black eyes, holding an umbrella, wearing a white down jacket, and drawn exceptionally clean and beautiful.",
        "It was his simple sketch, with small letters below saying, “Vegetables bought by His Excellency the male zerg.” The arrow pointed to the vegetable shelf, which had been completely cleared out, making it very eye-catching.",
        "Ye Er’s expression turned complicated for a moment. “You… “ Are quite good at doing business. ",
        "In the end, he didn’t do anything about the sign, letting the female zerg leave as he chose what to pick for himself.",
        "The hind legs of the mini star beast look like dinosaur legs… the meat quality seems pretty good, take some.",
        "Colorful tomatoes… they should all be ripe, take a few.",
        "Bread shaped like a burnt cockroach…? Put it back. ",
        "The technology of the Zerg race is at least a billion years ahead of Earth’s, but fortunately, the nutrient solution did not replace vegetables and meat.",
        "While he was selecting, a floating monitor screen next to him turned on, broadcasting the latest security situation around the nearby star systems.",
        "[According to the latest report, the war has already come to an end, and the surrounding small star systems will finally welcome the long-awaited peace and stability. In the previous war, the First Legion suffered losses and was still recovering…]",
        "[Today is the day when General Monte, the Light of the Empire, sacrificed himself. It has been five years since the general’s fall in the Military Campaigns of Mandel. Since then, the Empire has not witnessed the presence of such a remarkable and outstanding high-ranking military officer. Let us deeply mourn his loss…] ",
        "Ye Er paused, looked up at the monitor screen, and noticed that there were fewer reports on the recent war, but there were always mourning tributes dedicated to this general.",
        "The image on the screen had been deliberately photoshopped. One could only vaguely see the dazzling sunlight and the fluttering bright red cloak surrounding a blurry figure in the center, standing tall and exuding a majestic aura.",
        "A person highly praised by the official media as the “Light of the Empire” must have accumulated numerous merits, been unbeatable in their endeavors, and carried both roses and glory in themselves.",
        "In the society of the Zerg race, the majority of female zergs choose to join the military. Apart from their inherent advantages, only military females with great achievements and high positions have the right to choose their own marriage partners independently. They will not be easily deprived of their status to become a male zerg’s female attendant. ",
        "But all of this has nothing to do with him.",
        "Although the Zerg race follows the customs of male superiority and female inferiority, the root cause ultimately lies in the oppression of the lower classes by the higher classes, the monopoly, and exploitation of power.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The equal distribution of resources and wealth has always been the empire’s slogan to pacify the people. Even low-level male zerg can be divided as resources, but their value is priced higher.",
        "He never felt that he was anything special, especially since he was just a human wearing the shell of a zerg, needing to be vigilant and introspective at all times. The consequence of revealing a flaw is being torn open and gutted. ",
        "Ye Er lowered his gaze to the tomato in his palm, unsure whether he should be grateful that his rank was only D, keeping him far from the treacherous centers of power, allowing him to live peacefully day by day.",
        "As Ye Er left the supermarket, he caught a glimpse of the boss chuckling, bending down and taking out a stack of small blackboards filled with drawings in a Q-styled image of himself from under the cash register.",
        "Then, one by one, they were hung next to the items he had just bought, standing out as if they were supermarket mascots.",
        "Ye Er: “……” ",
        "He was silent for a while, then opened his umbrella and walked back into the snow.",
        "Just as Ye Er returned to the door of his house, the chubby little robot housekeeper, 015, rolled its wheel towards him, extending its long mechanical arm to take the things from him.",
        "He was about to close the door when he caught sight of an unusual thing out of the corner of his eye.",
        "A chip had been stuck above the hinge of the door. ",
        "Monitoring device?",
        "Ye Er’s eyes darkened slightly as he reached out to take down the thing, but before he could touch it, the chip automatically sensed the presence of a living being approaching and popped up a flat projection.",
        "“Big Sale! Huge Discounts! The Female Slave Exchange will launch a New Year discount event on the third of this month!”",
        "Ye Er: “?” ",
        "This is actually… an electronic chip advertisement?",
        "Seeing such a high-end advertisement for the first time, Ye Er just stared blankly.",
        "“Not for 19,999, not for 9,999, only for 1,999, bring home an obedient, docile, and adorable female slave!”",
        "“What are you still hesitating about? Are our sub-females not pretty enough, or are our female zergs not docile and obedient…” ",
        "Before Ye Er could react, the projection began to display a series of photos of female slaves in the exchange, leaving him dazzled.",
        "He reached out to tear off the chip, but unsure of where he had pressed it, the constantly changing projection suddenly stopped in one photo.",
        "",
        "Ye Er casually glanced at it, but the next second, he was caught off guard, sinking into a pair of molten gold eyes.",
        "Those eyes still shone brightly amidst the filth, beautiful in a way unlike anything in the world, yet carrying an almost sharp hostility and aggression, staring beyond the projection. ",
        "So scary.",
        "But so pretty.",
        "Regardless of who sees this photo, the first focus is always those eyes, followed by the specific details.",
        "The image of the female zerg on the screen portrayed cold and rigid features with a handsome and sharp appearance, deep and profound eyes, and a deep wrinkle between the eyebrows, resembling a solemn and awe-inspiring high-ranking military officer. ",
        "However, he was a mess, with tattered clothes that clearly did not suggest any association with nobility. Such a demeanor could only provoke a stronger desire to break and destroy.",
        "Those responsible for taming the person clearly thought so, too. In the displayed photos, not a single female slave had as many deep wounds, resembling shattered porcelain pieces after a violent impact.",
        "Ye Er was in a daze, lost in thought for a moment. His gaze shifted, and he saw the red label below—",
        "“Defective product: 90% off for sale” ",
        "That was indeed a pitifully low price, completely incompatible with those eyes.",
        "His heart felt like it had received a gentle tap, and it began to throb subtly. Ye Er pursed his lips, feeling the subtle pounding of his heart.",
        "“Why aren’t you coming in?”",
        "015 poked his head out, his red bean eyes looking confusedly at the stunned Ye Er. ",
        "“…I’m coming.”",
        "He hesitated for a moment, then completely tore off the chip, broke it, and threw it away. The projection flickered before cutting off the image completely.",
        "Forget it. He himself was living in a muddle-headed state, with no extra energy to do anything else.",
        "Translator’s Corner: This project was unplanned. I actually had another story that I was stockpiling to be my second project here, but I fell in love with the main characters of this book and had to translate and share it with you all. Therefore, there won’t be a regular update this month, but there will be a set update by next month. Hope you liked the first chapter! "
    ],
    "previous": null,
    "next": "Chapter 2"
}