{
    "title": "Chapter 28.1",
    "content": [
        "Translator: Deyonna",
        "Elaine rubbed his temples, pacing back and forth in the corridor not far from the lounge, feeling a long-lost sense of helplessness. ",
        "The five thousand milliliters of pheromones had not only caused a stir throughout the entire hospital, but even his female father, who held an office at a hospital in the Main Star, had heard about it.",
        "He immediately ordered Elaine to flatter the male zerg. It’s best to bind him tightly, suggesting that the hospital’s mortality rate might improve as a result.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "However, this matter wasn’t so easy. Male zergs are notoriously capricious.",
        "Even though His Excellency Ye Er was different from other male zergs, he undoubtedly also had his pride. His willingness to donate was probably just a moment of soft-heartedness, and it would be very difficult to establish a long-term, stable transaction. ",
        "Buying pheromones from the male zerg at a high price?\n\n",
        "It was a viable option, but the hospital was often short of funds, and they might not be able to afford the price demanded by the male zerg.",
        "However, if it was an urgent situation, they might be willing to pay a higher price.",
        "Compared to other greedy and insatiable male zergs, like lions with gaping maws, His Excellency Ye Er was the most trustworthy existence…. Elaine thought in silence.\n\n ",
        "“Beep, beep, beep!”",
        "The terminal on his wrist made a sound. He clicked it open and saw a special icon. He immediately realized that the male zerg had pressed the call service button.",
        "He dashed to the door of the lounge, but slammed on the brakes before pushing the door open. He quickly tidied his hair, clothes, and everything else before knocking lightly with his finger.\n\n",
        "“Your Excellency, may I come in?” ",
        "“Come in.”",
        "The temperature in the room was much higher than outside, like a warm and cozy living space. The male zerg was not sitting quietly on the sofa, but standing by the window, it was unknown what he was looking at.",
        "“How are you feeling now?”",
        "Elaine asked with concern. He glanced at the hot tea and dessert on the coffee table and noticed no signs of them being touched. He was somewhat worried. “Are you still feeling dizzy?” ",
        "Ye Er turned his head to look at him. “I’m fine. How’s the situation over there?”",
        "“Alvin’s condition is much better. He should be out of danger after the surgery. The five thousand milliliters of pheromone you donated are enough to treat thousands of seriously injured military females. We are immensely grateful to you!”",
        "Elaine began by expressing concern for his well-being, then praised his “great contribution,” his lowered voice still filled with fervor.",
        "Ye Er felt a bit embarrassed by the praise and coughed, covering his lips with his hand as his gaze drifted. “Actually, there’s something I wanted to discuss with you.” ",
        "Elaine immediately stopped talking and indicated that he was all ears. “You say.”",
        "“I think we can establish a long-term business relationship.”",
        "",
        "Before the dumbstruck female zerg managed to react, Ye Er directly stated his plan moments earlier.",
        "“Once a month, eight hundred milliliters each time. When the war is more intense, it can be once every two weeks. Flexible adjustments are acceptable.” ",
        "Pheromones are not something as important as blood for male zergs.",
        "Although their production may not be high, they can indeed be produced continuously. Moderate extraction will not cause any adverse reactions.",
        "However, due to the inexplicable arrogance and self-importance of most male zergs, they either refuse to donate or only donate a little, turning pheromones into a luxury item that is worth a fortune.",
        "“These are the conditions I can offer.” ",
        "Te Sr caught Slaine’s surprised ezpression, tinged with apprehension. Le subtly turned his head, concealing the contemplation in his eyes.",
        "Gespite his willingness to donate, it was best not to give unconditionally. Going so could easily foster endless greed and be ezploited by those hergs with ulterior motives.",
        "“Then, what kind of conditions do you wish… the hospital will offer?”",
        "Elaine’s voice sounded particularly hoarse, barely suppressing his excitement as he asked. ",
        "The conditions offered by the male zerg were already quite generous. If this business deal is successful, the hospital’s mortality rate could decrease by at least ten percentage points!",
        "“Throughout the duration of our business deal, waive all treatment fees for my female zerg, and use the best medicine possible.”",
        "Elaine nodded eagerly. “Absolutely no problem! Even if you didn’t ask for it, we would have waived the fees anyway, as a thank you for your donation.”",
        "“If there’s anything we need help with, I hope you can let us use the hospital’s network and connections.” ",
        "This condition was a bit vague, but upon careful thought, it wasn’t difficult. There was at least a lot of room for maneuver. Elaine thought for a moment before nodding in agreement.",
        "But the condition he most wanted to confirm wasn’t this.",
        "Elaine carefully chose his words. “I’ve been meaning to ask, well, about the pheromones you’ll be providing…”",
        "“The price of the pheromones should be based on the price set by the Drug Supervision Office. Those inflated prices on the market are too high and inappropriate.” ",
        "Ye Er said flatly. He glanced out the window, unconsciously wrinkling his brows.",
        "This window happened to face the hospital’s cafeteria. Countless military females were crammed inside, lining up to get their meals. The food didn’t look very plentiful, just enough to fill their stomachs.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "This hospital is financially incapable. How about giving them a 20% discount?",
        "Doubt, shock, disbelief, and ecstasy intertwined in Elaine’s expression, making it quite strange as he confirmed it in a jumbled manner. ",
        "“Standard p-price?! Are you serious? I didn’t hear wrong, did I? It really is the standard price…?!”",
        "Ye Er turned his head and nodded in response to Elaine’s expectant gaze. “Yeah.”",
        "“Your hospital is facing financial constraints. You can’t pay that much star coins.”",
        "Ye Er was very understanding and considerate, “You can also pay on credit. I don’t mind.” ",
        "While it was true that they were quite impoverished, this was a bit hurtful.",
        "Elaine tried to salvage a bit of the hospital’s image. “It’s not that poor…”",
        "“However—”",
        "Ye Er suddenly said, interrupting him, his expression turning somewhat cold. ",
        "“You could have talked to me properly and negotiated a deal, but instead, you chose to put me on the fire to roast. That’s really a bit offensive.”",
        "His voice was flat, devoid of anger, yet it instantly made Elaine break out in a cold sweat.",
        "“I’m truly sorry, Your Excellency. The situation was urgent at the time…”",
        "“If those military females began to riot, you wouldn’t have been able to stop them alone, right?” ",
        "A sharp and accurate question.",
        "Elaine’s expression also turned grave, his eyes revealing regret and lingering fear.",
        "“It was indeed my oversight. I will definitely give Your Excellency a satisfactory compensation afterwards. If you have any other requests, feel free to make them. The hospital will do its best to accommodate you.”",
        "Ye Er was noncommittal, just quietly looking at the female zerg across from him. ",
        "It wasn’t until Elaine was terrified that the business deal was just the male zerg toying him for fun that Ye Er suddenly relaxed his brow.",
        "“There’s no next time.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He smiled faintly and turned his head to look out the window, his voice calm as if nothing had just happened.",
        "“Don’t be so nervous. The deal will continue as planned. I just wanted to remind you.” ",
        "Give a sweet date, then a slap, then give another sweet date.",
        "This set of moves was played so smoothly. Although the male zerg in front of him had a good temper, he was definitely not a soft persimmon.",
        "Elaine felt cold sweat soaking through his back, and the hope in his heart that he could rely on this male zerg vanished.",
        "Clear boundaries and showing the utmost sincerity are the keys to successfully maintaining a long-term business deal. ",
        "“Oh, that’s right.”",
        "The male zerg seemed to suddenly remember something. His brow furrowed slightly, revealing a hint of distress. “I have something I need your help with right now.”",
        "“—I need to find something.”",
        "Xie Zhao opened the door and saw the male zerg sitting on the chair by the doorway. Before he could greet him, Xi Ze emerged from behind, bumping him with a force that was neither gentle nor heavy. So he instantly forgot what he was going to say. ",
        "“Male Lord.”",
        "He watched blankly as the military female, who had moments ago seemed as cold and hard as a rock—indifferent and stern—called out softly. The corner of his lips barely concealed a trace of a gentle smile.",
        "Ye Er stood up and looked down at the female zerg’s expression. Hmm, very calm, showing nothing out of the ordinary.",
        "“How’s the situation?” ",
        "The male zerg in front of him had a glimmer of hope and expectation in his eyes, which made the doctor incredibly soft-hearted. Xie Zhao opened his mouth, but he was too embarrassed to tell him that the progress was currently 0.",
        "“Ah… this, that… his current condition is…”",
        "“The treatment is going well. I feel much better.”",
        "A cold and firm voice interrupted his stammering. Xi Ze raised his eyes and glanced coldly at the spot where Xie Zhao was standing. “Right, Doctor Xie?” ",
        "Xie Zhao shivered under that gaze and immediately fell silent, unconsciously straightening his back. “That’s right, that’s exactly what I meant.”",
        "Then Xi Ze turned to the male zerg in front of him, his tone unconsciously becoming soft and gentle, “…Let’s go home.”",
        "",
        "Hiss—",
        "Xie Zhao, taking advantage of the fact that the military female couldn’t see him, exaggeratedly bared his teeth. ",
        "When the male zerg looked at him in confusion, he quickly straightened his expression and said repeatedly, “It’s nothing, just a sudden toothache, toothache…”",
        "“Okay, we’ll go home.”",
        "Ye Er casually rubbed the female zerg’s soft hair. A few strands were ruffled up, and combined with his pursed lips and tight-faced expression, it was strangely somewhat cute.",
        "A lot had happened today, and he was indeed a bit tired. ",
        "Ye Er took a deep breath, adjusted himself, and said goodbye to Xie Zhao. “We’ll leave first and come back next week.”",
        "The surgery was finally over. After checking on Alvin’s condition, the military females rushed to the VIP lounge.",
        "Just as they had tidied themselves and cleared their throats, ready to express their gratitude to the male zerg, Elaine, with a joyful expression still on his face, came out.",
        "“…Why is it you? Where is His Excellency the male zerg?” ",
        "“Oh, he went to Xie Zhao’s place to pick up his female zerg. You guys can go over there and take a look.”",
        "However, as soon as they arrived at the psychological consultation room, they saw Xie Zhao muttering to himself in the corner, his facial expressions changing constantly. One military female grabbed him. “Where is His Excellency the male zerg?”",
        "Xie Zhao subconsciously clipped his voice in a peculiar way. “How would I know? He had probably gone~home~”",
        "The military female was speechless. “…Are you unwell? If you’re sick, go get treatment. Don’t delay.” ",
        "By the time they got home, it was evening.",
        "The storm from last night had subsided slightly. A faint glow of twilight broke through the gloomy clouds, casting a dim yellow light on the small balcony.",
        "Ye Er pulled open the curtain with a swish, allowing the twilight to stream freely into the living room, creating a warm and weary atmosphere.",
        "“I completely forgot that there was a thing called wheelchairs.” ",
        "He turned around. “Sorry, it must have been very inconvenient for you to be carried around by 015 all the time, right?”",
        "“Nothing like that.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze whispered, “Male Lord has already done so much… I should be able to recover very soon. Male Lord doesn’t need to worry too much.”",
        "His condition wasn’t actually optimistic, but Ye Er didn’t utter a word. ",
        "It was good that the female zerg thought this way. At least he wasn’t caught in pain and pessimism.",
        "“I’m so tired today…”",
        "He mumbled, throwing himself onto the sofa, burying his face in the soft, fluffy tofu block the female zerg had folded, and took in a deep breath.",
        "Xi Ze wheeled the wheelchair to the edge of the sofa, his arms nimbly supporting himself as he sat beside Ye Er. ",
        "“Releasing too much pheromone can be very tiring. It’s not dinnertime yet. You can take a nap to recover your energy.”",
        "Ye Er had already messed up the quilt and wrapped it around himself. He was so sleepy he could barely keep his eyes open, but he still stubbornly mumbled.",
        "“That won’t do. If I sleep now, I won’t be able to sleep at night. My sleep schedule will be messed up…”",
        "He hugged his knees and rocked back and forth, trying to dispel away the untimely drowsiness, occasionally letting out muffled nasal sounds. ",
        "But a hand reached out from behind his ear, covering his eyes, gently but firmly guiding him back, completely lying in a soft, generous, warm embrace.",
        "“…Hmm?”",
        "Ye Er mumbled incoherently, feeling the hand covering his eyes release, then they began to massage his temples in circles, using a specialized technique with the right amount of pressure.",
        "He immediately looked like a cat whose chin was being scratched. His whole body instantly went limp under the comfort. ",
        "Every weary nerve, stripped of its armor, was completely entranced by the gentle caress of those large hands, utterly forgetting to protest.",
        "“Dinner…wake me…”",
        "He struggled one last time."
    ],
    "previous": "Chapter 27.2",
    "next": "Chapter 28.2"
}