{
    "title": "Chapter 19",
    "content": [
        "Translator: Deyonna",
        "The tiles on the bathroom floor were frigid, a stark contrast to the scalding hot water cascading down Xi Ze’s back. The alternating temperatures left his head feeling dizzy. ",
        "He was half-kneeling on the ground, one hand braced against the wall, his eyes tightly closed in a look of forbearance. He reached his other hand behind his body, moving with extreme unfamiliarity, and began to clean the area.",
        "“Nng…”\n",
        "",
        "Previously, he had only theoretical knowledge, never having actually practiced it on himself. Furthermore, the loss of his eyesight made the process somewhat difficult.",
        "Unsure if he’d touched a wound, a sharp, stabbing pain struck, causing the female zerg to gasp. His face suddenly turned pale, and his muscles tensed all over. ",
        "Xi Ze’s nostrils flared briefly, his Adam’s apple bobbing as he swallowed down the fleeting feeling of nausea.\n\n",
        "He had never told the male zerg that the torment did not stop at the external wounds, but rather the injuries reached deeper at more hidden places inside. It was unknown whether the injuries had caused any permanent damage to his fertility.",
        "Ye Er probably doesn’t know either, otherwise he wouldn’t have been so calm for so long, never asking or mentioning it.",
        "It’s better not to know… His pain tolerance has always been high, so he’ll endure it until it passes, without letting the male zerg discover any clues.\n\n ",
        "Water droplets fell from the tips of his hair, creating small splashes on the ground.",
        "Many thoughts raced through his mind in a jumble, but he couldn’t grasp on any of them. The inexplicable sense of urgency felt like a scythe hanging over his head, making Xi Ze increasingly restless.",
        "His expression was somewhat vacant as he mechanically and roughly cleaned with his right hand as if he had lost the sense of pain perception.\n\n",
        "“Xi Ze?” ",
        "The male zerg’s voice came through two doors, somewhat muffled and unclear, causing the female zerg to suddenly snap out of it, realizing that he seemed to have been washing for too long.",
        "He answered in a hoarse voice and grabbed the towel hanging on the side.",
        "It was the first time he lay on Ye Er’s bed, but the sensation beneath him was not that of a soft blanket, but a thin, cold waterproof sheet.",
        "Xi Ze hesitated but reached out to feel around. He confirmed that the quilt and pillows on the bed had been removed, and the entire mattress was covered with plastic film. ",
        "The female zerg unconsciously pursed his lips, a hint of embarrassment and indescribable loss flashing in his eyes.",
        "“Then I’ll go first. Call me if you need anything,” 015 routinely said, then closed the door and left the room.",
        "The sound of running water came from the bathroom not far away, indicating that the male zerg must have just entered not long ago.",
        "Xi Ze surreptitiously adjusted his posture, and the movements caused the waterproof sheet to make a faint sound, causing his body to freeze unnaturally. ",
        "Unable to see the edge of the bed, he inadvertently put his palm into an empty space, almost falling off, but he suddenly touched a protruding hard corner under the bed.",
        "Xi Ze wrinkled his brow, propped himself up, and fumbled to open the box. His fingertips touched something hard with a sinister outline, faintly smelling the foreboding scent of danger on it.",
        "",
        "These are things that the Male Zerg Protection Association had sent.",
        "The female zerg’s fingers tightened, while his clouded thoughts gradually became clear. ",
        "He couldn’t stand up, nor could he kneel down, always clinging to that fragile sense of self-respect, preferring to endure torment and abuse rather than humble himself to please others.",
        "Dut… Te Sr never demanded the female slave’s standards from him.",
        "Te Sr gave him a second life, providing a safe place to stay, ample food, clothes to cover his body, and the most precious of all, respect.",
        "So, it doesn’t matter. ",
        "——If the herg holding the whip is him.",
        "As this thought emerged, Xi Ze’s tense shoulders suddenly relaxed, as if abandoning resistance.",
        "He took a deep breath, fumbling to take out another prop, and unlocked the cold buckle on it.",
        "Ye Er opened the bathroom door, his eyes widening in shock at the scene in front of him, and then slammed the door shut. ",
        "What’s going on? Did he walk into the wrong room or travel through time and space?",
        "He could hardly believe the scene he had just seen.",
        "Xi Ze was kneeling on the bed, his back to Ye Er. He was wrapped in intricate bright red ropes that wound from his neck to his tailbone, binding his wrists together and was even tied into a bow.",
        "A silver chain was fastened to the collar, its other end was attached to the headboard, like a snow leopard holding its chain in its mouth, voluntarily bound and kept. It crawled and waited for either caresses or whipping. ",
        "Just a glimpse of what he saw was enough to shock him. Ye Er dared not imagine what it would look like up close.",
        "But it wasn’t good to keep Xi Ze waiting too long. He hesitated for a moment, but still opened the door.",
        "The female zerg on the bed must have heard him approaching. Perhaps it was due to the injury on his knees that made his back tremble slightly, causing him to uncontrollably bend down.",
        "It wasn’t until Ye Er reached the edge of the bed that he saw the box, pulled out from under the bed, with the decorative sex props inside already transferred to the female zerg. ",
        "He looked somewhat helpless, almost sighing as he asked, “What are you doing?”",
        "The female zerg’s eyes were covered with a black fabric, and Ye Er could only see his tightly pursed lips and the constantly rolling Adam’s apple, revealing his tension.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "There had been no movement beside him after so long, so Xi Ze froze for a moment, unable to guess whether the male zerg was happy or unhappy.",
        "Ye Er was originally examining the rope, thinking about how to untie it, but soon, he heard a sound and even caught a faint smell of blood. ",
        "“What’s that sound?”",
        "He suddenly frowned, took another look at the expression of the female zerg, and realized that something seemed wrong.",
        "He followed the sound to its source. Then, his expression changed instantly, and his voice turned cold. “Are you crazy? How dare you use that thing?”",
        "Without bothering to untie it properly, Ye Er picked a sharp and spiked prop and directly cut the red rope that bound the female zerg, freeing his wrists and ankles, which already bore red marks. ",
        "“….Ugh!”",
        "Xi Ze suddenly groaned, his tone wavering slightly, as if it conveyed both pain and perhaps a mix of other emotions.",
        "Clink.",
        "Ye Er held the trembling body of the female zerg with one hand, pulled out something with the other hand, and threw it on the ground. He looked at the bloodstains on his fingertips, with a hint of suppressed anger between his brows. ",
        "“…Believe me or not, if you don’t give me a reasonable explanation today, I won’t let you off easily.”",
        "The object in his mouth was removed, allowing Xi Ze to free himself from suffocation. He collapsed softly into the arms of the male zerg, but upon hearing the words, his body stiffened, and his voice turned hoarse and hesitant.",
        "“Today… the Male Zerg Protection Association came to the door, and then… this box was taken into the room by the Male Lord…”",
        "The female zerg spoke intermittently, but Ye Er instantly understood, and then the tip of his eyebrow slightly rose. ",
        "“So you thought I was going to start torturing you tonight?”",
        "“In your eyes, am I just the kind of zerg who enjoys abusing female zergs?”",
        "He almost laughed out of anger, but he was also too lazy to hide or beat around the bush for the female zerg to guess.",
        "“It was only today that Hughes informed me of the injury to your womb and requested that I provide you with in-depth treatment.” ",
        "The female zerg in his arms stiffened, wearing a somewhat dazed expression.",
        "Then he suddenly raised his head, as if he wanted to say something, but he was interrupted by Ye Er.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“I was afraid you would accidentally touch this box if it was left outside, and there’s no storage room in the house, so I placed it under the bed to collect dust.”",
        "“Do you understand what I’m saying?” ",
        "Ye Er lowered his gaze and stared at the female zerg. When he saw the light watery color in those golden eyes, his anger seemed to deflate like a punctured balloon, dissipating silently.",
        "“If you have any questions, don’t secretly speculate. Is it fair to me, who has been diligently treating you with medicine all this time, for you to harm your own body without permission?”",
        "Xi Ze still seemed a bit dazed and nodded subconsciously, but then he shook his head and reached out to grip the male zerg’s small arm, as if afraid he would pull away.",
        "“I’m sorry… It’s my fault, Male Lord…” ",
        "He was eager to explain, but he seemed overwhelmed by emotion, only managing to apologize hoarsely. His thick, nasal voice sounded like a faint sob.",
        "Ye Er sighed and reached out to stroke that □□ shoulder.",
        "The warm body beneath his palm trembled slightly, like a tamed wild beast, still retaining its wild nature but lowering its head to expose its belly for petting.",
        "“Don’t do this again.” ",
        "He removed the decorations tightly strangled around Xi Ze and threw them all back into the box.",
        "After a moment of hesitation, he released soothing pheromones, enveloping the female zerg in his arms.",
        "“Feeling better?”",
        "Tonight, Xi Ze’s emotions were abnormal, as if under stress, but fortunately, the situation was contained in time and did not result in worse repercussions. ",
        "“You’re very afraid of this kind of torture, right?”",
        "While no zerg is without fear, the fear associated with facing the battlefield differs significantly from the fear of enduring torture and abuse experienced by female zergs in the female slave exchange.",
        "It’s like a deep void in the heart, where flowing black blood has persisted for years, leaving it unable to heal and even more untouchable.",
        "Ye Er lowered his voice, his palm stroking from the female zerg’s neck to his tailbone as if appeasing a startled snow leopard. ",
        "“It’s okay, this kind of situation won’t happen again in the future. I promise… I also loathe things like this—it’s bloody and cruel. Only perverts would enjoy it!”",
        "“Take a deep breath and relax. We still have treatment to do later…”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The female zerg in his arms was still trembling slightly, nodding and holding onto his waist more tightly, as if grasping at a lifesaving straw.",
        "…Very strange. ",
        "Xi Ze tightly closed his eyes as the pain radiated from his clenched teeth, unable to stop the stress response.",
        "The violent ramming of his heartbeat brings about suffocation and dizziness, leading to a series of adverse reactions.",
        "He thought he could conceal it well, but it turned out to be so unbearable.",
        "But perhaps the reason wasn’t him, but the male zerg before him. ",
        "Every time, every time he slipped into the filthy swamp, Ye Er could accurately and powerfully pull him back.",
        "How could there be such a male zerg?",
        "His mental landscape trembled violently. The place that could not withstand any impact was now in a mess, yet it did not bring much pain.",
        "Under the complete upheaval comes a vast and sweeping arrival of spring. ",
        "After finally calming the female zerg down, it was already getting late.",
        "Ye Er arranged the medicines in a row on the bed, counted them, and then had the female zerg lie on his back while he held his legs.",
        "“The previous injury hasn’t healed yet, and you just tore it again. It might be painful later, so you bear with it.”",
        "He disinfected his hands, put on gloves, glanced at the female zerg, and gave some instructions before starting. ",
        "“Okay.”",
        "Xi Ze still looked a bit dazed, with faint tear stains on his face. He pursed his lips, breathing rapidly, yet there were no longer any signs of losing control.",
        "In front of him, there was still an undissolvable darkness, yet it felt like being enveloped in a thick, fluffy cotton candy, providing him with a long-lost sense of safety and relaxation.",
        "“I’m starting.” ",
        "Ye Er gave a warning, applied the transparent ointment on the outside of the gloves, and started the first course of treatment.",
        "Xi Ze made an indistinct sound, and his breathing gradually became rapid.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "He looked uneasily ahead of him. He could clearly feel the male zerg’s other hand pressing on his leg.",
        "The warm palm wrapped around the injured kneecap, its heat nearly scalding the flesh and blood of the wound. ",
        "The male zerg’s fingers were cold yet gentle, their presence so distinct that it momentarily overshadowed the pain, occupying all his thoughts.",
        "“Male Lord…”",
        "He looked dazed, his voice hoarse.",
        "The suppressed tears of weakness flooded his eyes once more, and he couldn’t help but let go of his bent knee, biting down on his curled knuckle. ",
        "“Ugh…!”"
    ],
    "previous": "Chapter 18",
    "next": "Chapter 20"
}