{
    "title": "Chapter 25.1",
    "content": [
        "Translator: Deyonna",
        "Ye Er stood up, giving way to 015’s movements. He casually righted the bottle of shower gel that was accidentally knocked askew and turned on the bathroom dryer. ",
        "“Where should we put him?”",
        "015’s voice came from outside the door, while Ye Er was still lost in thought.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Turning his head, he saw 015 supporting the female zerg in the middle of the room. They both turned to look at him, the scene indescribably harmonious.",
        "“Then…” Ye Er paused a little and for some reason blurted out, “Go to my bed.” ",
        "Wait a minute.\n\n",
        "He quickly realized his mistake, slapping his forehead in annoyance and closing his eyes.",
        "Did his brain get waterlogged from being in the bathroom for too long? How could he have said that?!",
        "For Ye Er, the bed was a very private place.\n\n ",
        "He had been sleeping in a separate room from adults since he was very young. From childhood to adulthood, he had never allowed anyone to touch his bed, let alone let anyone rest or sleep on it.",
        "There was no time to lay down a waterproof sheet now, and if he did it in front of the female zerg, he would definitely think he was rejecting him, which would make things even harder to deal with.",
        "Ye Er walked out, somewhat conflicted. He then saw the female zerg sitting reservedly on the bed, bending over to wipe his hair, making sure no water droplets fell onto the sheets.\n\n",
        "“Male Lord.” ",
        "Hearing the footsteps, Xi Ze moved the towel aside from his face and looked in the direction of the male zerg. The corners of his lips, which had been pressed together, almost uncontrollably turned upwards, and he said softly, “Tonight…”",
        "Ye Er absentmindedly hummed in response, reaching out to ruffle the female zerg’s messy hair. “Is it already dry? Be careful not to catch a cold.”",
        "He was still thinking about the bed matter.",
        "He shouldn’t have… He was quite sensitive about the word “bed.” What he said just now was unexplainable and practically impossible, but he truly had given his permission. ",
        "Were they the kind of intimate relationship that could share a bed?",
        "For the first time, Ye Er confronted this question, his brow furrowing as he fell into contemplation.",
        "It was true that they had done some things that crossed boundaries, but each time it was out of necessity, forced upon them, not driven by natural, developing feelings.",
        "Xi Ze probably wasn’t willing either. He was simply accustomed to this way of life due to societal conditioning. ",
        "Apart from their accidental male lord and female slave relationship, they should be considered… friends, right?",
        "Or, to take it a step further, their relationship was rather special, as they had gone through some experiences together. So, could they be considered good friends?",
        "Please visit chrysanthemumgarden (dot) com",
        "Te Sr muttered to himself for a moment, finding this definition to be fairly accurate.",
        "Lowever, after a moment of hesitation, he still said, “If you feel a bit better, you can…” Xo back to sleep outside. ",
        "Dut at that time, the soft, damp hair tangled around his fingers. The female herg pursed his lips and obediently pressed his head full of hair against his palm, allowing his fingers to rub and tousle it, like a fluffy puppy.",
        "Especially those golden eyes, raised upwards as if trying to look in his direction, with the moist corners drooping slightly… making him look more like a puppy.",
        "Ye Er’s breath hitched, and the rest of the words got stuck in his throat, making it impossible to say anything more.",
        "He sighed in resignation after a moment of entanglement. ",
        "…The weather outside was so bad, and the sofa was really uncomfortable to sleep on, so he’ll make an exception this time.",
        "“Let 015 help you change into some clothes to get ready for bed.”",
        "Remembering the tools scattered outside that hadn’t been put away, Ye Er walked into the living room, only to be caught off guard by a blast of cold wind that made him shiver.",
        "The balcony door had somehow been pushed open a crack, and a gust of wind carrying ice and snow billowed the curtains, revealing a corner of the deep dark, brooding night outside. ",
        "The storm raged on, showing no signs of letting up.",
        "He walked over and closed the door, but for some reason, his heart skipped a beat, and a vague sense of unease spread through him.",
        "“Is there something outside?”",
        "015’s voice suddenly rang out, startling Ye Er. ",
        "He pulled the curtains shut with a “whoosh,” leaving no gap, before turning around and saying, “Nothing, already done?”",
        "“Yes, I’ll take care of cleaning up these things on the floor. You can go to rest.”",
        "“Alright, remember not to go into sleep mode tonight. Keep an eye on your surroundings, just in case something else happens.”",
        "Ye Er closed the room door behind him. ",
        "Xi Ze had changed into clean clothes and was half-lying on the outer side of the bed, covered with a quilt. He opened his eyes and looked over when he heard the noise.",
        "His body, with its soft, undulating contours, appeared strong and plump, radiating a scorching heat and the scent of shower gel. It seemed like a nest or a warm bed you could pounce on, bury yourself in, and indulge in reckless abandon.",
        "",
        "The atmosphere right now… was truly strange.",
        "Ye Er took a deep breath, forcing himself to look away. Then he took out a new set of pajamas from the closet and headed towards the bathroom. ",
        "“I’m going to take another shower. You can go to sleep first. You don’t have to wait for me.”",
        "“Okay,” Xi Ze said softly, his body sliding further down into the covers.",
        "It was half an hour later when Ye Er emerged from the bathroom. The female zerg was lying on the bed with his back to him, his undulating form obscured by the soft quilt. His breathing was smooth and steady, long and even.",
        "He quietly let out a breath of relief and tiptoed over to turn off the light. ",
        "“Click.”",
        "The room finally plunged into silent darkness, broken only by the monotonous sound of the howling north wind and the rustling of the snow outside the window.",
        "Ye Er carefully stepped onto the bed, crossed over the female zerg’s waist, and gently lifted the covers to lie down.",
        "The bedding should have been cold, but the female zerg’s body temperature was slightly higher, radiating warmth through the covers and enveloping him in a comforting heat. ",
        "The breath of another being was clearly audible, even more distinct than the wind and snow outside. It lingered in his ear, impossible to ignore.",
        "…Too close.",
        "He stared blankly at the blurry floral pattern on the curtains, forcing himself to close his eyes and try to ignore the presence behind him.",
        "He even tried counting sheep to fall asleep, but— ",
        "He couldn’t sleep at all!",
        "A few short but agonizingly long minutes passed. Just as Ye Er was about to get up and take a sleeping pill, a sudden rustling sound came from behind him.",
        "He thought it was the female zerg turning over, but the next second, a warm breeze brushed against his back, and the quilt, radiating with a scorching temperature, suddenly wrapped around him snugly.",
        "Ye Er’s breathing remained steady, and the movements behind him adjusting the quilt were careful and gentle. The pervading warmth inside the quilt gradually melted the chill from his fingertips. ",
        "Compared to the coldness outside the quilt, the thought of getting out of bed to take medicine gradually became more difficult.",
        "…Forget it. He’ll just sleep like this.",
        "",
        "With the warmth enveloping him, a light, thin drowsiness finally visited him.",
        "The scorching heat source behind him wasn’t far, and he could faintly feel the hot breath against his nape. But the slight distance still allowed a draft to slip through the blanket, making it impossible to completely bury himself in the warmth. ",
        "Ye Er frowned a little uncomfortably and burrowed deeper into the quilt.",
        "The male zerg’s breathing grew long and even, as if he had already fallen asleep, but Xi Ze remained exceptionally awake.",
        "He had, in fact, deceived the male zerg. Reconstructing the mental landscape wasn’t as simple or quick as he had made it seem.",
        "At least after the most turbulent and dangerous stage had passed, those jumbled memories and emotions hadn’t receded, but instead became even more chaotic and intense. ",
        "Twisted, distorted faces, belonging to those he couldn’t discern, flickered in and out of view. A piercing ringing in his ears nearly tore through his temple. His senses were upside down and chaotic, waves of ripping pain radiating from every part of his body, but he couldn’t distinguish between illusion and reality.",
        "He silently held his breath, swallowing any potential sounds, and carefully turned over, facing away from Ye Er, not wanting to wake the male zerg.",
        "But right after, a hand reached out from beside him, a cool palm pressing against his forehead, as if checking his temperature.",
        "The male zerg’s voice sounded, vaguely with a hint of worry, “What’s wrong? Are you uncomfortable somewhere?” ",
        "Xi Ze’s Adam’s apple bobbed as he reached up to touch the hand stuck on his forehead, squeezing it tightly. “…Nothing, just a bit of insomnia.”",
        "“I’ll go get you some medicine.”",
        "Ye Er drew back his hand, about to lift open the covers and get out of bed, but the female zerg stopped him with a hoarse voice.",
        "“I don’t want to take medicine… how about we talk for a bit? We’ll naturally get sleepy later.” ",
        "It didn’t seem like a bad idea. Ye Er pondered for a moment, then burrowed back into the covers. “What should we talk about?”",
        "Xi Ze endured a wave of pain, pretending to think over it wearily. “Let me think…”",
        "He wanted to say something, but as he sifted through his memories, he realized that his past life was so incredibly mundane. It was nothing but war, and war, with the occasional dull power struggle thrown in. Speaking of it would only add to his uncomfortable state.",
        "After thinking for a long time, he picked something relatively simple and not too unpleasant, deciding to tell it to the male zerg as a bedtime story. ",
        "“Once, on the return journey, I found that the jump point was broken. We could only take the long way back, but because of that, I saw a lot of beautiful scenery.”",
        "“There was a nebula that shimmered with the vibrant red of a rose, shaped like a heart. It pulsed and contracted rhythmically as if it were alive.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“I’d never seen a nebula like that before, so I casually turned on my recorder and filmed it. After I got back, the recorder was handed over to a special place for analysis and review.”",
        "“But what I didn’t expect was that this seemingly insignificant little incident would cause such a stir.” ",
        "Xi Ze chuckled softly, still able to recall the incredulous expressions of those astronomers.",
        "Their faces were flushed red like a monkey’s bottom, as they shouted, “Impossible! This is absolutely impossible! Someone must have made this up to mess with us!”",
        "“They always claimed that the universe held no secrets and that there wouldn’t be any new discoveries for a hundred years. But as a result, their view was only a year old when it was shattered by a casual recording during a routine return trip. It’s quite…humorous, isn’t it?”",
        "When one loses their sense of awe, they suffer blindness from their arrogance. Naturally, they can’t see anything new and they can only be stuck in their own place. ",
        "Ye Er listened intently to his story with bated breath, then smiled a few times. “What happened next? Is that nebula still unnamed?”",
        "“It was later named ‘Heart of Vera’ meaning the heart of the gods.”",
        "The female zerg’s voice was low and gentle, with a hint of amusement that even he didn’t realize.",
        "The sharp, needle-like pain in his head gradually subsided, as if telling that story had sorted out his shambolic memories. The frenzied mental power in his mental landscape gradually calmed down. ",
        "After a moment’s thought, Ye Er coughed softly.",
        "“In return, I’ll tell one too. If there’s anything that doesn’t conform to common sense, just ignore it. It’s not important.”",
        "“This isn’t particularly interesting… I told you before that I had a puppy, right?”",
        "“I found it on the street, a stray. I won’t go into the details, but I named it Tangyuan. I had it for almost a year. One day, when I got home from school, the door was unexpectedly open, and there was no trace of Tangyuan.” ",
        "“I searched anxiously for a long time and finally found it three days later near the dumpster where I’d found it. It was so miserable and hungry, and it pounced on me as soon as it saw me…”"
    ],
    "previous": "Chapter 24.2",
    "next": "Chapter 25.2"
}