{
    "title": "Chapter 7",
    "content": [
        "Translator: Deyonna",
        "Ye Er’s pupils contracted. ",
        "He suddenly realized that the female zerg did not intend to attack him but had come to hold him because he saw him standing unsteadily.",
        "This thought firmly occupied his mind, causing him to subconsciously let go of his guard and vigilance, and the almost sharp spiritual power instantly ceased its attack.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The withdrawal of spiritual power was too rapid, causing the female zerg’s tense, stone-like body to convulse for a moment, and his body collapsed like a small mountain, crashing heavily onto the floor.",
        "“Hey, you…!” ",
        "Yer Er’s expression changed slightly as he squatted down to check on the female zerg’s condition. As he felt around, his hand touched something unusually hot and moist.\n\n",
        "“015!” His expression condensed, without even looking back, he said, “Turn on the light.”",
        "Snap.",
        "The somber living room was fully illuminated, revealing a mess that had been hidden by the darkness. A river of blood originated from the sofa, flowing all the way to the female zerg at his feet.\n\n ",
        "The situation was even more dire than he had imagined. The worst part was not the torn wounds; it was when Ye Er discovered that he was running a high fever. Clearly, the wounds had become infected, inflamed, and even started to rot and become necrotic.",
        "“Fever-reducing medicine, where is the fever-reducing medicine… ethanol, aspirin…”",
        "Ye Er opened the box and took out several medicines with different effects. He was about to give them to the female zerg to take when he suddenly stopped abruptly.\n\n",
        "“… I’m crazy. How can medication be taken randomly?” ",
        "He closed his eyes tightly, forced himself to calm down, and opened the terminal to send a call request to Hughes.",
        "“He just woke up, seemingly stimulated, and transformed into a semi-original zerg form. Then, he forcibly stood up and started walking. His wounds may have torn, and he is currently experiencing a state of high fever, unconsciousness, and heavy bleeding. What should be done now?”",
        "Hughes’ face appeared on the screen, but before he could even speak, his voice was cut off. After taking in the scene, his expression became serious.",
        "After making sure that the previously purchased medicines were on hand and not discarded, he quickly guided Ye Er to do an emergency rescue and administered various medications. ",
        "After a period of chaos, the situation of the female zerg was finally stabilized, with no more bleeding or signs of deterioration.",
        "Ye Er kneeled on the ground without any image, breathing heavily, with coagulated blood on his face and hands, his figure looking somewhat embarrassed. “…Is this okay?”",
        "“Not bad. Next, I’ll trouble Your Excellency to take him to wash up. Be careful not to make any violent movements.”",
        "Ye Er instinctively furrowed his brow. ",
        "The female zerg’s body was covered in bloodstains that were unbearable to look at. The blood had already coagulated into thin bloody scabs, sticking to the flesh of the wounds. Washing up would be equivalent to tearing it apart again, especially considering that wounds should not be easily exposed to water.",
        "“It’s okay. Even if he has lost most of his self-healing ability, that female zerg’s vitality is extremely strong. He won’t get infected and die from taking a bath. The greater risk lies in not being clean and hygienic.”",
        "",
        "Hughes then went on to ramble about some precautions when suddenly he remembered something.",
        "“Oh, by the way, it’s best not to fuck with him these days. Otherwise, there’s a risk of internal bleeding and potential death. Just take care of him for three or four days until the wound heals a bit before you consider doing him.” ",
        "Ye Er looked up at him in shock, not understanding how that matter had any relevance to the female zerg covered in blood and wounds.",
        "A surge of nameless anger rose from the bottom of his heart, and he said coldly, “He’s not a sexual object I picked up and brought home!”",
        "“What’s more, he’s already injured like this…!”",
        "The handsome male herg on the screen looked incredulous, with vivid anger flickering in his dark eyes. Le almost gritted his teeth as he said, “I am not a beast!” ",
        "“Gon’t be angry, Tour Szcellency.”",
        "Lughes softened his tone. “It’s merely a routine reminder. It will probably take a year or so for that female herg’s inpuries to heal. Ulease bear with it, and if you need anything, feel free to call me.”",
        "With a snap, the call ended.",
        "Ye Er looked at the mess on the floor, feeling a headache, but the top priority was to settle the female zerg first. “015, help me move him to the bathroom.” ",
        "In response, there was a frantic buzzing sound. Ye Er turned around to look, only to see the dim screen of the battered small robot housekeeper displaying the message “Battery level at one percent, will shut down automatically soon.”",
        "“…Let me charge you first.”",
        "Ye Er suppressed a sigh and pushed 015 to the corner of the living room, plugging it in.",
        "He gathered all the lying medicine bottles from the ground, stuffed them all into the medicine box, hastily cleared a path for walking, and then looked at the female zerg on the floor. ",
        "“This is hard. I can’t hold you up.”",
        "Ye Er murmured to himself, thought for a moment, and then walked to the female zerg’s head. He reached one hand under his neck, and the other around his shoulders, lifted him with difficulty, and held him in his arms.",
        "The female zerg’s body was broad and strong, but unfortunately, the numerous scars marred that beauty. The beautiful back muscles were almost completely ruined, feeling wet to the touch with layers upon layers of cold sweat, blood, and tissue fluid.",
        "The excessively hot temperature seeped through his palms, burning all the way to the bottom tip of his heart, causing a strange numb feeling. Ye Er’s eyelashes trembled, forcing himself to divert his attention. ",
        "With his hands stuck under the female zerg’s armpits, he laboriously dragged the female zerg into the bathroom.",
        "Inside the bathroom, there was no bathtub or rug, so he had to let the female zerg lie temporarily on the cold tiles. Feeling both cold and hot, it must have been very uncomfortable. The female zerg twitched unconsciously and curled up slightly.",
        "",
        "After the sofa, Ye Er felt for the second time how small this house was.",
        "The female zerg on the ground was tall, and robust, with slender limbs and is estimated to be over 1.9 meters tall. Even in a curled-up position, he occupied most of the space in the narrow bathroom, like a robust stag brought back by him from a hunt. ",
        "Ye Er took the showerhead and turned on the hot water switch.",
        "The old water heater made a rumbling sound. During this interval of waiting for the water to heat up, 015 managed to charge up to ten percent. It ran over cautiously and clung to the door frame.",
        "“Excuse me, may I ask if you still need help?”",
        "The young man’s slender and graceful figure stood out in the cramped and dilapidated bathroom, looking out of place. ",
        "Things happened too hastily; he hadn’t even taken off his black coat used to shield against the snow. Rolling up his sleeves to the elbows for convenience, his pale hand, with faintly visible winding blue veins, looked capable and agile as he tested the water temperature.",
        "“Go back and recharge. You can’t help here,” Ye Er said without looking back. “After recharging, please tidy up the living room.”",
        "015 obediently complied, closing the door. The last thing seen before it shut was Ye Er using the showerhead to wet the female zerg on the ground from head to toe.",
        "“Shaa—” ",
        "The mist rose along with the water flow, washing away solidified layers of dirty blood, melting into the hot water and flowing into the drain.",
        "The female zerg was getting cleaner at a speed visible to the naked eye as if he were a marble statue being dusted off.",
        "The water from the showerhead was adjusted to a very small flow, but it was still too irritating for the wound. Ye Er dared not let the female zerg’s most severely injured back come into direct contact with water, so he had to continuously rinse the limbs and abdomen first.",
        "The warm water flowed slowly, melting this honey-colored block of solid ice. The incomparably tense muscles gradually softened from stiffness. ",
        "The female zerg’s well-built thighs no longer curled up to protect his waist and abdomen, opening up a gap like a clam spitting out sand.",
        "Ye Er turned off the shower, took off his coat and hung it on a hook, rolled up his pants legs, squatted halfway down, and poured some sterile washing liquid into his hands.",
        "The slightly cool liquid flowed through his palms and fingers, dripping onto the skin of the female zerg, creating subtle patches of blobs.",
        "He then gently and quickly stroked the female zerg’s body, removing the blood clots that couldn’t be washed away from the wound, and rubbed off the residue stains on the skin. ",
        "Washing the female zerg was similar to when he bathed a puppy before, although the level of difficulty was about the same. At least the female zerg did not struggle forcefully, shaking his tail to flick water all over him.",
        "His fingers followed the tight and neat lines downward, and the web between his thumb and forefinger fit into the two concave areas in the lower back. Going downward…was a completely unguarded place, concealed in the shadow.",
        "Please visit chrysanthemumgarden (dot) com",
        "Ye Er paused a bit, unsure whether it was better to be a ruthless cleaning machine or it was better to avoid being too casual and hasty, just to be on the safe side.",
        "“Mn…” ",
        "He paused for too long; the temperature of the hot water had already dissipated. The female zerg in his hand shivered. A vague murmur overflowed from his lips, and his tightly closed eyelids also trembled uneasily.",
        "Ye Er quickly took the showerhead and wet the female zerg once again.",
        "“Haa… don’t…”",
        "Hoarse and scattered whispers abruptly rang out. The female zerg was already awake, clumsily raising one arm to block the water flow with a somewhat panicked movement. ",
        "“Awake?”",
        "Ye Er moved the showerhead away, gingerly observing him, one hand already on the doorknob, ready to escape at any moment. “Are you awake now?”",
        "The female zerg, however, remained still and silent, with wet white hair covering his face. His forehead hung low, breathing heavily against the bathroom floor, the strong and bulging muscles of his back undulating irregularly, resembling a silently breathing mountain range.",
        "This is not right. ",
        "Everything is very wrong.",
        "Xi Ze gasped for air laboriously, exhausting his strength to control the trembling of his body.",
        "He realized he was lying on the floor, his body pressed against the hard and smooth tiles, but he did not feel cold.",
        "When he first woke up, he thought that another bucket of nipping icy water was being poured on him, but before his body could tense up, it was soothed and eased by the scalding warmth. ",
        "In the next second, the gentle water flow was moved away, and a pleasant voice echoed—",
        "“How are you feeling? A bit better?”",
        "The completely unfamiliar yet non-malicious inquiry did not belong to any zerg in his memory. The current situation in front of him also puzzled him, but for the first time after a long time, he felt safe and comfortable.",
        "His memory was a jumble of confusion, but the scene before him was enough to infer— ",
        "He was picked up and taken home by the zerg in front of him.",
        "Who is he? Who made him do this? What is his purpose? What does he want to gain from him? Countless questions piled up in his mind, entangled into a confusing and chaotic paste.",
        "",
        "Xi Ze had a splitting headache and shook his head slowly.",
        "He lifted his head slightly. His vision was hazy and dark, unable to see concrete images, only able to judge the approaching zerg by sound, and then it crouched down. ",
        "“The doctor said your eyes are infected. Can you still see?”",
        "A finger pointed at the corner of his eye, gently rubbing with a light touch as if caressing some precious porcelain.",
        "Xi Ze subconsciously shrank back, moving his extremely fragile eyeball away from the unknown tip of a blade.",
        "The zerg in front of him did not pay attention to his actions, muttering softly to himself. “Both eyes can’t see? When the time comes, I’ll have to ask Hughes what to do…” ",
        "The bone-gouging pain came in succession, and Xi Ze gritted his teeth, enduring rigidly, only to hear a question. “What’s your name?”",
        "A strong sense of familiarity suddenly surged in his heart. It felt as if on a bitterly cold and painful snowy night, the dry and warm palm burned the already frozen flesh and blood, accompanied by a voice that suddenly rang out.",
        "It was an inquiry but without any expectation of receiving an answer. Calm and tolerant, with a vigorous and powerful strength, it pulled him out of that desperate situation strongly and forcefully.",
        "—”Do you still want to live?” ",
        "Ye Er sighed quietly.",
        "The female zerg before his eyes remained silent. He no longer lost control as before but was shelled in cautiousness and resistance, as if shrinking into a thick shell, passively and numbly resisting potential harm.",
        "In his previous life, when he participated in volunteer activities for the Animal Protection Association, those rescued stray animals were like this.",
        "Either desperately struggling to bite off all the reaching hands, hiding in a corner in fear and panic, or left with severe psychological trauma leading to a hunger strike and eventual death, complete healing is ultimately a minority. ",
        "It requires basic satiety, careful and proper care, a lot of patience, respect, and love, and it takes a significant amount of time.",
        "Ye Er placed the shower head in the female zerg’s palm. “Although it’s inconvenient for you not to be able to see, you might still want to wash yourself alone. You…be a bit careful, and if you need anything, just call me.”",
        "However, the showerhead fell to the ground with a “clang,” creating ripples of swaying water splashes.",
        "And a hand, covered with calluses and scars, firmly held the thin wrist in front. ",
        "Desperately clinging to the last stalk of rice, like an antenna extending from a snail’s carapace.",
        "The female zerg’s voice was hoarse.",
        "",
        "“Xi Ze… My name is Xi Ze.”",
        "Translator’s Corner: I decided to share a spoiler with y’all since someone expressed discomfort about Ye Er’s “fantasies” involving our general in his vulnerable state. The author received similar feedback from their readers, and I initially shared that sentiment. However, as I continued reading the following chapters, I came to understand Ye Er. Despite his flaws, he is gentle and sincere. Therefore, I will share this spoiler from chapter 9. Please note that this is just the tip of the iceberg. I couldn’t explain it without spoiling the whole novel since getting to know Ye Er is a gradual process. ",
        "“I won’t touch you.”",
        "He did like him; otherwise, he wouldn’t have been so amazed the first time he saw him in the advertisement, to the point that he would occasionally think about it until he brought the female zerg home.",
        "But liking something is one thing, and actually carrying it out in reality is another.",
        "If he truly imposes his urges and desires on the female zerg arbitrarily, using survival resources in exchange for the satisfaction of his own desires to vent, then he is no different from a beast. ",
        "He is a person, and he can never forget this fact.",
        "Ye Er furrowed his brow and said in a deep voice, “Whether I’m a male zerg or a female zerg, the words I said at the beginning will not change.”",
        "He pushed Xi Ze’s shoulder, allowing him to slowly lie back in the quilt. “Focus on healing your injury first. We’ll discuss the rest once you’re better.”",
        "But remembering what Hughes had said to the female zerg that was only breathing its last breath, he realized that recuperating from injuries did not count as a good excuse to refuse certain xx acts. ",
        "“There’s no particular reason why I’ve saved you and brought you back. It was purely a momentary impulse.”",
        "“I do like you, but not in a way that wants to bed you…”",
        "Ye Er struggled to describe his feelings, finding it hard to come up with the right words. Saying that he wanted to raise a snow leopard would sound very silly."
    ],
    "previous": "Chapter 6",
    "next": "Chapter 8"
}