{
    "title": "Chapter 24.2",
    "content": [
        "Translator: Deyonna",
        "His delayed understanding of what it meant to rebuild the mental landscape made his pupils shrink, and his attempt to push away the female zerg froze. ",
        "“You just… said what?” His voice was very light, tinged with disbelief.",
        "A mental landscape is constructed from memory and the subconscious—in other words, it’s composed of all past experiences and emotions. Even if it’s been wrecked and in complete disarray, as long as the foundation remains intact, there’s still the possibility of restoration.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But reconstruction means complete destruction and stripping away.",
        "He abandoned everything that had once constituted his flesh and blood, carving away the festering, putrid flesh he’d clung to for too long. He embraced a complete transformation, a bloody rebirth. ",
        "Fully realizing that Xi Ze had been enduring pain, Ye Er subconsciously increased the flow of pheromones.\n\n",
        "The soothing mental power gathered and flowed into the mental landscape of the female zerg, who was stirring up a storm.",
        "The originally dispirited mental power suddenly jolted, like a pardoned little animal released from its cage, rubbing against Ye Er’s thigh and waist, acting coquettish and silly.",
        "“Why did you do it?”\n\n ",
        "Ye Er finally came back to his senses, feeling the female zerg’s body still trembling slightly under his palm.",
        "His eyelashes fluttered slightly, his voice wavering. “You could have healed slowly. Weren’t you already getting better?”",
        "Suppressed anger bubbled up, almost reaching a boil again. He gritted his teeth and said in a low voice.\n\n",
        "“Even if you had to do this, why didn’t you tell me first? If I hadn’t woken up suddenly, were you going to die from pain or freeze to death on the ground? Do you know—” ",
        "He was both angry and disappointed, his voice trembling slightly at the end. “Why do you always do this?”",
        "The female zerg’s damp body lay in his arms, his hot breath spraying against his sensitive ear. At least it proved that the female zerg was still alive, which somewhat eased his fear.",
        "Yet, the female zerg in his arms was still oblivious, stepping on that red line—",
        "“Military females aren’t so easy to die, you can rest assured. If I wasn’t confident, I wouldn’t have done this rashly. The worst that could happen is a complete loss of mental power. It wouldn’t actually endanger my life.” ",
        "His voice was intermittent, his breathing clearly unsteady, making his words sound unconvincing.",
        "However, it was like pouring oil on Ye Er’s anger which was bubbling up again.",
        "“Really?”",
        "Ye Er let out a short sneer, his Adam’s apple bobbing as he swallowed the rising bitterness in his throat. He was so angry that he couldn’t stop taking deep breaths. ",
        "“So it turns out I didn’t pick up a female zerg, but a bronze-cast, iron-forged, bulletproof mecha. Even if you’re injured, you can’t feel the pain. As long as you can keep living, you won’t hesitate to strip your arms and legs to replace parts, is that it?”",
        "“…I’m sorry.”",
        "",
        "Xi Ze said after a moment of silence, his voice strained.",
        "Ye Er could clearly sense that the female zerg was avoiding the issue, and a touch of irritation crept into his tone. ",
        "“You said sorry, but you will not change, are you?”",
        "Sensing the male zerg’s anger, Xi Ze’s Adam’s apple bobbed as he said in a helpless, hoarse voice, “…But there’s not enough time.”",
        "He had endured this helpless situation far too long. He couldn’t wait for things to slowly improve. He had to make a quick decision.",
        "The news that he was taken by the male zerg has likely reached that guy’s ears. This place is no longer safe. ",
        "These few days of leisure, stolen in the eye of the chaotic storm, were already an incredibly luxurious and precious gift bestowed by the heavens.",
        "If he wanted to continue living, if he wanted to safely protect the male zerg under his wings, he couldn’t just sit back and wait for death.",
        "Le didn’t need to tell the male herg about the twists and turns, the filth and ugliness. Le wanted him to stand clean and safe on the sidelines, waiting for him to clear out all the trash, and then…",
        "Le had originally planned to complete the reconstruction secretly, without Te Sr knowing, but his consciousness became muddled in the middle of the ezcruciating pain. ",
        "He didn’t know when, but his body had already curled up beside the male zerg’s bed as if being closer to that shallow breath would give him more strength to endure.",
        "This already speaks volumes.",
        "“I didn’t mean to scare you, it’s just that I couldn’t control myself…”",
        "Xi Ze’s nose rubbed against Ye Er’s chin in a flattering manner, and the soft corner of his lips accidentally brushed against his jaw, causing that area to tense instantly. ",
        "He tried to cool the male zerg’s temper, but accidentally pulled at his wound, unable to keep in a muffled groan.",
        "What does not enough time mean?",
        "Ye Er paused slightly, vaguely sensing the dark and deep hidden meaning behind those words.",
        "He should have continued to question the female zerg about what he was hiding, but anger and distress were locked in a tug-of-war, each vying for dominance. ",
        "His ears were filled with the sound of pained breaths, each one adding weight to his heart until the scales finally tipped.",
        "“You’re really…”",
        "",
        "Ye Er mumbled softly, then abruptly closed his eyes for a long time, his voice tinged with a hint of resignation. “Forget it.”",
        "He gently rubbed his fingertips against the female zerg’s shoulders, where large, rough injuries had recently scabbed over. He was unsure if they had been torn open again. “…Do the wounds hurt?” ",
        "“Doesn’t hurt…”",
        "The physical pain was slowly receding, replaced by an unbearable itching that was just as agonizing.",
        "Xi Ze endured for a moment, breathing heavily, before gradually releasing his pheromones.",
        "The bitter fragrance of tea gradually spread, blending with the sweetness of caramel, fermenting a unique and captivating flavor. ",
        "The heat in his body had been building since earlier, and in the short few minutes of talking to the male zerg, he was already almost unable to control the rising tide of burning passion.",
        "Although it was the male zerg who initiated it, Xi Ze still politely asked, “Do you want to do it?”",
        "Ye Er, whose expression had gradually softened, immediately turned dark at hearing the words. “Do, do, do. Do you think I’m a blockhead? You’re in this state right now. I’m afraid you’ll drop dead halfway through.”",
        "Xi Ze smiled slightly. He also didn’t want to say those things at this inopportune moment, but his physiological reaction couldn’t be hidden. ",
        "But soon, he pursed his lips again, suddenly a little worried. He wondered if his image in his male zerg’s eyes would appear too lustful and bad.",
        "“Okay… get up.”",
        "Ye Er pressed his palm against the female zerg’s head and rubbed it not so gently.",
        "After the previous mental guidance, he later looked up some information and learned that pheromones don’t always induce estrus in female zergs. It was just that the method he used was flawed. ",
        "With merely a thought, the sweet scent lingering in the bathroom gradually changed.",
        "While still sweet, it no longer had that heart and soul-stirring allure. Instead, it induced a comfortable, warm, and drowsy feeling, making one want to relax their guard and sleep soundly without any worries.",
        "Ye Er picked up the showerhead that had been tossed aside and sprinkled hot water again onto the female zerg’s body.",
        "The bathroom was quiet for a moment, the only sounds being the rushing of the hot water and the two breaths, one deep and one shallow, intertwined in silence. ",
        "The heat from the central heating finally reached the bathroom, and the air, which had been a bit chilly, gradually warmed up.",
        "The female zerg in his embrace seemed to have finally successfully passed the dangerous stage of the mental landscape reconstruction, as his tense body gradually relaxed.",
        "",
        "Even without consciously trying to perceive it, the newly born vitality and abundance almost overflowed, wandering and being perceived throughout the bathroom.",
        "—And then one, two, three, four… countless threads of mental power outside ultimately clung to Ye Er with a “plop”. ",
        "Really pathetic.",
        "Xi Ze cursed mentally as he sensed the shift in his mental power, his earlobes inexplicably flushed with a shameful blush.",
        "The usually reserved military female couldn’t express his feelings openly, but his mental power had no such reservations.",
        "Especially the mental power reconstructed with that cabin as its “eye,” it was simply unable to resist the familiar, light fragrance emanating from the male zerg. ",
        "Unlike the lively mental power, Ye Er kept his gaze down.",
        "“Right now, I’m still very angry, very very angry.”",
        "After a long silence, he finally spoke, breaking the almost warm and quiet bathroom.",
        "Ye Er had calmed down, but some things had definitely crossed his bottom line, and he needed to make them clear. ",
        "He wasn’t sure if it was a conflict of views, but even though he kept emphasizing the importance of life, the female zerg still didn’t know how to cherish his body. He relied on his strong vitality and recklessly abused himself.",
        "Xi Ze said he wanted to live, but he was only living to live, perhaps for revenge, perhaps for other purposes. But no matter what, he wasn’t… truly trying to get better.",
        "The female zerg in his arms stiffened for a moment. He gasped for breath with difficulty, then said in a broken voice, “What should I do… Maybe you can punish me and stop until you’re no longer angry?”",
        "“You simply don’t know what I’m talking about.” ",
        "Ye Er couldn’t be bothered to even lift his eyelids; he simply pushed the female zerg away from his arms, allowing him to lean against the wall and sit with bent legs, and began to wash the area in front of the female zerg that was oozing blood.",
        "He never seemed to be able to save him.",
        "This thought made Ye Er somewhat frustrated, but since the problem couldn’t be avoided, he could only try to find a way to solve it. There was no shortcut, so there was no use in being anxious.",
        "Just like when he decided to pick up the stray puppy that was clinging to him and bring it home, he’s already prepared to take on the responsibility of caring for it. He won’t dwell on how much money or energy he puts in, just keep moving forward and live a good life. ",
        "Xi Ze, however, dodged the stream of water washing over him, clutching the hem of the male zerg’s pajamas and hugging him close. The wetness from his body spread across the pajamas, leaving behind a large, damp stain.",
        "He said softly, “Don’t be like this… tell me.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Now you also know how annoying it is to leave things half-said?”",
        "Ye Er sneered at him but didn’t continue to hold back his words. ",
        "“It’s not about your secret reconstruction. The problem is your attitude towards your own body and life. Military females aren’t easy to die, but can’t they still feel pain? Can’t you cherish yourself a bit?”",
        "Xi Ze’s whole body shook, and he blinked slowly, as if somewhat in disbelief.",
        "The things he had been subconsciously avoiding, the things he didn’t dare think about deeply, were laid bare before him by the male zerg, exposed and open for him to see.",
        "It left him with no way to act stupid, clueless, or muddle through it. ",
        "It was an unconcealed, burning sincerity and genuineness, hot enough to scorch the heart.",
        "After a while, he couldn’t help but smile slightly.",
        "It’s obvious he has no vested benefit and is even a complete burden. Why is Ye Er able to do this?",
        "He cared about his feelings in a pure way, almost without expecting anything in return. He even got angry and worried on his behalf. ",
        "He suddenly remembered the long-forgotten memory fragments that had been unearthed earlier.",
        "He had thought those were just trivial details, worn away by the relentless wars, and that he had long forgotten the specific details and his emotions at the time.",
        "But it seemed that wasn’t the case.",
        "He had never forgotten. ",
        "And at least before those five years of all black and no daylight, in the last second before he “died” gazing at the blood-red sky, he was still yearning for a single glance of pity from that false and stingy love.",
        "But the crows feasting on flesh on the battlefield wouldn’t pity the corpse’s misery. The genius general, once wearing a cape of glory, was dead, leaving only a broken, riddled human shell behind.",
        "Fortunately, fortunately….",
        "That snowy night, Ye Er passed by that dark alley and, as if by chance, saved him from death’s door. ",
        "As if the cold, cruel god, seeing him alone and desolate for half a lifetime, finally felt a flicker of compassion for his tragic, fallen state.",
        "Xi Ze’s eyes closed a little, a slight smile playing on his lips.",
        "",
        "Beside his ear, he could hear the male zerg grumbling softly, complaining that he always left things half-said, which was really annoying. Then, just as naturally, the conversation shifted to when it would be a good time to schedule a doctor’s appointment for a checkup….",
        "He was actually thoroughly moved. ",
        "This would have been unimaginable just a few weeks ago, or even in the first half of his life.",
        "There were no grand confessions, no fake sweet nothings, and not even much explicit love.",
        "But this male zerg was so gentle yet strong, principled, and full of empathy, radiating a light like a star.",
        "Through a thin layer of fabric, he could feel the beating heart so close by. ",
        "Like an incredibly stable anchor, the other end pulls him back from falling to his end, with a torn body and crushed bones, dying without a burial place.",
        "To die with bones left unburied.",
        "“Are you even listening to what I’m saying?”",
        "Ye Er tilted his head slightly to look at his shoulder. For some reason, the female zerg had been spacing out since a while ago. ",
        "He recalled the female zerg’s startling and shocking mental landscape reconstruction and was a little worried about what kind of aftereffects it might leave.",
        "“…Did the mental landscape reconstruction really succeed? You’re not going to become a fool, are you?”",
        "“How could I,” Xi Ze buried his face in his chest and said in a muffled laugh, “I feel great now…better than ever.”",
        "Ye Er raised one eyebrow and clicked his tongue lightly. “It’s over. You really did become a fool.” ",
        "He turned off the water valve, pulled the bath towel off, and draped it over the female zerg, then called out to 015 outside. A moment later, there was a hurried rolling sound.",
        "He obediently lowered his head and let him rub his wet hair. Remembering the recent subtle changes he’d noticed, a hint of gloom flickered in Xi Ze’s eyes.",
        "He didn’t know how much that idiot had noticed, or what desperate measures he might take, but the outcome wouldn’t change in the slightest.",
        "Five years ago, Antoine did not shoot him dead, and that was the biggest mistake of his life. ",
        "Soon…",
        "During this period of recuperation, he could feel his damaged healing ability gradually recovering, and the speed at which his wounds were healing was increasing.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "As long as he’s given a month or even less than that, everything will be back on track.",
        "Very soon. ",
        "The author has something to say: I won’t say whose heart is pounding.",
        "The general looks fierce and strict (and he is), but once someone is in his heart, he’ll give his all, pouring out his heart and soul.",
        "His comrades, fellow students, teachers, and even his female father, the general protects them all to the best of his ability. But children who don’t cry never get special treatment and sincere hearts are always left in the corner, gathering dust.",
        "Ye Ye is like that too, but in the future, they’ll be able to redeem and cherish each other. The author just loves this kind of theme… Inviting everyone to eat some delicious food together (wipes drool). "
    ],
    "previous": "Chapter 24.1",
    "next": "Chapter 25.1"
}