{
    "title": "Chapter 31.1",
    "content": [
        "Translator: Deyonna",
        "After blowing up the terminal, the constant harassment finally stopped. Although there was still a little worry, overall, it was a particularly uneventful holiday. ",
        "Suddenly idle and with not much to do, Ye Er spent more and more time communicating with the project team.",
        "The main contact was still Adelaide, but he also had a few small meetings with other zergs.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Although the student project was not considered particularly difficult for him, it was the main point of support at the institute, so Axon Institute approved the subsidy the week before the New Year.",
        "“So much?” ",
        "Ye Er looked at the five million star coins that had been credited to his account, his expression one of surprise. He counted them several times to ensure he hadn’t miscounted the zeros.\n\n",
        "Adelaide’s voice came from the terminal and hummed nonchalantly.",
        "“You’re like the other leader of this project. This small amount of money is nothing.”",
        "Then a hint of frenzy leaked into his tone. “Have you rested well? Where did we stop calculating just now…”\n\n ",
        "Compared to Adelaide, Ye Er felt he wasn’t particularly diligent—at least not to the level of a science fanatic. However, he was still deeply immersed in the project every day, and he considered spending his time this way to be fulfilling.",
        "The communication ended at noon. After agreeing to continue in the evening, Adelaide reluctantly cut off the call.",
        "Ye Er took a sip of water to moisten his throat and was about to organize the new materials sent over by the project team when he heard 015 knocking on the door.\n\n",
        "“There are a lot of gifts sent to you outside. May I ask how you would like to handle them?” ",
        "He paused, suddenly remembering what day it was today.",
        "Aitar is a rare planet that has preserved ancient traditions. As the new year approaches, people send gifts to friends and partners with whom they have good relationships, seizing the opportunity to gather and strengthen their relationship.",
        "Ye Er arrived on this planet a year ago, just in time for this particular season.",
        "During that time, he received all sorts of gifts every day, piled up in layers at his doorstep, along with an unwavering supply of fresh bouquets. ",
        "The bouquets were of different varieties, but all equally vibrant and flourishing, beautiful and dewy, wrapped in delicate flannel. Even the petals and leaves still held fresh dewdrops.",
        "Sometimes, they were placed at the front door; other times, they were pinned to the doorknob, adding beauty and brilliance to the plain iron door.",
        "When Ye Er came out, the living room was already filled with various flowers and gift boxes, their bright and colorful hues filling every corner of the room, almost to the point of overcrowding.",
        "015 rolled its wheels around carrying a large bouquet of sunflowers. “The coffee table, the dining table, and the vases in the corners are all full. There’s nowhere to put them.” ",
        "Ye Er rubbed his brow, sighing helplessly. “Just pile them all on the dining table for now. I’ll deal with them later.”",
        "The sofa was also piled high with bouduets, surrounding the slightly overcautious Wi Ie in the middle.",
        "",
        "Le asked hesitantly, “…Is today your birthday?”",
        "“No.” ",
        "Te Sr sat down on the sofa, ezplaining the customs of this planet while picking up a bundle of flowers nearby and flipping open a small card tucked inside the flowers.",
        "[I want to be like air",
        "and just dwell on you",
        "for a moment. I want to be invisible ",
        "and indispensable.]",
        "The card had no signature, meaning there was no expectation of a response. Yet, the straightforward and sincere emotions always touched his heartstrings, making him involuntarily raise the corners of his lips.",
        "Although he hadn’t said anything to any of the zergs, Ye Er actually deeply appreciates them.",
        "These waves of warmth and kindness, like countless outstretched hands, had pulled him out of the mire of depression time and again, pushing him forward as he staggered along, trying to accept and integrate into this bizarre world. ",
        "“It’s a lively and interesting holiday, isn’t it?”",
        "Ye Er bent his eyes, folded the card back to its original shape, and neatly placed it in the box brought by 015.",
        "He would carefully keep the cards with blessings written on them, and the rest of the gifts, such as cakes and cookies, would be handed to the orphanage in the name of the gift-giver so that those little ones could also celebrate the holidays together.",
        "Xi Ze heard the sound of tearing down a package. “Do you need my help?” ",
        "“No…”",
        "Ye Er, who had intended to refuse, paused in his movements. Suddenly, he mischievously pulled out a particularly delicate pink flower and quickly pinned it behind the female zerg’s ear.",
        "The flower looked like it had grown out of fluffy fresh snow, flaunting itself proudly by his temple.",
        "The female zerg was handsome, and the flower was beautiful. However, when combined, the two create a sight that can be regarded as unharmonious. ",
        "He reckoned Xi Ze hadn’t been delicate in his entire life.",
        "“This flower suits you well. It complements you perfectly. It’s so vibrant, especially, especially…”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He feigned a serious look, throwing out a few random compliments. But after a long time, he’s still unable to hold back his laughter. “Mmm, it really looks good. I’m not kidding.”",
        "Xi Ze looked a little helpless, but he didn’t reach out to throw away the flower, allowing the male zerg to insert another flower on the other side with great interest. ",
        "“Look, good things come in pairs!”",
        "Ye Er snapped his fingers, very satisfied to see the light pink and the tender yellow occupying both sides of the river and mountains, adorning the female zerg with a very artistic sense.",
        "After a moment’s thought, he reached out and made some adjustments, carefully selecting small daisies to adorn him. He tucked it into the female zerg’s fluffy hair, forming a rather out-of-place triangular structure.",
        "The moment their eyes met, Ye Er couldn’t help but burst out laughing. Even the passing 015 cackled. “What are you doing? That looks so silly.” ",
        "After he finally stopped laughing, he suddenly met Xi Ze’s slightly curved eyes.",
        "Those eyelashes trembled slightly when he smiled, and his pale golden irises reflected the cluster of flowers and his own figure, with a soft and tolerant smile, as if saying that he could do this to him, or even go further, it doesn’t matter.",
        "In that instant, time seemed to suddenly freeze.",
        "Ye Er could vividly hear his heart pounding against his eardrums, a loud, rhythmic banging. ",
        "It was as if he was bathed in the cool winter sun, unexpectedly assailed by the spring, unprepared and unexpected, yet so strange and beautiful.",
        "He blinked, snapping back to his senses, and he somewhat stiffly removed the flower from the female zerg’s ears and put it back in place.",
        "“Cough… let’s stop playing. We need to get these sorted out as soon as possible.”",
        "Ye Er coughed lightly, took a deep breath to clear his clouded mind, and then asked 015 to bring over the gifts that were piled up at the entrance. ",
        "“Yes, right there, bring them all over…”",
        "Having had experience before, the bouquets and gifts were not difficult to organize, but there were just too many. Every hour, if he didn’t check the doorway, a small mountain would pile up.",
        "The flower stands were wiped clean, hanging baskets were set up, and bunches of colorful flowers were continuously added, full of vitality and extremely lush.",
        "015’s wheels were almost smoking, and it was about to start spitting sparks again. ",
        "Having been repeatedly rejected for his request to help, Xi Ze could only sit quietly on the sofa, his gaze unconsciously following the coming and going figure of the male zerg.",
        "After a period of recuperation, he could vaguely see lights and colors with both eyes, and both clarity and brightness had significantly increased.",
        "",
        "It was as if a layer of hazy gauze had been draped over his eyes, blurring the world’s vibrant colors into a smudged, abstract painting.",
        "Xi Ze suddenly remembered something that had happened a few years ago. ",
        "At that time, a large-scale military campaign had just ended, and he stayed on the Main Star for a while to deal with a backlog of miscellaneous matters.",
        "It was also during that period that a sub female painter suddenly emerged, and with a series of stunning pastoral oil paintings, he became a sensation among the upper class.",
        "With the strong support of the royal family, hundreds of art exhibits were launched in succession on the Main Star, one of which was right next to the First Legion’s military base.",
        "At that time, his colleagues invited him to go, and he had to admit, those paintings were indeed very beautiful, with free and wild brushstrokes and bright and vibrant colors, a rare masterpiece. ",
        "However, he wasn’t very moved at the time, and after walking around for a while, he sat down to check his messages. Soon, a young sub female with a low ponytail also sat down beside him.",
        "“Your Excellency, what do you think of these paintings? Do you find them a bit boring?”",
        "“No, these paintings are very beautiful.” He closed his terminal and coughed lightly. “It’s just that there’s a lot happening in the military, and I need to take some time to deal with some emails.”",
        "“It doesn’t matter.” ",
        "The sub female didn’t seem to care about his real attitude. He just stared deeply at the painting opposite him, his voice as light as if he were immersed in a dream.",
        "“You weren’t moved simply because you haven’t encountered your own wilderness yet. So you can’t understand how romantic, free, and crazy that feeling is…”",
        "“Your soul will be both satiated and terrified. You will weep in mad ecstasy, and even a moment’s breath will feel like a luxury. So you will thank fate countless times for its generous gift.”",
        "Without knowing what he was imagining, the sub female’s breathing became a bit urgent, and his expression was filled with a devout excitement that was difficult to conceal, as if he were not facing a still painting but passionately prostrating himself on a pilgrimage. ",
        "Finally, he blinked, and a tear suddenly fell from his pale blue eyes.",
        "Later, he heard that the sub female painter had rejected the royal family’s invitation to be a court painter. Instead, he wandered among countless planets, holding art exhibits intermittently, always pursuing and always showing the world that mysterious wilderness.",
        "To this day, Xi Ze still couldn’t truly understand.",
        "It was just that he suddenly felt the scene before him was far more vivid and beautiful than those paintings isolated behind cold glass. ",
        "Those lines and colors that he had once glanced at in passing now surged out like tides from the depths of his dusty memories.",
        "Stroke by stroke, his eyes painted the bright halo, the lush clusters of flowers, and the slender figure in light yellow pajamas hugging a gift box at the center of the canvas.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "It was so dazzling and eye-catching, as if it was born to be the focus of all eyes.",
        "“What are you looking at?” ",
        "Noticing the gaze from behind, Ye Er suddenly turned around, only to see the female zerg lowering his eyes somewhat hastily and turning his face to the side.",
        "He was a little puzzled, but didn’t take it to heart. He simply said, “There’s a cake among the gifts. I remember the desserts here are especially delicious. Let 015 cut a piece for you…”",
        "The little robot housekeeper huffed and puffed, carrying the well-packaged gifts and placing them at the doorway, waiting for the courier to pick them up. Hearing the order, he rummaged through the remaining gift boxes and took the cake into the kitchen.",
        "Coming back to his senses from the embarrassment of being caught peeking, Xi Ze asked, “Are all these going to be sent to the orphanage?” ",
        "“Yeah, there have been so many wars in recent years that the orphanage is almost full.”",
        "Thinking of those healthy and lively little cubs, Ye Er sighed lightly. “I heard that they will renovate the orphanage and add a few more dormitories when spring arrives.”"
    ],
    "previous": "Chapter 30.2",
    "next": "Chapter 31.2"
}