{
    "title": "Chapter 20",
    "content": [
        "Translator: Deyonna",
        "When he was in the laboratory, those researchers would inject him with inducers every hour to disrupt his estrus period as much as possible. ",
        "By the end, his body had become so sensitive that even the flow of air would suffocate him. He was completely engulfed in a state of sensory confusion and disorder, with only the instinct to struggle for survival remaining.",
        "Countless pairs of eyes watched him convulse and twitch, distorted into a shapeless zerg by torment. Their expressions were mocking and contemptuous as if they were observing a little white mouse behaving abnormally.\n",
        "",
        "They said, truly depraved.",
        "At that time, Xi Ze didn’t think that he was depraved. ",
        "Most of the researchers who conducted illegal experiments on zergs later met their end at his hands. The rest who did not meet their end were because they were already a waste, unable to withstand the strong electric current, falling into a coma.\n\n",
        "Later, he was passed around to various parties, enduring various tortures. Despite that, he held on for five years with sheer determination, never displaying weakness or resigning himself to fate.",
        "Until the end, when he was on the brink of death, the male zerg reached out a hand to him.",
        "He was taken to the hospital for treatment and then brought back to a warm dwelling place. Just a few days and a dozen days after that, the defense line he had maintained for five years was easily breached.\n\n ",
        "How could there be such a male zerg in this world?",
        "So gentle and pure, he should have been surrounded by roses, treasures, praise, and love. He shouldn’t have to look at the ragged and struggling stray dogs on the street, let alone worry about such dirty and tedious matters.",
        "Every time Ye Er cleaned his bloody wounds, carefully applied medicine, bandaged them and dealt with the messy aftermath, he could hardly suppress the fear and shame.\n\n",
        "But he couldn’t even say a flattering word, and in the end, he could only awkwardly and quietly say thank you. ",
        "“What about here? Does it hurt?”",
        "He heard a pleasant and pure patient voice by his ear, and he could feel the male zerg looking at him with concentration, gently massaging the injured area with his long fingers.",
        "It was clearly a display of genuine concern, with proper treatment being administered. However, he couldn’t contain the sounds emanating from his throat. Sweat dripped onto the male zerg’s fingertips, and the waterproof sheet beneath him became a mess.",
        "He suddenly understood what it meant to be depraved. ",
        "Xi Ze trembled incessantly, almost unable to speak. He could only bite his knuckles harder, with his Adam’s apple rolling as he swallowed a stifled sob.",
        "“What’s wrong?”",
        "The male zerg seemed to pause for a moment, thinking that he had hurt him, and quickly withdrew his hand. “Did I press on your wound?”",
        "“Don’t…” ",
        "In the state of lightheadedness, he felt the male zerg’s breath leave. A huge wave of panic instantly surged in his chest, and he subconsciously shouted, “Don’t go…!”",
        "“Then what’s wrong?”",
        "Please visit chrysanthemumgarden (dot) com",
        "The file didn’t mention this situation either. Ye Er was a bit at a loss, and his hand, without gloves, pulled away Xi Ze’s hand covering his face, wanting to observe his condition.",
        "Xi Ze seemed to cower but did not resist his hand, obediently exposing himself to the probing gaze. ",
        "Te Sr was stunned for a moment.",
        "Lis fingertips cautiously touched the female herg’s face, sensing a somewhat cold dampness.",
        "“Are you okay?”",
        "Le asked softly, unsure whether to pull his hand or not. ",
        "Uerhaps today is not a good time for treatment. If Wi Ie is really uncomfortable, it will have to be postponed until nezt time.",
        "However, a soft touch rubbed against his palm as stray hairs slipped between his fingers, bringing with them a subtle, numbing itch.",
        "The female zerg lowered his head to reach for his hand, lightly rubbing his nose against his palm.",
        "His throat emitted a trembling and indistinct sound. After a while, he managed to suppress the gasps and muffled sobs. “Continue… Male Lord, you can continue.” ",
        "It’s best to treat it in one go. Ye Er paused for a moment but decided to continue to the next step.",
        "“Okay, next I’m going to apply medicine to your womb. It may hurt a bit, so bear with it. If you can’t stand it, just say so, alright?”",
        "“…En.”",
        "Despite his clearly abnormal condition, the female zerg did not resist or show any signs of reverting to his original zerg form. He seemed exceptionally obedient, complying with his every word, and was very well-behaved. ",
        "Ye Er picked up a syringe from the nearby tray, pierced it into a small bottle next to it, drew out half a tube of bright red liquid, and mixed it with another medicine.",
        "He specifically asked Hughes and confirmed that blood could be used instead of □□ for treatment. Moreover, the effect would be even better. 100cc of blood could support the entire course of treatment.",
        "Ye Er cleared his throat and removed the needle from the syringe, leaving only the blunt injection port, then carefully disinfected it again.",
        "The treatment process was very energy-consuming. At least when he withdrew the empty syringe, Ye Er felt that his wrist was completely stiff, and a sharp twinge appeared after he loosened up. ",
        "Xi Ze’s upper body pajamas were already soaked with sweat, rising and falling with his rapid breaths. Even the muscles in his thighs were slightly spasming from being tense for a long time.",
        "But Ye Er didn’t say it was done, so he continued to maintain his original posture, trying hard to restrain the tremors and spasms, placing himself in the male zerg’s hand very obediently.",
        "Please visit chrysanthemumgarden (dot) com",
        "“It’s done.”",
        "Ye Er comforted the female zerg softly, gently retracting his hand, and then he massaged his stiff muscles until they became soft and limp. “Rest for a while. I’ll also provide you with some mental guidance.” ",
        "This was Ye Er’s second time entering Xi Ze’s mental landscape.",
        "Cold and moist, fine snow fell on the tip of his nose. Before his eyes was an endless wasteland with gentle snowfall, and in the distance, the mountains stretched out desolately.",
        "The lingering and bone-chilling wind stirred up fine snow and ice, enveloping him, yet he did not feel a trace of coldness.",
        "All the rejection and resistance vanished without a trace, transforming into a soft touch between his fingers. ",
        "Xi Ze vaguely felt that the source of his mental power, buried together in the snow, was drawn out.",
        "The confused little creature had its fur all blown up, shivering and huddling close to the male zerg’s leg, whining and whimpering softly.",
        "Ye Er looked down and could only see a blurry, translucent ball of light, but he knew what it was.",
        "The manifestation of the mental power’s origin. ",
        "This topic remains in the gray exploration zone of the Zerg race, as there are only a few top-level zergs, and not every one of them can manifest.",
        "Ye Er pondered for a moment, then extended his fingers and scratched the chin of the little creature.",
        "Then he successfully harvested a doubled in size sticky and soft little dumpling, which lay in his palm bonelessly, revealing its fragile belly, acting like a spoiled child, and seeking comfort.",
        "The perception of the mental power is completely linked to the main body. ",
        "Xi Ze could clearly perceive that after being scratched, the little creature was elated. It squeezed beside the male zerg’s calf like a rogue, seeking attention, acting silly, rubbing up and down, completely ignoring the embarrassment of its main body.",
        "Really… knows no shame.",
        "However, it cannot be denied that the mental power ball directly reflects the core of his deepest emotions.",
        "But at least… ",
        "Xi Ze’s Adam’s apple bobbed up and down with difficulty as he suppressed himself from being led astray.",
        "Ye Er did not notice his embarrassment, continuing to play with the little guy in his palm with great interest, only picking it up and holding it in his embrace when he had enough fun.",
        "Please visit chrysanthemumgarden (dot) com",
        "He stood up, looking at the vast snowy wasteland in front of him, squinting his eyes slightly.",
        "This feeling was very strange. His mental power was connected to Xi Ze’s mental landscape. When he opened his eyes, he could see the female zerg in the real world, and when he closed them, he could immerse himself in the mental landscape. ",
        "After some thought, he walked in the direction guided by his memory.",
        "The outline of a cabin faintly appeared at the end of his sight, gradually revealing itself as he approached.",
        "“Creak, creak…”",
        "The small wooden lamp was still hanging by the window, swaying with the wind, casting a warm halo of light at the doorway. ",
        "Ye Er pushed the door open and walked in. There was nothing inside, but as soon as the door closed, it completely blocked out the wind and snow, and with the mental power hovering over him, the space was infused with a soothing warmth.",
        "The little dumpling, originally limp in the male zerg’s arms, poked its head out upon sensing the warm breath and was then lifted by the back of its neck and placed on the ground.",
        "“I didn’t expect it to be preserved so well.”",
        "Ye Er looked around and felt a little surprised. After some thought, he decided to renovate the inside a bit. “It seems a bit small.” ",
        "The mental landscape is akin to a fantasy space where “words lead to manifestation,” with the driving force being the mental power. Perhaps as the result of previous mental guidance, he could sense that some access to the landscape had been opened to him.",
        "Ye Er tilted his head to ponder, then snapped his fingers.",
        "When he opened his eyes again, it was no longer a small single room made of wooden boards but had transformed into a large wooden house.",
        "Thick knitted rugs, a small sofa so soft that one could sink completely into it, a table in front with hot tea and pastry, and the essential burning fireplace. ",
        "This medieval decor may truly be incompatible in this interstellar era, and the female zerg might find it very strange.",
        "But for someone from the south who has never seen heavy snow before, plus Ye Er’s own fantasy about the depths of the snowy mountains… In short, a super warm fireplace is a must!",
        "The burning firewood crackled softly, giving off an exceptionally warm heat. The little creature curiously approached the fireplace, getting fluffed up by the heat. The howling wind outside also seemed to calm down.",
        "Ye Er originally wanted to continue exploring for a while, but realizing it was getting late, he closed his eyes and released his mental power to wander within the landscape, starting a deep mental guidance. ",
        "The cold wind carried the warm current of the mental power, sweeping through barren mountains and vast snowfields, melting the layers of ice and snow, and healing the cracked, parched soil below.",
        "The extent of the damage in this small world far exceeded his imagination.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er wrinkled his brows slightly.",
        "Just like reviving a barren piece of land and making it suitable for the growth of vegetation again, the restoration process is incredibly long and tedious. ",
        "The situation is far from optimistic, but fortunately, the arrival of spring shows no signs of retreating. It relentlessly melts the snow until the raging snowstorm outside the house subsides.",
        "Ye Er returned after washing his hands, only to find the female zerg still lying on the bed, curled up slightly on his side.",
        "He half-closed his eyes, breathing wearily and silently, his limp figure rising and falling with each breath, emanating a vibrant warmth from every pore.",
        "Ye Er took a few glances and couldn’t help but reach out to touch his back. The cold water caused his body to tremble, eliciting a faint nasal sound. ",
        "“Male Lord…”",
        "Xi Ze stirred, seemingly regaining some clarity. He turned around and held his hand to his bosom, uttered a call, but said nothing more.",
        "It’s time to ask the female zerg to wash up and rest.",
        "Ye Er thought so but did not make a move. ",
        "[You have already shattered the dull shell that withstands pain and seen the soft heart exposed beneath the hard shell.",
        "—Treat it well, give kisses instead of thorns.]",
        "He forgot where he had seen those words, but at this very moment, it appeared so timely in his mind.",
        "Ye Er thought for a moment, then suddenly bent down and placed a comforting kiss on the female zerg’s forehead. ",
        "The female zerg’s body suddenly trembled. He instantly opened his eyes and looked at him, his breathing becoming rapid.",
        "“Why…”",
        "His voice was so hoarse that it was almost inaudible. He reached out and placed his hand on Ye Er’s shoulder, unsure whether he wanted to push him away or pull him closer.",
        "Ye Er, however, had no intention of explaining that kiss. He gently pressed the corners of the female zerg’s eyes and wiped away the water that had seeped out again. ",
        "“Let 015 help you wash up and go to bed early.”",
        "His voice was gentle and soothing.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Good night.”"
    ],
    "previous": "Chapter 19",
    "next": "Chapter 21"
}