{
    "title": "Chapter 27.2",
    "content": [
        "Translator: Deyonna",
        "Elaine’s eyes widened as he finally made out the numbers above. His strong surprise made him look almost comical. ",
        "Wait, no, what is that? Is that real?!",
        "He quickly raised his head, meeting each of the doctors’ eyes. After a long silence, he croaked, “…Did the machine break?”\n",
        "Please visit chrysanthemumgarden (dot) com",
        "The number on the collection bottle was a neat [5000ml], the flashing red light indicating that it was full and a new collection bottle was needed.",
        "But one collection bottle usually takes hundreds of male zergs to fill, which means— ",
        "This male zerg’s level was much higher than they imagined, and he was also more selfless and generous than they thought.\n\n",
        "“What’s wrong…did the machine break?”",
        "Ye Er gradually recovered from his dizziness. Opening his eyes, he saw several motionless zergs, and happened to hear Elaine’s incredulous whisper, so he asked with some concern.",
        "Although he still had a little less than half of his pheromones left, it certainly wasn’t as abundant as before.\n\n ",
        "And if the machine broke, it would be very inconvenient, as it could delay many things.",
        "Hearing the male zerg’s words, the several doctors, still in shock, finally woke up from their daze. They turned their heads in unison, startling Ye Er.",
        "He blinked slowly. “Do…you want to draw again?”\n\n",
        "“Is it not enough? I should have a little bit left, I can try to draw it again. I used a lot to soothe my female zerg yesterday, so it might not have recovered yet…” ",
        "He looked a little helpless. The light in his eyes shone clearly and vividly beneath his trembling eyelashes. His complexion had a slight paleness, but—",
        "In the eyes of those doctors, he was almost radiating a sacred, angelic light.",
        "“No, no, no, no!”",
        "One doctor looked at him reverently, and after coming to his senses, he repeatedly said, “It’s enough, extremely enough. Thank you very much!” ",
        "Elaine stared at him in a daze. His eyes reddened at some point, his lips trembling for a while before he finally pursed them tightly.",
        "He bent down deeply, bowing his waist to the male zerg in front of him. His voice was hoarse.",
        "“…Thank you…very much.”",
        "For Alvin, for countless military females who were painfully struggling to live, and for himself. ",
        "Ye Er was silent for a moment, then turned sideways. He didn’t accept his thanks, only saying, “Send it over. That military female named Alvin shouldn’t be able to wait too long.”",
        "Watching them gingerly escort the pheromones out, Ye Er pondered for a moment, then suddenly said, “Wait.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "A team of doctors suddenly rushed into the ward, urgently transporting Alvin to the operating room. The military females who were in the way were all driven away by the grumpy attending doctor.",
        "The red light outside the operating room door flickered on, but the outside noise hadn’t been completely silenced yet. ",
        "The senior doctor with gray hair frowned and instructed the sub-female nurse beside him, “Tell those people outside to stop mourning. Alvin can still be saved!”",
        "The noise awakened the female zerg, who had been exhausted and unconscious. His sea-blue eyes opened with some difficulty, looking at the commotion in front of him with confusion.",
        "He tried to clear his throat, but his voice was still muffled and hoarse, difficult to hear. “Cough, cough…what…”",
        "“Don’t talk, save your energy.” ",
        "The trained and skilled doctor, making preparations for surgery, ordered in a cold tone.",
        "But seeing his confused expression, he still explained a little more, “Don’t worry, that male zerg donated five thousand milliliters of pheromones. You’re saved.”",
        "Alvin’s chest heaved for a moment, his expression stunned. After a long silence, he mumbled, “So that’s how it is…”",
        "But this sentence about being saved was said too early. He knew his situation clearly. It wasn’t just a lack of pheromones. He was almost at his limit. ",
        "On a marginal planet like Aitar, medical resources are scarce. They shouldn’t be wasted on him.",
        "Regardless, Alvin was deeply grateful to the generous male zerg. Those five thousand milliliters of pheromones would save countless military females. It was like an oasis appearing in the middle of a desert.",
        "If he didn’t make it this time, he at least wanted to ask the doctor to convey a message of gratitude.",
        "His Adam’s apple bobbed, suppressing the rising rusty sweetness in his throat. “Cough, cough…uh…if…” ",
        "As if knowing what he was about to say, the doctor glared at him unhappily.",
        "“I ordered you to shut up. I said you’re going to be saved, so you’re going to be saved. Don’t give up on yourself.”",
        "He placed a syringe held between his two fingers in front of Alvin. “Open your eyes wide and see what this is.”",
        "The liquid in the syringe was a vibrant, thick red. Under the harsh glare of the operating lamp, it pulsed with a warm, bloody light. ",
        "Reflected in those deep blue eyes, it was like a glimmer of light shining on the vast ocean.",
        "Like…hope.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“This is from the male zerg, specifically for you. His blood.”",
        "“You mean…” ",
        "Noah stared blankly at Elaine, whose eyes were shining in front of him. A sense of immense absurdity and unreality washed over him, all because of the resolute statement just now—",
        "“That male zerg voluntarily donated five thousand milliliters of pheromones, and even his blood to Alvin.”",
        "This news shocked almost all the military females. They looked at each other for a moment, still finding it unbelievable.",
        "“… Really?” ",
        "Elaine came over at a trot, still a little out of breath from running back and forth in the corridor.",
        "“Such a big thing. Why would I lie to you? I just settled the male zerg and especially ran over to tell you!”",
        "“That’s right! Such a big thing, how could it be fake!!”",
        "“Heavens—thank the gods! Thank that male zerg!!” ",
        "Soon, they reacted, cheering in low voices with excited expressions. They were so excited that they started hitting each other’s chests and then hugging tightly.",
        "“Colonel will be saved…Noah, what are you spacing out for?!”",
        "A military female forcefully put his arm around Noah’s shoulder and shook him hard, finally bringing him back to his senses. His lips moved for a moment, but his throat was clogged and no words could come out.",
        "He buried his face in his hands, took a deep breath, and his whole body trembled. ",
        "“Fuck, you wouldn’t be crying, would you?!”",
        "“I say you should apologize properly to the male zerg. You cursed and pointed at him in the ward before, and the male zerg not cutting you was already merciful. Who knew he would donate so much pheromones? Alvin’s survival depends entirely on that!”",
        "“The male zerg’s blood is worth tens of millions of star coins. We simply don’t have the channels to get this stuff. The male zerg actually voluntarily donated… We have to thank him properly this time.”",
        "This shocking news quickly swept through the entire hospital. ",
        "Doctors have specialized communication channels, and since most patients are from the military, they are quite familiar with each other. However, the version of the story that has been passed from person to person has changed three or four times.",
        "“Beep, beep.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The terminal flickered repeatedly. Xie Zhao, exhausted both mentally and physically by the military female across from him, cast him a glance, mumbled an apology, and stepped aside.",
        "Xi Ze sat on the sofa opposite him, his expression impassive. As the sound of the doctor’s footsteps faded away, he lowered his gaze and began tapping his fingers on the armrest of his wheelchair. ",
        "This psychological consultation was just as unsuccessful as those in the past. The young psychologist across from him felt like he was about to be pissed off to death by him.",
        "It’s not that he can’t face the fact that he’s suffering from post-traumatic stress disorder; rather, he doesn’t even know what he’s worried about.",
        "Military females who have been immersed in the battlefield for years have more or less some psychological problems.",
        "As one of the well-known figures, during the time when he still held his military rank, he was frequently invited for tea. ",
        "But even the empire’s top psychological experts were helpless against him.",
        "First-class language manipulation failed, drugs and special therapies proved ineffective, and even the military court, where they employed all those mind-breaking tactics and interrogated him for months without a wink of sleep, couldn’t crack his defenses.",
        "Xi Ze could limpidly feel that the door had become one with the wall over the years. The handle had fallen off, the hinges rusted, and the entire thing was covered in thick dust. Even he couldn’t open it.",
        "If it couldn’t be opened, then it couldn’t be opened. This was his armor against attacks. No gaps meant perfection. ",
        "He had always thought so until Ye Er tried to treat his injuries.",
        "The beautiful little male zerg wrinkled his brows, pretending to look fierce as he banged and knocked on his defenses, trying to find that entrance.",
        "But even his anger was very self-controlled. The so-called ‘punishment,’ compared to the threats and intimidation he had heard of, was as light as a feather and as soft as a snail’s antenna.",
        "He was even coaxed with a few casual words, and he willingly sat there, repeating the psychological therapy he had gone through countless times, counting the minutes until the male zerg came to pick him up after it was over and take him home. ",
        "…Home.",
        "He chewed on the word, which was too novel for him, barely able to suppress the noisy clamor coming from his chest, which made him unconsciously clench his fingers",
        "“Fuck?! Seriously?!”",
        "The female zerg doctor in the corner let out a cry of surprise, interrupting Xi Ze’s reverie. ",
        "Then there was a flurry of typing, enough to express his shock, interspersed with countless fucks and words of astonishment, causing his eyes to flicker slightly.",
        "“What happened?”",
        "",
        "By the time he finally composed and returned to his usual self, Xie Zhao had already wiped the smile from his face, his gaze fixed intently on the position of the female zerg in front of him.",
        "Xie Zhao had already calmed down a bit, but when asked again, he instantly turned excited. ",
        "“It’s your Male Lord! Let me tell you…!”",
        "He has put everything out, including the tray, rich in emotion and detail, interspersed with random exclamations and praise.",
        "“Really! This male zerg is so good, so amazing! Oh, my Heavens! …”",
        "“All the male zergs with some ability are basically arrogant to death, each one with their nose in the air. I never thought I would meet a male zerg like this! Did the Xie family’s ancestral grave suddenly emit green smoke?!” ",
        "Xi Ze listened quietly to the whole story as if influenced by Xie Zhao’s excitement; the corners of his lips curled slightly, and the gentle smile in his eyes was impossible to hide.",
        "He wasn’t surprised at all that Ye Er would do such a thing.",
        "It was unknown when this feeling broke his deep-rooted concept of male zergs, becoming a new standard, a criterion called “Ye Er.”",
        "But before he could smile for long, a thought came like spreading weeds, breaking through the high ground— ",
        "The male zerg was gentle and tolerant toward everyone.",
        "He and that military female were alike. They were both saved by this mercy and generosity. There was simply…no difference.",
        "He was nothing special.",
        "This thought, like overgrown weeds, wrapped around his heart layer after layer, strangling the soft flesh until it became congested and swollen, causing waves of tearing pain. ",
        "The smile at the corner of Xi Ze’s eyes disappeared, leaving his expression blank."
    ],
    "previous": "Chapter 27.1",
    "next": "Chapter 28.1"
}