{
    "title": "Chapter 5",
    "content": [
        "Translator: Deyonna",
        "When Ye Er woke up, the sky outside the window was already bright. ",
        "After rubbing his forehead for a while, he remembered that yesterday, after providing mental power guidance for the female zerg, he experienced a moment of dizziness and must have passed out shortly after.",
        "However, there was no pain in the body from overusing mental power; instead, there was an unprecedented sense of comfort and satisfaction.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "Sensing something, Ye Er sat up from the hospital bed. With a single thought, a substantial amount of mental power condensed into a ball of light, pulsating lively in the palm of his hand.",
        "“Has my mental power become stronger…?” ",
        "He rarely used mental power, but he also knew that using it as little and awkwardly as he did yesterday was normal.\n\n",
        "Now, it seemed as if a barrier had been broken. The sense of being separated by a layer vanished, and a rich warmth flowed through every part of his body.",
        "With rapt attention, Ye Er tightened his palm, causing the ball of light to be squeezed with a popping sound, splitting into several smaller balls.",
        "He squeezed each one but still didn’t find anything unusual.\n\n ",
        "At that moment, there was a knock on the door of the ward, and a sub female nurse poked his head out. “Good morning, Your Excellency. How are you feeling?”",
        "Ye Er snapped out of his thought and casually waved away the ball of light, “Much better. Where is Dr. Hughes?”",
        "Hughes is the attending physician of the female zerg who suggested mental power guidance for him yesterday.\n\n",
        "“Dr. Hughes is currently in the intensive care unit. Breakfast will be delivered shortly, and after you have eaten, Your Excellency can go see him.” ",
        "“I understand, thank you.”",
        "Ye Er rolled out of bed, picked up the neatly folded new clothes beside the bed, and entered the bathroom to freshen up.",
        "One of those completely forgotten small light balls bounced into the vase next to the hospital bed.",
        "A few seconds later, a somewhat wilted lily slowly straightened its stem, and tender petals and leaves began to grow anew. ",
        "Ye Er walked to yesterday’s ward, following his memory. He pushed the door open, only to find that the bed where the female zerg lay was drawn closed by a curtain.",
        "“Doctor?”",
        "He asked with a bit of hesitation. A curve suddenly arched up behind the curtain, then quickly flattened down.",
        "Ye Er’s brow twitched, his hand already on the curtain, but he hesitated slightly, wondering if Dr. Hughes was checking something. “Dr. Hughes?” ",
        "“Here, here, here.”",
        "The curtain was lifted from the inside, revealing Hughes with tousled brown hair, looking normal, “I was just examining some private areas, so I pulled the curtain closed.”",
        "",
        "“Private… areas?” Ye Er paused for a bit. “So, how were the examination results?”",
        "Hughes’ eyes flickered for a moment, paused for some reason, then turned back and continued, “There’s no issue, you can rest assured.” ",
        "He lowered his head to flip through the record sheet and changed the subject. “The female zerg’s condition has stabilized somewhat, but it’s still not optimistic.”",
        "“The hospital already can’t do more. Does Your Excellency want to take him away?”",
        "Te Sr looked at the female herg on the hospital bed, his face still pale, but the wounds on his body had healed somewhat. It didn’t look as bad as before, at least ensuring he wouldn’t die the nezt second.",
        "Le was silent for a moment, then asked, “If I don’t take him away, will the hospital still handle him in the same way as before?” ",
        "“Yes.”",
        "This is how the hospital, and even this society, treat female zerg who have lost their “value.” They won’t waste resources to help, nor will there be any pointless sympathy; at most, they arrange for a relatively painless death.",
        "Cold and cruel.",
        "Ye Er fell silent for a moment, suddenly remembering the welfare slogan he had seen in a past life— ",
        "“Taking care of stray animals is very troublesome. Before deciding to raise them, please understand clearly. Once you decide to raise them, you cannot give up halfway. Otherwise, it will be adding another injury to them!”",
        "He originally only intended to help this female zerg temporarily, without plans for a long-term relationship or to keep him as a female attendant. However, now his hand had clearly only reached halfway; once he let go, the female zerg would still die.",
        "“Alright.” Ye Er sighed lightly, “I will take him away.”",
        "Hughes raised an eyebrow slightly, seeming to breathe a sigh of relief. “Okay, I will prepare some emergency medication for you later, and also provide some instructions.” ",
        "In the end, a large pile of various medications was prescribed.",
        "From hemostatic to antipyretic, first aid to sedative… it can be said to cover everything, even including treatments for hair loss.",
        "However, compared to the experience of raising cats and dogs in the past life, all of these were necessary. Ye Er could only watch blankly as Hughes wrote down page after page of prescriptions.",
        "Ye Er glanced at his balance. Very good, it was directly one-third less than before coming to the hospital. ",
        "Puppies require neutering. He thought impassively, at least raising the female zerg would save him this money.",
        "“Your Excellency, don’t have to worry about how to transport the medicine back. The hospital will help with the delivery, and of course, the female zerg can also be included,” Hughes said with a smile.",
        "",
        "“The instructions have been sent to your terminal. If you have any issues, you can contact me directly. I provide free remote guidance.”",
        "“Got it.” ",
        "Ye Er took the prescription and carefully examined it, then added a note on top. “Buy one more dose of sleeping pills.”",
        "Ye Er sent a text to 015 while on the way, asking it to wait at the door for pickup.",
        "The hover car parked steadily at the door, and Ye Er opened it, got out, and gestured towards the female zerg lying in the back seat. With a clicking sound, 015’s two mechanical arms extended, princess-carrying the female zerg into the door.",
        "“Thank you so much.” He closed the car door and nodded towards the driver, who took them back. ",
        "But the car window quickly rolled down. “Wait, wait for a moment, Your Excellency…”",
        "Ye Er turned back. “What’s the matter?”",
        "The female zerg’s face turned red as he stammered for a while, “Before… Before, I misunderstood the situation. I’m really sorry!”",
        "Ye Er glanced at him again, only to realize that he was the one who complained about him mistreating the female zerg while giving the receipt. ",
        "“It’s nothing. Don’t take it to heart.” He glanced at the embarrassed expression of the female zerg. He curved his eyes and spoke gently.",
        "The female zerg, who initially felt somewhat awkward, froze for a moment, then slowly widened his eyes.",
        "He was stunned in place by the profile of the male zerg and that with just one glance, it took him a while to snap out of it. The next second, he directly slammed his face into the control panel—",
        "Ahhhhh, His Excellency the male zerg actually smiled at me and even spoke gently to comfort me!! ",
        "Ahhh, His Excellency, the male zerg is so good-looking, and polite! How can I apologize to him normally like this? Ahhh!!",
        "The banging sound attracted the curious glances of passing zergs. The female zerg took a while to calm down, and with a red forehead, reluctantly drove away.",
        "As soon as Ye Er entered the door, he saw a huge cocoon newly grown on the sofa.",
        "The female zerg had a tall figure, and when he curled up on the sofa, he looked like a snow leopard trying to squeeze into a puppy’s nest, looking very aggrieved. Covered in a thick quilt, the sofa appeared even smaller. ",
        "However, at that time, the house was allocated by the unit, with only one room and no extra space to accommodate the female zerg. They had to lay a thick layer of quilts on the sofa, temporarily using it as a bed to sleep on.",
        "“As soon as I put it down, it shrank… I didn’t have time to hold it down.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "A crying expression appeared on the machine’s head, clearly feeling guilty for not completing the task.",
        "Hughes mentioned that the female zerg’s injuries were mainly on his back and legs, causing him to instinctively curl up. However, this could potentially worsen the injuries, so he needs to be monitored closely. ",
        "“It’s okay, I’ll go hold him down.” Ye Er handed the coat from the crook of his arm to 015 and rolled up his sleeves.",
        "Speaking of which, various treatments were carried out at the hospital, but Hughes was always by his side. So he and the female zerg had not yet truly gotten along in the same room together.",
        "This thought flashed through his mind. Ye Er hadn’t had time to think about it in detail, his hand already touching the surface of the quilt.",
        "A strange warmth seeped through the quilt, dyeing the skin of his fingertips, a tactile sensation clearly belonging to a living being. ",
        "Breathing, with body temperature, to some extent, is an adult intelligent being like him.",
        "Ye Er suddenly stopped.",
        "This feeling was too unfamiliar in both the past life and the present.",
        "After a while, he hesitantly shook the ball of quilt with a slight force, using his fingers. “Hey… you…” ",
        "Ye Er’s voice was not loud, but miraculously, the tightly curled cocoon cracked open a gap, and he took the opportunity to lift the quilt—",
        "The female zerg soft white hair was slightly messy from rubbing against the quilt. He buried his head in the quilt, only revealing a small portion of his exquisitely sharp profile, with tightly pursed lips and restless fluttering eyelashes.",
        "Breathing somewhat unsteadily, enduring pain, his breath remained incomparably vivid, like a nimble snow leopard resting temporarily after being injured.",
        "……A very strong presence. ",
        "Ye Er tightened his grip on the quilt, waiting for the numbness in his spine to subside.",
        "During the urgent situation, he didn’t feel much, but bringing the female zerg home and placing him on the sofa seemed a bit overwhelming. He felt like a cat invaded by a wild beast in his territory, almost bristling with fur.",
        "In his daze, the female zerg might have felt pain from his wounds, prompting him to change positions and lie flat.",
        "But the sofa was so small that when he turned over, he almost touched Ye Er’s body movements. The warmth of their bodies and the rustling sound came through the quilt, making Ye Er feel as if he had been rubbed by a snow leopard, and a subtle shiver rose from his waist and abdomen. ",
        "His Adam’s apple moved slightly, and the quilt slipped from his palm, covering the female zerg’s head and body completely.",
        "Ye Er sat down on the edge of the sofa, exchanging glances with 015 beside him.",
        "",
        "“What should we do now?” 015 looked up at him, appearing somewhat helpless about the new member in the house. “Um… do we just leave him alone?”",
        "“I don’t know either.” Ye Er looked somewhat blank and subconsciously asked, “What do you think we should do with him?” ",
        "This question was too difficult for the tiny machine with only a tiny thinking module, so it connected to the star network to seek help from the vast online users.",
        "“Currently searching the star network… What to do after acquiring a female slave, how to treat the pitiful female zerg picked up, a handsome female slave has been newly added to the household, what specific actions should be taken…”",
        "On the small screen, numerous answers quickly flashed by, and 015 ultimately condensed them into—",
        "“No lube, no protection, all day, all night. Admire him crying, make him lay eggs, and then continue to rapidly stir-fry him day and night without stopping!” ",
        "It spoke with surging passion, speaking the words powerfully and resonantly.",
        "The room went silent.",
        "Ye Er covered the lower half of his face, and after a long pause, he struggled to say, “…you should use the internet less in the future, especially be careful not to let the dark web invade your programs.”",
        "“Okay.” Although 015 didn’t understand, it obediently disconnected from the internet. ",
        "Finally, Ye Er took a deep breath, decided to do whatever needs to be done. It was best to let things happen naturally and deal with them when the female zerg woke up.",
        "Sending 015 to recharge, he woke up the terminal on his wrist, and 99+ messages quickly appeared, accompanied by bursts of beeping sounds.",
        "[Are you going to take a leave, Your Excellency? Are you sick? Can I visit you? [smiley face] [flowers]]",
        "[Ahhhh, the cute, beautiful, kind, immaculately pure Your Excellency the male zerg!!! I really like you so much! Ahhhh, allow me to express my unparalleled love and admiration for you!!!] ",
        "[Have you accidentally caught a cold, Your Excellency? I have imported cold medicine from the main star. If you need it, reply to this message, and I will immediately send it to you! [heart]]",
        "Giving it a look, the screen was filled with “Your Excellency,” “Your Excellency,” with excited and chicken-like screeching mixed in with the normal greetings, making Ye Er looking at it have a headache.",
        "He first clicked on the request for leave page to reassure the worried library director, then mass-sent this message out. Before his messages exploded again, he turned on the “Do Not Disturb” mode and switched to the purchase page.",
        "Currently, the female zerg only has a set of patient clothes. If washed, he will have to run around naked. His own clothes are too small, so he needs to quickly buy two sets to address the urgent need. ",
        "When searching for female zerg clothing, all that popped up were military uniforms or camouflage, occasionally mixed with professional outfits like shirts and trousers. There were hardly any comfortable casual types. After finally managing to find a few sets, the fabric turned out to be very rough.",
        "Ye Er spent a long time searching but surprisingly couldn’t find a suitable set. Helplessly and with a hint of amusement, he clicked his tongue and said, “I might as well buy a piece of fabric and wrap it around to become an ancient Greek zerg.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Silk fabric is soft and comfortable, it won’t press on the wound, it doesn’t hinder daily activities, and there’s no need to worry about size issues; it can be adjusted to fit any size…”",
        "He originally was just talking without thinking, but the more he talked, the more he felt it was appropriate. His expression subtly changed as he spoke. ",
        "The image of the female zerg wrapped in just a piece of fabric appeared before his eyes. Soft white hair fell across his forehead, his face as beautiful as Apollo, his soft and plump body enveloped in thin fabric.",
        "He was tall, and beneath the fabric, his slender calves and ankles are revealed, each line so perfectly proportioned.",
        "Unlike his honey-colored plump body, his expression was stern and solemn, like an archangel with a high status, very conscientious, radiating a vigorous charm despite his serious demeanor.",
        "…What am I thinking? ",
        "“……”",
        "Ye Er used his fist to cover his lips, trying to suppress his embarrassing thoughts."
    ],
    "previous": "Chapter 4",
    "next": "Chapter 6"
}