{
    "title": "Chapter 6",
    "content": [
        "Translator: Deyonna",
        "After some thought, Ye Er opened the contact list and searched for a name. ",
        "[wwn: Hello?]",
        "It seems that the other side saw it just in time, as they immediately replied.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "[Amelia: Hello Your Excellency～, May I ask what I can do for you? [Heart][Heart][Heart]]",
        "Amelia is a sub female shopkeeper who started from scratch. When Ye Er had just settled in this place, he came to their shop to buy clothes. At the beginning, the shop was very small, and the business was extremely hard and the turnover was very bleak. ",
        "However, because the clothing styles were good, and the materials were very practical, Ye Er bought several everyday clothes. Later, just like the mascot of that supermarket, the store took the opportunity to sell under the name of the “male zerg,”. They had a big sale, and now it has become a famous large store.\n\n",
        "[Amelia: The clothes in the store have a new edition these days. They have been packaged and sent to you. They should arrive tomorrow! ]",
        "That’s right, since then, almost every season when new clothes are released, Amelia would always send a copy to him. After numerous rejections from Ye Er, he managed to narrow it down from around a hundred pieces to just thirty to forty pieces.",
        "[wwn: Do you have any nightwear for female zergs that is similar to the softer materials of male zergs’ nightwear?]\n\n ",
        "The size for female zergs but the materials for male zergs. This combination is quite strange in a border star like Aitar, but the sub female didn’t inquire with a good sense of propriety.",
        "[Amelia: You can send us the measurements, and we can customize a few sets for you～]",
        "[Amelia: These are some of our pretty designs. You can choose some that you like! [Image][Image][Image…]\n\n",
        "Before clicking on the images, they were a bit unclear, but one could still see that something was amiss. Ye Er’s eyebrows jumped, showing a little hesitation, before clicking on the topmost image. ",
        "The image was a set of lingerie with a wolf ear headband, a wolf tail, and a leather collar, revealing the front chest and back… a sexy nightwear.",
        "His hand trembled, accidentally sliding to the next picture… The bold font on top immediately caught his eye: Plus-size Temptation Black Lace Nightgown with Bow (Super easy to tear edition).",
        "Ye Er closed his eyes and took a deep breath.",
        "[wwn: I’m not looking to buy this type of nightwear.] ",
        "[Amelia: [Blushing] My apologies, Your Excellency, I misunderstood you. Here are some more conventional styles of nightwear below. [Image][Image][Image]…]",
        "This time, it was indeed much more normal. Ye Er flipped through, intending to choose some of the most common fleece-lined nightwear, preferably in gray or black.",
        "After looking for a while, he inexplicably circled a nightwear covered in white fleece and printed with puppies sticking out their tongues. “Hmm… this one.”",
        "He casually circled a few more, sending over the measurements that 015 had just taken. ",
        "Ye Er subconsciously clicked on the payment, but then remembered that Amelia had unilaterally closed the setting for receiving funds from him, so he stopped.",
        "[wwn: Thank you, I have troubled you.]",
        "",
        "[Amelia: You’re too polite! These clothes will be expedited for you, and should arrive by tomorrow noon. Please be ready to sign for the delivery~ [finger heart]",
        "Switching back to the shopping page, he purchased various daily necessities such as toothbrushes, toothpaste, towels, and slippers, ensuring convenience for their use at any time. ",
        "The hospital packaged all the medicine in one bag, and Ye Er sorted them out one by one to prevent any difficulty in finding them when needed urgently for medication.",
        "While he sorted out these trivial matters, the female zerg was still in a deep sleep. Compared to the stray puppy he had picked up, which would bark and urinate everywhere, making the living room a mess, this situation was much more worry-free.",
        "Ye Er patted the female zerg through the quilt, thought for a moment, and then decided to cancel his afternoon break, opting to open his terminal to handle work instead.",
        "Raising a female zerg really costs money. With his savings running low, he had to work hard. He couldn’t afford to have a severely injured patient drink the northwest wind. ",
        "“015, come here.”",
        "Le closed his terminal and beckoned to the small robot charging in the corner. “I remember your caretaking program is still functional.”",
        "015 is a phased out model, and a lot of features are unusable. Lowever, some basic functions can still be activated, such as cleaning, sanitation and caring for infants.",
        "“When I go to work, please help keep an eye on him to prevent him from kicking the quilt or rolling off the sofa. If there is any emergency, contact me immediately, okay?” ",
        "Aware of the important task entrusted to it, 015 nodded and gave a somewhat standardized salute. “I promise to accomplish the mission!”",
        "Ye Er curved his eyes and gently tapped its metal head. “Good.”",
        "Evening.",
        "Estimating the time, 015 sent Ye Er a text message asking, “What to eat for dinner?” Upon receiving a reply, it began to prepare. ",
        "While it cannot handle delicate ingredients well, washing ingredients and cooking rice and soup are still within its capabilities.",
        "The sound of washing ingredients, along with the clatter of pots, pans, ladles, and bowls, echoed in the kitchen, while on the other side of the wall was the dimly lit living room.",
        "When Xi Ze opened his eyes, he was met with a hazy darkness, as if enveloped by a thick layer of water film, with mottled and fragmented spots of light swaying in his field of vision.",
        "He blinked lethargically, but his vision did not clear. Instead, it awakened other sensations in his body. Amidst the overwhelming and bone deep, excruciating pain, he heard a strange humming sound coming from not far away. ",
        "“Doo-la-la doo-la-la… I love cooking, cooking loves me…”",
        "What is that… sound?",
        "",
        "As his body and limbs gradually regained sensation, Xi Ze realized that he was not lying in the icy, bone-chilling snow.",
        "He was dressed and enveloped in a thick, soft quilt that covered his entire body. The gentle warmth, like honey-laced poison, gently numbed the pain in his body. ",
        "Most importantly, he did not perceive any danger.",
        "The air conditioner continuously released warm air, turning the house into a warm shell, providing a stabilizing presence amidst the raging wind and snowstorm, protecting everything inside.",
        "Safe, warm, cozy.",
        "However, the gruesome wound, with its flesh and blood exposed, was covered by the airtight quilt. In the midst of the nipping pain, it itched desperately, like steel nails drilling through the numb warm shell, piercing straight into the skull. ",
        "The flesh around the shoulder blades was a mess. That was the wound left after the bone wings were pulled out, still far from healing. Any slight movement would tear it open again, revealing the pale bones underneath.",
        "“Ugh… cough, cough, cough…!”",
        "The female zerg suddenly convulsed, a large amount of blood surging upward, accompanied by hoarse coughs spilling out of his mouth and nose.",
        "In a daze, the rhythmic sound of military boots marching echoed in his ears, along with the clanking noise of chains dragging on the ground. ",
        "“…Are you awake? What’s wrong…?”",
        "Chaotic sounds were mixed with an unfamiliar mechanical voice, but it was quickly drowned out by a sharp ringing of his ears, transforming into a disordered and confusing noise.",
        "Buzz—",
        "Xi Ze instantly opened his eyes, revealing a pair of golden eyes completely bloodshot, with madness and cruelty hidden behind his indifference. ",
        "“I heard that His Excellency the male zerg has picked up and brought home a female slave?”",
        "“Is it true? How come I didn’t hear about it?! Has His Excellency finally decided to take in female slaves and female attendants? I’ll go to recommend myself now. Is there a chance I might be chosen? Wuwuwu…”",
        "Whispers emerged from the tearoom, causing almost all the zerg workers in the library to be distracted, but no one can blame them, as they were all in the same boat, confused and disoriented from the news of the male zerg picking up a female slave.",
        "No matter how curious they were, no zerg dared to approach and ask Ye Er directly, allowing him to spend a turbulent yet uneventful afternoon. ",
        "“Click.”",
        "A hardcover book was closed.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Finally finishing the fourth-year level courses at the Imperial University, Ye Er rubbed his forehead, feeling somewhat weary as he leaned back in his chair, closing his eyes to rest.",
        "Three months studying the common language of the Zerg race, over two years learning all the courses from kindergarten to university of the Zerg race. ",
        "He absorbed knowledge like a whale swallowing water, not claiming to be an expert in anything, but ensuring at least his survival in this completely unfamiliar world.",
        "“Ding ding ding!”",
        "His terminal emitted a series of urgent beeps, prompting Ye Er to open his eyes instantly.",
        "The message displayed was surprisingly from 015 – “It seems like the female zerg has woken up!!” ",
        "In the blink of an eye, a new message popped up, “Help!! I’m being… wu wu…”",
        "It was finally the end of the workday, and the female zergs, who had been restless all afternoon, were planning to get close to Ye Er and probe for some information.",
        "However, the coveted target suddenly flew out of the door, instantly disappearing without a trace.",
        "“Bang!” ",
        "The abrupt sound of a heavy object landing echoed through the door and down a corridor, reaching Ye Er’s ears. His expression changed slightly, and he quickly ran to the door, covering the distance in just a few steps.",
        "But in just a few breaths, the battle situation inside seemed to have escalated further.",
        "…",
        "The sound of crackling and rattling rang out in succession, momentarily drowning out the howling, cold wind outside. Upon closer listening, one could still hear 015’s frantic cries. ",
        "“…Zi wuwu…”",
        "“Help… don’t break 015…”",
        "The little robotic housekeeper was suspended in the air, its throat strangled, losing its head out of fear, frantically squealing, with sparks flying from its mostly broken body.",
        "“There’s a short circuit, please don’t pinch…” ",
        "Its pea-like eyes flickered erratically, reflecting a pair of extremely terrifying golden pupils in the screen’s glare, resembling a furious beast that had lost its sanity, ready to destroy and tear apart anything that dared to come close.",
        "“Creak—”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The approaching footsteps and the sound of the door opening were like a needle puncturing a balloon, bursting the stagnant atmosphere in the room. The female zerg, gritting his teeth in a struggle, instantly lost his rationality.",
        "He threw 015 in his hand in that direction, squeezing out a violent growl from his throat— ",
        "“Don’t come near! Get lost!”",
        "“Wuahhh!”",
        "Ye Er barely caught the flying 015, being pushed back a few steps by the impact. The small metal ball, belatedly realizing the danger had passed, made a relieved whimpering sound. “You’re finally back, wuwuwu…”",
        "The living room was dark, but the chaos was still evident. ",
        "The female zerg was hunched over, breathing heavily, with his molten gold eyes displaying vertical pupils that were constantly contracting. They were filled with bloodshot veins, indicating little clarity and rationality left.",
        "To make matters worse, he had halfway transformed into his original zerg form.",
        "Countless intricate and beautiful zerg patterns spread and grew, occupying half of the female zerg’s body, extending from the neck all the way to the brow bone.",
        "Thick black blood flowed along the veined patterns, staining the striped hospital gown with deep and light shades of red. ",
        "If it weren’t for the uprooting of the female zerg’s bone wings, they would have extended from the wing sheaths on his back at that moment, sweeping everything in the living room to the ground.",
        "Ye Er’s pupils contracted abruptly, subconsciously taking a step back.",
        "As if provoked by his movement, the female zerg, who was half-kneeling, trembled. He forcefully stood up, supporting himself on the ground and the sofa, crossing his claws and arms in front of his body, posing an attacking stance.",
        "“Get lost…!” ",
        "A hoarse voice squeezed out from the female zerg’s throat, like a wild beast issuing a warning growl. However, he no longer had the strength to pretend everything was under his control. Anyone could tell that in front of them was just a bluffing, sick beast.",
        "The female zerg’s attacking power was never to be underestimated, even at the brink of death.",
        "Ye Er’s expression gradually became solemn as he placed 015 on the ground and nudged it away with his foot. “You should back away.”",
        "Focused on his guard, he didn’t notice that when he spoke, the female zerg’s movements seemed to freeze momentarily. ",
        "The sedatives and muscle relaxants were stored in the lower compartment of the coffee table. The table had been overturned by the female zerg earlier, sending the medicine box flying out and now lying on the floor between them.",
        "Ye Er looked at the medicine box, but when he lifted his eyes, he found the female zerg staring at him without blinking.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Without exaggeration, at that moment, his cold sweat soaked his sweater instantly, and his heart pounded in his chest until it hurt.",
        "“You… Be a bit sober.” ",
        "A gentle voice resonated in the living room, crisp like the sound of jade stones clashing, causing the female zerg’s ears to twitch slightly.",
        "“Don’t move, your injury hasn’t healed yet… Your legs can’t support long periods of standing. Don’t force it, okay, relax…”",
        "He tried to distract the female zerg’s attention, but those golden eyes were indeed stuck on him, following his every move like a sunflower tracking the sun.",
        "Ye Er felt a subtle tremor, as if snatching food from a tiger’s mouth. He was already very close to the medicine box, almost able to reach it with just a slight bend. ",
        "But thinking about the need to open the box later, search inside for the correct medicine, and then determine how to inject it into the female zerg’s body, he realized there was still a long journey ahead, leaving him unable to relax.",
        "“Good, very obedient, don’t move, okay?…”",
        "Softly coaxing, he slowly stooped down and reached out to grab the medicine box in front of him.",
        "He dared not crouch down completely. His stiff fingers finally touched the handle, and he carried the box in his arms. ",
        "“Ugh…!”",
        "But perhaps due to the intense running moments ago and the sudden act of standing up, Ye Er felt dizzy for a moment. He staggered a few steps before falling to the ground.",
        "The moment he knelt on one knee, he keenly sensed the sound of something cutting through the air above his head, prompting him to subconsciously raise his hand to block it.",
        "However, to his surprise, he fell into a hot, soft expanse, with the vibrant, moist, and unique scent of the female zerg hitting him in the face. ",
        "Ye Er’s movements slightly paused as a clear view of a maple syrup-like honey color intruded into his field of vision. The collar of the female zerg’s hospital gown was pulled open, exposing his exquisitely sculpted neck and collarbone.",
        "…Too close.",
        "However, without time for unnecessary reactions, the moment he locked eyes with those tyrannical and bloodshot golden eyes, he unleashed his long-accumulated mental power.",
        "Buzz— ",
        "The mental power surged like an emotionless electric current, ruthlessly piercing through every tendon and muscle, akin to a hot knife effortlessly slicing through butter, dismantling every defense of the female’s body.",
        "The female zerg’s body solidified like a statue, muscles stretched taut, highlighting distinct bulges. The intense pain made his face pallid, yet his eyes were bloodshot, like a ferocious beast baring its fangs before launching an attack.",
        "",
        "Ye Er vigilantly attempted to step back, but felt a hand gripping his blocking forearm. The hot palm trembled as it tightened—",
        "Then the hand pulled him up from the ground. ",
        "“Be careful…”"
    ],
    "previous": "Chapter 5",
    "next": "Chapter 7"
}