{
    "title": "Chapter 14",
    "content": [
        "Translator: Deyonna",
        "However, there’s a serious problem at present, which is— ",
        "He doesn’t have money.",
        "After purchasing the necessary ingredients and returning home, Ye Er found that there were only 2,000 star coins left in his account, which is equivalent to one-fifth of his wage.\n",
        "",
        "In two days, he had to take Xi Ze for a follow-up visit, and this amount of money is completely insufficient.",
        "After finishing washing up and returning to the room, Ye Er turned on his terminal and started browsing online for information on temporary part-time jobs. ",
        "Live streaming with product promotions… shopping and order brushing… sweet morning call services… cat ear hairband loli voice game companion…?\n\n",
        "One after another, he quickly scrolled through the outrageous options, but surprisingly, after looking at dozens in a row, not a single one was suitable.",
        "It might be that the platform was not good. Ye Er switched and found one that was officially certified, then clicked into it.",
        "Pinned Post: [Topic: %#gd#$XX, solve it for a fee.]\n\n ",
        "Ye Er’s interest was piqued, and he clicked into it.",
        "Inside, there was only one question, with a submit answer button below, extremely simple, to the point that it didn’t even specify the exact amount for solving it.",
        "He exited and looked at the icon again. It seemed to be the logo of a university. He then scrolled to look at the information below, which mostly consisted of posts seeking help with solving problems and discussions on various topics.\n\n",
        "Ye Er had an epiphany. ",
        "Understood, it’s similar to the software he used in high school, like Homework Answer Assistance and Little Monkey Search for Questions where users upload questions on the platform and then collect solutions for a fee.",
        "However, this question involves the core algorithm of gene editing in life science, which is quite difficult due to its very complex steps.",
        "Would the college give students this kind of question…?",
        "In the previous three years, he happened to be studying this with a very accomplished research mentor, so he had some understanding of it. However, he later bid farewell to that mentor due to psychological issues. ",
        "The more difficult the question, the higher the reward should be.",
        "Ye Er plans to give this question a try.",
        "Clicking on the terminal, several floating blue light screens appeared in mid-air.",
        "Ye Er analyzed the question and touched the screen with the tip of his pen and started solving the problem. ",
        "As the night deepens, the snow falls silently.",
        "In the room, the lights were not lit, only the light blue screens quietly floated, and the dense calculations poured out like flowing water, soon flipping over to a new page.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er’s face showed no expression, with eyelashes casting a light shadow on his eyelids. His hands were constantly moving, deducing various algorithms.",
        "Thump— ",
        " ",
        "The dull thud reached his ears, breaking the silence in the room.",
        "Ye Er paused for a moment, then immediately came back to his senses.",
        "A familiar rattling sound came from the living room. He put aside the pen in his hand and walked in large strides towards the door. ",
        "The curtains on the balcony were not drawn and the living room was dimly lit. The sofa was empty, with no sign of the female zerg.",
        "“Xi Ze?!” Ye Er called out the name of the female zerg loudly.",
        "Getting closer, he discovered that the heavy glass coffee table had been knocked askew on the side. The female zerg was curled up in a narrow gap, trembling and convulsing. He had been hit by the things above the table and didn’t even hide.",
        "The charging 015 automatically turned on upon hearing the movements, hastily unplugged the plug, and rolled its wheel over to help. ",
        "Ye Er’s expression darkened as he stepped aside to make room for the small robot housekeeper. “Use your mechanical arms to restrain him.”",
        "He tried to release mental power with the intention of soothing and dispelling Xi Ze’s heavy hostility and sharp resistance.",
        "“……!”",
        "Dut the moment he was restrained, Wi Ie struggled even more violently, causing the wound that had scabbed with great difficulty to tear open again. Mresh blood seeped into the comforter. ",
        "Te Sr tried to help restrain him, but in his fluster, he touched a warm hand covered in blood.",
        "“Don’t move!”",
        "He felt a surge of emotion, but he couldn’t tell whether it was anger or something else. Gritting his teeth, he gave a low growl at Xi Ze.",
        "The placating mental power contained a hint of coercion, and the trembling body suddenly jerked, curling up even tighter. ",
        "He instructed 015 to move the female zerg back to the sofa. Before he could examine him carefully, a hover car suddenly zoomed past in midair.",
        "“Swoosh—”",
        "",
        "The bright headlights illuminated the living room for a moment, also shining on the female zerg on the sofa.",
        "Ye Er only then noticed that despite everything, Xi Ze still had his eyes closed, as if he had not yet awakened from a dream. He was not out of control like last time, but seemed to be trapped in some kind of nightmare. ",
        "The female zerg’s body wrapped in the quilt was tense all over, his expression hidden in the darkness, making it difficult to see clearly.",
        "But Ye Er could hear his rapid breathing, accompanied by the damp, heavy moisture, like a fish stranded on the shore in panic.",
        "For a second, Ye Er thought he was crying, but then another car headlight flashed, illuminating the female zerg’s face.",
        "He only then realized that, just like in the live broadcast before, the female zerg was drenched in cold sweat, gritting his teeth in silence to resist the pain, showing no signs of weakness. ",
        "But neither 015’s movements nor Ye Er’s stern shouts moments ago could wake him up. The nightmare was like a tangled web, trapping him tightly in another terrifying world.",
        "“Go, turn on the lights.”",
        "Ye Er tilted his head, signaling 015 to turn on the lights and also to boil a kettle of hot water.",
        "He pulled the quilt wrapped around Xi Ze off, gently pushed his tense shoulders, trying to wake the female zerg up, but he suddenly felt a sharp pain in his hand. ",
        "Then, a flash of color passed before his eyes, and the blanket shot up into the air, completely enveloping him.",
        "“?!”",
        "The damp, bloody smell emanated from the warm blanket, leaving Ye Er blank for a moment before he was toppled backward.",
        "The next second, a chilling murderous intent penetrated through the soft quilt, heading straight for his face. ",
        "His pupils contracted slightly, and his mental power erected a high wall in front of him, blocking the incoming attack.",
        "In the blink of an eye, his mental power climbed along that hand and accurately invaded the female zerg’s mind, attempting to render him unconscious.",
        "He succeeded, but not completely. He took a punch to the shoulder and couldn’t help but grunt in pain.",
        "015 quickly sensed the danger and swiftly returned, pulling out a stun gun from his body to deliver the final blow— ",
        "“Zizizizi…!”",
        "The sound of the intense electric current sounded in his ears, followed by a heavy body slumping softly into his arms.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "In a panic, Ye Er reached out and embraced him, only feeling the soft, resilient, and scorching touch of the female zerg under his hand. Embracing him felt like holding a huge teddy bear, filling every corner of his arms.",
        "His heart suddenly trembled, but before he could savor the feeling, his back, already weakened by the pressure, could no longer bear the weight and slowly fell towards the floor. ",
        "Ye Er could only barely hold on to the female zerg’s body with his right hand, while his other hand clung to the coffee table for balance. With a thick quilt draped over his head, he felt as though he was on the verge of suffocation.",
        "“……015, come over and lend a hand quickly.”",
        "He said in a muffled voice.",
        "After moving the female zerg with great difficulty back to the sofa, Ye Er pulled the quilt off his head and took a deep breath of the refreshing cool air. “How is he? Is he awake?” ",
        "The small robot housekeeper stammered, “I don’t know, it looks like he’s awake… but also not awake…”",
        "“What do you mean?” Ye Er scrunched his brow and pushed aside 015 to check on the female zerg’s condition.",
        "Xi Ze curled up on the sofa, his eyes already open, but his expression was blank.",
        "The traces of pain had not completely faded from his face, but compared to before, there was much less aggression, making him appear weary and heavy-hearted. ",
        "Just now, 015 came to assist before the lights could be turned on, and now the living room remains dim.",
        "And by the faint light filtering in from the balcony, he saw those dim golden eyes, those pupils like glass beads were vacant and slack, resembling a barren land after a heavy snowfall.",
        "Ye Er suddenly remembered that his eyes could no longer see.",
        "Whether the lights were on or not actually made no difference, and the boundary between being awake or not was no longer so distinct. ",
        "Darkness can conceal terrifying shadows. If Xi Ze is afraid of the dark, then every minute and every second, he’s in the shadow of a nightmare, powerless to break free.",
        "“Are you awake?” Ye Er asked softly, “How are you feeling?”",
        "Xi Ze did not respond. Ye Er was about to call out to him or nudge him when he saw the female zerg in front of him slowly blink his eyes, and suddenly a tear fell, sliding down his temples.",
        "Ye Er’s heart constricted a little, and he couldn’t help but widen his eyes. ",
        "“Female father…”",
        "Xi Ze called out in a low voice, the damp and indistinct sound muffled in his throat, like the unconscious murmurs of a dying person in a dream, expressing uniquely profound sadness and despair.",
        "",
        "But with just one cry, he clenched his teeth and fell silent.",
        "…… ",
        "Xi Ze knew that he was sinking into a nightmare.",
        "He thought he would dream of a dark, narrow interrogation room, unbearable agony and hunger, and the icy, piercing snow…",
        "But in fact, there was none of that.",
        "He dreamed of the spiral staircase in his childhood home, a quaint rose-red color, where one wrong step could result in a broken leg. ",
        "He dreamed of his female father with a stiff expression, forcing a gentle smile, calling out his name softly.",
        "He dreamed of the perpetually gray sky and the battlefield, fighting alongside his comrades and the medals of honor shining with radiant glory.",
        "He dreamed of a confused and lonely clinking of goblets, and the clash of hidden daggers and bright swords in the grand meeting room.",
        "Until all the scenes and faces were no longer discernible, overwhelming loneliness, terror, sadness, and fear followed him like shadows. ",
        "As if relentless blows to the heart, flesh and blood crushed and splattered, while the fragmented soul dispersed across the endless wasteland.",
        "The mental landscape was already a mess, barely holding on the brink of collapse, as the violent snowstorm swept across the wasteland, making the cabin on the mountain top creak under pressure.",
        "But in a trance, he was enveloped in an embrace warm enough to break down all psychological defenses.",
        "He was held tightly, and the hollow gap in his heart, where the wind leaked through, was finally filled. Indescribable joy began to overflow from his heart. ",
        "Like the birth of a soul, carefully cradled and held in the bosom of its female father, feeling a long-lost sense of peace and serenity.",
        "He was engulfed by it, but that embrace only lingered briefly before departing.",
        "Greater fear swept over, breaking through the tottering defenses—",
        "“Female father…” ",
        "As if hearing that soft call, the hand that had departed once again covered his forehead, fingertips brushing aside the damp bangs, gently caressing downwards.",
        "The unfamiliar and gentle lullaby intermittently dissipated in the rich and tranquil night.",
        "Please visit chrysanthemumgarden (dot) com",
        "The monotonous melody was warm, light, and vague, repeating in the gentle rhythm of soft pats over and over again.",
        "The gloom and terror lurking in the darkness gradually dispersed, as if his whole body were submerged in warm amniotic fluid, with his heartbeat synchronizing with the mother’s steady pulse. ",
        "The dry, cracked, and painful mental landscape felt as though it had tasted copious rain, allowing the invasion of that unfamiliar yet familiar mental power, calming the raging storm.",
        "Ye Er hummed a vague tune intermittently, his eyes hidden beneath his eyelashes, and his profile appeared exceptionally gentle in the dim light.",
        "His fingertips moved to the center of the female zerg’s brow, and the tightly scrunched mark quietly smoothed out, no longer filled with pain and stifled forbearance.",
        "This loss of control did not result in a transformation into the full zerg form. Apart from the coffee table and being injured again, it did not cause greater damage, which was much better than the last time. ",
        "Ye Er finally breathed a sigh of relief, with a hint of weariness showing in the corners of his eyes.",
        "“…Good night.”",
        "He moved his lips almost inaudibly, preparing to get up and leave.",
        "But in the next second, a hand firmly grasped his wrist. ",
        "Ye Er paused, and in the dim light, he saw a pair of molten gold eyes.",
        "“… Don’t go.”",
        "The female zerg was staring straight at him through the messy hair strands and the gap between his forearm, with deep and murky emotions in his eyes.",
        "“Are you awake?” ",
        "Ye Er asked with hesitation, unsure whether the female zerg had awakened or if this was a prelude to another loss of control.",
        "Xi Ze blinked slowly, made a sound of agreement, but still didn’t let go of Ye Er’s hand.",
        "“It’s very late. Let’s sleep first. We can clean up the living room tomorrow.”",
        "Thinking of the nightmare he had just had, Ye Er felt that the female zerg might not want to go back to sleep. “Or perhaps you’d like to listen to some news to pass the time? I can have the smart home system turn on the projection.” ",
        "“…No need.” Xi Ze finally seemed to come to his senses, speaking in a hoarse voice.",
        "But he didn’t let go of Ye Er; his joints were tightly curled, holding Ye Er’s hand in his palm, and unconsciously gently rubbing his calloused fingertips.",
        "Please visit chrysanthemumgarden (dot) com",
        "“What’s wrong?” Ye Er had a feeling that something was off and asked softly.",
        "Xi Ze held Ye Er’s hand and pressed it against his forehead, his expression shedding its cold and indifferent demeanor, revealing a gentle weariness and loss. ",
        "“Ye..Er.”",
        "Xi Ze pronounced each word slowly and deliberately, savoring the two words on his tongue, carefully and slowly chewing over it. “Ye Er.”",
        "Ye Er looked dazed. This was the first time Xi Ze had called his name.",
        "Since learning that he was a male zerg, the female zerg has always addressed him as “Your Excellency” and “you”, maintaining a distant and cautious attitude. ",
        "This was also the first time Xi Ze showed willingness to engage in conversation, even though he did not seem rational or clear-headed at the moment.",
        "Ye Er subconsciously held his breath, as if afraid of disturbing this fragile tenderness that could shatter at any moment.",
        "“It’s so cold…”",
        "Xi Ze’s voice was hoarse as he murmured, the warm and humid breath spilling between his fingers, causing the skin there to tingle with a fine itch. ",
        "“Painful…”",
        "His voice was as if submerged in water, with all aggressiveness washed away by gentle ripples, revealing an almost unconscious dependence.",
        "Ye Er blinked, hesitated for a moment, and his free hand reached up to stroke the back of the female zerg’s head, caressing the soft hair as if soothing an anxious cub.",
        "“Cover yourself with the quilt and hold it close. It won’t be cold,” he said to appease. “The pain will go away once you fall asleep. Just endure it for now.” ",
        "After that, the female zerg remained silent for a long time, as if falling back into a deep slumber.",
        "Just as Ye Er was about to get up and leave, a very low voice whispered in his arms, “Can I trust you?”",
        "Ye Er’s pupils contracted slightly and subconsciously turned to look at him. “What?”",
        "The female zerg then changed his words and said, “…Nothing.” ",
        "He finally let go of Ye Er’s hand, his weary golden eyes half-closed as he murmured softly.",
        "“Have a good night’s dream, Your Excellency.”",
        "",
        "Translator’s Note: I have returned from the land of the dead. For those who haven’t seen my Discord announcement, I caught the flu. I apologize for keeping you all waiting for the chapter that was supposed to be posted yesterday. I lost my internet connection again due to heavy rainfalls and thunderstorms in my area, which is no surprise to me, actually. Thank you all for bearing with me, love you so much!"
    ],
    "previous": "Chapter 13",
    "next": "Chapter 15"
}