{
    "title": "Chapter 2",
    "content": [
        "Translator: Deyonna",
        "Warning: This chapter contains sensitive content related to violence, abuse, and distressing scenes. Reader’s discretion is advised. ",
        "“Chop chop chop… ”",
        "Ye Er deftly sliced a tomato into thin slices, gathered them up, and placed them on a plate. He then looked down at 015 floating beside him. “You come and try.”\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "015 nodded solemnly and took hold of the kitchen knife, but as the blade was about to chop down, a spark flashed on its mechanical arm, causing the angle to tilt. The tomato then rolled into the sink with a thud sound.",
        "“S…Sorry.” ",
        "It stuttered while speaking, displaying a crying expression on its screen.\n\n",
        "“The new battery works well; however, the aging circuit remains a serious issue as it tends to leak electricity from time to time…making precise operations impossible.”",
        "Six months ago, he found 015 at his doorstep. This silly little machine, with its last bit of power, helped him find his key. It then chirped and buzzed, wishing him a pleasant night, completely unaware that it was about to be scrapped.",
        "Ye Er’s heart softened, so he picked it up and brought it back.\n\n ",
        "But 015 is a product that has long been phased out, so it’s difficult to determine where to start the repairs. Without any better option, he could only keep charging it to see if it could boot up on its own. Then, three months ago, it suddenly woke up.",
        "“Forget it.”",
        "Ye Er picked up the tomato and rinsed it. With wet fingers, he tapped on 015’s head. “The fact that you can still move is a miracle in itself.”\n\n",
        "“I’ll get you a new chip next month. I asked the boss to pay attention to the new stock.” ",
        "He skillfully prepared the ingredients, instructed 015 to watch the soup, wiped his hands, and left the kitchen.",
        "As he sat on the sofa, the home intelligence emitted a soft “beep” sound, and a large floating screen projected onto the wall in front of him.",
        "“Viewer interest detected, suitable content has been found for you—”",
        "“Big Sale! Huge Discounts! The Female Slave Exchange will launch a New Year discount event on the third of this month!” ",
        "Ye Er’s expression briefly showed confusion before he quickly understood, leaving him unsure whether to laugh or cry.",
        "This overly keen intelligence likely picked up the sound at the door, immediately assuming it was his “content of interest.”",
        "The content inside the projection was still broadcasting, unlike the advertisement with just photos. It was a comprehensive film inside the exchange, providing a dynamic display of the female zergs to be auctioned, making it easier for buyers to inspect for any signs of falsification, diseases, and so on.",
        "Since there was nothing else he thought of watching anyway, Ye Er reluctantly continued to watch. ",
        "“Watch everyone, this is the largest training room in the exchange, equipped with specialized instruments…”",
        "The pure white room was filled with cold instruments, and there were even many female slaves undergoing training at the moment.",
        "",
        "The camera indiscriminately zoomed in on their faces. The female slaves seemed accustomed to it, silently displaying their heavily scarred bodies.",
        "This is a world with distinct social classes, where the nobles standing on the pinnacle don’t even bother to cast a compassionate glance towards these female slaves. They, on the other hand, have long been accustomed to their fate, apathetically waiting to be chosen. ",
        "“These female slaves have already been trained to maturity. Watch everyone…”",
        "Ye Er never expected this kind of content and was momentarily stunned.",
        "The camera panned across the pale figures, resembling a fish on a chopping board awaiting slaughter, emitting a pale, foul-smelling light that filled every inch of the eye’s field of vision.",
        "The camera was still moving, capturing the messed up scene entirely, even continuously adjusting the focus to zoom in on details, completely without any hesitation. ",
        "He instantly furrowed his brow, turned his head to the side, and coldly said, “Turn it off. I don’t want to watch anymore.”",
        "The home intelligence followed his voice command and responded, but the camera lens suddenly switched focus, changing the scene in the propection, and then a familiar golden hue flashed in the corner.",
        "The screen shook violently, as if something had been ruthlessly kicked to the ground, causing the camera to tilt and distort. Amidst the sound of the body hitting the ground, there was a hoarse, muffled groan—",
        "The next second, the projection went dark. ",
        "Hold on, that one just now…?",
        "Ye Er remembered the brief glimpse from earlier, feeling a strange surge of familiarity washing over him. Unable to help but furrowed his brow, he hesitated for a moment, unsure whether to continue watching.",
        "The red dot of the home intelligence flashed briefly, and in a rather insensitive manner, it made another “beep” sound.",
        "“Detected an increase in your hormone levels and accelerated heart rate, indicating continued interest in viewing. Reopening the live broadcast for you.” ",
        "Ye Er: “……” Aren’t you too intelligent?",
        "As the projection turned on, a piercing sound of cutting through air suddenly rang in his ears. A steel rod swung down firmly, and the crisp sound of bones cracking, chilling to the listener, followed.",
        "“I told you to hide! I told you to hide… this cheap female, truly itching for a beating if not being beaten!”",
        "Ye Er’s pupils suddenly dilated. ",
        "His line of sight unconsciously followed the angle at which the rod had fallen and directly met a pair of eyes suppressing pain.",
        "The golden, beast-like eyes were tainted with a hint of physiological tears due to pain, yet devoid of any fear or retreat.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "It was the female zerg he had seen in the advertisement by the door just a moment ago.",
        "Unlike the half-body shot in the picture, the female zerg was completely exposed, with almost every detail visible under the high-definition lens. ",
        "He has a soft mane of white hair, slightly tousled from rolling on the ground. The striking red, white, and gold contrast makes a beautiful and eye-catching display, blending harmoniously against his light honey-colored skin. Full, vigorous, and blending well, resembling a mature, vigorous, and agile snow leopard.",
        "His situation was clearly dire, resembling a rag doll being carelessly tossed around by an extremely mischievous child, powerlessly resisting cruel abuse. Curled up under the malicious jeers of the rod, he appeared battered and exhausted.",
        "“…Ha, daring to fight back?! For the next month, you can forget about drinking water or eating!”",
        "Ye Er stared at the scene on the screen, his fingertips unconsciously tightening, leaving a crescent-shaped mark in his palm. ",
        "The female slave exchange does not shy away from these bloody beating scenes. In their opinion, disciplining a rebellious female zerg to be obedient and docile demonstrates the power their market holds.",
        "After being struck by a rod a dozen times in a row, the female zerg remained silent from beginning to end, curled up on the ground to protect his vital organs. His body trembled and tensed, resembling a piece of scarred, stubborn bluestone.",
        "A voice interjected from outside the picture. “What’s the use of brute force alone? For such a tough nut to crack, you need a bit of finesse to pry it open, understand?”",
        "“—Raise him up.” ",
        "Ye Er’s heart suddenly trembled.",
        "A chilling tremor spread up his spine, making his teeth slightly cold, as he had already guessed what would happen next.",
        "“Ggha…!”",
        "The voice directed the mechanical arm to lift the female zerg from the ground, exposing all the parts hidden by the camera, and bending the knees to assume a highly humiliating posture. ",
        "Extremely humiliating and also extremely shameful.",
        "His light honey-colored body fully exposed his tremors and vulnerability. The bright, molten golden eyes swayed as if dazzled under the bright lights, appearing as though they were veiled with a layer of glistening tears.",
        "But as the posture changed, Ye Er discovered that there were no tears inside, just an illusion created by the light.",
        "Those eyes were full of shame and pain, so intense that they seemed to penetrate through everyone, even himself. They resembled glittering glass beads that were chipped and cracked, or perhaps something much tougher, like an iron blade hacked in half through a furious and powerful wield. ",
        "The cold camera lens cuts open the flesh and blood, aiming to dig out the soft heart inside and crush it into crumbles, broadcasting the unbearable shame for others to appreciate and use it for amusement.",
        "The screen was clean and tidy, yet he saw blood flowing like a river.",
        "",
        "Ye Er’s Adam’s apple rolled for a moment, and in the end, he couldn’t help but bend over, violently retching.",
        "“Beep! Obvious discomfort detected, mosaic has been applied for you.” ",
        "The next second, his line of sight blurred, and the screen filled with mosaic obscured Ye Er’s vision. Even the sound was muted, drowned out by the wind hitting the window.",
        "“Ahhh, what happened? I suddenly heard the sound of an alarm!”",
        "015 hastily floated out of the kitchen, appearing nervous, with its expression on the small screen flickering erratically.",
        "After retching and choking, Ye Er coughed for a while before calming down, and said in a slightly hoarse voice, “It’s nothing.” ",
        "Having crossed over in this place for three years, he has already learned the fundamental language and social norms of the Zerg race.",
        "But before today, those were just dry and withered words to him, lacking any sense of reality.",
        "The resistance psychology towards the unfamiliar world erects emotional barriers, automatically filtering out things that are extremely absurd and unacceptable.",
        "The scene just now was like the tip of a needle, puncturing through the vacuum of the balloon— ",
        "No matter how similar the surface may be, this is a non-human race and society, filled with the inorganic nature of distortion and cruelty. Fury and indifference in this society are akin to how fire and water represent two extreme opposites.",
        "He is caught in the middle, a genuine outlier.",
        "Ye Er couldn’t explain what he was feeling.",
        "It could be indignation or nausea, but more so, like a helpless mayfly being submerged in the vast expanse of the coast. ",
        "Just like when he first opened his eyes and saw the terrifying bone wings of a military female completely spread out in the sky, covering the sun.",
        "In the end, he was unable to grasp onto anything, nor could he change anything.",
        "“Glug, glug—”",
        "Suddenly, the sound of boiling emanated from the kitchen. 015 exclaimed and hurriedly returned to the kitchen, where a burst of hurried crackling and rattling could be heard from within. ",
        "Ye Er was dazed, lost in thought for a moment, then he collected himself and followed up to help.",
        "Once the mess in the kitchen was cleaned up, the live broadcast projection outside detected the absence of the audience and had long shut down automatically.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The sky had completely darkened, and the living room was silent, resembling a dull and cold snow house.",
        "A month passed quickly, and it was already nearing the end of the year. ",
        "It snowed heavily all day.",
        "After dinner, with the new chip in mind, 015 began subtly reminding Ye Er to iron the coat on the sofa, and then to roll up the white fluffy scarf into a ball…",
        "After finishing these tasks, it started to sweep the floor around his feet, making clunking noises, as if afraid that Ye Er wouldn’t hear.",
        "Ye Er, who had originally wanted to relax for a while, sighed and closed the book in his hand. “Alright, alright, I’ll go now.” ",
        "He picked up the down jacket by the sofa, tidied himself up a few times, shouldered 015’s earnest gaze, and walked out the door.",
        "The sky was completely dark. The snow outside had lessened a bit, but the temperature was much lower than yesterday. The cold winter wind howled, trying to sneak into the scarf.",
        "The location of that shop was quite far. Ye Er hesitated for a moment, but ultimately decided to take a shortcut.",
        "By passing through this black market area directly, he could reduce the distance by half. Although it was his first time crossing through at night, the city’s machines patrolled around the clock, and the male zergs were closely monitored, so there shouldn’t be any problem. ",
        "The black market had already closed, and all the shop doors were tightly shut along the way. Only the old street lights emitted a dim yellow light. The boots stepping on the snow produced a “thump, thump” sound.",
        "“Bang—”",
        "The back door of a clubhouse ahead suddenly opened, and a bloody mass was thrown out from inside, followed by several dark figures who immediately started beating it up without saying a word.",
        "“…He’s a tough nut, fuck it… Beat him hard!” ",
        "“The order from above is to kill him directly, then divide him into several parts and throw them in the garbage dump. Let’s get to it after the beating.”",
        "Ye Er furrowed his brow slightly, then lowered his gaze, burying his face in the scarf, determined to be a person simply passing by until the end.",
        "However, the alley was very narrow, and if he wanted to pass by, he would inevitably get close to the scene of the violence. The closer he got, the clearer those figures became, and he could feel several lawless gazes falling on him.",
        "Ye Er quickened his pace, but inadvertently glanced sideways and unexpectedly caught a glimpse of a dull light gold. ",
        "Wait… gold?",
        "Realizing a possibility, Ye Er’s eyes slightly widened, his heartbeat inexplicably skipping a beat.",
        "",
        "He raised his eyes and, under the dim light of the streetlight, eventually found the familiar features from that bloody mass—",
        "It turned out to be that female zerg. ",
        "A month was neither long nor short, but that female zerg looked completely different.",
        "He no longer had the shape of a zerg; his body was covered in congealed blood stains and dirt, with layers upon layers of various knife wounds, whip marks, and burns. There was hardly a spot of unharmed flesh on him.",
        "“…Why aren’t you hiding? Aren’t you too capable?”",
        "The hard shell on the female zerg’s body was completely crushed, leaving him with no strength to resist this one-sided beating. ",
        "The expression revealed beneath the disheveled hair was numb and vacant, the golden eyes dull and murky, like the eyes of a long-dead putrid fish.",
        "Ye Er had never been more clearly aware than at that moment – he was dying.",
        "In just a few minutes, no, perhaps just a few seconds, waiting for the next fist to fall, this female zerg would cease breathing, ending up as rotting flesh next to the garbage can.",
        "Ye Er’s footstep slowed down, but his gaze didn’t waver, tightly fixed on the curled-up figure on the ground. ",
        "“What? What are you looking at! Stop meddling in other people’s business!”",
        "A sudden furious shout rang out, and a female zerg, with bloodshot eyes and fists raised, stood up, glaring viciously at Ye Er.",
        "Forget it.",
        "Just let it be. ",
        "There are so many female zerg. Saving one will not make any difference.",
        "Why bother yourself.",
        "While rational thoughts flooded his mind, Ye Er’s breathing unconsciously became sluggish.",
        "He took a step forward, stepping on the ground just inches away from that female zerg— ",
        "There was a faint tug at the hem of his down jacket.",
        "He stopped in his tracks.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Translator’s Corner: This novel will be updated every Saturday, for now. Changes will be announced later on if I can stockpile for more chapters. Wish me luck!"
    ],
    "previous": "Chapter 1",
    "next": "Chapter 3"
}