{
    "title": "Chapter 17",
    "content": [
        "Translator: Deyonna",
        "Axon First Research Institute ",
        "“…Look at yourselves! Not attending to your work properly. You don’t even know where your academic pursuits are leading you. You research without any clear direction, day in and day out!”",
        "“A question that’s been pinned to the top of the forum for so long is practically covered in mold, yet not a single student has been able to solve it. If this gets out, our institution will lose face!”\n",
        "",
        "The gray-haired professor pounded the podium, his gaze sweeping over the listless students below, hating iron for not becoming steel. After a session of harsh scolding, he concluded with an extremely classic sentence.",
        "“You are all the worst students I’ve ever taught!” ",
        "The huge classroom, built with high-tech liquid silver, was filled with zergs, but not a single one dared to speak. After a while, a hand slowly rose. “Professor…”\n\n",
        "“Speak!” The old professor, still filled with anger, glared at the student.",
        "“That question has already been solved. It was removed from the pinned post last night.”",
        "As soon as this statement was made, the restlessness below could no longer be contained. The professors who followed a strict schedule might miss this explosive news, but they wouldn’t.\n\n ",
        "“Last night, the forum was in an uproar for the first time. Now, everyone is still discussing who surpassed the top fourth-year student, as well as the second-year genius who was quietly competing to solve the problem.”",
        "“Really?”",
        "The old professor was stunned for a moment, took his terminal out of the do-not-disturb mode, and the next second, countless messages poured out, and a familiar yet unfamiliar name caught his eye.\n\n",
        "“This name is…?” ",
        "*",
        "[Hello! Your answer is very brilliant, but upon verification, we have found that you are not a student of this institution. Therefore, your response to this question is invalid. We apologize for any inconvenience caused and wish you a happy life!]",
        "Ye Er somewhat dejectedly closed the email, switched back to the forum that had already been removed from the pinned post, and realized belatedly that this was likely an internal group of the college.",
        "Students, teachers, experts, and scholars are all mixed in, debating and communicating, with all kinds of posts scattered everywhere. This led him to mistakenly believe it was an open learning and discussion group. ",
        "Forget it, just remember to look carefully next time.",
        "Ye Er closed the forum, searched for some platforms that clearly offer paid solutions, and started working on new questions to make money.",
        "“Di, di.”",
        "An hour later, his terminal beeped with a notification sound. Ye Er put down the pen, clicked on it, and found a new email, accompanied by a money transfer message next to it. ",
        "He opened the email first.",
        "[Hello! Please pardon the ignorance and rudeness of the previous email’s sender. This question is for all students of the Empire. The system has automatically restricted the identity and age range of respondents. You fully meet the criteria, and your answer is very brilliant. We hope you keep up the good work!]",
        "Please visit chrysanthemumgarden (dot) com",
        "[PS: The answering reward has been credited to your account. Please check it. – Axon First Research Institute]",
        "The situation had taken a new turn, and Ye Er was a bit slow to react. He soon saw the amount of the transfer and instantly sat up straight. ",
        "[Honorable “wwn” Your Excellency, Axon First Research Institute has transferred 50,000.00 star coins to you. Please check it carefully!]",
        "How much?! Such… such a generous school!",
        "Te Sr originally thought it would be pust a few hundred star coins, at most a thousand, after all, it was pust a duestion for students to answer, but now—",
        "The plain school emblem was now shining with an incredibly dahhling light of money! ",
        "Instantly solving his current financial crisis, Te Sr gratefully and sincerely sent a receipt to the school. Le then made an appointment for a specialist session with Lughes in the afternoon.",
        ".",
        "The pain in his knee was throbbing again. Xi Ze pressed his palm firmly on it, enduring the pain in silence, beads of cold sweat forming on his forehead, his lips turning white.",
        "A gaping hole was where the web of his thumb and forefinger was stuck, pierced by a dark matter bullet. The bleeding had been forcefully stopped with special medication, but the wound stubbornly refused to heal. This was the culprit preventing him from standing up. ",
        "“Are you okay? Is the wound hurting again?” 015 approached with a mop, asking with a concerned tone.",
        "After the intense pain of the muscle spasm subsided, Xi Ze took a breath and squeezed out a hoarse voice from his throat. “…I’m fine.”",
        "015 was about to ask further, but suddenly received a message requesting entry. It quickly slid back into the room and knocked on Ye Er’s door.",
        "Xi Ze faintly heard words like “visitor” and “appointment”, hesitating for a moment on whether to avoid it himself. In the end, he remained silent and simply shifted his body to the corner of the sofa. ",
        "In front of him was a hazy dark color. Ye Er’s footsteps could be heard coming from the room, gradually getting closer, then passing by his side, bringing a slight cool breeze.",
        "Then came the sound of the door opening, followed by the male zerg’s greetings, and another voice in conversation, sounding young, with a calm and gentle tone.",
        "Xi Ze didn’t realize he was frowning, increasing the pressure on his knee, causing a sharper wave of pain.",
        "“…Alright, got it. I’ll take a look at the details later.” ",
        "Sensing a discreet gaze lingering on his face, Hughes’s eyes flickered slightly, glancing past Ye Er in front of him to look inside the room.",
        "“Come in.” Ye Er gestured for 015 to lead the way, then turned to go into the kitchen to get some water.",
        "Please visit chrysanthemumgarden (dot) com",
        "Soon, Hughes saw the source of that feeling.",
        "The white-haired, golden-eyed female zerg was sitting quietly on the sofa, wearing soft and thick puppy-printed pajamas. Even so, his sharp, knife-like vigor couldn’t be hidden. ",
        "Although the person would occasionally appear on the communication screen, Hughes felt he was truly seeing him in person for the first time.",
        "This female zerg named Xi Ze looked very different from when he was just taken to the hospital, to the point where he could hardly recognize him.",
        "Like a fallen alpha wolf taken home and well cared for, he had broken free from the tragic brink of death from severe injuries. Gradually growing flesh and blood, he moved closer to the originally calm and awe-inspiring temperament of a military female.",
        "The female zerg lowered his eyes, with no expression on his face, but Hughes subtly felt that he was not welcomed. ",
        "“Good afternoon?”",
        "With the zerg who could act as a mediator missing, Hughes had to try to initiate the conversation alone. “I am His Excellency Ye Er’s…”",
        "He sat down on the chair that 015 brought in, but before he could finish speaking, he suddenly met a pair of icy and inorganic eyes, with molten gold pupils constricting into vertical lines!",
        "“Creak—!” ",
        "A harsh friction sound suddenly rang out, breaking the quietness of the living room. It was followed by a loud “bang” – the sound of the chair falling to the ground.",
        "It took Hughes several seconds to catch his breath.",
        "“Are you okay? The system detected that your heart rate is too fast, suspecting symptoms of stress…”",
        "Beside his ear, the worried inquiry of the robot housekeeper echoed. His darkened vision gradually cleared, revealing the surrounding mess. ",
        "“What’s wrong?”",
        "Ye Er heard the noise and quickly walked out of the kitchen.",
        "“I…”",
        "A deep sense of tremor paralyzed his heart and limbs. Hughes propped himself up with 015’s head, barely managing to stand straight, and hoarsely said, “It’s nothing…” ",
        "He forced out a breath, calming the rapidly beating heart in his chest. However, after a moment of contemplation, his expression gradually grew serious.",
        "Both male and female zergs have clear hierarchical divisions determined by genes. Higher-level zergs naturally suppress lower-level ones, and the greater the difference in level, the stronger the sense of oppression.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Among the female zergs, the majority are B and C levels. In marginal stars like Aitar, there are mostly C-level and below female zergs living.",
        "Hughes himself is a relatively superior B-level female zerg. When facing an A-level zerg, there is no obvious sense of oppression, which is normal… ",
        "If his senses weren’t mistaken, the feeling of terror just now stemmed from the oppression and warning inherent in the huge gap difference in levels.",
        "This means that the female zerg in front of him is at least S-level or even the extremely rare SS-level. Females of this level are rare in the empire.",
        "Hughes looked at Ye Er, who seemed unaware, feeling complex emotions in his heart.",
        "This was his own short-sightedness before. But does this male zerg really not know what kind of monster he had picked up and brought home… ",
        "“What just happened?”",
        "Ye Er still looked doubtful, casually rubbing the female zerg’s hair, messing up the neatly arranged strands.",
        "“I’m not sure.”",
        "Xi Ze allowed the male zerg to mess up his hair, only slightly tilting his face towards Hughes, his golden eyes already back to normal. ",
        "Faced with two equally bewildered and innocent faces, Hughes choked up. Although he knew the suppression released by the female zerg was probably unconscious, he still felt like having an intense heart attack.",
        "“…It’s okay, let’s continue.”",
        "He put on a professional fake smile and sat down on the chair that 015 had helped him up.",
        "The doctor in front of him had a shrewd and experienced demeanor that belied his age. Without relying on many instruments for examination, he could accurately assess Xi Ze’s recovery situation, occasionally asking about trivial details of his life. ",
        "Xi Ze responded to all questions concisely and comprehensively, showing precise control over his physical condition.",
        "“Have you had any further mental guidance?”",
        "Hughes continuously tapped and modified the treatment plan on his terminal with one hand, and asked aloud.",
        "Ye Er awkwardly touched his nose and said, “…Only once.” ",
        "After learning that he was a male zerg, Xi Ze felt emotionally repulsed. His guiding techniques were also very unskilled, so he clumsily did it once and simply shelved it.",
        "“I suggest having more mental guidance and pheromone appeasement. These can promote the body’s recovery and wound healing more than any medication…”",
        "",
        "At this point, Hughes paused his typing hand.",
        "As far as he knew, the male zerg in front of him was at the D level. Normally, a D-level male zerg can only appease up to a B-level female zerg. However, he succeeded in the first attempt to provide mental guidance to Xi Ze. ",
        "If Ye Er’s identity information is not concealed or forged, then this is also a monster that defies common sense.",
        "“What’s wrong?” Ye Er asked in confusion, unable to wait for the rest of the words.",
        "“It’s nothing, anyway, just have more guidance and appeasement.”",
        "Hughes remembered something else Ye Er had mentioned. “Your Excellency mentioned before that there are occasional nightmare situations, yes?” ",
        "“Before, you were a military female, correct?”",
        "He asked Xi Ze, and after receiving a positive answer, he added several more medications to the plan.",
        "“Generally speaking, military females who have come off the battlefield will have varying degrees of post-traumatic stress. Although mental guidance can alleviate it well, it is best to combine it with professional medication for treatment.”",
        "Although the female zerg in front of him has improved significantly since he first picked him up, he still hovers on the edge of serious injury. Whether it’s his severely damaged self-healing ability, or the injuries to his eyes, back, and legs, none of them have truly improved. ",
        "His brows wrinkled, wrapped up the treatment plan and sent it to Ye Er. “It is recommended to start with the less seriously injured eyes. There are several topical medicines in the plan…”",
        "The examination lasted for three hours and finally ended before dinner. Hughes packed up the instruments he had brought and was escorted to the door by Ye Er.",
        "“Medical resources in Aitar are still scarce. If you want him to be completely cured, you may need to go to the main star, but it will inevitably cost more money and energy… In any case, he is already Your Excellency’s female slave. Your Excellency can do whatever you want with him.”",
        "The level of that female zerg is indeed high. It’s clear he was targeted and tortured so miserably at that time. His previous identity is likely not simple and may even have been very prominent. ",
        "But that is all in the past. From the moment he became Ye Er’s female slave, the past and future of this female zerg, even his life and death, have become possessions of the male zerg.",
        "Whether or not he can survive, and in what form he can survive, all depend on the male zerg’s whim. The only fortunate thing may be the presence of this atypical male zerg before him.",
        "“Okay, I will consider it.”",
        "Hughes gazed at the beautiful and refined face of the male zerg in front of him. After hearing a solemn response, he smiled and took his leave nimbly. ",
        "Ye Er closed the door and returned to the living room. 015 had already entered the kitchen to prepare dinner. He sat next to Xi Ze and examined the treatment plan on his terminal.",
        "But not long after, a bill message popped up—",
        "Read more BL at chrysanthemumgarden (dot) com",
        "[Please pay the treatment and medication fees: 49,998.0 star coins.]",
        "Ye Er: “……” ",
        "That person is so thoughtful to even leave two coins, haha : )",
        "——————–",
        "The author has something to say:",
        "[Reward received!] ",
        "Ye Ye: I’m rich now! (Happy)",
        "[Please pay the bill.]",
        "Ye Ye: I’m broke again… (Sad)",
        "It’s okay, your wife is filthy rich. You can buy any planet you want in the future, and wake up from a 500-square-meter bed every day. (Smirk) "
    ],
    "previous": "Chapter 16",
    "next": "Chapter 18"
}