{
    "title": "Chapter 30.1",
    "content": [
        "Translator: Deyonna",
        "Trigger Warning: This chapter contains brief depictions of violence ",
        "“Beep, beep, beep, beep, beep, beep…”",
        "A continuous series of message notifications sounded from the terminal.\n",
        "",
        "Ye Er, sitting beside had turned a deaf ear to it until he finished what he was doing, then picked it up and opened it.",
        "Sure enough, hundreds of email notifications crammed the homepage. Even scrolling up several times couldn’t reach the bottom. ",
        "He clicked in to view the messages—\n\n",
        "[If you don’t want to be stabbed in the throat on the street, hand over that female slave quickly, or don’t blame us for being rude!]",
        "[Do you think that female zerg is a good commodity? Go somewhere else and waste your pathetic sympathy!]",
        "[Attachment 1.awi, Attachment 2.awi, Attachment 3.awi, Attachment 4.awi…]\n\n ",
        "[Don’t think because male zergs have special protection, we dare not touch you. Just wait and see, you idiot, don’t end up crying and beg us to let you off…]",
        "[Attachment: CompressedImagesPackage.zip (10G)]",
        "[Poor zerg matches with a rotten commodity, a natural pair, I spit!]\n\n",
        "Ye Er lowered his eyes, indifferently ignoring those abusive and insulting words, took screenshots of all these emails, and put them into a background file package named “Extortion and Threats”. ",
        "Despite repeatedly telling himself to stay calm, he couldn’t help but feel his fingertips tremble slightly when he saw those videos and pictures.",
        "Pushing open a crack in the window, the cold wind blew in, stirring the hair on his forehead.",
        "Ye Er took a deep breath of the icy air and forcibly suppressed the anger in his heart.",
        "He started receiving such emails two days ago when he and Xi Ze were watching a movie. ",
        "After replying with a “?”, he was bombarded with an explosive number of emails, with the main idea being only one, that is, to hand over Xi Ze.",
        "Although they were constantly making threats, Ye Er could sense the underlying fear and anxiety in their words.",
        "It was very strange.",
        "The exchange should not have cared about a female slave who was supposed to be ‘disposed of’. At that time, although the zerg workers were determined to kill Xi Ze, they did not relentlessly pursue him after being driven away. ",
        "This was enough to prove that Xi Ze was not that important in their eyes.",
        "So why, more than half a month after he picked up Xi Ze, did he suddenly receive such threatening emails?",
        "",
        "Ye Er stared at the scene outside the window, the light in his eyes gradually sunk.",
        "The only logical explanation is that those guys originally didn’t know about Xi Ze’s special identity, and thought that it wouldn’t matter much if he were killed or stolen, so they casually concealed this embarrassing matter. ",
        "It’s very likely that someone above the exchange, or a zerg with a more prominent identity, started asking about Xi Ze’s current situation, which made them realize the seriousness of the matter and want to get the female zerg back to the exchange before things were exposed.",
        "As for those unsightly videos and pictures…",
        "Le already had a glimpse of some methods of torturing female slaves during the live broadcast, but given the level of perversion in this society, those should have been pust child’s play.",
        "The content that could be organihed separately and packaged specifically for him must go far beyond the limits of disgust and gruesomeness. ",
        "After two days of being bombarded with dozens of gigabytes of videos and pictures, he still hadn’t opened any of them to look at.",
        "That should have been something left behind—like a piece of rotten flesh that had long been painfully cut away—meant to be thrown into the stinking sewer to slowly and completely dissolve over time.",
        "Instead, it was dug up and exposed once more, arbitrarily used as a tool for intimidation and threats, with the vicious intent to block the new path that the female zerg had already taken.",
        "He wanted to directly close the page, but a video thumbnail that caught his eye made Ye Er’s eyelashes tremble. ",
        "The screen shook, finally focusing on the zerg’s drooping head.",
        "A hand grabbed his hair, yanking his face up roughly.",
        "The female zerg’s face was splattered with blood, and one eye was almost completely covered, making it unable to open.",
        "His eyes were not yet blind at this time, but they were still vacant and dazed. ",
        "His golden eyes resembled shattered glass, fragmented, transparent, and empty, staring into the void, as lifeless as a corpse.",
        "“Hey! Snap out of it… Why isn’t he reacting? Did you hit his head?”",
        "“I didn’t. It was you who was hitting him the hardest just now… Don’t pretend! Get up for me!”",
        "The abuser grabbed his hair and pulled him up. The video frame zoomed out a little to capture his upper body into the camera lens. ",
        "Ye Er swiftly turned his head away and closed his eyes tightly, and when he opened them again, the rim of his eyes were already slightly red.",
        "Everything was already in the past. It’s already… in the past.",
        "",
        "Now, Xi Ze was still well and alive in his house, and would soon regain his sight and stand up again…",
        "So calm down. It’s all in the past. ",
        "He took a deep breath for a moment, sufficiently prepared himself mentally, and decided to finish watching the entire video.",
        "Based on the female zerg’s injuries and condition, it could be roughly judged that this video was taken during the month between the second and third times he saw the female zerg.",
        "After pouring a bucket of ice water, the video had already started a new round of beatings.",
        "It couldn’t even be considered an execution; it was simply a wanton and malicious outburst of violence—chaotic, methodless, vicious, and blind. ",
        "Beyond the jeering and taunts of other zergs, the video only captured the female zerg’s ragged breathing. It was intermittent, full of pain, laborious and heavy, gasping for air with all his might between bouts of choking and coughing.",
        "Sometimes the camera was aimed directly at the female zerg’s face, attempting to force out an expression of humiliation or shame.",
        "But he rarely looked at the lens, his eyelashes lowered as he silently gasped for breath, only occasionally flashing a slight contortion of pain.",
        "Sometimes the camera would pan out, revealing the densely packed torture devices hanging on the wall. ",
        "Some of them even had fresh blood dripping from them, a dark gleam reflecting off the sharp spikes. Just looking at them was enough to make one’s heart sink.",
        "Ye Er’s nails dug deep into his palm, his eyes filled with unbearable filth, yet he couldn’t help but be lost in thought.",
        "Those guys tormented him like he was a slab of meat, devoid of pain or emotion.",
        "But the truth was, every time he looked at those enduring golden eyes, memories of his time with Xi Ze surged back, bringing with them a soft and heavy warmth that completely overshadowed everything on the screen. ",
        "He remembered the female zerg when he first lost control and was on the verge of death, yet he still reached out to pull him back from falling. He remembered the female zerg’s hatred and struggle, as well as his eventual compromise.",
        "He always seemed to be enduring and compromising.",
        "He remembered the kiss branded onto the back of his hand. The warm quilt moved to his side, the way he whispered ‘Male Lord’ in a low voice, and his light golden eyes holding a hint of moisture, suppressed yet yearning.",
        "He remembered the female zerg’s excessive cautiousness, his carefulness when facing him, the coat draped over his shoulders, the hand measuring the temperature on his forehead, and the tremor in the female zerg’s fingertips before they touched his face… ",
        "There was simply too much. Every scene and every frame seemed saturated with a certain kind of unspoken, profound, and concentrated emotion. It hit him belatedly, filling his heart and chest, causing it to tremble incessantly.",
        "The video progress bar approached its end. The tortures that had never spared a moment’s respite finally ceased, but only because the instruments of torture had broken and the tormentors were out of breath.",
        "Please visit chrysanthemumgarden (dot) com",
        "“Hey, if you’re willing to lick my hand and call me lord zerg, I’ll let you off today. How does that sound?”",
        "The zerg who had wielded the club most ferociously earlier squatted down and extended a hand in front of the female zerg, wiggling his fingers as if he were teasing a dog. ",
        "As soon as these words were spoken, the female zerg on the side burst into laughter.",
        "“Andrey! You really have talent!… Call out, call out, and I’ll give you food. Haven’t you eaten anything for three days already? This lowly zerg can really endure… !”",
        "He saw a flicker of a spark coalescing in the female zerg’s vacant gaze.",
        "It was as if his detached soul had finally returned, instantly bursting forth with a sharp light amidst the pain and blood, like an alpha wolf finally finding the right moment to strike back— ",
        "“Ah!! My finger—it’s bitten off!! Ah—ah!!”",
        "A bloody chunk of flesh fell to the ground. The robust guy who had his finger bitten off let out a deafening howl as if what had been bitten off was not a finger but his life root.",
        "Ye Er heard a very faint sneer from the female zerg amidst the chaotic background noise.",
        "It was tinged with a hint of satisfaction, contemptuous and mocking, vaguely revealing a never-extinguished sharp pride. ",
        "It was obviously him who lay collapsed on the ground, yet it seemed as if he had been the one overlooking the fiasco of these pitiful zergs from beginning to end—",
        "“Coward.”",
        "However, Ye Er, sitting in front of the screen, closed his eyes and loosened his pale, pursed lips, murmuring almost inaudibly…",
        "…Don’t be like that. ",
        "He hoped the female zerg would give in a bit, so he could suffer a little less. At least the trash behind the scenes would certainly enjoy seeing him submit rather than resist.",
        "This wasn’t impossible. When he had first picked up the female zerg, there had been many conflicts and frictions, but none that couldn’t be resolved.",
        "Most of the time, the female zerg would silently compromise and give in, allowing him to invade his territory inch by inch, exploring and running wild on it.",
        "The more he resisted, the more they would torment him. ",
        "The video was only half a month old since he’d picked up the female zerg, and he couldn’t imagine how he had endured when living was worse than dying.",
        "His chest hurt so much that it felt like his heart was about to tear apart, and his fingers were clenched so tightly that they trembled as waves of suffocation flooded his mouth and nose.",
        "Please visit chrysanthemumgarden (dot) com",
        "The guy who had been mocked and poked where it hurt cursed in rage with a distorted expression and began to beat him even more wantonly. The video turned into a chaotic mess.",
        "“Idiots, all of you, stop it.” ",
        "A cold, hard command suddenly rang out.",
        "Then came the resounding sound of military boots colliding with the ground, and the camera that was recording the video was suddenly knocked to the ground, capturing the female zerg’s face up close.",
        "The female zerg struggled to raise his head, but was forcefully pressed down to the ground by a black military boot with nails on the bottom.",
        "Then the video was cut off abruptly. ",
        "But perhaps the real torture had only just begun.",
        "Ye Er stared fixedly at the screen, his mind blank.",
        "After a long silence, he got up and washed his hands.",
        "The blood he had squeezed out of his palms was washed away by the water, the red gradually fading. The icy winter water was nipping, making his hands tremble uncontrollably. ",
        "When he returned to his room from the bathroom, he realized belatedly that the bedroom was so stuffy he could hardly breathe.",
        "He pushed both windows open to the maximum, allowing the biting cold from outside to rush in, blasting and chilling his face.",
        "Like a headless fly, blindly and urgently completing these things, Ye Er finally returned to the table.",
        "The terminal’s screen still displayed the same image as when it had finished playing: a small, light-colored triangle stayed on the female zerg’s cheek, like an indelible brand of humiliation. ",
        "The extremely forced calmness suddenly transformed into an explosive rage—",
        "“Clatter, rattle—bang!”",
        "Ye Er suddenly raised his hand and swept everything off the table!",
        "With a clatter and rattle, the heavy desk was lifted at both corners and then slammed back down onto the ground with a dull thud. ",
        "He could hear the grinding sound of his teeth clenching together. A piercing ringing echoed in his mind, overlapping with his pounding heartbeat and gradually engulfing his head.",
        "Ye Er let the boiling rage simmer, then unprecedentedly calmed down before it reached its peak.",
        "",
        "—He had changed his mind.",
        "Collecting evidence methodically and using legal means to punish those guys was pointless. ",
        "With cold eyes, Ye Er’s clear, glass-like pupils darted around, then landed on the terminal lying amidst the mess.",
        "“Hello… Hello? Is this Adelaide?”",
        "“Yes, what’s up?”",
        "“Do me a favor.” "
    ],
    "previous": "Chapter 29.2",
    "next": "Chapter 30.2"
}