{
    "title": "Chapter 24.1",
    "content": [
        "Translator: Deyonna",
        "“Beep—match over!” ",
        "The large screen at the stadium flickered twice, and the final score displayed a huge difference.",
        "Xi Ze leaped out of his mecha, watching as the hatch of the opposing mecha slowly opened. A grim expression flickered across the military female’s face for a moment before he jumped down as well.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“There was no regression, but there was also no progress.”",
        "Xi Ze pointed down at him from a distance, his tone somewhat stern. “Antoine, you’re not taking this seriously.” ",
        "The military female across from him had brown hair and brown eyes, his appearance undoubtedly resolute and handsome. However, his long, narrow eyes and high cheekbones gave him a somewhat mean look.\n\n",
        "Antoine gave a dry laugh. “It’s not that I’m not taking this seriously, it’s just that the General is as terrifying as a monster. You can refresh the highest score in the arena every now and then. How can we ordinary soldiers compare?”",
        "Xi Ze frowned ruthlessly and coldly reprimanded. “Be serious!”",
        "“Many of your moves were superfluous just now. There were simpler, more efficient attack methods. Why didn’t you use them? I could have ended the match with one strike as early as when you were showing off by flipping your wings.”\n\n ",
        "All the soldiers who were observing the scene came running over, so Xi Ze didn’t bother arguing with him. He said indifferently, “Go back and train harder. I want to see your improvement by next week.”",
        "As they brushed past each other, Antoine’s expression subtly changed.",
        "Normally, he wouldn’t lose his temper, but the sympathy or mockery in the expressions of his surrounding comrades was like a spark igniting a fuse.\n\n",
        "He said in a low voice, disregarding anything else, “It would have been fine normally, but everyone is watching now. Wouldn’t the General leave me some face?” ",
        "Xi Ze abruptly stopped in his tracks. The molten gold eyes under his military cap were sharp as knives, piercing Antoine, who instinctively flinched.",
        "“Will the enemy leave you some face when you’re on the battlefield?”",
        "The military females around them instantly fell silent out of fear, instinctively standing at attention, and skillfully following along as they listened to the reprimand.",
        "Antoine’s face went from green to white, but he didn’t dare to retort. ",
        "“Don’t treat training like training. Treat it like a real battlefield! How many times have I told you?!”",
        "“How many lives do you have to waste on those fancy, useless tricks? Do you think war is a house play?”",
        "“…Stop associating with those extravagant, decadent, and corrupt fools. Your recent state has been deteriorating.”",
        "With those final words, Xi Ze left Antoine behind and walked out of the training grounds. As he looked up, he saw a female zerg with graying hair in the stands. ",
        "“Teacher.” A smile appeared in his eyes, his expression extremely respectful. “How did you find the time to come?”",
        "The female zerg, addressed as a teacher, sighed. “You ah, you’re still so strict. You treat your soldiers this way. Aren’t you afraid they’ll rebel?”",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze explained in a low voice, “You also know that being soft-hearted during training is the greatest cruelty to them. I must do everything in my power to ensure they can return from the battlefield alive.”",
        "“Alright, alright, let’s not talk about that.” The female zerg waved his hand, looking at the young military female on the training grounds who was clearly sulking. ",
        "“You and Edreck are both my students. How could I not understand him? He’s always been flamboyant and proud, his ambitions reaching for the sky. But he’s not a bad person at heart. Just let him have his way sometimes.”",
        "Xi Ze pursed his lips, but still conceded, “…Okay, you can rest assured.”",
        "“General, someone is looking for you.”",
        "Xi Ze turned his head and saw a female zerg standing at the entrance of the training grounds. Despite the distance, he could clearly see that the female zerg had the same hair color as him. ",
        "“Dismissed. Free practice.”",
        "The expression on his face faded. After dismissing the troops, he walked straight towards the entrance.",
        "“What is it?”",
        "Wi Ie’s ezpression was indifferent. Le slowly and deliberately took off his white gloves and put them in his pocket, never once looking directly at that female herg. ",
        "The female herg across from him also had white hair and golden eyes. Lis long hair was tied behind his head, and he was dressed in the luzurious attire of a noble. Lis brows and eyes were very similar to Wi Ie but with more warmth and gentleness in comparison.",
        "“Can’t I come to see you even if there’s nothing important?” he murmured in a low voice, his tone still gentle. “You haven’t called me ‘female father’ in a long time.”",
        "Xi Ze didn’t respond to his remark at all. After waiting a few seconds without a reply, he turned around directly. “If there’s nothing else, I’m leaving.”",
        "“Hold on!” ",
        "“This is for you.”",
        "Lance pulled out an old pocket watch from his chest. The blue diamonds on its surface had all fallen off, leaving it looking worn and full of holes. A few engraved markings were faintly visible on the watch cover.",
        "“Didn’t you used to love this when you were little? You said it was your lucky charm. Female father dug it out from your male brother’s junk room with difficulty… Take it with you into battle, maybe it’ll bring you good luck.”",
        "Xi Ze glanced at the worn-out trinket, intending to make a sarcastic remark. But the words he almost blurted out died in his throat, replaced by a wave of weariness. He couldn’t be bothered to speak. ",
        "“Don’t come looking for me again.”",
        "Seeing Xi Ze leaving without a second thought, Lance’s expression shifted slightly. But he still smiled and said, “I will leave this on the chair on the side. If you don’t want it, just let them clean it up.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Bang—",
        "The training ground door slammed shut behind him. The female zerg hesitated for a moment, then bent down, placed the object on the ground, and walked away. ",
        "After a long while, the door was pushed open again, and Xi Ze’s figure emerged.",
        "He clicked his tongue softly, his brow furrowed in apparent hesitation. But in the end, he still picked up the lonely, worn-out trinket from the chair.",
        "Long-forgotten memories, already blurred, surged to the surface, only to be ground to dust in the storm of his mental landscape.",
        "In the midst of agonizing tearing, he hastily caught a fleeting glimpse of a corner of his past, only to realize that all his suffering had long-standing traces to follow, rather than being a sudden overnight upheaval. ",
        "On the vast snowfield, a violent blizzard raged, obliterating the already ravaged surface even further.",
        "Only the cabin was sheltered within the eye of the storm. The little lamp beneath the window rattled and clicked in the wind, radiating a comforting warmth.",
        "It exuded a familiar, soft breath, standing there absurdly and incongruously, steadfast like a lighthouse in a raging sea, guiding this upheaval and reconstruction of destruction and rebirth.",
        "Shaaa— ",
        "Hot water gushed from the showerhead, and Ye Er drenched the surrounding walls and floor.",
        "Only when the warm steam filled the bathroom, melting the chill in the air, did he lower the water temperature and slowly wet Xi Ze’s body.",
        "This scene felt familiar. When he first picked up the female zerg, he seemed to have washed him in the same way.",
        "The only difference was that last time, his emotions were cautious and unfamiliar, while now he was bottling up a brimming cold anger. ",
        "He was so preoccupied that he didn’t even bother to respond to the little creature rubbing against his legs. He mercilessly turned the showerhead, drenching the female zerg’s face and hair, causing him to cough and sputter in surprise.",
        "“….Cough, cough…Ugh!”",
        "The water stream was blocked by the female zerg’s raised forearm. A hazy golden light finally emerged with difficulty, like a faint glimmer piercing through the cascading water mist, abruptly scorching the insides of Ye Er’s heart.",
        "Finally awake. ",
        "Relief and fear surged up, momentarily eclipsing his anger.",
        "His hand trembled, causing the showerhead to spray water off-target. Only then did he belatedly realize that the other half of his body felt weak.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“Cough…Male Lord?”",
        "Xi Ze opened his eyes in the middle of the violent, excruciating pain. He felt every inch of his flesh tearing and reforming, his entire body convulsing and twitching uncontrollably. ",
        "Before his eyes was still the impenetrable darkness that cannot be dispelled, but his wandering mental power formed an image of the bathroom in his head. The silhouette of the male zerg standing in front of him was clear, but he couldn’t make out his expression.",
        "But at the tip of his mental power, Xi Ze sensed intense anger and panic coming from him.",
        "And there was a strong feeling of worry, taking up the majority of it.",
        "Realizing this, the pain that had been unbearable unexpectedly became manageable. ",
        "A heavy weight pressed down on his heart, making Xi Ze involuntarily squeeze out an intermittent smile on his lips. “Male Lord…”",
        "He opened his mouth, barely managing to use his vocal cords. “…Don’t be angry…”",
        "Ye Er’s pupils constricted slightly, and his hand holding the showerhead consciously tightened.",
        "The next second, he turned the water flow to its maximum with a cold expression, washing over the sensitive area of the female zerg’s waist and between his legs. The stimulation made Xi Ze cry out softly as he curled up to resist. ",
        "He continued to shower him for a while, until the female zerg, with his eyes half-closed, was about to fall asleep again. Then Ye Er threw the shower head onto the floor with a ‘thud’, grabbed the female zerg by the collar, and pulled him up.",
        "“What exactly do you want?”",
        "The words were almost crushed and squeezed out between his teeth. He had never spoken to Xi Ze in such a tone before.",
        "Their faces were so close, their hot breaths intertwined and merged, almost indistinguishable from one another. ",
        "Ye Er lowered his eyes into the female zerg’s eyes as if looking at a door that he had pounded on countless times but never opened to him. Anger and helplessness rose and fell in turn.",
        "“Heal properly. You promised me this yourself. Didn’t you say you wanted to live? What are you doing now? If I hadn’t woken up in the middle of the night, what I would have seen tomorrow would be a frozen corpse!”",
        "He firmly suppressed his anger, but in the end, when he started talking, he couldn’t help but faintly bellow in a low, hoarse voice.",
        "Then the sensation of something rubbing against his leg startled him so much that he froze and dared not move again. ",
        "Xi Ze panted heavily and rapidly, trying to smooth out his tightly furrowed brow. Before Ye Er could become suspicious, he reached out and pressed his hand on the hand that was on his collar, murmuring repeatedly, “Male Lord…”",
        "The female zerg in front of him was clearly still delirious. Ye Er took a few deep breaths, barely managing to suppress his anger.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Staying here would only worsen his mood. It would be better to go fix the heating system and calm down first.",
        "He picked up the showerhead on the floor, threw it into the female zerg’s arms, and said coldly, “Take it, do it yourself.” ",
        "In the living room.",
        "Luckily, the thunderstorm earlier didn’t cause a power outage, otherwise it would have been really troublesome.",
        "The central heating control system is outdated and cannot automatically recover. Additionally, 015 has gone into low-temperature protection due to the extreme cold, so it can’t provide help for now.",
        "Ye Er dug out a full set of tools from the corner, pried open a section of the alloy wall, and began repairing the tangled mess of complex wiring. ",
        "The hand holding the tool was still trembling slightly, pale and cold, as if drained of blood.",
        "He lowered his gaze and looked at it, then set down the tool and clenched his fist tightly. With his other hand, he continuously massaged the pressure points on his wrist, forcing himself to recover, relax, and stabilize.",
        "“Click! Beep—”",
        "With a soft click, the warm air enveloped every corner of the house once more. The temperature, which had plummeted to freezing, began to slowly rise, and 015 also started up in a clumsy and unsteady manner. ",
        "Ye Er continued to stare at the wiring in front of him, lost in thought. Only after his breathing calmed down somewhat did he get up and return to his room.",
        "However, when he opened the bathroom, what he saw wasn’t the sight of the female zerg obediently showering in warm water—",
        "Instead, he found Xi Ze lying on the floor, soaked to the bone. The showerhead lay beside him, spraying hot water out to the side.",
        "The hot water, now cold, aggressively stole his body heat. The female zerg was shivering slightly, and that strand of strange mental power seemed to have become violent, thrashing around in the bathroom. ",
        "Ye Er took another deep breath, but the anger he had just suppressed began to boil over, like steam about to burst from a kettle.",
        "Since crossing into this world, there haven’t been many things that have made him lose his temper. This is now one of them.",
        "Good, very good.",
        "He gritted his teeth, crouched down, and tore open the female zerg’s soaked pajamas, revealing the pale wheat-colored, damp □□ body underneath. ",
        "The stiff muscles had regained their softness and warmth, filling his hand with a thick handful. A squeeze brought a blush of pale red to the surface.",
        "The rich, slightly bitter-sweet fragrance gradually spread, permeating the entire bathroom and seeping into every inch of the female zerg’s flesh.",
        "Please visit chrysanthemumgarden (dot) com",
        "The male zerg’s pheromones were a top-tier soothing agent, their threads of coolness clearing the congested intense pain and bringing immense relief and relaxation.",
        "Meanwhile, Xi Ze was becoming increasingly hot and soft. His body beneath his palm was covered with glistening sweat. It was like sizzling roasted meat on a grill, exuding a mouthwatering temptation. ",
        "Ye Er didn’t want to constantly describe him in terms of food, but he couldn’t resist the urge to take a hard bite no matter what.",
        "He had restrained himself many times, but this time he finally didn’t want to hold back anymore. Might as well take advantage of his anger and break the rules once.",
        "“…Uh, nng…!”",
        "Receiving stimulation, Xi Ze lets out a startled cry. His hand instinctively reached for the tingling, slightly itchy place, only to touch a handful of soft hair. ",
        "The sensation between his teeth was too good. Ye Er couldn’t help but gradually clench his jaws tighter, grinding the piece of flesh.",
        "The female zerg’s waist and abdomen, receiving stimulation, tightened and relaxed uncontrollably. They occasionally arched wide, then spasmodically lost strength, the large expanse of wet, honey-colored flesh undulating before his eyes.",
        "Ye Er lowered his eyes, absentmindedly thinking that a torrent of gold was surging before him.",
        "Having been both scolded and bitten, coupled with the effects of the pheromones, Xi Ze finally, after some tossing and turning, sobered up and came around. ",
        "“Male Lord…?”",
        "He opened his eyes with some difficulty. Ye Er’s lips and teeth, which had been pressed against his chest, finally moved away. They then found a new target in his vulnerable neck, leaving sharp bite marks as if venting anger.",
        "Xi Ze chuckled indistinctly, reaching out a hand, but instead of pushing the male zerg off him, he gently stroked his shoulder and neck with a gesture of forbearance.",
        "“……I’m very angry right now. You’ve seriously pissed me off.” ",
        "After an unknown amount of time spent gnawing on the female zerg, Ye Er finally released the flesh in his teeth, speaking in a tone that could only be described as calm.",
        "Nothing could be discerned from his voice. It remained pleasant to the ears, but the stray tips of his mental power keenly sensed the deep, suppressed emotions below, dark and dangerous, churning like magma.",
        "Xi Ze moved his lips but didn’t utter any apologies or other nonsense. He knew Ye Er wasn’t looking for that.",
        "“I’m punishing you right now. You stay put and don’t dare resist.” ",
        "He was struggling to think of a countermeasure amidst the throbbing pain in his head when the male zerg’s tense words suddenly rang out above him. It was undoubtedly coated with anger, but—",
        "What kind of punishment is this?",
        "Read more BL at chrysanthemumgarden (dot) com",
        "A corner of his heart suddenly softened, and the long-frozen wall collapsed, letting in a warm spring breeze. It gnawed at his heart, causing a bittersweet ache, yet he couldn’t help but feel a surge of joy.",
        "Xi Ze pushed himself up with difficulty, his hand that had been stroking the male zerg’s spine now slid down to his waist. ",
        "He reached out and embraced Ye Er’s waist, enveloped in the clean, crisp scent that belonged only to the male zerg before him.",
        "He rested his chin on the male zerg’s shoulder, almost sighing as he spoke.",
        "“I’ve reconstructed my mental landscape.”",
        "“What?” Ye Er froze, unable to respond for a moment. "
    ],
    "previous": "Chapter 23",
    "next": "Chapter 24.2"
}