{
    "title": "Chapter 33.2",
    "content": [
        "Translator: Deyonna",
        "Xi Ze looked up and smiled at him, but this smile was different from his usual gentle and amiable expression. His eyes were slightly narrowed, carrying a hint of indifference and lingering aggression. ",
        "Like a snow leopard strolling beside its eating mate, its icy gaze threatening covetous intruders.",
        "Yet, it couldn’t help but lower its head occasionally and rub against its mate, solemnly licking the blood from their soft fur.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Thump.",
        "Ye Er’s eyes widened slightly, his breath hitching for a moment. ",
        "The next second, without warning, he choked. He clamped his hand over his mouth, and he coughed violently, his cheeks and ears turning a deep pink.\n\n",
        "“…Male Lord?!”",
        "A voice filled with worry and panic rang in his ears, and then a big hand patted his back rhythmically, helping him catch his breath",
        "Ye Er shook his head as he coughed, then he quietly chuckled inwardly, as if amused by his own loss of composure.\n\n ",
        "A faint sweetness lingered on his tongue, overpowering the slight bitterness of the matcha powder. It was rich and velvety, a far more delightful taste than any dessert.",
        "He didn’t know when it started, but Xi Ze had begun to dedicate himself to these things, seeping into his life as subtly as air.",
        "The female zerg would quietly and thoughtfully take care of things that 015 couldn’t help with or often forgot.\n\n",
        "Such as improving the quality of his meals. Not only were they becoming more delicious and sumptuous, but they were also increasingly tailored to his tastes as if the female zerg had custom-made them for him. ",
        "There were also times when he would forget to bring his pajamas into the bathroom, and before he could call for 015 to bring him a set, he would reach out and feel the clothes hanging on the doorknob, and they were always the color he wanted.",
        "There were even a few times when he lost track of time while working on the joint project, he was so famished that he planned to eat leftovers, only to find that the female zerg had just finished preparing a meal, which was already served, the rice still steaming hot.",
        "At first, Ye Er was very happy, but later, this happiness turned into a kind of worry.",
        "It wasn’t until he stayed up late again and found a prepared late-night snack in a thermos on the dining table that he finally realized it couldn’t go on like this. ",
        "The next day at breakfast, Ye Er looked at the food on his plate for a long time and put down his chopsticks. Wearing a solemn expression, he said, “Xi Ze, I have something to tell you.”",
        "Xi Ze was a little surprised and glanced at his untouched breakfast, his expression becoming somewhat vexed. “Is the breakfast not to your liking? If you want to eat something else, I’ll go make you another one…”",
        "“It’s not about that,” Ye Er interrupted him, looking into the female zerg’s eyes, trying to make Xi Ze understand the importance of the matter.",
        "“You don’t have to go to this extent. Just let 015 do it. I didn’t pick you up to make you do these things.” ",
        "Xi Ze paused briefly, his expression shifting to one of understanding. However, he didn’t agree immediately. Instead, he lowered his head, chuckled lightly, and said, “I would like to do something else, but the Male Lord hasn’t allowed me to.”",
        "“What haven’t I allowed you to do?”",
        "",
        "Ye Er was confused, but the female zerg no longer answered, leaving him to think for himself.",
        "After thinking for a long time, he thought that Xi Ze was probably too bored, so he spent all his time on him, so he immediately ordered a new terminal as a gift for the female zerg. ",
        "With the terminal, he finally saw that Wi Ie was no longer always cooking or on his way to prepare food.",
        "Dut before Te Sr could relaz, he found that the female herg was still flawlessly doing all the things he had done before, and his time was allocated very well. Sven because of the terminal, he could connect to the Star Network and access more comprehensive and perfect recipes.",
        "“Try it, if it tastes good?”",
        "A brand new dessert was placed in front of him. Ye Er stared at it for a moment, and then he heard Xi Ze’s inquiring voice, with a hint of unspoken expectation. ",
        "He scooped up the first bite and held it out to the female zerg. “Eat.”",
        "Xi Ze paused. Seeing the male zerg’s serious expression, he knew there was no room for negotiation, so he could only try to eat the food on top without touching the spoon.",
        "“Very sweet.” Xi Ze savored it and commented.",
        "Ye Er didn’t know why he felt relieved, as if a tangled knot had been untied. ",
        "Then he also scooped up a mouthful and put it in his mouth. The soft, sweet flavor filled his mouth, and it was indeed extremely sweet, as the female zerg had said.",
        "He finally understood that the female zerg wasn’t doing these trivial chores meticulously just because he had nothing to do.",
        "It was because he cared about him deeply, cherished and treated him well that he was willing to invest his time and energy to do these things tirelessly.",
        "But he didn’t want to be the only one enjoying it. At least this sweetness had to be tasted by both of them to be considered fair. ",
        "“Have another bite.”",
        "Ye Er scooped up another big mouthful and sent it out to the female zerg, who lowered his head and took a bite.",
        "In the end, they shared that dessert, taking bites one after the other.",
        "Time passed slowly like this. They were too lazy to count the specific dates, and it was almost a week before the new year. ",
        "A thorough cleaning is always done at home during these days. In the past, 015 would simply tidy up a bit, and Ye Er didn’t pay much attention. However, he forgot that this thorough cleaning would often bring up many forgotten old things.",
        "“Did the Male Lord raise this? Why is it here?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "015 turned around and saw Xi Ze flip up a board on the balcony and take out a small pot of withered succulents.",
        "The plant was a dusty pink color all over. Its once round and plump leaves had withered into irregular, thin strips, looking as dead as they could be. ",
        "015 stopped waving the broom and exclaimed in surprise, “This one wasn’t actually thrown away.”",
        "Xi Ze looked up at it with some confusion and placed the small plant on the outstretched mechanical hand.",
        "“His Excellency has raised many of these plants. Let me think… I think there have been a dozen pots of them, but they’ve basically all died. Even though he took great care of them, he would raise one pot and then kill one pot, and eventually, they would all be packed up and thrown away.”",
        "Imagining the tragic scene based on 015’s description, Xi Ze went silent for quite a while. ",
        "015 had originally wanted to throw it away directly, but since it had been suddenly dug up, 015 was a little reluctant to part with it and placed it on the ground and symbolically watered it.",
        "“It’s really dead. It won’t even drink water.”",
        "The compacted soil couldn’t absorb the water, and it only got wet on the surface, with the rest dripping to the ground. 015 seemed a bit sad and then increased the water flow.",
        "Xi Ze stayed behind it and watched for a while, finally stopping it before the barely alive plant was completely submerged. “That’s not how it’s done.” ",
        "The female zerg rolled up his sleeves and began cleaning the small, miserably dying plant from scratch.",
        "When the dry soil had been made moist and soft again, suitable for plant growth, Xi Ze’s slender fingers were covered in soil and dirty water.",
        "The rotten and withered parts of the succulent had been cut away with a sharp knife, scattered and piled on the floor, leaving only a tiny, still pink core.",
        "“Why cut it off? It doesn’t even have a complete corpse.” ",
        "A crying face appeared on 015’s screen, looking a little sad.",
        "“If it’s rotten, you can only cut it off. The bad part will drag down the part that’s still good. You have to be willing to cut it off in order to keep it alive.”",
        "Xi Ze explained in a deep voice.",
        "He used a shovel to carefully put the soil back into the small flowerpot and transplanted the tiny plant. Although it’s not certain that it could survive, at least it looked much better. ",
        "015 lowered its head and observed the small potted plant up close. It actually detected a faint trace of life inside, even though its system had previously judged it to be a dead seedling.",
        "It exclaimed in surprise and turned on the exaggerated praising mode. “You’re amazing! It actually came back to life! Wow…”",
        "Please visit chrysanthemumgarden (dot) com",
        "When Ye Er went out to get water, the outside was already shrouded in a hazy twilight.",
        "Looking out through the open balcony door, a brilliant rosy sunset filled the sky, casting a shimmering light on the floor. ",
        "But what interested him was not the sunset, but the figure sitting in the sunset.",
        "Xi Ze was wearing a white shirt and cargo pants, with his shirt sleeves rolled up above his forearms, revealing his strong and smooth arm muscles.",
        "His palms were wide and his knuckles were distinct. He was holding a pot of soil steadily, and one could vaguely see the veins bulging on the back of his hand and forearm, winding into his cuff, looking strong and reliable.",
        "The female zerg’s movements were nimble, and it didn’t look like he was loosening soil or watering, but rather tinkering with some kind of high-tech mecha part. ",
        "A proud and sharp military female, even if he was reduced to mud and beaten to a pulp with wounds covering his body, if you picked him up, washed him, and nursed him back to health, he would recover his original tenacious and dazzling appearance.",
        "Ye Er’s lips curved into a faint smile, his gaze casually drifting downward. But the moment he saw something familiar, his smile froze.",
        "Hold on, what’s that in the female zerg’s hand…?",
        "“Alright, put it in a shady area.” ",
        "Xi Ze wiped his hands dry with a towel and was about to put the plant down from his knee when his hand was suddenly pressed down.",
        "“Where did you find this?”",
        "He looked up and saw the male zerg’s eyes wide, his lips pursed in annoyance with even a hint of humiliation.",
        "“What’s wrong?” ",
        "Xi Ze paused. The spot where he was touched stiffened, and he didn’t move the hand that the male zerg’s fingers were holding. Even his breathing slowed down.",
        "Ye Er took a closer look and confirmed that it was the plant he had raised and killed. He stubbornly looked at 015 at the side, hoping it hadn’t told the female zerg about those “incidents.”",
        "Xi Ze understood his gaze and coughed lightly. “I already know.”",
        "“…Quickly forget it!” Ye Er covered his face and crouched beside the wheelchair, mumbling for a long time. ",
        "Xi Ze blinked, covering his laugh with a cough, then deliberately said, “What if I can’t forget?”",
        "Ye Er gave him a deadly glare, but because his puffed up cheeks were flushed red, it had basically no deterrent effect at all. A soft, curled ear tip peeked out from his black hair, looking very inviting to the touch.",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze’s muffled laughter got stuck in his throat, and his gaze was completely drawn to it. For a moment, he felt a little dazed.",
        "He tightened his fingers in restraint, and when the male zerg’s sulking subsided a bit, he lowered his eyes and said softly, “Male Lord, are you feeling better today?” ",
        "Ye Er was startled.",
        "How did Xi Ze know he had been in a bad mood lately?",
        "He glanced at the female zerg out of the corner of his eye, his tone slightly dazed. “So that’s why you’ve been making all these delicious things for me these past few days, to cheer me up?”",
        "“Not really, it’s just that I’ve only recently recovered my eyesight and can make some things.” ",
        "Xi Ze corrected his statement, reiterating, “Even if the Male Lord’s mood improves in the future, I won’t stop.”",
        "In the future…",
        "Ye Er was instantly lost in thought, his lips pursed.",
        "He wanted to say something, to ask something, but he couldn’t find the words. But on second thought, it didn’t seem necessary to delve deeper into this matter. ",
        "Xi Ze would leave one day, while he was already trapped in place, too heart-weary and powerless to chase after anything.",
        "It was just that he couldn’t, for that reason, resist getting closer to the female zerg. It was really like liking a puppy; knowing that its lifespan was only a dozen or so years, they couldn’t suppress their affection and not raise it, pet it, and be close to it.",
        "And that day hadn’t come yet, had it?",
        "As he can see, at least not in the next two or three days. Instead of worrying and overthinking, it was better to enjoy the remaining time wholeheartedly. ",
        "Ye Er sighed and finally decided to free himself of any worries.",
        "He reached out and took the female zerg’s hand resting on his knee, caressing the hard knuckles of his fingers, and then received a tighter grip in return.",
        "And if that day really came—",
        "He would be willing to give him freedom and watch him fly high. ",
        "——————–",
        "One of the general’s courting methods: feeding bear cookies X5, strawberry cakes X5, madeleines X5, Portuguese tarts X5, mini mousse squares X5…",
        "",
        "Ye Ye’s reflection result: lie flat, free himself of worries, see through it all, and then open his mouth to wait for feeding."
    ],
    "previous": "Chapter 33.1",
    "next": null
}