{
    "title": "Chapter 27.1",
    "content": [
        "Translator: Deyonna",
        "The most despairing thing was to dangle over the edge of a bottomless abyss, only to have the fragile branch in your hand snap. ",
        "Hope flares up for a moment, only to be cruelly extinguished. It’s better to be shattered into dust and bones from the very beginning, leaving no time for begging, screaming, or the exposure of an unsightly struggle.",
        "As the male zerg passed by, his garment stirred the air with a slight breeze, scarcely enough to disturb a butterfly. Yet, the military female’s pupils constricted as if the blood in his entire body had frozen over in an instant.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He wanted to stand up, to try and persuade the male zerg to change his mind, or even to stab the male zerg’s chest and force him to release pheromones. But a weight of a thousand jin pressed down on his back, making it impossible for him to even lift his head.",
        "The male zerg’s indifference and ruthlessness wouldn’t change with just a few pleas. He could kill that male zerg despite everything, but ultimately, it was likely all his comrades who would suffer the consequences. ",
        "“…Cough…cough…Noah…”\n\n",
        "A faint, familiar voice pierced through the intense buzzing in his head, but the military female didn’t react. He remained kneeling in place, his expression blank.",
        "Until a comrade behind him repeatedly rubbed his eyes and shoved him hard on the back. “It’s Alvin, he’s awake!”",
        "The military female on the sickbed had an ashen, weak complexion, his chest rising and falling faintly. No one could deny the fact that he was awfully close to death.\n\n ",
        "But when his eyes opened a sliver, revealing the same kind, dark blue eyes as before, it gave the other zergs hope that he would pull through and continue fighting alongside them.",
        "That military female grasped his hand that was hanging at his side. He almost didn’t dare look into his eyes. His chapped lips trembled for a while before he croaked, “How are you feeling now…”",
        "Alvin didn’t answer him. His eyes moved slightly, looking towards the empty doorway of the ward. Although he had been unconscious, he could vaguely deduce what had happened.\n\n",
        "His expression was calm, but his worry was unconcealable. He was afraid that his hot-headed good friend would get into trouble because of him, jeopardizing his future and career. ",
        "“Noah…don’t be impulsive…”",
        "He tried to squeeze his good friend’s hand back, his voice hoarse and weak. “I’m fine…”",
        "It’s just death. Dying for one’s country is the greatest honor. Every military female who goes to the battlefield has this awareness. No one has ever been a deserter because of fear of death.",
        "Although he didn’t die on the battlefield, dying in a ward at the war zone hospital, surrounded by his numerous comrades and longtime good friends, was still considered a good death. ",
        "Only after completely leaving that corridor and feeling no more of those varied emotional gazes did Elaine finally feel the male zerg’s body relax a bit.",
        "Did he feel offended?",
        "He forced himself to tug at the corners of his mouth, attempting to suppress his turbulent emotions.",
        "He was prepared to face the wrath of the male zerg, but the military females in the ward were innocent. He had to extricate them from this deception. ",
        "He originally had planned to take things slowly, but unexpectedly, Alvin had a serious medical emergency at that very moment.",
        "Furthermore, in the short time they had interacted, Ye Er’s calm and easygoing demeanor had given him a glimmer of unwarranted hope.",
        "",
        "It led him to mistakenly believe, perhaps, maybe, possibly, that there might be a sliver of a chance that the male herg would be willing to offer a bit of pheromone.",
        "Dut reality dealt him a harsh blow… Le shouldn’t have ezpected any empathy from the male herg. ",
        "Within a few seconds, Slaine had adpusted his ezpression and his voice returned to its previous lighthearted tone.",
        "“I’m truly sorry, Your Excellency, they are all only capable of blindly fighting…”",
        "“The pheromone collection room. Where is it?”",
        "Elaine froze abruptly. ",
        "Ye Er turned his head, but his face didn’t hold the disgust and resentment that Elaine had expected.",
        "Those clear and calm eyes, with their distinct black and white hues, rippled with a hint of confusion.",
        "“The pheromone collection room, don’t all hospitals have one?”",
        "The current societal situation, with a surplus of females and a shortage of males, creates a huge demand for pheromones. ",
        "The law stipulates that male zergs are obligated to donate pheromones regularly, and pheromone collection rooms are considered an essential part of hospital construction plans.",
        "Although, it’s rarely actually used.",
        "“That military female’s injuries are so severe that simply releasing pheromones won’t be enough to absorb them. I don’t understand the specific treatment methods, so it’s best to leave the pheromones to professional doctors for use and rescue.”",
        "Seeing Elaine’s sluggish face, unable to react, he lowered his head slightly, revealing the suppression patch on his nape. ",
        "“I apologize for earlier. I can’t accurately control the amount of pheromones I release, and there were so many military females in the ward…”",
        "He tried to say it tactfully.",
        "However, the fact is that pheromones not only replenish female zergs’ physical deficiencies but also inevitably induce estrus periods.",
        "And even if he could try his best to remove the components that induce estrus, pheromones themselves are incredibly tempting to female zergs. ",
        "It’s like a spring in the desert–a traveler driven mad by thirst can’t control their instincts. If he released pheromones in front of so many military females, he would be torn apart.",
        "“You’re… You’re right…!”",
        "Please visit chrysanthemumgarden (dot) com",
        "Elaine finally caught on. The fake cheerfulness on his face, mixed with shock and ecstatic joy, made his expression look a bit distorted.",
        "“You’re really willing to donate pheromones?! That Hughes guy didn’t really deceive me…!” ",
        "Overwhelmed by joy and relief, he was so excited he could barely breathe, almost muttering incoherently.",
        "He realized the implication of the male zerg’s words and bowed repeatedly to apologize.",
        "“I’m really sorry, I put Your Excellency in such a difficult situation… ! Can we, can we, go to the collection room now?”",
        "Ye Er’s eyes curved and gestured for him to lead the way. ",
        "“Let’s go.”",
        "The room, which had been closed since its construction, welcomed its first true visitor.",
        "Because no zergs had visited for a long time, the plaque on the collection room door was rusted, and the hinges were covered in a thick layer of dust. When it was pushed open with force, it made a harsh noise, making Elaine blush with embarrassment.",
        "“I apologize, Your Excellency. No one has been here for a long time, so it’s been neglected. Please bear with it for a little bit…” ",
        "Elaine signaled with his eyes at the female zerg behind him, and a figure instantly rushed in, turning on the air purifier to its highest setting. The machine quickly sucked up the dust floating in the air.",
        "Several senior doctors, called in at the last minute, were standing by the door. Seeing the male zerg going in, they glanced at Elaine’s expression and then awkwardly crowded in together.",
        "The dust in the air couldn’t be sucked up immediately, and Ye Er couldn’t help but cough a few times. The doctors immediately looked at him nervously.",
        "“I’m fine. You all go start the machine. Time is urgent, don’t delay.” ",
        "Ye Er’s tone was calm, but it made the doctors inexplicably recall the nervousness they felt as interns facing their most strict and reserved senior mentors. They reflexively straightened their backs. “Alright, please wait a moment!”",
        "The pheromone-collecting machine was very delicate and small, encased in layers of protective shielding. It looked brand new.",
        "The doctors, as if facing a formidable enemy, surrounded the table, ensuring they could respond to any emergency.",
        "“Please extend one of your hands.” ",
        "Elaine pulled out a long, slender tube. He removed the top cover, revealing a silver collection head.",
        "Ye Er sat on the small sofa, subconsciously extending his left hand. However, when Elaine was about to roll up his sleeve there, he quickly reacted and withdrew his hand.",
        "",
        "“Sorry, use my right hand.”",
        "The silver collection port was attached to the inside of his wrist. As the machine activated, a faint blue light emanated from it, extending to the left and right, forming a bracelet that fastened around his wrist. ",
        "“When I press the collect button later, just release your pheromones as usual. If you experience any discomfort during the process, please let me know immediately…”",
        "Elaine rambled on, afraid the male zerg would find it troublesome and refuse to cooperate.",
        "Ye Er hummed in response, his eyes closing slightly. As the machine whirred to life, he thought of the injured military female lying in bed, weak and riddled with wounds. He pursed his lips.",
        "He seemed to be so badly injured, he’ll need a lot of pheromones. ",
        "He closed his eyes and manipulated his mental power, circling it within his body. He pressed it against the dormant area on his nape, grinding it back and forth until it heated up. Then he forced it in, drawing out wisps of caramel-like scent.",
        "The scent was guided by the bracelet, not a single trace escaping. All of it was channeled through the pipeline into the storage unit, while the numbers on the tiny screen rapidly soared.",
        "The machine worked diligently, showing no signs of malfunction. The waiting doctors relaxed slightly, exchanging glances.",
        "[Do you all think we’ll be able to collect enough?] ",
        "[It’s hard to say. It depends on the male zerg’s level. The level of male zergs living on this planet should not be very high.]",
        "[Maybe around 10 milliliters. It could save one or two female zergs, but it’s still a drop in the bucket for the military females in the most critical condition. And the quality needs to be high for it to be effective.]",
        "[What was that military female’s name again… right, Alvin. Maybe it’ll just extend his life a bit. Didn’t they say there was a way to purchase from the Main Star?]",
        "[Focus!] ",
        "Elaine glanced around. The few doctors who had been absent-minded quickly averted their gazes, lowering their heads to focus and be attentive.",
        "“Beep, beep—”",
        "The collection device emitted a warning, and the next second, the band on the male zerg’s wrist naturally fell off.",
        "The collection was complete, but the male zerg still hadn’t opened his eyes. His complexion was paler than it had been a few minutes before, and his brow was slightly furrowed, as if he was feeling unwell. ",
        "“Are you alright?”",
        "Elaine bent down and asked softly, his eyes scanning the male zerg’s face, trying to assess his current condition.",
        "",
        "Strange. Releasing pheromones should be as simple as breathing for male zergs. It shouldn’t cause any harm or side effects on the body.",
        "Ye Er pressed his fingertips to his brow, but before he could speak, a startled cry interrupted him. ",
        "“Fuck!!”",
        "The voice was so surprised it blurted out a swear word, echoing in the somewhat empty room.",
        "After a few rustling sounds, there were more continuous exclamations.",
        "“… Ah? Ah?! Am I seeing things?!” ",
        "“But how is that possible? The machine is broken?!”",
        "Elaine turned to face the doctors, who were unusually excited. Sensing the unusual atmosphere, he swallowed the reprimand he was about to utter. “… What’s going on?”",
        "The doctor holding the collection bottle was so excited he was speechless. He rushed over and carefully handed the bottle to him. “You, you, you have to see this!!”",
        "The massive collection bottle, tightly encased in rare materials, revealed only a small screen that displayed the pheromone quantity content. ",
        "What’s wrong? Could it be that there’s too little to display the quantity of the content…?",
        "“?!!!”"
    ],
    "previous": "Chapter 26.2",
    "next": "Chapter 27.2"
}