{
    "title": "Chapter 3",
    "content": [
        "Translator: Deyonna",
        "Ye Er lowered his head and saw a hand riddled with scars. ",
        "The hand had well-defined joints, with fingertips dyed in blood, gripping the hem of his down jacket, instantly staining the white clothes with a dirty mark.",
        "[Thump.]\n",
        "",
        "His heart gave a gentle knock in his chest, followed by a momentary stab of pain and numbness.",
        "The female zerg did not look up at him, nor did he cry out for help. He lay there weakly, breathing, as if pulling him was merely an unconscious action. ",
        "The force was very light; Ye Er could easily break free without exerting much effort. He didn’t even need to move; the fingers would naturally release their grip and slide off.\n\n",
        "But strangely, the tug made him stop in his tracks.",
        "He unexpectedly no longer wanted to leave just like that.",
        "“What are you looking at? Scram, don’t meddle in other people’s business!”\n\n ",
        "The female zerg, who was about to release a punch, seemed provoked into anger. He cursed in a gruff voice, took a step forward, and was about to beat Ye Er along with the others.",
        "At this moment, a tall female zerg emerged from the shadows, raised his hand to stop the impulsive subordinates, and lifted his eyelids. “I suggest, Your Excellency, to think twice. Don’t blindly meddle.”",
        "The female zerg in front of them was clearly the leader orchestrating the atrocity. He had a stern expression resembling a soldier retired from the battlefield, exuding a violent aura throughout his body.\n\n",
        "“I’m sorry for causing inconvenience, but may I have a word with him?” ",
        "Ye Er took a step forward out of the streetlight, exposing his vague face from the darkness, his voice light yet firm.",
        "The leader sized Ye Er up and down, stared at his face for a moment, and then his expression turned to bewilderment. “…a male zerg?”",
        "A female zerg who wanted to meddle could be easily kicked away, but it was different with a male zerg. They were pampered and troublesome; if they got a scratch or a bump, the Protection Association would come knocking and breaking into your door the next day, which was very troublesome.",
        "While the female zerg on the other side had a varied and changing expression, Ye Er had already crouched down. He grasped a wrist that was so thin it was almost just bones, shaking it in an attempt to wake up the unconscious female zerg lying on the ground. ",
        "However, the icy cold sensation in his hand startled him. The female zerg on the ground had a vacant expression, with his lax gaze passing through Ye Er’s face to the sky, indicating a very dire situation.",
        "“You…”",
        "Ye Er got stuck. In fact, he hadn’t thought about what to say. Stopping by was just a spur-of-the-moment decision for him.",
        "Although it was just a moment of impulse, that thought occupied his entire mind, and he was unable to drive it away no matter what. ",
        "And that thought was, he wanted to take away this female zerg.",
        "“Do you still want to live?”",
        "",
        "The female zerg’s glass bead-like eyes flickered slightly, his cracked lips parted slightly, but he didn’t say a word. It was as if a breath that had been held in his chest suddenly relaxed, causing him to choke ever so slightly.",
        "That means wanting to live. ",
        "Ye Er glanced at the female zerg, answered in his place amidst his heart’s intense tremor, and decided to pay the price for his impulse.",
        "He stood up, took out his terminal, and prepared to scan and pay. “How much is this female zerg? I’ll buy him.”",
        "Unexpectedly, Ye Er really intended to pick up trash. The leader raised an eyebrow in surprise but still waved his hand.",
        "“No, no. We’re not selling him. The order from above is to kill him. Selling him wouldn’t be a good way to fulfill the task.” ",
        "“The ezchange is pust ahead. We can go in and pick a well-behaved and beautiful one inside. Why are you insisting on picking up trash from the garbage bin?”",
        "“In any case, no other zergs will know. Who would care about a dying female slave?”",
        "Ye Er said indifferently, unyielding, “You can keep all the money from the sale for yourself. There’s no need to hand it over to the exchange.”",
        "“No,” the female zerg refused bluntly, his gaze gradually turning cruel. “You’re a male zerg, so I can’t harm you. However, killing this female slave is still simple. Do it.” ",
        "The words at the end were spoken for the subordinate on the side.",
        "Ye Er’s expression slightly turned cold as he instinctively took a step forward and stood in front of the female zerg. He said softly, “Intending to harm a male zerg is a felony. You should think carefully.”",
        "“Tsk, be careful with your hands! Avoid bumping into the male zerg. Instead, kick the female slave’s neck and break it.”",
        "Even in his past life, Ye Er rarely encountered such situations where he faced the oppressive and terrifying presence of blood head-on. He pursed his lips and took a deep breath to calm the throbbing in his chest. ",
        "“Your Excellency, don’t be stubborn. Quickly step aside.”",
        "…Three.",
        "“Stop shouting, just do it directly. You go around from the back!”",
        "…Two. ",
        "“Wait a minute, what’s that sound?!”",
        "A faint buzzing sound rang out on top of their heads. Ye Er’s expression relaxed, murmuring silently—",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "One.",
        "The glaring red light suddenly flared, causing him and the female zergs opposite, whose expressions had suddenly changed, to raise their heads and look. In front of them was a pitch-black barrel. ",
        "“Warning—Warning—Detection of an attempted act of harm towards a male zerg, activating level one disciplinary mode!”",
        "In just one breath, the machine holding the firearm completed its energy storage and accurately shot at several female zergs. With immense power, it easily blasted through the wall behind them.",
        "“Fuck, how did the city machine end up here! Run quickly!”",
        "The female zerg leader gritted his teeth, taking the lead to unfold his wings and fly into the sky, speeding off towards the distance. ",
        "The remaining female zergs followed suit. The round-headed machine instantly split into several sub-machines, rapidly pursuing and attacking in different directions. Within a few seconds, the alley in front became quiet.",
        "Ye Er took out the hand that was inserted in the pocket of his down jacket, and the terminal on his wrist flickered with a red light.",
        "He quickly closed the alarm page in two or three clicks and checked the situation of the female zerg by his feet.",
        "With just a casual glance earlier, it wasn’t obvious, but the female zerg actually had a black collar around his neck, with a thick iron chain welded onto it, muddled in the dirty blood and mud. ",
        "Those guys completely treated him as a lowly beast to torture.",
        "Ye Er took a deep breath, barely suppressing the anger in his heart.",
        "He intended to release the restraints, but soon caught a strong smell of blood in the air. In this weather cold enough to freeze one’s sense of smell, the smell of blood slowly seeped into his nasal membranes, like a warm stream flowing through.",
        "Only then did Ye Er notice that the female zerg’s legs were twisted unnaturally, as if broken and bent. The bruises above the knees had turned almost black, and blood was oozing from his lower abdomen and legs. ",
        "…Damn it, staying here any longer will definitely lead to limb necrosis. It will be troublesome if amputation is required later on.",
        "He woke up his terminal, dialed the nearest hospital’s emergency number, sent the location, and suddenly remembered that ambulances couldn’t enter the gray area; they couldn’t wait in this place indefinitely.",
        "“We still have to get out of this stretch of road.”",
        "Ye Er looked around. In this chaotic black market alley, there might be things like carts here. ",
        "But, every time you urgently need something, it always seems to be missing, yet when you don’t need it, you can see it everywhere.",
        "He rummaged around for a while, but when he felt the female zerg’s body temperature dropping, he decisively gave up. After some thought, he took off his down jacket, leaving only the thin wool sweater underneath.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "A gust of cold wind blew by, causing Ye Er to shiver violently, freezing him from head to foot.",
        "……It’s so cold. ",
        "He wrapped the warm down jacket around the female zerg. Attempting to pull the zipper up but failing to do so, he tied the sleeves together on both sides, barely covering up the female zerg’s body.",
        "Then, squatting down, he pulled and placed the female zerg on his back, attempting to stand up with immense difficulty.",
        "But as if burned by that slight warmth, or perhaps pressed on the wound, the female zerg, who was initially unconscious, suddenly jolted.",
        "Ye Er, who had just managed to stand steadily, staggered a few steps, almost throwing the female zerg back to the ground. ",
        "“…Don’t move!”",
        "He said, subconsciously gritting his teeth, not knowing if the female zerg had heard him, but at least he stopped moving randomly.",
        "The body on his back was as cold as ice, pressing heavily on his shoulders. He struggled to carry the female zerg and headed toward the exit of the black market.",
        "The snow was falling heavier and heavier, and the swirling white flakes silently landed under the dim light. ",
        "Layers of thin snow piled up on Ye Er’s head, with the remaining snow accumulating on the body of the female zerg on his back.",
        "Their shadows merged under the streetlight, looking like a bloated snowman staggering along from a distance.",
        "Ye Er was shorter and was also thinner than the female zerg on his back. As he walked, supporting the female zerg’s bent knees, the female’s long slender legs would occasionally slip down, making it quite strenuous.",
        "“Hoo…” ",
        "White mist overflowed from between his lips, trapped in the fluffy scarf, emitting a damp and warm breath.",
        "Ye Er hoisted up the body sliding off on his back, feeling his arms becoming sore. He even broke into a sweat in the coldest month of winter.",
        "The female zerg on his back had a very weak breath, his drooping arms swaying gently with each step. Fresh blood trickled down, eventually congealing at the fingertips and dripping down all the way.",
        "“……You can’t die.” ",
        "On his back, there’s a hot, damp feeling as the blood has completely soaked through the down jacket and sweater.",
        "Ye Er’s Adam’s apple moved slightly as he murmured softly, “You’ve persisted this long, just endure a little longer.”",
        "",
        "He bit his tongue, forcibly pulling himself out of a clouded state of mind, holding his breath, quickening his pace, and walking towards the mouth of the alley.",
        "“Beep—” ",
        "From a distance came the sharp siren of an ambulance, breaking the quietness of the street and quickly approaching this direction within a very short span of time.",
        "Ye Er’s heart relaxed, taking a few quick steps to run out of the street corner, just in time to meet the doctor who had jumped off the hover car.",
        "“Your Excellency, did you call for the ambulance?”",
        "“Come, put him on the stretcher, be careful with the wounds…” ",
        "With a loud “bang,” the door of the ambulance closed tightly, gathering energy and flying into the air, merging into the sky road.",
        "The vehicle was equipped with two experienced doctors who quickly completed the first aid. There was no time to wipe off the thick blood stains on the female zerg’s face, as the doctors had already put on an oxygen mask and various apparatus.",
        "Ye Er sat aside, calming his rapid breathing, his gaze fixed on the female zerg’s face, until the situation was initially stabilized. His tense shoulders finally relaxed.",
        "He pressed his temples, leaning back somewhat wearily against the chair. ",
        "The sub female assistant in the corner lifted his head from the electronic screen, quietly observing Ye Er’s side profile, feeling somewhat amazed in his heart.",
        "Is this that legendary His Excellency, the male zerg?",
        "Although he had heard about it before, it was the first time being this close.",
        "The male zerg in front of him is shockingly beautiful, with tired eyes and a tightly furrowed brow. ",
        "Half of his body was stained with blood, the extreme red and white colors clashed intensely, just sitting there exuding a breathtaking beauty.",
        "The sub female suppressed the rapid and erratic beating in his chest, unable to take his eyes off.",
        "When the hospital received the distress signal from the male zerg, a small wave of chaos erupted throughout the hospital. The director urgently dispatched two senior doctors who hurried over, fearing that any delay might lead to irreversible consequences.",
        "But… the sub female caught a glimpse of the female zerg on the stretcher and pursed his lips. ",
        "But it turns out it was for treating a female slave who was on the verge of dying?",
        "He muttered to himself, “What a waste of medical resources.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "However, the next second, a chill attacked his nape, causing him to shudder suddenly, and he found himself unexpectedly facing a pair of deep black eyes.",
        "Ye Er looked at him expressionlessly, a chill spreading in his eyes. “What are you looking at? At a critical moment of life and death, you’re neglecting your duty. Where’s your professional ethics?” ",
        "The questioning tone made the sub female feel wronged. He gritted his teeth and turned his gaze back to the monitor, feeling somewhat indignant. He’s just a D-level male zerg. What’s so superior in that!",
        "Those rumors must all be fake! Where is the gentleness and beauty? Who are you trying to scare with that cold face?!",
        "The female zerg doctor treating the patient noticed the subtle atmosphere, furrowed his brow, and warned. “Focus, Nou Ni.”",
        "After speaking, he turned to look at Ye Er, softened his tone, and said reassuringly, “No need to worry, Your Excellency. Your distress call was very timely, and the situation has been preliminarily stabilized.” ",
        "“Female zergs have a strong recovery ability; once saved, it’s hard for them to die.”",
        "Ye Er withdrew his gaze and looked at the female zerg lying on the stretcher with closed eyes, his expression finally easing up.",
        "“That’s good.”",
        "The author has something to say: ",
        "PS: Private Setting:",
        "The General’s information, including age and appearance, is kept confidential. He is a symbol and emblem of the empire’s honor and has never appeared in the public media. Any photos of him will be intercepted by the smart system and prevented from circulating. So, few people know what he actually looks like."
    ],
    "previous": "Chapter 2",
    "next": "Chapter 4"
}