{
    "title": "Chapter 22",
    "content": [
        "Translator: Deyonna",
        "When the invitation was sent to Ye Er’s terminal, he was researching new part-time jobs. ",
        "[To classmate “wwn”:",
        "To promote communication, mutual learning, and progress together, according to the cooperation and exchange agreement, we sincerely invite you to participate in a short-term exchange study on the xxx project.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "During your exchange study, all expenses will be waived, and you will receive a certain amount of subsidy.",
        "Contact information: Star network account XXXXXXXXXXX ",
        "—Axon First Research Institute]\n\n",
        "“?” What is this thing, even zergs engage in email scams?",
        "When Ye Er read to the end and saw the signature of “Axon First Research Institute,” he paused, and his expression became thoughtful.",
        "That prestigious school that rewards fifty thousand star coins for solving a problem? Invited him to join the research project for exchange learning?\n\n ",
        "His gaze lingered on the word “subsidy”, and he remembered his pitiful deposit. His hand originally wanted to decline, but still searched for the provided star network account.",
        "The profile picture shows a black night sky, with only an indifferent short line of text on the homepage that says “If you have something to say, speak. If you don’t have anything to say, do not disturb”.",
        "Ye Er hesitated for a moment, then sent a friend request.\n\n",
        "“Chief?” ",
        "A voice broke the silence in the room, and Adelaide, who was reading a report, looked up coldly at the stammering member.",
        "“That… your terminal has a notification.”",
        "“Got it.”",
        "Adelaide closed the report in his hand and handed it to him, then picked up the terminal that had been flashing a red light all along. ",
        "“There’s a parameter error inside. I’ve marked it for you. Take it and recalculate.”",
        "[User “wwn” has sent you a friend request. Do you accept?]",
        "Adelaide raised an eyebrow, a different kind of emotion flashing in his eyes.",
        "[Accept.] ",
        "As the chat page opened, Adelaide prepared a few seconds of polite social pleasantries. However, before sending out that stiff greeting, a message came from the other side.",
        "[wwn: Hello, could you provide a detailed introduction to the project research content?]",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Straightforward enough and arrogant enough.",
        "There was a hint of interest in his eyes and his previously indifferent attitude of giving medicine to a dead horse somewhat changed. He compressed the file and sent it over. ",
        "About ten minutes later, a message came from the other side again.",
        "[wwn: I have a rough understanding. May I ask which part requires discussing algorithms?]",
        "Adelaide instantly sat up straight.",
        "[Adelaide: We’re starting now?] ",
        "[wwn: Let’s start now.]",
        "Almost all the members of the laboratory gathered in front of a huge demonstration whiteboard, with a lifeless look in their eyes as the large algorithms rapidly scrolled past in front of them.",
        "Countless cold and magnificent data towers rose high, then instantly transformed into a shape.",
        "The unfamiliar voice is their controlling god, seamlessly collaborating with Adelaide to create a vast new world. ",
        "“Wait… where were they talking about pust now?”",
        "“No, they were pust calculating the sub-data a second ago, and now they’re starting to build the model?!”",
        "The panel was rapidly calculating, trying to keep up with the progress, and in pust the blink of an eye, it was already a million miles away. A lot of the research members’ faces were about to fall apart.",
        "In addition to Adelaide, there is another unfamiliar zerg in the shared presentation. Their profile picture is an unknown, simple drawing of a small star beast, appearing cute and innocent with its head tilted, but— ",
        "“Here, here… and here, your algorithms all have flaws. If my estimation is correct, they will eventually calculate an exaggerated value…”",
        "The voice, so pleasant that it could be used as a sleep-coaxing anchor, ruthlessly punctured several big holes in what they had been studying overnight for several months.",
        "The grand building that was painstakingly constructed may have to be demolished and rebuilt in just a few seconds.",
        "At the thought of this, one member turned pale, and he muttered indignantly, “He’s probably just talking irresponsibly. Who does he think he is to dare give suggestions randomly? Isn’t he afraid of getting into trouble with his big mouth?” ",
        "“Exactly, coming here just to cause trouble… I don’t know how the chief could trust such a half-baked guy.”",
        "Just as these whispered conversations were spreading, they were abruptly interrupted by a long “beep.”",
        "",
        "The algorithm, initially tangled into a mass on the screen, began to flow smoothly toward the next node, with a large green check mark appearing on the detector.",
        "The algorithm that had been stagnant for a whole week actually made progress! ",
        "Although it may seem insignificant compared to the entire complex system, it is real progress and every bit counts. Who knows, maybe in the end, it can really be solved!",
        "“The… the detection actually passed?!”",
        "The research member, who was originally frowning, widened their eyes in disbelief at the moment the detection passed. They couldn’t help but exclaim, “So awesome?! This is so fucking amazing!”",
        "“Who is this guy? He’s pretty good! Let’s quickly recruit him into our laboratory!” ",
        "Waves of suppressed shock and joyous discussions broke out, bringing a breath of fresh air into the lifeless laboratory that had been quiet for half a month.",
        "Adelaide watched the rapidly scrolling chains of data on the screen. The coldness on his face completely disappeared, replaced by a trace of suppressed excitement that’s gradually seeping out. His deep cerulean pupils contracted with anticipation.",
        "“Very good, excellent…”",
        "He murmured, staring fixedly at Ye Er’s profile picture on the star network account. ",
        "Building algorithms with a partner who he’s in sync with is almost like a satisfying and exhilarating enjoyment, a feeling that he had never experienced even when competing with the genius junior in the second year.",
        "Catching a glimpse of his expression, the researchers’ hearts skipped a beat, their expressions sorrowful.",
        "“We’re done for. Chief is about to go into his science lunatic mode again…”",
        "“Continue.” ",
        "Adelaide’s hand was already on the demonstration screen, unconsciously using a firm and commanding tone to give instructions.",
        "Suddenly, there was static on the other end of the line, and after a moment of noise, the voice said in apology.",
        "“Sorry, let’s end it here for today. I need to go offline a bit earlier.”",
        "With a crisp snap, the other profile on the shared presentation disappeared without allowing any chance for a response. ",
        "“……???”",
        "Let’s end it here for today…end it here… here…",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The zergs in the laboratory looked at the demonstration screen in disbelief, then all turned their gaze towards Adelaide in front of the screen.",
        "His movements froze completely, his expression instantly darkened, and his already unsteady breathing, due to excitement, became even more rapid, like a volcano on the verge of eruption. ",
        "Oh no, it’s over.",
        "The zergs buried their heads like quails, not daring to make a sound, afraid that the last straw would set Adelaide off completely.",
        "“Di, di.”",
        "The terminal placed aside flickered with a red light. Adelaide, who had snapped out of his senses, glanced at it and suppressed his anger with great difficulty before picking it up. ",
        "[wwn: May I ask how much the exchange subsidy is? I am currently in urgent need of money for medical treatment. [Rose]]",
        "Adelaide paused, and a hint of anger faded from his face.",
        "[Still waiting.]",
        "That night, the account username “wwn” on the star network, after solving and pulling down the platform’s pinned question, once again dominated Axon’s various major forums. ",
        "Not only was there a stir between the professors and students but also an extremely difficult guy arrived at the dean’s office.",
        "“I have only two demands: one is to admit him as a student, even if it’s just in name; the other is to approve the subsidy in advance, and if it’s relatively small, I suggest giving a little more.”",
        "Adelaide sat upright on the small sofa for guests, with his legs crossed. His expression was as cold and indifferent as ever, almost immovable and being extremely difficult.",
        "“You haven’t even seen his face, yet you’re already rushing to send money. Aren’t you afraid of being scammed down to your underwear!” ",
        "Norman sighed for who knows how many times, rubbing his forehead from headache.",
        "“First, we have already communicated in the afternoon. His thinking is very sharp and unique. I unilaterally judged him to be trustworthy. The dean can use his connections to verify his true identity. Second, the specific details have spread throughout the entire college, and the algorithm has indeed progressed by a percentage of…”",
        "“Are there three, four, five, six as well?”",
        "Adelaide fell silent. ",
        "Norman set down the documents in his hand and gazed at Adelaide with a look in his eyes that seemed to hate iron for not being steel.",
        "This child is good in every way, but he’s too stubborn and lacks insight. Once he decides on something, not even the nine-headed star beast can pull him back.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Okay, I got it.”",
        "He waved his hand casually. “You go back and do the experiment.” ",
        "Seeing his hesitant expression as he did not receive a definite answer, Norman finally hinted a bit, “The school is considering your proposal internally. Early subsidies can be negotiated….go now.”",
        "Not long after Adelaide left, a document was delivered to his desk.",
        "Norman opened the cover page, and a glance at it made his brow wrinkle. “This is…”",
        "…… ",
        "Due to the sudden intense pain in Xi Ze’s right eye, Ye Er had to interrupt the communication to attend to the injury.",
        "“During the treatment, this kind of pain is normal. Just bear with it for now. If it gets too painful, let me know so that 015 can give you a certain dose of painkiller.”",
        "Ye Er threw the blood-soaked gauze into the trash can and instructed the female zerg without looking up.",
        "“You didn’t need to wrap it with gauze originally, but since it’s bleeding, there’s no other way. I’ll help you remove it tonight.” ",
        "“Okay, thank you, Male Lord.”",
        "Xi Ze touched the soft gauze on his eye with his fingertips and whispered a thank you. He hesitated for a moment but still said.",
        "“…You didn’t have lunch. Dinner is in two hours. Do you want to have something to eat first to pad your stomach?”",
        "Ye Er belatedly realized that his stomach was empty and was subtly spasming and contracting, simply because he had been so focused on other things. ",
        "“015 usually takes care of the leftover food… I’ll go to the kitchen and see what’s available to eat.”",
        "He got up and entered the kitchen. Opening the refrigerator door, he bumped into 015, the little robot housekeeper. It seemed to suddenly remember something and slapped its head before taking out a portion of tomato pasta that was still emitting heat from the warming cupboard.",
        "“Ta-da!”",
        "“I’ll have this for lunch. How did you think to save a portion for me?” ",
        "Ye Er was somewhat surprised but didn’t pay much attention. He took it and casually placed it on the coffee table.",
        "“It was your female zerg who said to save it for you.” 015 blinked his eyes honestly.",
        "",
        "“I see…” Ye Er tilted his head to the side and looked at the female zerg, thanked him, and started eating. “I should stock up on some bread or something at home. It’s convenient for emergencies.”",
        "“It’s still better to eat on time.” ",
        "Xi Ze disagreed. He couldn’t help but rub the gauze on his right eye with his fingertips again.",
        "There had been several intense pains in his right eye before, but only this time did he take the initiative to call out to Ye Er.",
        "On one hand, he wanted the male zerg to eat on time, but on the other hand, it was due to some subtle and indescribable thoughts.",
        "Clearly, the male zerg enthusiastically suggested watching TV together, but soon after, he walked away on his own, not even having lunch. ",
        "“Alright, alright.”",
        "Ye Er perfunctorily replied, remembering his exchange with Hughes earlier.",
        "“Aitar has a field hospital that is said to be effective in treating gunshot wounds and post-traumatic stress. When your body recovers…”",
        "Recently, he had been hearing the male zerg talking to himself a lot about future treatment plans. Clearly, this matter has already occupied a large part of his mind. ",
        "This sincerity and solemnity weigh heavily on Xi Ze. The fear and pain of being cared for in such a broken and unbearable state only deepen his sense of indebtedness and shame with every passing time.",
        "The cost of treatment may be compensated a thousand or ten thousand times in the future, but the daily expenditure of energy and emotional investment leaves him feeling deeply indebted and unable to repay.",
        "“…Actually, there’s no need to treat these injuries so carefully. Many injuries can heal on their own. There’s no need to go to the hospital.”",
        "Xi Ze opened his mouth and squeezed out a dry sound from his throat. ",
        "Ye Er swallowed the food in his mouth and took out a tissue to wipe his mouth. “But it will leave sequelae.”",
        "“Money can be earned back in the future, but missing the golden period of treatment is not worth it. The most important thing is life and health, then everything else can be put aside first.”",
        "Life is above everything.",
        "This is the lesson his former country taught him. ",
        "Ye Er knew that the Zerg society has always embraced the cold theory of eliminating those deemed worthless, but now Xi Ze is in his care, so—",
        "“Don’t think about passive treatment.”",
        "",
        "His tone was warning as he corrected the female zerg from a distance.",
        "“…Okay.” ",
        "Xi Ze looked stunned as the intense tearing pain in his right eye suddenly became tame. It was as if something soft and fluffy had filled the bleeding void, overflowing and enveloping him completely.",
        "“If you pick up a stray puppy, you must take full responsibility for it. Otherwise, what’s the difference between letting it fend for itself? That would be too irresponsible.”",
        "Thinking back to the time before transmigrating, Ye Er remembered the little stray dog that was picked up and nurtured into a chubby and healthy puppy. He jokingly said, “I am a very qualified keeper.”",
        "Before Xi Ze could respond, 015, who was washing vegetables in the kitchen, short-circuited again and cried out for Ye Er, sobbing for rescue. ",
        "The sofa beside him suddenly felt lighter as the male zerg’s gentle breath abruptly left, and the faint warmth that was once vivid instantly turned cold.",
        "The familiar silence that he was already accustomed to suddenly became unbearable, and even the surrounding air felt thin.",
        "Xi Ze’s eyelashes trembled, and he subconsciously called out softly, “Male Lord?”",
        "“En?” ",
        "Ye Er’s voice came from not far away, mixed with 015’s chatter. “I’m here. What’s wrong?”",
        "Xi Ze stared blankly, and his tightly creased brow slowly relaxed.",
        "His lips curved slightly, and he smiled almost silently.",
        "“… It’s nothing.” "
    ],
    "previous": "Chapter 21",
    "next": "Chapter 23"
}