{
    "title": "Chapter 18",
    "content": [
        "Translator: Deyonna",
        "“What do you want to say in the end?” ",
        "Ye Er put down the documents in his hand and knitted his brow as he looked at the screen in front of him.",
        "He rarely saw Hughes show such a hesitant expression. They were obviously just discussing the detailed follow-up treatment plan.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“I’m sorry… I didn’t tell you before, the womb of that female zerg is severely damaged, and it requires specialized treatment.”",
        "Hughes cleared his throat and said, wearing an apologetic expression on his face. ",
        "Womb damage is a very serious matter, especially for zergs who retain their primal instincts for reproduction. No male zerg would willingly accept a female zerg with such a defect.\n\n",
        "Considering this, he had initially decided not to tell Ye Er about the situation.",
        "“Womb damage?”",
        "Ye Er’s brow knitted deeper, realizing that Xi Ze had been enduring pain all along. Anger flickered across his face.\n\n ",
        "“It’s been so many days. You even came for a consultation once. Why are you only telling me about the situation now?”",
        "He took a deep breath, but was unable to suppress his incredulity and fury. His voice, rarely laced with mockery, said.",
        "“Don’t you realize how unprofessional your behavior is? Did you buy your medical license?”\n\n",
        "Hughes kept apologizing, waiting for his anger to calm down before explaining with a forced smile. ",
        "“It’s because I was afraid that you wouldn’t take the female zerg back if you knew. That’s why I didn’t tell you. I also prescribed antibiotics at the time, so there shouldn’t be any inflammation or infection.”",
        "“I have already confirmed the condition of the female zerg. His self-healing ability is gradually recovering, but he still needs intensive treatment. Can you… accept it?”",
        "Ye Er still pursed his lips in displeasure and said somewhat harshly, “It’s your duty how to treat him. What can’t I accept?”",
        "“Because we need your pheromones and ‘bodily fluids’ to complement the medication for ‘intensive’ treatment.” ",
        "Hughes emphasized the two words, carefully raising his eyes to observe the expression of the male zerg. Sure enough, he saw a stunned look of understanding, with a touch of incredulousness on his face.",
        "“Wait, are you saying…?”",
        "“Yes, it’s exactly the same as what you understand.”",
        "Are male zergs a millennium ginseng? ",
        "Smelling, taking a bite, or even just stuffing the root can treat the female zerg’s injuries. Even legendary magic potions of immortals aren’t guaranteed to cure all diseases, eh?",
        "Ye Er was almost dumbfounded.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "“Cough… It seems that His Excellency hasn’t had a female attendant yet, so you may not understand the specifics of how it works. I will prepare a file for you later, and you can follow it to practice.”",
        "Before he could regain his composure, the call was abruptly disconnected. A moment later, a beep from his terminal notified him that a file had been received. ",
        "[Hughes: The medication will be delivered to you by same-city express delivery, and you can officially start the treatment tonight.]",
        "Ye Er had a complicated expression. He hesitated for a moment but still did not open the file titled:《Teaching Yourself How to Make Your Female Zerg (Beep) Life (Beep) Death, (Beep)(Beep) Non-stop…》",
        "Forget it, he’ll wait for the medicine to arrive… and then take a look again.",
        "But faster than the arrival of the medication was the legendary Male Zerg Protection Association. ",
        "“Who is it?”",
        "At the moment he heard this name, Te Sr sat up from the sofa. Le noticed Wi Ie’s lips twitching into a flat line, seeming somewhat displeased.",
        "It suddenly dawned on him that this association seemed dedicated to protecting male hergs and safeguarding their interests, not ezactly known for being friendly towards female hergs.",
        "“015, take Xi Ze into the room. There’s a small sofa inside.” ",
        "After making sure that the female zerg was well hidden, he opened the door and saw an unfamiliar zerg standing outside.",
        "“Hello, may I ask if you are His Excellency Ye Er?”",
        "The zerg introduced himself.",
        "“I am a staff member of the Male Zerg Protection Association branch. We detected a change in your marital status earlier, but due to a shortage of resources, we were only able to visit now. Please forgive us.” ",
        "“The system detected that this is your first time having your own female zerg. The Protection Association has a responsibility to provide guidance, and we have brought some specialized equipment for you.”",
        "Ye Er noticed a large package behind him. After a long pause, he nodded. “Then come in.”",
        "He was quite doubtful about this so-called guidance until the zerg opened the package—",
        "Inside were an assortment of props, both familiar and unfamiliar, such as □□, □□, and □□. All were packed in a whole box, exuding a dark luster. ",
        "Ye Er was once again dumbfounded.",
        "The worker zerg casually picked up one and began explaining its usage, “You see, this is…”",
        "",
        "Typically, male zergs would already be familiar with these things in advance, and some would even be quite proficient before their second differentiation without needing any guidance. However, explaining is part of his job description, and he cannot stop the guidance unless the male zerg interrupts first.",
        "Ye Er’s expression gradually turned complicated. ",
        "He initially wanted to interrupt the zerg in front of him, but upon second thought, he realized that some of the equipment might be needed for assistance and treatment later tonight. It would be better to understand them now rather than rush at the last minute, so he remained silent.",
        "The living room was very quiet, with only the diligent voice of the zerg echoing as he explained the usage of the tools.",
        "The house had average soundproofing, so Xi Ze could hear everything happening outside very clearly.",
        "He understood the purpose of the Male Zerg Protection Association better than Ye Er, and he also understood… that their peaceful days were probably coming to an end. ",
        "What is truly terrifying is not the mental guidance or the accompanying activities, because those can be considered a harmonious integration of both body and mind, bringing comfort.",
        "But those who need to use those things are subjected to complete abuse, without gentle caresses and kisses, only blood-drenched pain, which no zerg except the abuser would appreciate.",
        "Since childhood, he had witnessed too many scenes like this: his female father whipped by his male father, bloodied and unconscious, falling into a pool of blood, with vacant eyes looking towards the corner where he was hiding.",
        "It was a nightmare that shrouded his entire childhood, different from the blood and flesh flying on the battlefield, not even half as terrifying as a professional torture chamber, yet it burned a deep bottomless void in his heart, constantly dripping with dark black blood. ",
        "Over this period of time, he had noticed that there was no disciplinary room in this house, not even a single one of those tools.",
        "But… compared to the possibility that the male zerg did not like it, Xi Ze was more inclined to the fact that the male zerg actually did not understand.",
        "Once he became interested, it was the most natural thing to try his hand on the female slave. But novices mostly couldn’t control their strength well, and he didn’t know how long his body could hold up now.",
        "But the time they spent together seemed to corrode his defenses. Those kind and soft emotions filled that void. Although it still ached faintly, it was no longer as sharp and intense. ",
        "Xi Ze’s eyes fell on a certain place in the void. The confusion inside had not yet dispersed, but it unconsciously exposed a fragmented and weak, fragile golden light.",
        "Male Lord.",
        "He ground this title between his lips and teeth, muttering it silently again and again. The tips of his eyes showed a trace of fear and nostalgia that he hadn’t noticed.",
        "“You look at this one, you can fasten the female zerg’s hands and feet so that he doesn’t move…” ",
        "Ye Er originally was just absentmindedly propping up his chin, but after hearing this, his eyes widened slightly.",
        "This feels like it can be used when applying medicine to prevent the female zerg from moving around and worsening the injury.",
        "Please visit chrysanthemumgarden (dot) com",
        "“This one is an opening device and injector that can open the womb, which can be filled with milk or…”",
        "Ah, that feels more convenient than using fingers. When applying medicine, there’s a high possibility of worsening the injury if the technique isn’t professional. Maybe using professional tools can make it a bit easier. ",
        "Ye Er was slightly interested, but as he listened all the way, he began to feel somewhat unimpressed. It seemed usable, but not quite proper, and so his brow furrowed slightly.",
        "The worker zerg spoke until his mouth was dry. He took the water handed to him by 015 and drank it all with one gulp. Then he said, “Can you allow me to use your female slave to demonstrate?”",
        "Ye Er paused for a moment, his expression turning slightly cold. He said somewhat rudely to refuse, “No.”",
        "The worker zerg smiled awkwardly, but his expression was somewhat disdainful. ",
        "“After all, it is Your Excellency’s first female zerg, and I can understand your possessiveness at the moment. But in fact, he is just a lowly female slave. Use him when needed. Don’t hesitate.”",
        "He didn’t know how many tough female zergs he had trained, including military females. He considered himself an expert player of these tools, and those male zergs were happy to watch a free show.",
        "“You haven’t tried it yet, so it’s very normal to not be interested. After you’ve seen it, maybe you will like it.”",
        "The zerg hinted with a wink, picked up a long whip from the box, and made a crisp sound in the air. ",
        "“Make sure to whip that lowly slave until their skin cracks and they cry out in pain, begging for mercy!”",
        "“First of all, I won’t let you touch him.”",
        "Ye Er spoke clearly, enunciating each word.",
        "His expression turned completely cold, his pitch-black eyes staring at the zerg in front of him. The unconscious suppression he released made the zerg’s face change color. “Secondly, he’s not my female slave. Please show some respect.” ",
        "“Lastly, thanks for your explanation, but you can leave now.”",
        "He curled his lips, but there was not much smile in the depths of his eyes.",
        "The worker zerg was completely stunned. His movements halted, and he couldn’t speak for a while.",
        "Finally, he stuttered as he said, “Uh, then… then just leave it at that for this guidance session. I’ll go first…” ",
        "He quickly left, almost fleeing in panic, not daring to slam the door.",
        "The living room returned to its original quietness.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er paused, picked up the whip that had fallen on the ground, and threw it back into the box. After hesitating for a moment, he picked up a few more and examined them carefully.",
        "Forget it, these don’t seem very reliable. He’ll take another look later. ",
        "He put the props back, closed the box, and moved it to the corner. Then he called the little robot housekeeper from afar.",
        "“015, bring Xi Ze out. It’s time to eat lunch.”",
        "The male zerg had not mentioned that matter all along. Although he had the idea of burying his head and muddling through for the first time, in reality, waiting was much more agonizing than imagined.",
        "Xi Ze leaned back on the sofa lost in thought for a moment, then suddenly called out to the little robotic housekeeper in a low voice, “015?” ",
        "“What’s wrong? What’s wrong?” 015 put down the mop and enthusiastically approached. “Is there anything I can do for you?”",
        "“Is there a box in the corner?”",
        "He asked somewhat hesitantly, having heard the sound of dragging in the room just now. The sound didn’t last long before stopping, so the box containing the props should be not far from him.",
        "015 turned his head and immediately saw the cardboard box next to the sofa. “Yes, do you need me to get it for you to take a look?” ",
        "Xi Ze hesitated for a moment, but suddenly the male zerg’s voice rang in his ears, trailing off a bit, somewhat hoarse—",
        "“015, bring that box to my room.”",
        "In 015’s program, Ye Er’s command naturally took precedence, so he picked up the box and trotted off to the room at once.",
        "The female zerg on the sofa seemed to freeze. From Ye Er’s perspective, he could see the corner of his tightly pursed lips, and he avoided his inquisitive gaze by lowering his eyes. ",
        "“What’s wrong?”",
        "Ye Er stepped aside to let 015 in, and after listening for a while without hearing Xi Ze’s answer, he didn’t pay it any mind.",
        "“If you’re bored, you can listen to the news or take a nap.”",
        "Xi Ze opened his mouth as if to say something, but then stopped. After a moment of silence, he softly hummed. “En.” ",
        "With a grunt, 015 moved the box to the bedside and enthusiastically asked, “Do you want me to help you disinfect the things inside?”",
        "“No need. Oh right, I have a delivery coming later. Can you help me sign for it?”",
        "Please visit chrysanthemumgarden (dot) com",
        "Ye Er tilted his head slightly, indicating for it to leave, and then kicked the box directly under the bed.",
        "Although the female zerg couldn’t see, it’s still better to hide the box well to avoid any unpleasant misunderstandings. ",
        "He hesitated for a moment, then opened his terminal and downloaded the compressed file Hughes had sent. The name of the file that popped up made his brow twitch slightly.",
        "Ye Er took a deep breath.",
        "Until dinner was ready, the male zerg did not come out of the room. 015 knocked on the door for the third time in confusion before finally getting a response.",
        "“…What’s the matter?” ",
        "Ye Er opened the door with a dazed expression. When he met 015’s incredibly innocent eyes, he subconsciously dodged and, after coming to his senses, awkwardly cleared his throat.",
        "“Is it time for dinner? Alright, you guys go ahead and eat. I’ll wash my face and join you later.”",
        "The dining table was as quiet as a chicken. All except for 015 seemed burdened with heavy thoughts, as if they were worried because of each other, but none of them had the will to open up and communicate.",
        "“Tap.” ",
        "The thick bottom of the cup knocked on the dining table, making a crisp sound and breaking the strange silence.",
        "After preparing mentally for most of the day and being tormented by that compressed file all afternoon, Ye Er thought his heart was already calm as still water.",
        "“Xi Ze, come to my room tonight.”",
        "He hesitated for a long time before speaking, surprising the zerg. ",
        "“Ah?” 015 looked confused.",
        "Xi Ze’s body trembled slightly, and the movements of his hands froze.",
        "“Also, can you prepare? It’s the…”",
        "Ye Er wanted to say it in one go but hesitated for a long time. He couldn’t bring himself to say the words, and his ears gradually turned red. “It’s the…” ",
        "The male zerg’s voice hesitated, sounding conflicted and distressed. The implication in the words was so strong that he didn’t even need to guess what it meant.",
        "The blade hanging over his head finally fell.",
        "",
        "Xi Ze’s eyelashes trembled slightly, his fingers holding the knife and fork tightened. Strangely, he did not feel any anger or sadness, only a dead calmness.",
        "“…Okay.” "
    ],
    "previous": "Chapter 17",
    "next": "Chapter 19"
}