{
    "title": "Chapter 9",
    "content": [
        "Translator: Deyonna",
        "His words coincided with Hughes’ words. ",
        "This is very unusual as if this issue was an irrefutable fact, more important and urgent than anything else.",
        "Ye Er’s eyes did not waver, staring at the female zerg in front of him.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "The detached “human” mindset finally connects to the track of the Zerg race society, facing issues that he intentionally or unintentionally avoided.",
        "Dying wild animals will erupt with a high, unprecedented will to survive. This is especially true for those who are fortunate enough to be rescued and have a glimmer of hope for survival. ",
        "The former exhibits resolute and unyielding character, while the latter often bends their spine, gritting their teeth to endure bitter pain to survive.\n\n",
        "Some individuals who considered themselves noble and virtuous detest this transformation, understanding universal values with subtle contempt. However, the hands of those contemptuous cannot reach this small house in another time and space.",
        "The Zerg race believed that a male zerg fucking his female slave is as normal as it can be, even though the female slave may be in great pain. However, no Zerg would care, making the situation worse than in the “human world.”",
        "In this world, it is a completely isolated moral island.\n\n ",
        "He can do anything he wants to the female zerg. It is reasonable, legal, normal, and correct.",
        "“I know what you like. It’s better to just come directly.”",
        "The scorching breath moistened the fabric, like fine needles, awakening Ye Er, who was absorbed in his dark fantasies.\n\n",
        "Xi Ze had already crawled out of the quilt and was kneeling at his legs, knocking his knees on the cold ground as if not knowing pain. ",
        "Ye Er remembered the hollow, bloody hole in his knees, which left him unable to stand up at all.",
        "He was like a newborn baby, and like a god in Greek mythology, every line depicted vitality and beauty. His molten gold eyes were like deep pools, burning with cold blue fire.",
        "—A god pulled down from his altar, covered in mud, blood, and wounds, the suffering and embarrassment adding a different kind of allure to his beauty, almost breathtaking.",
        "He thought he had found hope, only to realize that he had fallen into a deeper layer of hell, bargaining with the ruler of hell for the sake of surviving. ",
        "“Is it possible? His Excellency can play to his heart’s content, and I get the resources to survive.”",
        "The female zerg’s voice was hoarse, carrying an almost desperate calmness.",
        "In fair trade, payment is made if the goods have been received—",
        "Ye Er gently caressed the soft white hair of the female zerg, feeling a slight tremor. ",
        "“No.”",
        "He squinted his eyes. His voice was soft but very firm, almost like making a vow.",
        "Please visit chrysanthemumgarden (dot) com",
        "“I won’t touch you.”",
        "He did like him, otherwise, he wouldn’t have been so amazed the first time he saw him in the advertisement, to the point that he would occasionally think about it until he brought the female zerg home. ",
        "But liking something is one thing, and actually carrying it out in reality is another.",
        "If he truly imposes his urges and desires on the female zerg arbitrarily, using survival resources in exchange for the satisfaction of his own desires to vent, then he is no different from a beast.",
        "He is a person, and he can never forget this fact.",
        "Te Sr furrowed his brow and said in a deep voice, “Whether I’m a male herg or a female herg, the words I said at the beginning will not change.” ",
        "Le pushed Wi Ie’s shoulder, allowing him to slowly lie back in the duilt. “Mocus on healing your inpury first. We’ll discuss the rest once you’re better.”",
        "But remembering what Hughes had said to the female zerg that was only breathing its last breath, he realized that recuperating from injuries did not count as a good excuse to refuse □□ acts.",
        "“There’s no particular reason why I’ve saved you and brought you back. It was purely a momentary impulse.”",
        "“I do like you, but not in a way that wants to bed you…” ",
        "Ye Er struggled to describe his feelings, finding it hard to come up with the right words. Saying that he wanted to raise a snow leopard would sound very silly.",
        "“So let’s just live together like roommates. At worst, you can just pay double the rent in the future.”",
        "Xi Ze’s field of vision was dim.",
        "The voice in his ear was gentle and warm, with a hint of soft distress, lacking the arrogant, gloomy and cold, or hysterical tone of the male zergs in his memory. ",
        "The zerg’s emotions in front of him remained stable throughout, skillfully and gently easing the conflict of two opposing needle tips.",
        "But compared to gullibly trusting the false surface in front of his eyes, he still believed more in the consistent nature of the male zergs in his cognition.",
        "In a warm and comfortable environment, it is natural to relax one’s guard. However, instead of being caught off guard by a heavy blow when exposing his weak spot, he would prefer to remain vigilant from the beginning and endure the pain.",
        "“I will play the role of a good toy and make sure you don’t feel bored.” ",
        "The female zerg tried hard to squeeze out a smile, like a diligent but inexperienced waitress trying hard to work.",
        "And as he said, he would be a good actor. After a few blinks, that smile visibly became much more pleasing to the eye.",
        "",
        "“You can lock me at the head of the bed, do whatever you want to do, do me from morning till night, I don’t mind. You can dress me in sexy underwear. It might look more fun. Maybe you will like it…”",
        "He listed the male zergs’ method of playing, introducing himself as if he were selling expired goods in a supermarket clearance sale. ",
        "Perhaps even worse than that, expired items have to be purchased with money, but he’s almost free.",
        "He didn’t wait for Ye Er’s response, but gritted his teeth and said with a smile, “I want to accompany you to play.”",
        "However, Ye Er felt that it sounded more like “I want to kill you.”",
        "The female zerg dispelled the previous silence as if something would bite and crush his throat if he stopped talking. At this time, an invisible shadow was trying to engulf him. ",
        "Ye Er smelled the scent of unease and fear.",
        "Those feelings will not be changed by the resilience and will of the female zerg, as being violated and harmed are all possibilities that exist objectively.",
        "Ye Er took a deep breath and couldn’t help but knit his brow, gently tapping his long fingers on his knee.",
        "This won’t work. ",
        "They can’t communicate like this.",
        "But he couldn’t expect to change the female zerg’s mind all at once.",
        "This is akin to forcing a stray puppy, whose bones have been broken by a stick, to like a huge, grinding stick that resembles a weapon. It is too much bullying for him.",
        "“Alright.” ",
        "After a moment of contemplation, Ye Er interrupted Xi Ze and carefully considered his words.",
        "“I do want to play. You… obey my orders and make me happy, and I’ll give you what you want.”",
        "He emphasized the words “obey my orders.”",
        "“I don’t like playing with blood everywhere, making a mess. If you kneel down until your knees bleed, you’ll be sleeping directly on the floor tonight.” ",
        "Ye Er sat back on the sofa, lightly stepping on the female zergs’ big inner thigh with his plush slippers, sweet-talking and intimidating.",
        "The female zerg’s eyelashes trembled, his breathing slightly hitched, his arm hanging by his side tensed and loosened, looking like a clam that wants to close but forces itself to open.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er also paused, feeling the scorching body temperature and the solid yet flexible muscle shapes through the thin, soft insole of the foot, causing him to uneasily curl up his toes.",
        "“….Yes.” Xi Ze’s body tensed, adjusting his posture as he sat back on the quilt. ",
        "His back bent slightly, his abdomen was stretched taut into a sleek and elegant line. Ye Er glanced a few times and discovered the source of that familiar feeling.",
        "This is the defensive action of the female zerg before resisting the beating during the previous live broadcast of the female slave exchange, making it easy to curl up like a ball at any time to protect the vulnerable abdomen and vital organs.",
        "Ye Er’s eyes darkened slightly, rubbed his fingertips, resisted the urge to touch Xi Ze’s head again, and instead picked up the glass of lukewarm milk.",
        "Xi Ze waited for a long time, but instead of the usual kicking, trampling, or whipping, he heard the male zerg order him to “open his mouth”. ",
        "There are many forms of oral play, but it was also an area that could get hurt easily. His Adam’s apple bobbed, and he slightly opened his mouth—",
        "The warm glass touched his lips.",
        "“Drink milk.”",
        "The glass is transparent, and Ye Er can see him cautiously sipping the milk, his soft lips stained with a bit of milky white, occasionally sticking out his tongue. ",
        "There really is a sense of familiarity with raising a big snow leopard bowing its head and coyly licking milk from a plate.",
        "He was momentarily lost in thought, and the milk in the cup was running low and Xi Ze couldn’t drink. The female zerg dared not speak up to urge him, so he could only lower his head and reach to drink.",
        "Ye Er regained his senses and saw at a glance that the female’s face was marked with a circle of milk stains from the glass and felt subtly guilty. “You can drink it yourself.”",
        "After finishing his drink, Xi Ze wiped his face with the help of 015. Following the tiring series of events, it was already close to eleven o’clock. ",
        "Ye Er’s biological clock made him lazily squint his eyes in drowsiness and didn’t bother to put on a show anymore.",
        "He yawned three times in a row. Due to psychological tears, his long eyelashes stick together in small clusters. The corners of his eyes turned slightly red, his voice sounded as if immersed in the tranquil night, somewhat ambiguous.",
        "“At home, there should not be any living being who hasn’t slept for at least eight hours… Hurry and rest, okay?”",
        "The female zerg, who was quietly carrying out the order, suddenly paused. His expression became somewhat strange as he lifted his eyes and looked over, hesitantly asking in his hoarse voice. ",
        "“Why…?”",
        "Ye Er cleared his mind with great difficulty, locking eyes with the female zerg for a moment, completely failing to understand Xi Ze asking why. “What why?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Then he helplessly watched as the female zerg clenched his teeth in silence, his expression turning stiff, with a hint of anger, as if he was being used as amusement.",
        "“What’s wrong?” ",
        "Ye Er was completely puzzled. He offered the milk to him again, only to be rejected as he tilted his head to the side.",
        "His drowsiness dispelled a bit as he stared blankly at the female zerg’s side profile.",
        "Hold on… Ye Er suddenly realized that he had made a wrong decision just now.",
        "The problem between them was not resolved. It was merely overlooked and muddled through hastily to placate the female zerg. ",
        "And he’s not a good actor either. In no time, his true colors were exposed and discovered by the female zerg.",
        "But now is not the time suitable for negotiation and communication.",
        "Both sides are exhausted and weary. It’s possible that misunderstandings and conflicts will just continue to accumulate. Moreover, staying up late is also not conducive to the recovery of wounds.",
        "Ye Er kneaded his slightly aching temples and said softly, “We will have the chance to talk again. How about it? Let’s go to sleep for now.” ",
        "This response obviously did not satisfy Xi Ze, but he also seemed to have no right to object.",
        "After a moment of silence, the female zerg slowly tucked himself under the quilt.",
        "“Goodnight.” Ye Er said softly.",
        "Not receiving a response, he turned off the living room lights and went back to his room. ",
        "Then he tossed and turned in bed for a while, but his drowsiness gradually dissipated.",
        "Ye Er stared blankly at the ceiling for some time, then turned on his terminal and entered keywords such as ‘female slave collar’.",
        "At that time, he only hastily skimmed over the explanations for this thing, seemingly overlooking too many details.",
        "[Each female slave will be fitted with a collar for the convenience of male zerg’s management and punishment. It only requires recognition of the male zergs’ fingerprint to input information.] ",
        "[The male zerg can voice-control the collar to carry out electric shocks, suffocation, toxin injection, force estrus…]",
        "[Each collar has only one key, representing that the life of this female slave can only belong to that one male zerg from then on. It cannot change hands even by transfer or abandonment.]",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "[And unless his male lord voluntarily uses the key to unlock the collar, any unauthorized damage to the collar is illegal…]",
        "[Data shows that ninety-nine percent of female slaves live their whole lives bearing this identity, with very few upgrading to female attendants or regaining their freedom.] ",
        "[PS: The collar can only recognize a male zerg’s identity information. Without a male zerg’s authentication, it will be regarded as a common punishment band.]",
        "So that’s how it is. Ye Er suddenly realized, no wonder the female zerg was so angry.",
        "His fingers slightly moved and continued searching for information about the female slave collar.",
        "The pale blue light reflected in his eyes. Countless entries opened and closed, and the surging flow of information flowed like a river. ",
        "It wasn’t until the faint light of dawn that he finally stopped.",
        "Ye Ye: I’m a person who habitually avoids conflicts qwq"
    ],
    "previous": "Chapter 8",
    "next": "Chapter 10"
}