{
    "title": "Chapter 8",
    "content": [
        "Translator: Deyonna",
        "The sound of water in the bathroom stopped. ",
        "Ye Er was sitting on the sofa lost in thought. When he heard the sound, he called out to the careful and conscientious cleaner, 015, “Carry him out.”",
        "Having both legs broken is a very bad thing. Without the assistance of 015, the female zerg cannot wash and go to the toilet by himself. Perhaps he will be stuck on the sofa for a long time in the future.\n",
        "",
        "He subconsciously frowned, but he also understood that after being frozen in the snow for so long, it was already very good that his limbs had not necrotized to the point of amputation. At present, apart from slow treatment, there is no better way.",
        "“Click.” ",
        "It was the sound of the bathroom door opening.\n\n",
        "The little robot housekeeper, half a meter tall, came out carrying the female zerg, several times its size. Its two long mechanical arms wrapped around the shoulders and thighs, executing a very standard princess carry.",
        "The female zerg was clearly very unused to being carried like this, his body stiffened almost helplessly.",
        "It’s like Snow White being carried by a dwarf.\n\n ",
        "Ye Er smiled softly, and noticing the increasingly evident embarrassment of the female zerg, he cleared his throat slightly to conceal his amusement.",
        "“Put him down here.” He patted the newly laid quilt on the floor, stood up, and made enough space.",
        "The female zerg lay flat on the clean quilt, no longer bleeding or with torn wounds, and he did indeed look much better.\n\n",
        "He closed his eyes as if waiting for something, no longer struggling or resisting incisively, as if deciding to become a weathered bluestone. ",
        "But he’s obviously not.",
        "The female zerg’s breathing was somewhat rapid, and his tightly closed eyelids trembled slightly, indicating his unease.",
        "The soft and vibrant lines, like cotton candy, gently undulated. The light coated the light honey color with a smooth film, resembling the outer layer of a sugar-coated hawthorn, but definitely more plump and juicy.",
        "Ye Er felt a slight numbness in his teeth roots and couldn’t help but grind his teeth. It was only after doing so that he suddenly realized what he was thinking. ",
        "He glanced at the time and sure enough, it was already past eight-thirty in the evening.",
        "He knew within himself that he was not a hooligan, yet he had just had a rare and magical fantasy about the female zerg’s body. Seeing the strange association of two unrelated foods, he felt he must have been muddled-headed from hunger.",
        "The female zerg looked unwilling to communicate, and he didn’t want to force a conversation. Ensuring that the female zerg was settled was enough to achieve his goal.",
        "The new clothes were bought in the afternoon, and they will only arrive tomorrow. ",
        "Ye Er shook out the comforter he had dug out from the bottom of the wardrobe and covered the female zerg from head to toe, making sure he was tightly wrapped. “Rest well, sleeping more will help with the healing of your wounds.”",
        "A large lump under the comforter moved, and then the comforter was suddenly lifted. Xi Ze propped up his body halfway, his jaw tense, looking alert yet perplexed.",
        "",
        "He lifted his eyes towards Ye Er, his deep gaze now veiled with a layer of shadow, yet still sharp and stern, as if capable of piercing through all falsehood and deception.",
        "“What do you want?” ",
        "He spoke slowly, the injury to his throat made it difficult for him to vocalize.",
        "Since a moment ago, Ye Er had been immersed in thoughts about dinner. Upon hearing the words, he blurted out, “I want to eat stir-fried tomatoes and scrambled eggs.”",
        "The female zerg’s silent and immense confusion left Ye Er finally coming to his senses, coughing slightly in embarrassment.",
        "It happens that 015 had already processed it, and the little robot housekeeper responded eagerly, “Alright, I’ll go and do it right away!” ",
        "With this interruption, the female herg seemed to become less tense. Le remained silent for a moment and then asked, “Who are you?”",
        "What’s your identity, who sent you, and what’s your purpose?",
        "Is he serving the nobles or affiliated with the military, or perhaps… In just a few breaths, he had already run through different possible options, but he felt a deep powerlessness, thinking, even if he knew, what difference does it make?",
        "As a series of duestions came crashing in, Te Sr was momentarily stunned, then carefully said, “Actually… I was pust passing by.” ",
        "He told the female zerg about the short advertisement posted on the door, the live broadcast of the female slave exchange, followed by the events in the alley he passed by, then the hospital, and finally his home.",
        "He spoke aimlessly without a specific focus, simply reminiscing. As he spoke, he recalled a sentence by Hesse that he found too fitting and wonderful—",
        "[Because all forks in the road lead me to your side.]",
        "“Anyway, that’s the truth, I’m just a passerby.” ",
        "Ye Er explained, reflecting on his motives, “Perhaps it was just a moment of impulse that led me to pick you up and bring you home.”",
        "He felt that Xi Ze would not believe it, after all, he looked as vigilant and cautious as a wolf.",
        "But beyond expectations, the female zerg did not ask any more questions. His fingers on the blanket tightened and then relaxed.",
        "The sharp pent-up frustrations between his brows gradually dissipated, turning once again into a silent endurance of pain. ",
        "—It’s as if he didn’t want to dig deep to seek the real answer, he just needed a reasonable explanation to accept the sudden change and the unknown situation, so that he could close his eyes and continue living.",
        "“Thank you very much for helping at that time, Your Excellency. I will repay you double the medical expenses, and I will do my best to fulfill any requests you may have.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Xi Ze said hoarsely, with the usual solemn expression of a military female, his eyes and brows showing a hint of embarrassment. “I’m immensely grateful.”",
        "“It’s not a big deal. You should first focus on recovering from your injury, we can talk more once you’re better.” ",
        "Ye Er smiled and said casually to console.",
        "He was not surprised by Xi Ze’s reaction, which was why he struggled to hide his expression of humiliation during the live broadcast. If he had not retained that trait, he might not have lived so miserably.",
        "There was a moment of silence.",
        "Ye Er could sense Xi Ze’s veiled uneasiness and hesitation. ",
        "Perhaps the female zerg did not want to stop questioning so soon, perhaps it was because he knew nothing about the current situation, and lies can be easily fabricated.",
        "Or perhaps, this house had no malice or sharpness that could make him raise his spikes, so his vigilance and resistance were boundless, enveloped in a quiet and peaceful air.",
        "Regardless of what, this is a good start.",
        "It takes time. ",
        "Ye Er reminded himself once again.",
        "Then he decided to go to the kitchen to check the situation, to prevent 015 from suddenly losing power again and burning through the bottom of the pot.",
        "At exactly nine o’clock, Ye Er finally had his belated dinner.",
        "During the process, 015’s cooking panel may have malfunctioned intermittently again, resulting in a large pot of tomatoes with scrambled eggs. ",
        "In fact, the tomatoes were tomatoes, but the eggs were unknown eggs of some star beast, as huge as ostrich eggs. After being stir-fried, they were fresh and tender in color and smelled very fragrant.",
        "Ye Er often expresses gratitude for the rice and wheat grown here, as they have not been replaced by the sticky and pasty nutrient solution. Otherwise, his symptoms of not being acclimated to the local environment would have worsened a lot.",
        "When the fragrance wafted out, he clearly heard a muffled sound, and when he turned to look, he found Xi Ze also looking in this direction, lips tightly pressed together in silence.",
        "The female zerg must have not eaten for a long time. He had received a nutrient injection in the hospital, but it had been two full days since leaving the hospital, and he had not eaten a single grain of rice. ",
        "Ye Er separated half of the tomato scrambled eggs, mixed them with rice, creating a slightly sticky but richly flavored mixed rice bowl, and then handed it to 015.",
        "“Please go feed him.”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Impaired vision and broken legs are equally troublesome, as they first manifest in inserting chopsticks into the nostrils while eating, requiring assistance in feeding or specialized training.",
        "Taking care of a female zerg is like repairing a long-neglected machine. Just plugging in and barely starting it up is only the first step; the subsequent series of repairs and maintenance are the real trouble. ",
        "Ye Er sighed, carried the bowl, and sat on a sofa that had not been stained by blood.",
        "The steaming hot food swallowed down the esophagus, soothed the empty stomach that had been empty for a dozen days or even longer, and the moment of satisfaction almost exploded.",
        "He had almost forgotten how long it had been since he last ate normal food.",
        "Xi Ze looked restrained yet eager, his Adam’s apple bobbing, his body involuntarily leaning forward, almost leaning towards 015 in front of him. ",
        "015, which was forced to constantly speed up, had sparks almost starting to spurt on its mechanical arms again.",
        "“Slow down.” Ye Er helplessly used his chopsticks to clamp on the busy spoon. “Be careful not to choke.”",
        "The female zerg pursed his lips and looked at him, with dull eyes lacking focus, but revealing a hint of accusation.",
        "It’s as if Ye Er is a cruel guy who feeds half a sausage and then cruelly takes it back, enjoying watching the puppy whine and bark while standing up to scratch his pants leg. ",
        "But the female zerg is not a puppy, so when his food is intercepted, he can only silently lower his eyes and barely suppress the desire to swallow saliva.",
        "“Go charge up.”",
        "Xi Ze heard what the clear and refreshing voice said. Then the little robot housekeeper in front of him rolled away, but his stomach was still rumbling from hunger, and he almost couldn’t restrain his disappointment.",
        "But the next second, a hot spoon extended from the side and touched his lower lip— ",
        "“Eat, and chew before swallowing, or your stomach will feel uncomfortable.”",
        "“…Thank you.”",
        "Ye Er scooped up another spoonful of rice, looking at the female zerg wrapped in a fluffy quilt in front of him.",
        "His soft, slightly curled white hair hung down, and the contours of his face softened a bit when silent. After swallowing the food, he would look up, lively and vivid. ",
        "At this moment, he finally felt a hint of reality that this female zerg was truly brought back home by him, and not just a dream tinged with regret.",
        "For the first time, this house, like a lone island, had the sound of a living being other than 015, breathing with warm temperature, filling the other half of the house to the brim.",
        "",
        "It felt pretty good.",
        "Ye Er’s eyes and eyebrows bent, and the slight curve at the corner of his lips revealed a trace of joy. ",
        "Unable to sleep on the sofa, Ye Er had to let him sleep on the floor. Fortunately, the central air conditioning system was constantly delivering heat, so there shouldn’t be a risk of catching a cold.",
        "Ye Er put the double dose of sleeping pills into the small pot of boiling milk. The pills melted along with the foamy bubbles, he thought for a moment, and then added a spoonful of sugar.",
        "Only a dim yellow light was left in the living room. Xi Ze was wrapped in a quilt, but he was not asleep. He opened his eyes when Ye Er approached.",
        "The glass lightly tapped on the coffee table, and the sweet fragrance of milk wafted out with the steam. The pervasive chill seemed to be dispelled, stuffed into the thick and dense milk foam. ",
        "Ye Er patted the female zerg through the quilt.",
        "“The collapse of the mental landscape can lead to severe headaches. I will give you another mental power guidance before bed…”",
        "Mental guidance.",
        "Before his words could even finish, the body under his palm instantly stiffened, and Xi Ze suddenly looked up in Ye Er’s direction— ",
        "“Male zerg…”",
        "He muttered, repeating again as if unable to believe. “You are… a male zerg?”",
        "“Yes, you…” Didn’t know?",
        "Ye Er was somewhat confused, then realized that he had never declared his gender. But why emphasize it deliberately? ",
        "But when he looked at the female zerg, he realized belatedly that this was not something that could be ignored.",
        "Those suppressed and deeply hidden anger and fear, surged out from under the chapped indifferent mask of the female zerg, entwining around the light golden eyeballs like vines.",
        "He looked like he had been stabbed hard, and the color drained from his face.",
        "Ye Er recognized that look and expression; they had appeared in the advertisement and filled his face during the live broadcast. ",
        "That was a look gazing at a torturer.",
        "He unknowingly felt a stab of pain, and suddenly remembered the collar on the female slave that ‘can only recognize the identity of the male zerg.’",
        "Please visit chrysanthemumgarden (dot) com",
        "Thinking back to when he was marked as his exclusive property while unconscious, from then on, Xi Ze became his possession.",
        "Thinking of Hughes’ initial apologetic and light smile, the superficial apology was directed towards him, while the ridicule and indifference were directed towards the severely injured female zerg on the sickbed. ",
        "Sure enough, Xi Ze’s face suddenly changed drastically as he reached out to touch the black ring band around his neck.",
        "He quickly got the answer, his jaw tightened, gritting his teeth as if he could bear no more. “… Have I already become your female slave?”",
        "“I’m sorry, that was an accident,” Ye Er said softly, “At that time, I…”",
        "He looked almost helpless, sensing that the situation was about to spiral out of control. ",
        "In front of him was like a volcano about to erupt, he was unsure if he could withstand the rushing hot lava.",
        "“Accident?”",
        "Xi Ze smiled mockingly, his face stern, like a harsh officer dealing with a new recruit who made a big mistake, almost burning with anger. “Do you know…”",
        "He swallowed the latter half. ",
        "After a moment of rough breathing in silence, he withdrew all those exposed emotions back into his shell, as if burning himself and silently becoming a pile of ashes.",
        "He thought he was utterly damaged, with nothing left already.",
        "But the fact is, he still has a little value left, and perhaps that’s why the male zerg picked him up.",
        "It felt like a lump was stuck in his throat, making the collar above tighten to the point of being unbearable, causing Xi Ze to feel a stabbing sensation of suffocation. ",
        "The bowl of fragrant and sweet rice turned into poison, churning in his constricted stomach, making him almost nauseous.",
        "But he is still alive after all, and he… wants to continue living.",
        "He suddenly smiled, but it looked more like he was crying.",
        "“Your Excellency, do you want to fuck me?” ",
        "The calm and hopeful dream for the night popped like bubbles so quickly.",
        ""
    ],
    "previous": "Chapter 7",
    "next": "Chapter 9"
}