{
    "title": "Chapter 28.2",
    "content": [
        "Translator: Deyonna",
        "As Ye Er’s breathing in his arms grew long and steady, Xi Ze paused the movements of his hand and he combed his fingers through Ye Er’s hair with unfamiliarity as he tucked the loose strands behind his ears. ",
        "The smaller body in his arms felt light and soft. He tried to relax his muscles, wanting the male zerg to lie more comfortably.",
        "But before he could even curve the corners of his lips and hold his breath to carefully savor the scent unique to the male zerg, a voice suddenly echoed in his mind.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "[Don’t get your hopes up. You’re no different from any other military female.]",
        "Xi Ze had always known he was a typical military female. ",
        "Tall and strong, dull and uninteresting, savage and terrifying on the battlefield, yet stiff and boring in bed, unable to arouse the likes of those male zergs.\n\n",
        "He used to scoff at the idea of currying favor with male zergs, but that was until he met Ye Er. Only now, after much thought, did he taste and feel a bit of helplessness and powerlessness.",
        "If he still had the status of a general, with tremendous power and wealth, perhaps he could attempt vainly of tying the male zerg in front of him to his side and holding him in his hands.",
        "But now, in his broken and destitute state, how could he possibly deserve this fine little male zerg?\n\n ",
        "Xi Ze’s eyelashes fluttered as the hand resting on Ye Er’s shoulder twitched. He resisted the urge to tighten his grip and instead moved his hand to the other side of the sofa, never touching the zerg in his arms again.",
        "This nap felt like a very, very long sleep.",
        "When Ye Er woke up, he was completely disoriented. He sat up for a while, gradually regaining consciousness, his unfocused eyes slowly focusing.\n\n",
        "“…What time is it?” ",
        "He looked around, realizing he was resting on the female zerg’s pillow, covered by the female’s quilt, with his hair and thin shirt a mess from sleep.",
        "Still a bit weak from just waking up, he felt an unexpected sense of relaxation and satisfaction. He had almost forgotten how long it had been since he had slept so soundly.",
        "He glanced at the sky from the balcony. The last rays of twilight had faded, and a few stars were already hanging in the night sky. All kinds of colorful neon lights in the street and the illuminated windows of the houses gradually began to shine.",
        "The vast and bustling night had just begun. ",
        "In the kitchen, 015 was cooking; the clattering of dishes, the chopping of vegetables, and the sounds of pots, bowls, ladles, and basins played a lively and warm symphony.",
        "He stared outside for a while, belatedly noticed the heat on his forehead was not right. He reached out and touched it, realizing he must have a low fever.",
        "No wonder he felt so sluggish and didn’t want to get out of bed.",
        "“Beep, beep!” ",
        "The terminal on the coffee table beeped twice. Ye Er reached out and grabbed it, sinking back into the soft quilt to check the message.",
        "[Elaine: Your Excellency, good evening [heart]!]",
        "Read more BL at chrysanthemumgarden (dot) com",
        "[Elaine: The remaining test reports are out. I will arrange for the staff to deliver them to you shortly. If you want to talk to a doctor, feel free to let me know; I will definitely make arrangements for you! [rose x3]]",
        "[Elaine: By the way, the matter Your Excellency mentioned has already been arranged. If all goes well, you will receive a response soon. I’ll trouble you to wait patiently.] ",
        "Three messages flashed in a row, all good news. Ye Er was too lazy to exchange pleasantries, so he moved his finger and sent an emoji.",
        "[wwn: CatNodding.jpg.]",
        "“Deep, beep.”",
        "A new message popped up, a familiar cold yet enthusiastic tone— [Free to chat tonight?] ",
        "Te Sr let out a long hum, pondering for a few seconds before deciding to give himself a day off tonight; he really couldn’t handle it anymore.",
        "[wwn: Not tonight, I have a fever.]",
        "[wwn: CryingTomato.jpg.]",
        "Le was about to put down his terminal and check on the female herg and 015 in the kitchen when two beeps rang in duick succession. Le casually swept it a glance— ",
        "[You have received a transfer of 880,000 star coins from user ‘Elaine’…]",
        "[You have received a transfer of 150,000 star coins from user ‘Adelaide’…]",
        "The two messages appeared side by side on the homepage, looking particularly pleasing to the eyes.",
        "The tip of Ye Er’s eyebrow slightly rose, he hummed a happy laugh and sent two thank-you emojis back before getting out of bed, feeling refreshed and invigorated. ",
        "015 came out of the kitchen with a potful of soup, blinking its pea eyes, “You’re awake! Dinner will be ready soon.”",
        "The aroma of the food, trapped by the kitchen door, wafted out. The little robot housekeeper lifted the lid of the soup pot.",
        "The milky white steam, mixed with a rich and mellow fragrance, rose gracefully in the bright light, instantly awakening his numb appetite.",
        "“…You didn’t burn the bottom of the pot?” ",
        "Ye Er pulled out a chair and sat down as he said in surprise.",
        "Although it smelled delicious, he still maintained a bit of vigilance. “You didn’t dump half a jar of salt in it like last time, did you?”",
        "",
        "015’s small screen maintained a standard smile. “You can try a sip and see.”",
        "“Just kidding…” ",
        "Ye Er chuckled, taking the bowl and spoon it handed him. His eyes curved slightly. “Thank you for your hard work.”",
        "But 015 suddenly remembered something and hurried to the kitchen. “It’s going to burn! It’s going to burn!… Fortunately, fortunately, it’s not burned…”",
        "The kitchen door was pushed open again.",
        "Ye Er was originally propping his cheek on his hand, holding a spoon and stirring the hot soup when he turned his head upon hearing the movement. Sure enough, he saw Xi Ze come out, his sweater splashed with water droplets and carrying the smell of smoke and fire. ",
        "“Did you guide 015 to make dinner?” he asked with a smile.",
        "015 wouldn’t know how to make these fancy dishes; it always made the same few things. The only possibility was that Xi Ze had stepped in to guide it.",
        "He had said before that his cooking skills were good, and it seems that it was indeed very good.",
        "“So amazing—I’m not very good at cooking. I’m lucky I haven’t starved myself to death.” ",
        "Due to the low fever, his voice was still a little hoarse, and his tone was sluggish and drawn out.",
        "“What’s wrong with your voice?”",
        "Xi Ze keenly noticed something was wrong and cocked his head. “It sounds a little hoarse. Did you catch a cold?”",
        "“I might have a low fever… It’s nothing serious. I’ll be fine after taking some medicine and getting some sleep after dinner.” ",
        "As he spoke, 015 brought out the stir-fried dishes one after another. Ye Er put down his soup spoon, picked up a dish with his chopsticks and put it in his mouth, then mumbled somewhat indistinctly.",
        "“This tastes good. It would be perfect if it were a little spicier…”",
        "He ate mouthful after mouthful with gusto, not noticing that Xi Ze was maneuvering his wheelchair away.",
        "Suddenly, warmth enveloped him from behind as a coat was draped over his shoulders. ",
        "Ye Er was startled, subconsciously reaching out and touching it, feeling the edge of a fluffy hat.",
        "“Put on more clothes so you don’t catch a cold.”",
        "Please visit chrysanthemumgarden (dot) com",
        "The female zerg’s voice came from the side. The hand that had been supporting the coat on his back withdrew, then picked up a soft pillow and stuffed it behind his waist.",
        "Ye Er felt the warmth wrapping around him. He blinked slowly, and before he could react, the hair on his forehead was brushed aside, and a hand felt his temperature. ",
        "The temperature of that hand was higher than his forehead—steady and powerful—but the action was somewhat restrained.",
        "After taking a simple temperature test, the expression on Xi Ze’s face relaxed a little, and he said softly.",
        "“You must just be tired… Drink some medicine after dinner and rest early tonight.”",
        "The hand on his forehead has not withdrawn yet. Ye Er subconsciously lowered his head and rubbed against it, nuzzling into the palm a few times. ",
        "The hand stiffened for a moment, after some hesitation, gently caressed his head a few times, like smoothing a cat’s fur from front to back.",
        "“Is it very uncomfortable?”",
        "The male zerg had never displayed such almost coquettish action before, and he had been quiet since earlier. Xi Ze was inevitably a bit worried.",
        "“Don’t worry… I’m fine.” ",
        "Finally, coming to his senses and realizing what he had just done, Ye Er’s cheeks burned hot. He quickly lowered his head and drank the soup. “Let’s eat quickly; it will get cold.”",
        "He remembered lying in the female zerg’s arms, being kneaded so comfortably that he fell asleep. Xi Ze’s technique was exactly the same as now.",
        "The feeling was quite subtle. It felt like… he was a cub, being gently licked and loved by a broken and battered, yet still powerful, snow leopard.",
        "He should not think about it anymore. Eat, eat! ",
        "Ye Er took a big gulp of soup, trying to suppress the heartbeat that seemed ready to jump out of his throat.",
        "Fortunately, after a night’s rest, the low fever had almost completely gone down.",
        "Ye Er wouldn’t have to take leave on the last day before the New Year holidays, saving his precarious perfect attendance record.",
        "It’s another busy day, following the same working routine. ",
        "“Your Excellency, do you have any plans for tonight?”",
        "As the workday drew to a close, a sub-female colleague suddenly turned around and enthusiastically invited him to dinner. “There’s no point in going back anyway, is there?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ye Er turned off the screen of his terminal and politely declined as usual, “Sorry, I…”",
        "He was going to use the excuse that dinner at home was already prepared, but thinking of the female zerg quietly sitting on the sofa waiting for him, he inexplicably said, “I already have a date tonight.” ",
        "The sub-female, who didn’t hold out much hope at first, was caught off guard when a mouthful of melon seeds was stuffed into his mouth. “You actually have a date?!”",
        "This was simply more shocking than the news that Aitar had been bombed by star pirates!",
        "“Ah.” Ye Er blinked, “It’s only at home, nothing special. 015 has already prepared dinner.”",
        "The female zerg who had heard the news sighed in disappointment, then said indignantly, “How can eating dinner made by a robot housekeeper be called a date? It’s a complete waste of a good night!” ",
        "“But has something good happened recently? Your Excellency has been in a good mood these past few days.”",
        "A female zerg colleague passed by his workstation with coffee, smiling as he asked him.",
        "“Really?” Ye Er blinked. “I didn’t notice.”",
        "“It’s true. You’ve been looking at your terminal and smiling from time to time recently. You seem very happy.” ",
        "Terminal… he was basically looking at 015’s reports about the female zerg’s activities. He was actually smiling while reading?",
        "Realizing this, Ye Er coughed lightly, suppressed his smile, and, avoiding the important while focusing on the trivial, said, “The New Year holidays will start tomorrow. Of course I’m happy. It’s nothing special.”",
        "Seeing that he didn’t want to talk about it, the other zergs let out a long sigh and continued the topic of the New Year holidays.",
        "The New Year holidays here are usually a month long, similar to the short winter break during his student days. Many zergs will take this opportunity to travel to nearby star systems and take a good rest. ",
        "“I heard there will be a lot of activities on the street then. Your Excellency, do you want to go see them? Speaking of which, I have made plans with York to go to the Flamingo Paradise during those days…”",
        "At this time, there weren’t many zergs coming in to read or buy books. The director also let the staff take a break, although they were occasionally called upon. Ye Er quite liked this atmosphere.",
        "It seems that no matter where you are, corporate drones are the most miserable.",
        "Almost no creature can resist the joy of holidays, and talking about holiday plans with colleagues or friends before the holiday is a traditional custom that transcends dimensions and species. ",
        "“Alright.” Ye Er looked at the time, gathering his things. “Time to go home.”",
        "Amidst the same enthusiastic farewells every day, he opened his black umbrella and stepped back into the snow.",
        "",
        "But halfway through the journey, for some reason, he suddenly remembered their conversation moments ago. Ye Er lowered his eyes and buried his face in his scarf.",
        "Home… he hadn’t had a home for a long time. ",
        "He had lost it ten years ago, and three years ago, he lost his homeland as well.",
        "But suddenly, as he raised his eyes, he saw lights like clouds from the myriad of households, the crisscrossing star trails spiraling above the tall buildings and a vast, boundless starry sky. Unknowingly, this scene had somehow lessened the unfamiliar feeling that had made him apprehensive.",
        "The arrival of the new year washes away all the bad luck and filth of the past, leaving only a brand new beginning.",
        "Ye Er gradually stopped, lost in thought. ",
        "It wasn’t until this moment that he realized, belatedly, that he had died, that he had come to this place, and that he had returned to life.",
        "His lonely soul had crossed the vast and eternal universe, completely severing all ties to his homeland, embarking on a new journey of life.",
        "Fortunately, he was no longer alone.",
        "The terminal on his wrist chimed. It was a message from 015 reporting that dinner was ready. He withdrew his gaze and quickly walked into the corridor in front of him. ",
        "“I’m home.”"
    ],
    "previous": "Chapter 28.1",
    "next": "Chapter 29.1"
}