{
    "title": "Chapter 16",
    "content": [
        "Translator: Deyonna",
        "Ye Er suppressed the drumming in his chest with difficulty and patted Xi Ze’s arm. “Alright, let go. I’ll go get the inhibitor.” ",
        "“… Not doing it?”",
        "The female zerg was panting softly, with a dignified yet puzzled expression.\n",
        "Read more BL at chrysanthemumgarden (dot) com",
        "He tentatively leaned forward, carefully grasping the male zerg’s pant leg with his fingers. As he inquired, his lips were slightly parted, revealing a fragile and soft oral cavity.",
        "Ye Er’s breath hitched. ",
        "He watched blankly as the female zerg bit onto his waistband. He quickly jolted back to his senses before the situation escalated to R18 territory, his hand stopping the female zerg’s face. “Wait, wait, wait…”\n\n",
        "He knew Xi Ze had already decided to accept him, and he also expected a change and softening in his attitude.",
        "But what he didn’t expect was how surprisingly…straightforward it would be. It was an arrow that stabbed straight to the heart, one he couldn’t guard against.",
        "One could say that the female zerg looked quite delectable at this moment.\n\n ",
        "The tea’s bitter fragrance poured out like a winding underground river. He exuded the ripe, translucent sweetness of a hard-skinned peach, one that seemed ready to burst with juice under the slightest pressure.",
        "His damp hair was swept back, revealing a handsome, upright face that glistened like water, full and flushed with moisture. The sharp golden eyes, at this moment, looked warm, soft, and hazy…",
        "Even used a solemn military female voice as he frankly asked why he wouldn’t do it.\n\n",
        "This is too… too cute!! ",
        "Ye Er repeatedly took a deep breath, almost unable to resist stepping forward to take a bite and taste what the piece of candy, exuding a rich bitter tea flavor, really tasted like.",
        "But his gaze shifted to the wounds on the female zerg’s body. This body was an arrow at the end of its flight, unable to bear any more torment.",
        "“A patient whose wounds have not healed has no right to go into heat.”",
        "Ye Er patted his head. “Wait here, let 015 come in and give you the inhibitor.” ",
        "Pheromones are a reinforced version of glue, binding male and female zergs together. So the intertwining fusion of bitter tea fragrance and sweet caramel created an indescribable, scorching sensation in his chest, making it difficult to break free.",
        "Ye Er suspected that if he stayed in the bathroom a little longer, he wouldn’t be able to resist sticking to the female zerg and he wouldn’t be able to tear himself away.",
        "He held his breath and quickly fled the bathroom, shutting the door behind him, and trapping the bitter tea fragrance inside.",
        "After a leisurely bath, 015 was charged up and ready to carry out this difficult task. ",
        "Ye Er sat on the sofa, slowly collecting his thoughts.",
        "He didn’t lose control of his pheromones; at most, he was induced to release them just now, and after resting for a while, the heat quickly subsided.",
        "Please visit chrysanthemumgarden (dot) com",
        "After some thought, he awakened his terminal and called Hughes.",
        "“Can one control the release of their pheromones on their own?” ",
        "On the screen, Hughes looked somewhat surprised. “This is a good sign. It proves that his body is gradually recovering its functions, but normally it shouldn’t happen this quickly.”",
        "“The problem of hormonal imbalance in the female zerg’s body was still very serious. The situation of suddenly entering into heat will still happen, and it must be taken seriously…”",
        "Following that was a long string of professional vocabulary. Ye Er listened with only partial understanding, but he also grasped that as long as he reasonably appeased and injected inhibitors, there would be no major problems.",
        "After the consultation ended, he got up and went to the kitchen to pour a glass of water. He had only taken a few sips when he heard the sound of the bathroom door opening behind him. ",
        "Then came the sound of rolling wheels, and finally, the faint sound of the female zerg being placed on the sofa.",
        "Ye Er stared at the swaying water at the bottom of the glass. His rationality, which had been overturned by pheromones and rising water vapor, regained the upper hand, but he belatedly realized that the tips of his ears were still somewhat burning hot.",
        "“It’s all good now!”",
        "015 suddenly appeared behind the kitchen door, doubtfully looking at Ye Er’s trembling figure facing it. “What are you doing?” ",
        "“Jough…” Te Sr covered his mouth with his fist, coughing a few times to hide his embarrassment.",
        "“It’s nothing. I’ll go out and take a look. Tou continue making breakfast.”her",
        "After hesitating at the door for a while, he finally pushed it open and stepped into the living room.",
        "Xi Ze was sitting on the sofa, with one elbow on his knee supporting his forehead, and the other forearm casually resting on his thigh. He lifted his head and made eye contact with Ye Er upon hearing the sound. ",
        "He was only wearing a pair of loose pajamas. The redness of his upper body had not yet receded. He furrowed his brows, suppressing the dizziness and stabbing pain in his head, and lifted his eyes upon hearing the sound of the male zerg.",
        "“Male Lord.”",
        "He whispered softly, this time obviously much more skilled, with damp, tousled hair hanging down between his eyebrows, looking particularly obedient.",
        "“…En.” ",
        "Ye Er coughed unnaturally, sitting on the other side of the sofa. “Do you feel better? How is the effect of the inhibitor?”",
        "“Not bad…”",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze’s voice was hoarse from the burning sensation, his words coming out intermittently but exceptionally candid about the feelings in his body.",
        "“My glands are still burning hot, but the pheromones have stopped leaking… Increasing the concentration of the inhibitor by two percent should be just right.” ",
        "What a precise and rigorous answer. Ye Er clicked his tongue slightly.",
        "Out of the corner of his eye, he caught sight of the female zerg’s still bright red ears and the tightened fingers on his knee, suddenly realizing that he wasn’t the only one feeling uncomfortable.",
        "This realization instantly made Ye Er calm.",
        "He even somewhat mischievously turned excited, tilting his head towards Xi Ze and laughing lightly as he said, “Really? You still smell very fragrant right now.” ",
        "Feeling the light breath spraying on his neck, Xi Ze’s jawline suddenly tightened.",
        "He hesitated for a moment, his Adam’s apple bobbing, before whispering softly, “Male Lord… you also smell very sweet.”",
        "“Like melted caramel.”",
        "Thump. ",
        "Ye Er’s eyelashes fluttered.",
        "His heart thumped against his chest, speeding up the flow of blood.",
        "This is too cute.",
        "For the second time today, he thought to himself. ",
        "015 was right in the kitchen making breakfast.",
        "During the wait, Ye Er opened the terminal to browse the news.",
        "The official news of the Aitar Galaxy firmly occupied the homepage. He skimmed past a series of political game results, and turned to the surrounding war reports occupying a small square.",
        "[The Desa Military Campaign, which lasted for half a month, finally came to an end today. Compared to the Laimier Military Campaign, this war was smaller in scale and resulted in fewer casualties…] ",
        "[Under the leadership of newly appointed Imperial General Antoine Edreck, the military campaign achieved a successful victory. This victory is believed to be a step towards a more peaceful and brighter future for the Empire…]",
        "In just a few hundred words, the report provided only a simple introduction to the battle situation, with more emphasis placed on the hottest name in the past two years—",
        "",
        "“The Empire has appointed a new general, did you know?”",
        "Ye Er skimmed through the news report, casually saying, “He’s named Antoine Edreck.” ",
        "Antoine Edreck.",
        "Xi Ze’s pupils contracted, and his hand on the table suddenly tightened, causing the heavy solid wooden table to creak as he bumped into it.",
        "“What’s wrong?”",
        "Ye Er was startled and looked over in confusion. ",
        "In almost an instant, Xi Ze lowered his eyes, concealing the strange emotion. “…It’s nothing.”",
        "Ye Er looked at him strangely, then he suddenly remembered something, and asked, “In which military campaign were you injured?”",
        "Xi Ze said in a low voice, “… It’s the military campaign of Laimier.”",
        "Not the recent one, indeed, the timing doesn’t match up. ",
        "Ye Er pondered for a moment and casually asked, “Do you have a military rank?”",
        "“Major.”",
        "015 brought out breakfast, interrupting their conversation. Ye Er took a few bites of the fried eggs and remembered a question that had been thrown in the back of his mind.",
        "“You… Why did you voluntarily call me Male Lord?” ",
        "Ye Er carefully chose his words.",
        "Obviously, not long ago, Xi Ze was extremely resistant. Nothing major happened during this period, yet the female zerg voluntarily changed his attitude, which is very strange.",
        "“Although I am also very happy, there must be a reason, right?”",
        "Ye Er put down the chopsticks in his hand, looked at the female zerg, and smiled as he spoke. ",
        "He knew that he didn’t have any special charm, aside from the male zerg identity buff. While Xi Ze might have seen this as a negative amplification, he had managed to overcome this difficulty and achieve a harmonious state.",
        "“We have only been together for less than two days. I thought you wouldn’t trust me so easily, besides… I am a male zerg, aren’t I?”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Xi Ze looked a bit dazed, and the movements of his hands slowly stopped.",
        "To be precise, he had not thought about this question. ",
        "He used to be an excellent spy, very good at capturing subtle traces and making the right judgments.",
        "But sometimes, things just happen with such breathtaking speed that they appear before his eyes like lightning. In those moments of sudden enlightenment, he can either stay far away from it or reach out and grasp it regardless of everything.",
        "His current actions now don’t seem to be much different from what he used to detest.",
        "But the fact is not so. ",
        "He has already escaped from the desperate situation and was not to the point of fawning to live in degradation. He does what he does because he wants to.",
        "When the road ahead seems bleak, one should seize every opportunity and walk forward without fear. It may not be a dead end after all.",
        "After a moment of silence, Xi Ze lowered his eyes and said in a deep voice. “I’m following what my heart tells me.”",
        "Ye Er furrowed his brows in confusion. ",
        "But as he gazed at the calm profile of the female zerg for a while, he suddenly understood his thoughts.",
        "“You…”",
        "Ye Er’s pupils contracted slightly, his voice rarely sounding a bit harsh. The corner of his eye suddenly caught a glimpse of the inside of his own wrist.",
        "The sleeve slid up along the slender wrist bone, revealing a mess underneath. The pale skin was covered with thin, messy crisscrossing scars, marked by deep and shallow red scars. ",
        "His heart suddenly trembled, and he subconsciously pulled down his sleeve to cover it.",
        "The shadow lurking in the darkness suddenly extended its thorns, stabbing into his brows, and pouring corrosive venom into his heart, sending waves of numbness and stabbing pain.",
        "“Don’t pin your hopes on me, anyway.”",
        "He blurted out, his tone urgent and cold. ",
        "After a moment of silence, he realized, a bit belatedly, that his reaction seemed a bit excessive. Ye Er furrowed his brows and tried to make amends, speaking in a vicious tone.",
        "“Anyway, I’m just an unremarkable D-level male zerg. I can’t guarantee to meet your expectations.”",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Xi Ze covered his lips with the hand holding the chopsticks, cleared his throat softly, and said, “Don’t feel burdened; I never had many expectations for you to begin with.”",
        "“……?!” ",
        "Ye Er’s eyes widened. He swung his head to look at him, only to realize he was being teased when he noticed the pair of slightly curved, smiling eyes.",
        "Feeling depressed for a moment, he grudgingly stuffed the remaining fried egg into his mouth.",
        "He decided not to pay attention to this female zerg for the rest of the morning and then gulped down the milk that 015 cheerfully handed over.",
        "After breakfast, in order to help 015 save some electricity, Ye Er helped it clean up some of the dishes and utensils. ",
        "But the moment the faucet was turned on, along with the sound of water, there was also a cry of alarm from 015—",
        "“Your hand! How did you get injured?”",
        "015 wouldn’t make a fuss about his old scars so Ye Er lethargically lowered his head and only then did he discover the several long, thin wounds across the back of his left hand.",
        "The wounds were new, with the surface already inflamed because they were soaked in water. The edges appeared slightly white, giving it a somewhat frightening appearance. ",
        "The scene before him felt like déjà vu, and his field of vision suddenly trembled for a moment. A sharp ringing in his ears caught him off guard, making his pupils shrink abruptly.",
        "A sharp pain exploded in the back of his head, as if long nails were pulling on his hair, making it impossible for him to break free. He could only struggle as he was pressed into the sink in front of him—",
        "[So hungry? Running to the cafeteria to steal food to eat?! You’re a fine rat, your bitch of a mother raised! Eat, eat more! All of this discarded water is for you…!]",
        "[Plop—Bang! Gurgle… Ugh! Gurgle… Cough, cough, cough, cough, cough!] ",
        "A strong sense of suffocation spread to his mouth and nose, and dark spots clouded his vision. Ye Er stood frozen in place, watching blankly as the faucet in front of him sprayed water. A severe numbness enveloped most of his body.",
        "“What’s wrong? The water is about to overflow!”",
        "015’s voice suddenly cut through the chaotic buzzing, like a needle piercing through a vacuum, the air immediately rushed in, as if a new life was born.",
        "Ye Er slowly shook his head, reached out to turn off the faucet, and waited silently for his body’s reaction to pass. ",
        "The stinging pain on the back of his hand was relayed to his brain from the moment he noticed it. He knitted his brows and picked up the nearby towel to dry his hands.",
        "015 emitted a sharp buzzing sound. “Put down that cleaning rag. It’s very dirty! Don’t let it touch the wound!”",
        "Please visit chrysanthemumgarden (dot) com",
        "In the end, Ye Er was forcefully pushed out of the kitchen. Recently, he had become very proficient in disinfecting and bandaging to help Xi Ze change his dressing. 015 was not worried about this, but he was definitely not allowed to touch water.",
        "Ye Er hissed in pain as the disinfectant liquid touched his wound. He swung his hand in annoyance, accidentally knocking and spilling the disinfectant onto the ground with a ‘thud.’” ",
        "“Be a bit careful.”",
        "Sitting beside him, Xi Ze spoke up to remind him. Ye Er remembered his decision to ignore him in the morning, so he slid down the chair abruptly without saying a word.",
        "“Creak—”",
        "He bent down to pick up the bottle, but a hand reached out from the side and tapped the wound on the back of his hand. The next moment, his entire hand was held firmly in a palm. ",
        "The female zerg in front suddenly lowered his head.",
        "When the warm and soft touch landed on the back of his hand, Ye Er almost didn’t react.",
        "The next second, an even softer thing touched the wound, bringing a slight itch.",
        "“What…” are you doing? ",
        "Ye Er’s eyes widened, too shocked to immediately pull his hand away.",
        "But the pain where he was kissed became tame, the nameless anger extinguished by the sweet and copious rain. However, the slight itch on the wound intensified, burrowing deeper into the flesh.",
        "Xi Ze held his injured hand, his pure white eyelashes trembling slightly. His warm lips pressed lightly against the wound, like an ancient knight’s oath of fealty.",
        "After a while, Xi Ze raised his eyes and looked at the male zerg, his voice hoarse. “Male Lord, don’t be angry.” ",
        "The moment Ye Er’s eyes met those molten gold eyes, he suddenly thought that paying attention to him would be much better."
    ],
    "previous": "Chapter 15",
    "next": "Chapter 17"
}