{
    "title": "Chapter 10",
    "content": [
        "Translator: Deyonna",
        "“Click.” ",
        "It’s the sound of the room door opening.",
        "It was very light as if hesitating about something. Ye Er reached the living room but did not turn on the lights.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Upon detecting the movements, 015 automatically booted on, rolled quietly in front of the sofa, and whispered in inquiry if he wanted a cup of hot milk.",
        "Xi Ze almost didn’t sleep all night, capturing all the movements and sounds just now, but there was no response from the male zerg. After waiting for a while, the sound of the kitchen door being pulled open could be heard not far away. ",
        "The male zerg didn’t stay long, as if it was just a quick trip; the sound of footsteps had already reached beside the sofa.\n\n",
        "Immediately, a low rustling sound appeared, followed by the quick opening and closing of the door. The living room once again returned to silence.",
        "After a while, Xi Ze finally came to his senses, only to discover that his muscles were tense all over, and he was gripping the edge of the sofa so hard that his fingertips turned white.",
        "He belatedly realized that he was nervous—\n\n ",
        "Because of the few seconds the male zerg had stopped by the side of the sofa.",
        "Truly… absurd.",
        "He opened his eyes to a thick, impenetrable darkness, feeling the tearing pain all over his body, and let out a self-deprecating laugh.\n\n",
        "…… ",
        "Di di di di—",
        "The terminal placed close at hand kept ringing incessantly, forcing Ye Er to interrupt his work and pick it up.",
        "As soon as he opened the chat page, a flood of messages almost overwhelmed the screen, filling the chat box to the brim.",
        "[……] ",
        "[He had toast and milk for breakfast this morning, but the toast was a bit burned [crying face]]",
        "[The female zerg finished eating everything, but he doesn’t look full at all. Should I give him some more to eat?]",
        "[The sunshine at noon is very good, the clothes have been basked well in the sun. Should I also let the female zerg bask in the sun?]",
        "[I heard that not basking in the sun will lead to calcium deficiency, but this knowledge seems as outdated as I am [silly]] ",
        "[Just now, I ran out of power and shut down, but when I woke up, I found myself charging. How strange.]",
        "[It seems like the female zerg’s wound has reopened, causing him to break out in a cold sweat from pain. Did something happen that I’m not aware of?]",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "[The evening sunset is very pretty. What do you want for dinner?]",
        "[The ingredients for the female zerg’s nutritional meal are gone. If it’s convenient, buy some on the way back. Maybe you can also buy some desserts. I heard that eating sweets during recovery can improve mood…] ",
        "015 is eduipped with an emotional module and oftentimes likes to chatter like a child, sending messages to Te Sr about every trivial matter.",
        "Lis finger slid across the screen, one message after another, and he simply couldn’t scroll down to the end.",
        "Te Sr sighed lightly and smiled helplessly.",
        "…But this is not a solution. ",
        "The female zerg has been in this silent resistance state for a full two days and nights.",
        "When given a direct command, the female zerg will obediently comply, but that’s about it. If Ye Er wants him to express more of his own feelings or thoughts, he falls silent.",
        "He can’t really follow the method the female zerg said about tying him up at the head of the bed, can he?",
        "Even though he is no longer human, his heart is still a red heart, and he’s incapable of committing such inhumane acts of abuse. ",
        "This problem has puzzled him from the beginning of work until the end of work, and it remains unsolved.",
        "But after opening the door to his home, Ye Er’s contemplation on this issue came to an abrupt stop—",
        "The slightly bitter, blood-tinged taste was like a surging tide, pouncing and enclosing him from head to toe.",
        "“What’s… the situation?” ",
        "Ye Er’s pupils contracted slightly, his mind somewhat crashed, and almost instantly his body started to burn with an unusual heat.",
        "He subconsciously closed the door, preventing the smell from leaking out further.",
        "The female zerg on the sofa had already woken up, but the situation looked very bad.",
        "He was lying in a somewhat twisted position, with his flexible back bent to a wide extent, resembling a branch bent to the extreme, almost as if about to emit a mournful sound of breaking apart. ",
        "The wounds that were barely stopped from bleeding were torn open again, and the bubbling and gushing blood flowed down the sofa in a meandering stream, converging into a pool of blood.",
        "“Nng… haa, haa… uhh…”",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze forcefully pressed his head against the back of the sofa, with his hanging hair covering half of his face, only able to hear the extremely painful gasps.",
        "He continuously exuded a rich scent of bitter tea from his body, but within the extreme bitterness, there was a hint of sweet and cloying aftertaste. ",
        "He’s in heat.",
        "Even though he had never encountered this situation before, Ye Er immediately grasped the information.",
        "One of the main reasons for the formation of this society with a huge disparity in status is that female zergs go into estrus regularly every year. Without the comfort of the male zergs’ pheromones, their bodies will gradually deteriorate, and this process is irreversible, and enduring it is futile.",
        "“Huah…” ",
        "Xi Ze did not notice the male zerg approaching; his mind had already been completely burned into a mush by the high heat.",
        "A tearing pain rose from deep within the abdomen as if the fragile and soft organ had been impaled by steel bars. Even the slightest breath would affect it, and the spasms of pain were so intense it became unbearable and numb.",
        "He absentmindedly thought he was still in that dark and sunless interrogation room, stimulated by drugs to force into heat time and time again, yet receiving no comfort or relief.",
        "Enduring the high heat, he was drained of his strength and vitality, so sensitive that even the movement of air could cause him shock and suffocation. ",
        "In the interrogation room, numerous cameras were installed, vividly recording his various ugly and struggling painful expressions, being watched and circulated by unknown eyes that showed indifference, revulsion, and mockery.",
        "“Xi Ze? Xi Ze!… Go quickly… inhibitor…”",
        "A familiar voice overlapped into the gaps between reality and dreams.",
        "He shook his head slowly, trying hard to open his eyes wide, but all he could see in front of him was an unshakeable darkness. His rapid breathing and erratic heartbeat gradually merged, with dizziness overflowing to the top of his head. ",
        "“…How do you feel? Are you awake?”",
        "The scent of pheromones permeated almost pervasively; even if he covered his mouth and nose, it could still seep into his body, like pairs of little hands pushing Ye Er’s back, urging him to advance step by step.",
        "“Hey…”",
        "His Adam’s apple rolled as his voice became slightly hoarse, reaching out to wake up the female zerg who seemed frozen like a statue. ",
        "The body that was touched suddenly jolted and, under stress, slipped away intensely from the hand—",
        "The female zerg seemed to have been brutally stabbed by a knife, violently struggling and bouncing on the bed, with the bound wrists emitting a crisp sound.",
        "",
        "His fur bristled as he arched his back, his eyes bloodshot. He growled at Ye Er like a vicious wolf. “Get lost! Don’t touch me! Get lost…!”",
        "Ye Er quickly took a step back, subconsciously releasing his mental power to resist, but the effect was counterproductive and the female zerg struggled even more intensely. ",
        "“Haa, haa… Uhh, get lost…!”",
        "This is not right. He made a miscalculation.",
        "A hint of panic flashed in Ye Er’s eyes. He then focused his mind and felt the slight warmth of the gland at the back of his neck, as a dense surge of male zerg pheromones poured out—",
        "The tall body of the female zerg collapsed like a small mountain as if his spine had been directly removed, and all his muscles went limp. ",
        "The body, forced into estrus countless times, was severely depleted, greedily absorbing nourishment.",
        "The intense pain in the abdomen was strangely appeased, and the rioting sharp emotions in his mind were also completely washed away into a blank slate.",
        "Xi Ze gasped for air in disarray, with his golden eyes slightly closed, the scattered water-like light in them fragmented, as if it would condense and slip away in the next second.",
        "A slightly cool hand covered his forehead, and a worried voice rang out in his ear. “How do you feel now? The inhibitor should arrive soon, just endure a little longer…” ",
        "Xi Ze suddenly shivered, turned his head to avoid that hand, and propped himself up with his trembling one arm.",
        "The pain receded, yet from deep within the body rose another kind of more intense longing.",
        "As if to soothe the excruciating pain from before, a viscous heat surged and spread throughout the body, causing a bone-corroding, heart-wrenching ache and itchiness everywhere.",
        "It just so happened that the source of this pheromone was still dangling before his eyes without any awareness, approaching to inspect the situation of his wounds, and even reaching out to press and touch. ",
        "“Don’t move. It seems like the wound has split open. Let me see…”",
        "“…Don’t… don’t touch…”",
        "He curled up his body in embarrassment, not wanting the male zerg to see the changes in that place, but his body, just having absorbed pheromones, was extremely sensitive, and even a slight movement would arouse an unbearable itchiness.",
        "His resistance was futile, as the hands flipped him over, exposing his vulnerable belly like a fish waiting to be gutted. ",
        "The reaction of his lower body could no longer be concealed, exposed in another pair of eyes.",
        "“Haa… nng, don’t…!”",
        "",
        "015 has not rummaged through the inhibitor yet, and Xi Ze’s situation seems to have gotten as bad as it could be.",
        "The search results on star network apart from pheromone appeasement are all □□ words like stir-fry and no lube. There was no reasonable solution to deal with the situation. ",
        "Perhaps it was because he had been silent for too long, the female zerg on the bed had no idea what he was thinking, and his originally flushed face turned pale little by little.",
        "The harmoniously blended pheromones faithfully conveyed the female zerg’s mood, containing sharp pain and despair, making Ye Er purse his lips.",
        "He sighed quietly, took off the terminal on his wrist and placed it on the bedside table, then reached out his hand and pulled down the soaking wet pajama pants—",
        "“I’ll help you.” ",
        "Excessive pleasure and pain are intertwined and inseparable.",
        "Sweet and thick maple syrup flowed slowly, while sparkling and translucent sweat rolled down, soaking the sofa beneath, leaving the female zerg dangerously dehydrated and dried up.",
        "Ye Er hesitated several times about whether to stop his hand, but each time his hand tried to pull back, it would be instantly caught and held firm, like a baby clinging to its mother for nurturing.",
        "But he felt that the female zerg was more like a holy mother, opening up with soft and fragile internal organs, nurturing a belly full of pure white pearls with flesh and tears, in silent endurance. ",
        "Ye Er was like a cold and gentle executioner, who couldn’t hear the sufferings and choking pleas, as the cold blade mercilessly cut down without any mercy—",
        "But what splattered out was not warm blood.",
        "……",
        "“Where, where, where… Ah!” ",
        "015 rummaged around quickly, nearly burning its CPU. Finally, it located the inhibitor and hurriedly rushed to the living room. “Got the inhibitor!”",
        "But Ye Er, who had his back turned to it, pulled the quilt open, enveloping the two figures inside. Then he said in a low and hoarse voice, “You go back to my room first.”",
        "Why go back to the room? Don’t you need the inhibitor anymore?",
        "015’s CPU that had just cooled down short-circuited again. ",
        "Translator’s Corner: I really tried, I really tried to make this chapter cohesive wuwu",
        ""
    ],
    "previous": "Chapter 9",
    "next": "Chapter 11"
}