{
    "title": "Chapter 31.2",
    "content": [
        "Translator: Deyonna",
        "While comparing news from recent years, he furrowed his brow, appearing a bit regretful. ",
        "“I remember that the general who died had persistently promoted a new policy for the welfare of orphans during his lifetime, but after General Antoine took office, that policy ended up achieving nothing definite. It’s a real pity.”",
        "Xi Ze was stunned, and after a long while, he said softly, “Yes, it’s a real pity…”\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“If he had been more vigilant and had noticed the betrayal of the zergs around him earlier, or had persisted a little longer on the battlefield, staying undefeated, decades of hard work and foundation would not have crumbled so instantly.”",
        "Ye Er was immersed in thought and didn’t notice the self-deprecating tone in his voice. He simply said slowly. ",
        "“But where in the world is there such a thing as knowing beforehand? It’s already good enough to do the best you can in the present moment.”\n\n",
        "“That general was very capable. There aren’t many who can reach his level. Although I don’t understand political struggles very well, he has tirelessly promoted the implementation of truly beneficial policies and has accomplished a great deal of practical work…”",
        "He pulled open the tape-sealed package and praised unreservedly. “This is what I’ve understood from listening to the news recently. How should I put it? As the first general to be awarded the title of ‘Light of the Empire’, he is truly worthy of respect.”",
        "There was no sound from behind after a long time. Ye Er eventually turned his head to look back.\n\n ",
        "He saw the female zerg covering his face with one hand, and the tips of his ears that were exposed from his hair had turned red. Even his neck was dyed a crimson color.",
        "“What’s wrong with you?”",
        "He blinked and stopped the movements of his hands. “Are you okay?”\n\n",
        "“…I’m fine.” ",
        "Xi Ze rubbed his face mercilessly, took a deep breath to suppress his chaotic and agitated heart. After a long time, he finally lowered his hand, but he still didn’t dare to look up at the male zerg.",
        "It’s not like he hasn’t heard compliments before.",
        "During the years when his reputation was at its peak, almost all media outlets were singing his praises in various ways, touting his ‘great achievements’.",
        "There were long, flowery articles, calling him things like the “god of war” and the “descendant of the sun god”, praising him to the heavens— ",
        "He was so indifferent that he didn’t bat an eye at those praises, let alone show any emotional fluctuations.",
        "So why does his face get so hot hearing the male zerg in front of him say he’s amazing? It’s really baffling.",
        "“Your face is so red. Are you really fine?”",
        "A cool finger poked his cheek, catching Xi Ze off guard. He could only hurriedly lower his eyelashes, avoiding that probing gaze. ",
        "He said in a low, embarrassed voice, “…The heater must be on too high. It’s a bit hot.”",
        "015’s timely appearance saved the female zerg.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“The cake is here… it’s a strawberry cake this time!”",
        "Te Sr moved aside to make room on the coffee table and looked at the cake that was emitting a sweet fragrance. Le smiled and said, “I won’t disturb you anymore. Oet’s eat cake.” ",
        "Then he turned to 015 and said, “It’s done. Jontact the local courier service.”",
        "Xi Ze thought that the matter was successfully brushed off.",
        "But unexpectedly, before going to bed that night, the male zerg didn’t return to the bedroom after he finished washing up. Instead, he went back to sit on the sofa.",
        "The night was deep, and the male zerg exuded the fragrance of shower gel, which was very pleasant. ",
        "But the next sentence made Xi Ze’s expression stiffen—",
        "“What were you thinking about at noon? Why was your face so red?”",
        "Ye Er’s tone was leisurely, with a hint of soft, teasing laughter. It was not malicious, but rather intimate, causing Xi Ze’s heartbeat to somewhat quicken.",
        "“Do you think I’ll buy that heater excuse?” ",
        "“I’m sorry…”",
        "Xi Ze pursed his lips. Although he didn’t want to hide it from the male zerg, it was indeed a bit difficult to explain the reason. “It’s nothing important.”",
        "“Alright.” Seeing that he really didn’t want to say it, Ye Er didn’t force it. Yawning, he got up. “Good night, go to sleep early.”",
        "But a deep and low voice came from behind, stopping him in his tracks— ",
        "“…I just want to see what the Male Lord looks like as soon as possible.”",
        "Ye Er’s shoulders instantly relaxed a bit.",
        "He didn’t turn his head, he just let out a low chuckle, the fading sound dissolving into the night and making it seem exceptionally gentle.",
        "“Then go to sleep early, work hard to recover, and strive to see me soon.” ",
        "His vision recovered three days later.",
        "During this period, Hughes came to check on him and switched to a strong medicine that needed to be applied to a bandage wrapped around his eyes.",
        "",
        "The next day, after the pain completely subsided, he could remove it and observe if there were any obvious results.",
        "The bandage was unraveled circle by circle, and the halo of light gradually penetrated the gauze, shifting from vague and blurry to clear and bright, until only the last thin layer remained. ",
        "But the hands stopped.",
        "“Wait, I’m a little nervous. Let me take it slow at first.”",
        "The male zerg’s voice in front of him was a bit tense, and he took a few deep breaths, as if mentally preparing himself.",
        "“Didn’t the doctor say to observe for any results? Maybe it’s just not that fast yet. Don’t be nervous.” ",
        "Xi Ze comforted him. He should have been the most nervous one, but he seemed unusually calm.",
        "“That’s possible too.”",
        "Ye Er murmured, but looking at the female zerg’s face, that subtle nervousness was still impossible to get rid of.",
        "“I’m still nervous. How about you take it off yourself, see the result, and then call me…” ",
        "Before he could finish his words, his hand was grasped by another. With a gentle but firm pull, the last layer of gauze slowly unraveled.",
        "The soft gauze slithered to the ground soundlessly. The eyelashes hidden beneath trembled slightly and slowly opened, revealing a pair of golden eyes.",
        "The female zerg didn’t speak, but the moment their gazes met, Ye Er knew—",
        "He could already see. ",
        "They were so close that their breaths nearly blended. Ye Er could even see his own image, greatly reduced, in those golden eyes—impeccably distinct, down to the finest detail.",
        "He could feel himself being scrutinized, every inch of him examined carefully, yet this gaze didn’t cause any discomfort.",
        "As it didn’t involve condescending scrutiny or an overstepping desire, it was simply a pure gaze—one that contained perhaps even a sense of surprise and shock that the female zerg himself hadn’t realized.",
        "Xi Ze held his breath, unwilling to even blink, as his eyes meticulously traced his real and vivid brows, eyes, and contours. ",
        "The air was so still that Ye Er felt a little uneasy. He raised his eyebrows slightly and joked, “What’s the matter? Stunned?”",
        "The female zerg still didn’t speak, as if he was really stunned.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "Ye Er raised the tip of his eyebrow slightly. The joke he had made about being nervous was actually half-true and half-fake, but now he was genuinely a little nervous.",
        "Although he had roughly touched and explored his face with his fingers, it was still incomparable to seeing it with his own eyes. After all, everyone has a nose and eyes, so visualizing things with just your hands was not enough. ",
        "“Looking for so long… was it very different from what you expected?”",
        "Ye Er was a little confused and waved his hand in front of the female zerg, hinting at him to look into his eyes.",
        "Xi Ze finally snapped out of his daze, but he still couldn’t tear his gaze away from the male zerg. Then, he retorted in a low voice, “Not at all.”",
        "However, he racked his brains but still couldn’t find the right adjective, feeling that those pale words were unworthy of the male zerg in front of him. ",
        "Xi Ze opened and closed his mouth several times before finally swallowing his words and laughing softly.",
        "“Male Lord… looked just as I had imagined.”",
        "These words were actually lies. He hadn’t imagined the male zerg’s appearance beforehand.",
        "Before actually seeing him, it would be very rude to arbitrarily impose any emotional connotations. It would be even more arrogant and even shameless if he felt regret or disappointment simply because his imagination didn’t match reality. ",
        "But how could he describe that feeling?…He didn’t know what the male zerg looked like before, but now, everything he saw before him was just so right.",
        "Every soft line that outlines his contours, every delicate and vivid color—none too much or too little—perfectly captures the male zerg’s appearance before him with precision, seamlessly filling in the gaps in his memory.",
        "The male zerg didn’t need to conform to any particular standard or fit any specific adjective. He could be whatever he wanted to be. As long as the one standing before him was him…",
        "That was enough. ",
        "Ye Er quietly observed the female zerg’s expression, confirming there was no sign that his words were forced, and he breathed a sigh of relief. “If that’s the case, then that’s good.”",
        "He bent down to pick up the gauze that had fallen to the ground. “Are you feeling uncomfortable? You’re recovering faster than expected. I can have Hughes come and see you this afternoon…”",
        "Keenly sensing a hint of sadness hidden beneath the male zerg’s calm demeanor, Xi Ze paused, realizing his own reaction shouldn’t be like this.",
        "The male zerg couldn’t read minds and was unaware of his true thoughts. ",
        "He was so astounded, so deeply impressed by the male zerg’s face, that he couldn’t find the right words to describe him in his mind. To the male zerg, his face might look ordinary to the other, nothing special, and he might even think the other was disappointed in his appearance.",
        "Now was the best time to explain and prevent this misunderstanding from festering.",
        "",
        "Ye Er had just stood up when Xi Ze reached out and grasped his forearm. The female zerg’s other hand moved somewhat helplessly from the side of his waist to his back, half-embracing him as the other held him back.",
        "Xi Ze spoke softly, trying to hold him back. “Wait, just now, that’s not what I meant. I was trying to say…” ",
        "“What?”",
        "Ye Er looked at him with a hint of curiosity, ruffling the female zerg’s hair in a comforting manner. “I’m not in a hurry. Take your time.”",
        "The female zerg in front of him took a deep breath, his voice solemn and earnest as he carefully chose his words.",
        "“I’ll tell you the words I’ll use to describe you: beautiful and luminary—” ",
        "He uttered unfamiliar, hard-to-pronounce words, each with more than a few syllables. They rolled off the female zerg’s tongue in a deep, melodious voice, like a cello, resembling a short, romantic poem",
        "“What was that last word?”",
        "“It’s a word nobles often use when writing poetry. Maybe it’s a bit obscure…”",
        "Xi Ze’s eyes were filled with a gentle smile as he spelled out the definition of the word, one word at a time. ",
        "“It means crackling, bubbling, radiant, shining, brilliant, and overflowing.”",
        "Ye Er, who had been listening quietly to his explanation, laughed when he heard those words. “You think I’m scintillating?”",
        "Far more than that.",
        "Xi Ze gazed deeply into the male zerg’s eyes. "
    ],
    "previous": "Chapter 31.1",
    "next": "Chapter 32.1"
}