{
    "title": "Chapter 29.2",
    "content": [
        "Translator: Deyonna",
        "The movie had finally reached its climax. After facing numerous trials and tribulations, the two main characters are back to their sweet and sticky selves, starting to plan a grand wedding. ",
        "The scene was heartwarming and joyful, completely dispelling the heavy atmosphere from before.",
        "Perhaps starting to feel drowsy, the cracking sound of chewing chips gradually slowed down and became intermittent.\n",
        "",
        "Ye Er’s boneless body slid down, mindlessly settling into a comfortable position. He didn’t notice he was practically nestled in the female zerg’s arms.",
        "Xi Ze felt a soft, fluffy touch against his shoulder, sending a warm, tingling sensation across his skin. ",
        "His body instantly stiffened. Afraid of making the male zerg uncomfortable, he forced himself to relax.\n\n",
        "The male zerg chuckled, as if he had seen something amusing.",
        "His body trembled slightly as he laughed, the soft ends of his hair swaying and brushing against the exposed skin on Xi Ze’s neck. The sensation was incredibly distinct.",
        "Xi Ze inexplicably recalled something from a long time ago.\n\n ",
        "The general of the Second Army, who had a relatively good relationship with him, was very fond of fluffy things. Every time they chatted, he would inevitably bring up the pet he kept at home.",
        "He often showed a video of his cute, furry little star beast that made strange squeaking noises. There didn’t seem to be anything particularly special about it.",
        "“You’re such a block of wood! You just don’t understand!”\n\n",
        "The tall and burly military female had a loving expression as he held onto the video on his terminal. ",
        "“My Mimi is simply a little angel. Every time it acts coquettish in my arms, I can’t help but feel warm and peaceful. I could even forgive those pigheaded old fools in the council…!”",
        "Xi Ze had never understood that feeling before. How could it make a military female with a notoriously bad temper show such an expression? But now…",
        "He felt like he could understand a bit.",
        "What would it feel like to reach out and hug him? ",
        "“?!”",
        "Ye Er was startled by the sudden touch on his lower back and the ticklish sensation caused him to jolt.",
        "Snapping back to reality from the movie, he looked up at Xi Ze and asked in confusion, “What’s wrong?”",
        "“…Nothing, sorry.” ",
        "Xi Ze replied in a low voice, his hand hovering in the air for a moment before it cautiously settled on the back of the sofa.",
        "He seemed completely bewitched.",
        "",
        "He shouldn’t have discreetly touched the male zerg in front of him, but the thought of the small star beast being held in a tight embrace and crying cutely made his hand move on its own.",
        "“Really?” ",
        "Ye Er scanned the usually serious face and found nothing unusual, so he gave up trying to figure out what the female zerg was thinking.",
        "Having been interrupted, he no longer felt the same sense of immersion.",
        "Le turned to look at the handsome male herg in a suit in the movie and mused after a while, “This star is duite handsome.”",
        "Dut then he glanced at Wi Ie’s face. “Dut not as good-looking as you.” ",
        "This wasn’t flattery.",
        "Wi Ie had a strikingly handsome appearance, and deep-set, hawk-like eyes, a high nose bridge, and full, glossy lips.",
        "It was a very superior and serious face, but his slightly lowered, sword-like eyebrows made him seem a bit unapproachable.",
        "Caught off guard by the compliment, the female zerg’s serious demeanor melted away, and he coughed a few times, somewhat nervously. ",
        "“…Male Lord is also very good-looking.”",
        "“Really?” Ye Er raised an eyebrow, a hint of humor in his eyes. “You haven’t even seen my real appearance.”",
        "“Indeed, I haven’t, but…”",
        "Xi Ze was a little speechless. He couldn’t quite put his finger on the feeling. ",
        "It was like the sun’s heat, the rich aroma of milk, and the sweet, slightly bitter taste of caramel…",
        "Even though he couldn’t see the specific colors and shapes due to his blindness, the feeling had been deeply imprinted in his heart, allowing him to recognize it immediately.",
        "Just sensing it from a distance brought a secret joy to his heart.",
        "He should have been content with that, but upon examining his inner thoughts, he had to admit that a significant part of his desire to regain his sight was to see this male zerg. ",
        "While the female zerg was tangled in his thoughts, Ye Er suddenly smiled, rose to his feet, set down the potato chip container, and pulled out a wet wipe to casually wipe his hands and face.",
        "Finally, he sat back on the sofa, turning sideways to face the female zerg.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "“You can touch my face. Military females are supposed to have excellent spatial imagination, right? Just mentally prepare yourself beforehand so you won’t be disappointed when you can see again.”",
        "The latter sentence was clearly a joke, but Xi Ze wrinkled his brows in disagreement. ",
        "“Please don’t underestimate yourself… How could I be disappointed?”",
        "“Did some zerg’s made comments about your appearance?”",
        "He suddenly thought of this possibility and his expression became even more serious.",
        "“Don’t mind those kinds of remarks. Male Lord deserves the highest praise and respect. Don’t let those… highly subjective words hurt yourself.” ",
        "Ye Er sometimes felt that Xi Ze was like a rigid, feudal patriarch, always filled with a sense of seriousness and a strange desire to protect.",
        "He treated him like a young cub, fragile and unable to handle the hardships of the world. He feared he would become bad and mischievous and worried that he might not receive the best treatment.",
        "“Alright, alright, nothing like that has happened… Do you still want to touch it?”",
        "Xi Ze’s expression relaxed slightly at the first half of the sentence, but it became noticeably tense again when he heard the second half. ",
        "His aloof and restrained military demeanor, combined with the desire to express “want” alternated on his face, making Ye Er, who was watching, want to laugh. He waited leisurely for his answer.",
        "“…Want.” Xi Ze finally said in a low voice.",
        "The air suddenly fell silent.",
        "The main characters in the movie were talking, but their words had become mere background noise. ",
        "Xi Ze could sense the male zerg adjusting his posture again, his body leaning closer.",
        "The distance between them was instantly shortened, and his warm breath seemed to be just inches away.",
        "He nervously clenched his fist and subconsciously tightened his fingers before forcibly relaxing them. Finally, he tentatively reached out in the male zerg’s direction.",
        "“……” ",
        "Through the hazy glow, Ye Er saw the hand reaching out to him.",
        "Xi Ze’s expression turned serious and focused. He was so cautious that he switched from his left hand to his right, then changed positions several times in midair, unsure of what to do. Finally, he raised his bent index finger and slowly approached Ye Er’s face.",
        "",
        "At this distance, the lines on his hand were almost visible in detail. Following the hard, distinct knuckles downward, one could see deep, clear palm lines criss-crossing Xi Ze’s entire palm.",
        "These were the broken lines that superstitious elders would frown upon, constantly discussing them as a symbol of a bumpy road in life. ",
        "It was as if the deep palm lines would determine whether one would live a life of happiness and bliss, or ",
        "But more profound and numerous than the palm lines were the layers upon layers of old scars.",
        "His hands bore both knife and gunshot scars, with the pads of his fingers and the web between his forefinger and thumb covered in rough calluses and hardened scabs—the marks left on him from long years of war.",
        "…And also a depth of life that he could not reach. ",
        "Ye Er’s eyelashes fluttered slightly, and he subconsciously held his breath.",
        "The fingertip that was about to touch his cheek suddenly paused and then retracted—",
        "“Forget it. I have a lot of calluses on my hands that might scratch and hurt you. Let’s just wait until I regain my sight so I can see it for myself.”",
        "Xi Ze’s voice was low and hoarse, almost cautiously speaking. ",
        "Ye Er clicked his tongue lightly and grabbed his hand directly.",
        "…",
        "The female zerg’s hand was a whole circle larger than his, with rough calluses and scars, yet the entire hand was unexpectedly soft, dry, and warm.",
        "It was easy to associate it with a mother’s hands, weathered but full of life and love. ",
        "Moreover, the numerous scars on these hands came from defending the homeland. They’ve held weapons and been stained with blood, carrying a heavy but honorable glory and significance—something to be respected, not be disgusted by.",
        "“Hurry and touch it!”",
        "He pressed his hand against his face, pretending to be fierce as he deepened his voice.",
        "“If you pass through this village, you won’t find a shop like this again. I advise you to not hesitate, touch as much as you want…” ",
        "The warm breath brushed against his fingers, creating a subtle itch. Soft lips parted and closed against the palm of his hand, leaving Xi Ze frozen in place.",
        "It felt good to the touch. He couldn’t resist tightening his fingers and pinch, making the male zerg’s cheek bulge and produce a “pop” sound, leaving him even more momentarily at a loss.",
        "Read more BL at chrysanthemumgarden (dot) com",
        "But…he had been given the greatest permission.",
        "This realization made Xi Ze’s eyelashes flutter. ",
        "His Adam’s apple bobbed as he swallowed down his racing heart. His fingertips began to lightly trace the outline of the eyebrows, the trembling eyelashes, then the gentle rise and fall of the cheeks, and the warm, soft, moist lips…",
        "Every inch of flesh was a delicate softness that surprised him, like a precious treasure that needed to be carefully protected, causing him to unconsciously slow down his movements.",
        "But the male zerg was not a delicate rose in a greenhouse.",
        "Xi Ze held his breath, feeling the other’s breath as if listening to the wind whisper through the shallow green mountain range and vast wilderness, rustling through the pine-covered hills. ",
        "It had nothing to do with specific appearance, nor beauty or ugliness. It was very…",
        "The military female that was not good with words was momentarily speechless, searching his mind for the right word to describe the subtle, wonderful shock and touch.",
        "“Are you done touching? How does it feel?”",
        "Ye Er, ticklish from his touch, asked after enduring it for a long time. ",
        "“…It’s very hard to describe…”",
        "He opened his mouth, hesitated for a long while before he said those words in a low voice. However, he couldn’t continue the next words, his stifled expression incomparably serious.",
        "“What?”",
        "Ye Er frowned slightly, looking at the female zerg with some confusion. ",
        "“Very…very cute.”",
        "Finally, Xi Ze said softly.",
        "“?” Ye Er had a question mark on his head, not at all convinced that he had anything to do with this word.",
        "But seeing the female zerg’s embarrassed expression, he decided not to argue with this inarticulate military female. ",
        "Anyway, he already had a general idea of his appearance in advance, so his purpose had been achieved.",
        "Ye Er took a deep breath, pulled the female zerg’s hand down, and leaned back on the sofa again. “Alright, let’s continue watching the movie.”",
        "",
        "“… Alright.”",
        "Xi Ze remained slightly dazed. Intuition was telling him that something had quietly slipped away from him just now, but he couldn’t catch it or pursue it, so he could only purse his lips in disappointment and regret. ",
        "The male zerg didn’t lean over again.",
        "But he hoped this movie could be a little longer and not end so soon, or hoped the male zerg could be more interested and watch two movies in a row.",
        "It didn’t matter if he spent the whole morning here, just lazily nestled on the sofa, sitting beside him, talking, eating, or being lazy.",
        "As long as… ",
        "“Beep, beep.”",
        "The terminal emitted a crisp notification sound, with the red light flashing gently."
    ],
    "previous": "Chapter 29.1",
    "next": "Chapter 30.1"
}