{
    "title": "Chapter 13",
    "content": [
        "Translator: Deyonna",
        "This was the first time Ye Er let the female zerg into his room. ",
        "Xi Ze was wearing loose pajamas, sitting carefully on the small sofa beside the bed. His sitting posture was a bit unnatural, but still very upright, even a bit tense.",
        "He always maintains the restraint and dignity of a military female, without touching randomly or making any other overly curious movements.\n",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Just like a puppy picked up for the first time, it vigilantly squeezed into the corner of a small, dilapidated box, burying all four paws carefully underneath. The slightest touch would make its fur stand on end.",
        "Really… cute. ",
        "Ye Er took a glance and felt a slight itch between the fingers of his right hand, almost unable to resist the urge to rub.\n\n",
        "He passed by the small sofa, sat on the edge of the bed, looked at the female zerg’s restrained expression, and smiled. “Nervous?”",
        "“No.” Xi Ze pursed his lips, his voice very low.",
        "“What’s there to be afraid of? I heard it won’t hurt.” Ye Er recalled the contents of the thesis and the steps mentioned in the guiding tutorial.\n\n ",
        "…They’re still too abstract, so one must personally practice it to know what’s really needed to be done.",
        "Lost in thought about the guiding steps, he absentmindedly said, “We’re about to begin soon. Get yourself ready.”",
        "However, the next second—\n\n",
        "“You don’t need to take off your pants!” ",
        "The female zerg looked at him somewhat at a loss. While his top was still on, his loose pajama pants had been pulled down and loosely dropped around his ankles.",
        "And he wasn’t wearing anything underneath. Everything that could be seen and couldn’t be seen was all exposed.",
        "Ye Er’s face remained calm, but in fact, his mind went blank for a moment. He couldn’t help but glance at the corner of his eyes. “…Cough.”",
        "“Sorry, I thought it was…” ",
        "Xi Ze bent down in a flustered manner to pull up his pants, but in his anxious state, he ended up getting tripped up instead, and it took several attempts to put them on properly.",
        "That long tail was knocked askew by the rough handling, and Ye Er looked at it with a wince on behalf of Xi Ze. He reached out and pressed down on the female zerg’s shoulder, “Be gentle, what’s the rush?”",
        "Feeling the muscles tense under his hands, Ye Er looked up and noticed that the female zerg’s ears and neck were flushed red, with the color having the tendency to spread downward.",
        "Xi Ze straightened his clothes without saying a word, turning to the side as if concealing something, not letting the male zerg see the embarrassment and confusion on his face. ",
        "It’s quite a wonder. When he thought about using his body in exchange for resources, and when he wanted to fulfill his so-called duties as a female slave, he was remarkably calm, showing no struggle, as if accepting his fate.",
        "But every time Ye Er lightly touched, rubbed, or casually teased him with a few sentences, that cold and tense mask would crack open, revealing a hint of youthful and uncharted emotions.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Just like honey, that can only be enjoyed after removing its hard shell. Each taste quickly dissipates. One must continually pry and tap to keep it flowing and dripping into the palm of their hand. Its mellow and smooth texture invites playful indulgence whenever desired.",
        "Really cute. Ye Er smiled. ",
        "So embarrassing. Xi Ze pursed his lips.",
        "Under the tacit understanding between the two parties, this little episode was gently passed over.",
        "“Gon’t be nervous. Today, we will try a simple level of mental guidance.”",
        "Zental power is connected to the five senses of the body, like a detached consciousness or soul floating outside the body, freely shuttling back and forth, unbound by the constraints of time and space. ",
        "At the same time, it is eztremely delicate, able to magnify the sensory perceptions several times, and clearly propect the captured obpects and emotions onto the cerebral cortez.",
        "Ye Er slightly closed his eyes, the invisible fine thread of mental power entwined around his fingertips, swaying in the air like a swimming fish, carefully patrolling the outside world.",
        "At the same time, he keenly sensed a faint ripple discreetly spreading towards this direction not far away in the air.",
        "“……!” ",
        "When the two mental powers touched, Ye Er couldn’t help but stifle a groan.",
        "His own mental power is soft and gentle, like the murmuring of spring water, with strong inclusiveness and penetrability.",
        "The female zerg’s mental power, on the other hand, was the complete opposite, like the north wind in the extreme cold zone, cold and piercing, sharp and keen, just like a bone-chilling steel knife.",
        "It was as if he had hit an extremely hard barrier, a strong rejection emanated from within the wall, ruthlessly stabbing at the tip of his mental power. ",
        "At the same time, Ye Er noticed Xi Ze’s body suddenly stiffen, his hand gripping the edge of the sofa tightly, veins bulging from the force. His unfocused pupils tensely shrunk to pinpoints, yet he remained silent.",
        "“Relax, take deep breaths, don’t be nervous…”",
        "He unconsciously lowered his voice, as if appeasing a startled newborn young awakened by a nightmare.",
        "“You’re safe now, don’t be afraid…” ",
        "The flexible and soft mental power tentacles swayed from side to side, still unable to find a gap to penetrate. The tip tapped here and there, trying to open up a passage for entry and exit.",
        "Whether it was Ye Er’s words that had an effect or sensing that the mental power posed no threat, the female zerg eventually relaxed his guard slightly.",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "The tip of Ye Er’s mental power was so keen that it quickly sensed the slight crack and dove into it, penetrating deep into the fragile interior of the howling wind—",
        "“Ah! Don’t…” ",
        "Xi Ze trembled all over and let out a somewhat panicked cry.",
        "As if the intense sensation of flesh and blood merging was too overwhelming, all senses were enveloped by another mental power.",
        "It felt as if his mouth and nose were submerged in warm spring water, a surge of both suffocation and elation, deeply constricting his throat.",
        "“Relax, Xi Ze.” ",
        "Finally, taking the first step, Ye Er was determined to continue. He silently recited the steps from the guide and penetrated deeper inside, little by little.",
        "A strong sensation of engulfment emanated from the tip of his mental power, suggesting that it was likely in the process of guiding and purifying.",
        "But soon, the mental power belonging to the female zerg began to retreat, and if it hadn’t been for the timely restraint, it would have instantly withdrawn back into the mental landscape.",
        "“Endure it for a while. Don’t retreat.” ",
        "Ye Er frowned, his body leaning forward involuntarily, pressing down on Xi Ze’s shoulder to prevent him from retreating.",
        "He focused on silently reciting the guiding steps and the appropriate reactions for each stage, unaware that he was getting closer and closer, almost pressing the female zerg into the back of the sofa.",
        "“Haa…”",
        "It wasn’t until the guidance was nearing its end that Ye Er relaxed his tense spirit, no longer pressing aggressively, but rather forcefully and almost harshly scouring those mental impurities. ",
        "And at this moment, he only realized belatedly that the body under his palm was trembling faintly, like a steaming, soft pastry expanding in a hot oven.",
        "The female zerg kept his eyes tightly closed, his expression silently enduring. He curled up tensely between his arms and the back of the sofa, his taut body occasionally spasming and trembling, drenched in sweat.",
        "“Is it very painful?”",
        "According to the tutorial, it should be very comfortable. Ye Er, somewhat vexed, asked, “I wasn’t paying attention earlier. Did I hurt you?” ",
        "He quickly withdrew his mental power, abruptly separating the two strands of mental power that were almost glued together, stimulating a more intense sensation compared to before.",
        "“…Nng…ah!”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Xi Ze extended his forearm to cover his eyes, desperately suppressing the sounds in his throat. Deep tooth marks were left on his lower lip, and his exposed earlobes were bright red.",
        "It seems like… it’s not uncomfortable. ",
        "“Are you okay?”",
        "Ye Er reached out to pull him, but the female zerg did not rise along with his force as before. Instead, he shrunk back even tighter.",
        "“…Don’t touch me.”",
        "A hoarse voice, intimately close to a whisper, came, causing Ye Er to pause in his movements. ",
        "He was momentarily at a loss. However, he caught a glimpse out of the corner of his eye of the female zerg bending his knees, as if concealing something.",
        "“?!!”",
        "He finally realized now how big the said destructive power a mental guidance could bring to female zergs.",
        "For a military female who had been reserved and restrained for years, this deep soul-to-soul fusion was more shameful and intimate than baring his body. ",
        "Ye Er somewhat bashfully turned over and stooped down to pick up the terminal that had been swept to the ground. As his fingers accidentally slid down, he discovered that the tutorial post was unexpectedly not yet finished.",
        "After a blank space, at the very bottom, it was written: “Well done, now begin your wonderful nightlife (smile).”",
        "Ye Er: “……”",
        "He coughed softly and pulled the thin quilt from the side to cover the lower half of the female zerg’s body. ",
        "“I’ll go take a shower, and you… can you solve it yourself this time?”",
        "The female zerg nestled on the small sofa remained silent. Just as Ye Er thought he wouldn’t respond and was about to walk away, he heard a muffled “mn.”",
        "Xi Ze put down his hand, covering his face, revealing the moist and slightly ruddy corners of his eyes.",
        "The flush spread from his face to the base of his neck. He tightened his face, trying to keep a blank expression, but the effect was not very successful. ",
        "The overflowing and unfamiliar surging tide made Xi Ze’s entire body burn hot. Shedding his usual silence and cold stiffness, there was now a softness that was hard to put into words.",
        "Ye Er almost dared not make eye contact with him, so he cleared his throat a few times and quickly walked towards the bathroom.",
        "Please visit chrysanthemumgarden (dot) com",
        "The sound of rushing water quickly filled the bathroom.",
        "Xi Ze’s tense body finally relaxed slowly. He closed his eyes and leaned back on the sofa. His heavy breathing sounded exhausted yet satiated. ",
        "There were still remnants of warmth and bitterness in his body, like a sea that had not completely receded, gently patting and washing his soul with soft waves.",
        "The drought-stricken wasteland was like a land receiving a sweet rain, greedily and insatiably drinking its fill.",
        "True mental guidance brings a sense of relief that cannot be compared with any temporary substitute.",
        "This is why those foul-natured male zerg still receive fervent adoration. ",
        "But the “side effect” is also quite evident.",
        "Xi Ze clenched the blanket covering his upper thighs, the veins on the back of his hand bulging, intending to solve the untimely issue coldly.",
        "He silently counted some dry data, but the heat never cooled down, causing him to furrow his brow.",
        "Obviously, when he reacted before, as long as he paid it no heed, it would quickly go down. ",
        "“015, I forgot to bring my clothes. Can you help me get a set of pajamas from the wardrobe?”",
        "Inside the misty frosted glass, a blurry silhouette was gently swaying.",
        "The soft and slightly hoarse voice of the male zerg sounded somewhat distressed, describing the style of the clothes intermittently.",
        "His body grew even hotter. ",
        "Xi Ze half-closed his eyes, pushed back the sweaty hair on his forehead, and leaned back somewhat wearily.",
        "And in the unnoticed corners.",
        "The mental landscape, already in a mess and on the brink of collapse, quietly began to repair itself after absorbing the mental power of the male zerg, silently brewing a grandiose spring.",
        "It was not until after taking a shower that Xi Ze remembered the final step after the guidance, which was to give feedback to the male zerg. One should actively offer oneself instead of refusing. ",
        "Being rejected before doesn’t mean he doesn’t want it after the guidance. Different male zerg have different habits. Is it because he has been indulged too much by the male zerg that he has become complacent?",
        "“I’m sorry, I… I forgot just now.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Xi Ze’s expression changed slightly, the movement of wiping his hair slowing down as he carefully raised his eyes to look at Ye Er.",
        "“Do you want to do it again? I’ll give you a direct response without any mental guidance.” ",
        "His expression was a bit uneasy, as if he was upset by his subconscious resistance just now, unsure if the male zerg would be displeased by it.",
        "“No need. Let’s wait until next time and talk about it.”",
        "The male zerg’s voice was still soft and steady. Xi Ze thought it was waiting for the next mental guidance, but then the unfinished second half of the sentence came out, leaving him stunned.",
        "“Wait until you truly start to enjoy this process, then do it when you genuinely want to.” ",
        "Ye Er picked up the towel that had fallen on the ground and casually draped it on the nearby rack. Out of the corner of his eye, he noticed that the female zerg seemed stunned, so he comforted him casually.",
        "“Anyway, I’m not in a hurry, so don’t burden yourself too much.”",
        "“… Okay.”",
        "Xi Ze blinked rapidly, almost unnaturally, and he somewhat mechanically continued to wipe his hair, but in reality, he didn’t know what he was doing anymore. ",
        "His heart thumped all of a sudden, hitting his chest cavity, bringing a slightly painful suffocation."
    ],
    "previous": "Chapter 12",
    "next": "Chapter 14"
}