{
    "title": "Chapter 26.1",
    "content": [
        "Translator: Deyonna",
        "“Next.” ",
        "The female zerg doctor, wearing black-rimmed glasses, rubbed the space between his eyebrows. He picked up a file from the side, but before he could read the information about the sick zerg, the door was pushed open.",
        "Three zergs walked in. He glanced at them briefly and noticed that one of them was his good friend, who was quietly conversing with a remarkably beautiful sub-female.\n",
        "Please visit chrysanthemumgarden (dot) com",
        "There was also a tall military female on the side, but unfortunately, he was sitting in a wheelchair.",
        "He wore a black mask covering most of his face, his neck wrapped in thick bandages, but any discerning zerg could tell it was a female slave’s neck collar. ",
        "“Xie Zhao!”\n\n",
        "His good friend stepped forward, greeting him with great enthusiasm, his eyelids twitching rapidly as he winked at him. “Remember that private deal we talked about before?”",
        "Xie? Which Xie?",
        "Xi Ze’s heart skipped a beat. He pulled his mask up a little without betraying any emotion.\n\n ",
        "Xie Zhao, seated behind his desk, lifted his eyes with a lack of interest, meeting the gaze of the sub-female who was the object of his good friend’s fervent fawning. Despite being mentally prepared, his heart still skipped a beat.",
        "So…so good looking.",
        "However, as a professional doctor, he couldn’t possibly do such rude behavior as staring at other zerg.\n\n",
        "The sub-female before him was breathtakingly beautiful, yet his expression was utterly cold, like a little immortal zerg that breathed breeze and drank dew, untouched by the mundane world. The tips of his eyes, smooth and gently curved, were slightly upturned as if nothing before him was capable of pleasing him. ",
        "Xie Zhao coughed softly and looked at his good friend—",
        "This guy, ever since Xie Zhao had made it clear he wasn’t interested in male zergs, had been tirelessly introducing him to beautiful female zergs, acting like a pimp in the black market.",
        "He wondered where he snagged this sub-female from?",
        "“What are you thinking about? Get back to work.” ",
        "Elaine moved his lips mouthing something, then bent down and bowed, ushering the “sub-female” forward. “This is His Excellency Ye Er.”",
        "Male zerg. He silently mouthed the words and met Xie Zhao’s shocked gaze.",
        "Fuck… a male, male zerg?!",
        "This godforsaken place actually has a rare creature like a male herg?! ",
        "Wie Ihao’s mind went blank for a moment, and he stood up, flustered. Le opened his mouth to say something, but before he could, his good friend began chattering away with an introduction.",
        "“Tour Szcellency, this is the psychologist I mentioned to you before. Le graduated from the Smpire’s top university, has ezcellent professional skills, and a wealth of ezperience. Le came to work here a year ago…”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Ye Er raised his eyes with the words.",
        "The doctor before him had a head of raven-black curly hair, a fair and delicate face, and thick, heavy black-rimmed glasses perched on his nose. He looked bewildered and a bit silly. ",
        "He had looked over the files of this doctor named Xie Zhao beforehand and had formed his own initial assessment, but the actual personality was somewhat different from what he had imagined.",
        "He looked so innocent. Xie Zhao wondered if he could handle a military female like Xi Ze, who was extremely guarded, tight-lipped, and known for scaring zergs with his cold face.",
        "“Hello.”",
        "Ye Er’s eyes curved slightly, the coldness in them like residual snow shaken from a branch, swiftly vanishing. In its place was a light, clean smile. ",
        "So, he’s not an aloof little immortal zerg, but a gentle and polite little immortal zerg!",
        "He smiled at me! So cute, and he’s… he’s going to shake hands!!",
        "Xie Zhao felt a wave of dizziness, and for the first time, he felt a genuine sense of awe in the face of a male zerg.",
        "He carefully took the clean, delicate hand, feeling like he was touching a precious work of art. He said uneasily, “Hello, hello…” ",
        "“It’s not me who’s getting the treatment this time. It’s my female zerg.”",
        "Ye Er briefly explained Xi Ze’s situation and then faintly smiled as he said.",
        "“Doctor Xie’s resume is truly outstanding. I have complete faith in your abilities. I’ll be relying on Doctor Xie this time. If there’s anything you need to check, don’t hesitate to ask…”",
        "Xie Zhao could feel his face getting hot. After being called “Doctor Xie” left and right, he started to feel dizzy, overwhelmed by the male zerg’s polite flattery. ",
        "Heavens, are those male zergs who are picky, difficult, and threatening doctors really exist?!",
        "He came to this remote planet from the Imperial Main Star’s hospital, partly to do some real work and partly to heal his wounded heart from serving the noble male zergs.",
        "His professional skills were top-notch. He could tell at a glance that the male zerg in front of him, although not yet having undergone secondary differentiation, was definitely of a high level. If placed on the Main Star, he would be one of those who needed special care.",
        "He’d never heard which family could have such a beautiful little male zerg! ",
        "Xie Zhao felt like he had been given a Mi Hun soup, unable to stop himself from grinning foolishly. Following Ye Er’s words, he looked at the military female sitting in the wheelchair.",
        "Then, he was pierced to the core by a pair of icy golden eyes.",
        "",
        "He instantly sobered up.",
        "“Okay, then it’ll be three times a week. We’ll decide on the specific time later. Is that alright?” ",
        "After confirming the long-term plan and treatment schedule, Ye Er stopped talking.",
        "Before, when he was applying for funding for his research, he needed to engage in a lot of diplomatic maneuvering and polite flattery. He was quite adept at it, though not a master. Since coming here, however, such situations have become less frequent.",
        "He didn’t object to this kind of conduct. After all, it was just about getting what he wanted. The research materials and equipment were worth the effort, and this military female was no different.",
        "“Alright, alright, alright. Then, Your Excellency can leave now, or wait in the VIP lounge for a while. I’ll take your female zerg inside to chat for a bit?” ",
        "Xie Zhao picked up the documents on the table, his face still flushed, his enthusiasm radiating like a lively, huge dog. The curls on his forehead swayed with his movements.",
        "Ye Er pondered for a moment but chose not to leave immediately. “I’ll wait.”",
        "Then, Xie Zhao saw the male zerg smile at the military female. It wasn’t the distant, polite smile he had received, but a shallow, genuine one, tinged with a hint of helplessness.",
        "The military female, who had been secretly glaring intimidatingly at the zerg, meekly raised his head. The male zerg removed the mask from his face, revealing features that had been deliberately concealed. ",
        "The military female was handsome, with cold, deep-set eyes and slightly upturned, narrow eye corners. His golden eyes were sharp and piercing, radiating a sharp, unbidden light.",
        "Whenever he fixed his gaze on someone, it was like a predator locking onto its prey, sending chills down the spine on zergs. At least, Xie Zhao, who was being “watched”, felt a shiver run down his back, as if his throat had been squeezed, causing him to feel a slight sense of suffocation.",
        "But something about it seemed a little off…",
        "Xie Zhao secretly furrowed his brow, couldn’t help but glance over again, and realized that the military female’s gaze was somewhat unfocused, veiled in a thin layer of dimness, as if unable to see a thing. ",
        "He was already blind?!",
        "He clicked his tongue inwardly. Even blind, he was still so formidable. If he hadn’t been burdened with all these injuries, how dazzling this military female must have been.",
        "Furthermore, he had a nagging feeling that this military female had familiar features, as if he had seen him somewhere before.",
        "But then, on second thought, if he had seen such a distinctive military female, he couldn’t possibly have forgotten him completely. It must have been a mistake. ",
        "“Whether there’s a problem or not, since you’re here now. Let’s check your mental health as well. Didn’t you have nightmares before?”",
        "Knowing that Xi Ze wasn’t very willing, Ye Er didn’t bother arguing. He casually ruffled the female zerg’s incredibly soft hair, and then said, half command, half coaxing, “Alright, be good. I’ll come get you later.”",
        "",
        "Be good.",
        "The words spoken in a gentle tone by the male zerg had such a powerful impact that even Xie Zhao, who was standing far away, felt the fatal blow, let alone Xi Ze, who was being coaxed right to his face. ",
        "The female zerg lowered his gaze, somewhat flustered, swallowing the heartbeat that had leaped into his throat, and softly replied, “Okay.”",
        "Xie Zhao grinned subtly, wondering if his teeth had already fallen out from the sourness.",
        "But when Ye Er turned back, he instantly assumed a highly professional demeanor. “Hello, are you ready now? Can I take him in?”",
        "“Then I’ll be troubling Doctor Xie.” ",
        "The psychological therapy room is just behind this office, a few steps away.",
        "Just as the door was about to close, Ye Er saw the harmless expression on Xie Zhao’s face disappear, his eyes hardening slightly, giving off an air of reliability and professionalism.",
        "Click—the door behind them shut completely.",
        "Elaine, who had been acting as a backdrop since the beginning, stepped forward and said enthusiastically, “Your Excellency, are you going to the lounge or somewhere else? If you don’t mind, I can be of service…” ",
        "Ye Er retracted his gaze, then thought for a moment. “I’ll go to the lounge and wait.”",
        "This hospital wasn’t actually the one Ye Er was familiar with. It was a battlefield hospital situated in the gray zone at the planet’s edge, primarily treating injured female soldiers during wartime.",
        "The doctor and patient demographics here are quite complex, but the medical team is highly trained and professional, even with a dedicated psychologist specializing in post-traumatic stress disorder. No wonder Hughes strongly recommended this place.",
        "“Me and Hughes? We’re more like frenemies. Our relationship was simply like that. When he looked for me, I was surprised…” ",
        "Elaine is the acting director of this hospital. According to the grapevine, the real director was his female father, who was now opening a hospital on the Main Star. He left this clueless female child here as a mascot.",
        "Ye Er rolled the examination report in his hand into a tube and glanced at Elaine after hearing this.",
        "“Your Excellency, this way, please. You just came in through the back door. You haven’t seen the inside of this hospital yet. While we may not be as grand as the Central Hospital, our medical standards are reliable…”",
        "Ye Er followed him down the corridor but was caught off guard by the stretchers lining the hallway, filled with countless injured military females—some sitting and some lying down. ",
        "His pupils constricted, and he stopped in his tracks.",
        "Right, there was a small war in the surrounding star systems recently. Though they won, there must be many injured military females. This is where this hospital comes into play.",
        "",
        "Those military females with severed hands and legs turned into bloody gourds, only barely wrapped around the wounds to stop the bleeding, which was very tragic. And due to the wounds mutating into zerg pedipalps and shells, they appeared grotesque and terrifying.",
        "They packed the corridor tightly, but they were quiet and disciplined. When they saw zergs coming, they silently made way for a small path. ",
        "Ye Er withdrew his eyes, somewhat silent."
    ],
    "previous": "Chapter 25.2",
    "next": "Chapter 26.2"
}