{
    "title": "Chapter 32.2",
    "content": [
        "Translator: Deyonna",
        "A military female was lying on the hospital bed, his body mostly obscured by the drooping curtain. He was wearing a breathing mask, so his facial features were somewhat blurred. ",
        "If he remembered correctly, this military female was named Alvin.",
        "He seemed to be doing much better.\n",
        "",
        "Although he was still wrapped in bandages and unable to move, one could see that life was gradually returning to his body, like green moss thawing from ice, slowly creeping over the rough rocks.",
        "Ye Er met those eyes for a moment. ",
        "After a while, he lowered his eyes, pulled up his mask, and left the door of the ward.\n\n",
        "But as he was about to reach the hospital entrance, he heard a surprised voice from behind.",
        "“Your Excellency Ye Er? What a coincidence, you’re here too.”",
        "It was Hughes.\n\n ",
        "Hughes instructed the nurse in front of him and then walked over, pulling Ye Er into an empty ward next door.",
        "“I heard about your good deeds. It’s really quite surprising.”",
        "Hughes’ eyes were brimming with an admiring smile, different from the polite but distant attitude he had before. It carried a genuine sense of goodwill and familiarity.\n\n",
        "“You’re here for the pheromone extraction today?” ",
        "Ye Er had already taken off his mask, his eyes bent from smiling as he heard his words.",
        "“Yes, and I also briefly discussed a treatment plan for Xi Ze with them while I was at it.”",
        "“I see…”",
        "Speaking of this, the expression on Hughes’ face changed. He hesitated for a moment but decided to tell the male zerg the truth. ",
        "“I’ll tell you something important.”",
        "His expression was very grave, which surprised Ye Er. “What?”",
        "“You probably don’t know this yet, but your female zerg’s level is unexpectedly high—likely at an S level or even higher.”",
        "“Even in the Empire, S-level and double S-level female zergs are few and far between, and their identities cannot be simple. You…” ",
        "He paused, suddenly unsure of what to say and wondering why he had blurted it out without much thought.",
        "But seeing Ye Er care so much about that female zerg, he was worried that the male zerg would be deceived and end up not getting what he genuinely wanted in the end.",
        "",
        "Ye Er’s pupils constricted.",
        "He froze for a few seconds before slowly raising his head, still looking somewhat incredulous. ",
        "He opened his mouth, his voice almost inaudible, “What… did you say?”",
        "The moment their eyes met, despite him not wanting to acknowledge it, Lughes’ ezpression was incredibly serious, clearly not playing around.",
        "Wi Ie is… an S-level or even higher-level female herg?",
        "This thought circled in his blank mind, but it failed to stir any emotional ripples. ",
        "Uerhaps it was too shocking and unbelievable, making him feel completely unreal, and subconsciously resisted thinking deeper.",
        "But he actually already had a hunch and felt that this was to be expected.",
        "No wonder…",
        "No wonder. ",
        "Although he had thought Xi Ze’s identity might be not so simple, he had never imagined that his level would be so high.",
        "Then what was the identity that the female zerg had been hiding all along?",
        "Ye Er remained motionless for so long that Hughes began to feel anxious, cautiously waving his hand in front of him.",
        "“Your Excellency? Your Excellency, Ye Er?” ",
        "“This news may be a bit difficult to accept, but no matter what, he’s already your female slave. This fact will not change, so you don’t have to worry too much…”",
        "But Ye Er didn’t really take in the rest of what he said.",
        "He lowered his eyes somewhat hurriedly, only by putting on his mask could he barely conceal his expression. In the end, he quickly bid farewell to Hughes and left the hospital at a brisk pace.",
        "The remaining snow on the street was melting under the warm sun, slowly forming gurgling streams that were trampled muddy by passing boots. ",
        "After leaving the hospital, Ye Er didn’t take a taxi. Instead, he walked quickly for several blocks before finally coming to his senses and stopping.",
        "Fortunately, he was wearing a mask, and none of the female zergs passing by on the street recognized him, so he didn’t have to bother dealing with overly enthusiastic female zergs.",
        "Please visit chrysanthemumgarden (dot) com",
        "Besides, he was… completely out of the mood to think about anything else right now.",
        "There was a park right next to the hospital. ",
        "Dozens of fearless birds perched on the white stone-paved ground, occasionally flapping their wings and flying a short distance before stopping, their long, pointed beaks searching for small fruits buried under the snow.",
        "Ye Er found a bench and sat down. Blown by the cold wind, he finally came completely to his senses.",
        "The examination report was scanned, packaged, and sent to his terminal. He flipped through it several times.",
        "A moment later, without rhyme or reason, he clicked into the 015’s chat box. The last message was still from noon. ",
        "And further up, there was an endless stream of [Female Zerg’s Observation Reports] which reported Xi Ze’s whereabouts and condition regardless of its importance, interspersed with 015’s childish chatter.",
        "All the details were so vivid as if they were right in front of him.",
        "It had even become a subconscious habit for him to check from time to time to see if there were any new reports.",
        "And because 015 would shut down regularly from 12 to 2 o’clock for immersive charging, these messages will also stop flooding the screen for one hour. ",
        "After thinking for a while, Ye Er turned on the new electronic camera installed in the living room. He had bought and installed it after the first time the female zerg had lost control, but this was the first time he had turned it on.",
        "The camera quickly focused, directly facing the sofa, but there was no sign of the female zerg.",
        "Ye Er paused and looked at the charging port in the corner. 015 was indeed charging, but where had the female zerg gone?",
        "He manipulated the camera to rotate downward— ",
        "Finally, on the floor between the living room and the dining room, he saw the female zerg lying on the ground.",
        "The image continued to focus until it became clear, and Xi Ze’s face appeared in the center of the screen, with the wheelchair not far away.",
        "The floor was cold, and the wounds had only just scabbed over, and now he dared to exert himself like this? What couldn’t possibly wait until 015 was booted up?",
        "Ye Er’s brow contracted tightly. Remembering the last time the female zerg had willfully reconstructed his mental landscape—almost freezing himself to death—his mood soured. ",
        "But just as he was about to urgently wake up 015, he noticed that Xi Ze’s movements were a bit strange—",
        "As if afraid of dirtying the floor, the female zerg had taken off his jacket and padded it on the ground.",
        "",
        "And he was lying on top of it, doing some leg raises, stretches, and bends. After doing dozens of repetitions, he curled up on his side and began the next set of movements.",
        "His chest rose and fell, already covered in shiny beads of sweat, and his forehead was also full of fine sweat, sliding down his sharp jawline. ",
        "Those movements clearly put a lot of strain on him, even to the point of almost tearing the wound open again.",
        "But he remained quiet and patient, moving with a special rhythm and completing each action with perfection.",
        "After completing those movements, Xi Ze placed his fingers on his thighs, feeling and measuring the distance. His hard knuckles rhythmically pressed and rotated, as if massaging acupoints, and he repeated this cycle several times.",
        "Finally, after completing a series of exercises, the female zerg’s expression finally showed some fatigue. ",
        "The legs, having their muscles fully exercised, trembled slightly, but were visibly more relaxed and flexible.",
        "The effect was remarkable.",
        "Elaine’s casual comment quickly came to mind—",
        "“For military females, compared to lying down and resting, they prefer to stimulate self-healing effects to the maximum extent through special recovery exercises. Some can even achieve twice to three times the effectiveness… Truly worthy of being war machines.” ",
        "And just when Ye Er thought it was already over.",
        "Xi Ze propped himself up on his elbow to the floor, lifted his upper body, and reached behind to grab the armrest of the sofa, allowing himself to sit up completely.",
        "Then—",
        "He stood up. ",
        "Although he shook slightly, he surprisingly managed to stand up slowly despite his twisted and dislocated leg bones, with one kneecap even perforated.",
        "The military female’s arm muscles bulged with clear, full lines, and veins wound up from his forearm like branches branching out from the top of a tree, containing an immense and tenacious strength.",
        "It was obviously torturous, but he had a good grasp of the situation so the wound didn’t tear open and gradually ceased its subtle trembling.",
        "Xi Ze’s expression was serious as he straightened up slightly, moving his legs through some simple movements. Each movement was deliberate, followed by a pause, during which he would occasionally glance thoughtfully before changing his posture. ",
        "The whole process lasted about five minutes, and then he groped back to the wheelchair and sat on it, continuing to massage the acupoints and bones of his legs.",
        "Details that had previously been overlooked suddenly became magnified—",
        "",
        "Previously, 015 had found it strange that it had suddenly run out of power and woke up to find itself charging, while the wounds on Xi Ze’s legs had reopened and were bleeding.",
        "Despite consistently undergoing conservative treatment, and with his self-healing ability damaged, the female zerg leg recovery was progressing at an increasingly rapid pace with each hospital check-up. ",
        "Ye Er pulled up the surveillance footage from the previous period, and sure enough, whenever he was in the library at noon break and 015 was exactly charging, the female zerg was always doing this.",
        "Whether it was Xi Ze’s unyielding military routine and habits, or the things gleaned from their interactions—",
        "All of it was enough to show that the female zerg was not an undisciplined, decadent, go with the flow character.",
        "On the contrary, he was like a wounded beast lurking deep in the forest, biding his time, waiting for a chance to strike back. ",
        "There were crumbs everywhere, but he had never thought deeply about it, or rather, he didn’t want to think deeply.",
        "Ye Er stared at the scene on the terminal in a daze, unconsciously pursing his lips.",
        "“Don’t worry, that female zerg doesn’t seem like the type to repay kindness with vengeance. Your efforts will be repaid a hundred or a thousandfold.”",
        "This was what Hughes had said to comfort him, but he never cared for any repayment. ",
        "From the beginning, he didn’t plan to keep the female zerg. They shouldn’t have a deep intersection.",
        "Everything that happened later was merely due to an unexpected turn of events, and he had also told Xi Ze that he could decide for himself whether to leave when his injuries healed.",
        "Things were developing according to expectations and he should be happy.",
        "…But he wasn’t happy. ",
        "Because if the disparity in their identities were truly that great, then once Xi Ze left, it would be time to decisively sever this thin connection. After all, mountains are high and waters are far; from that moment on, they would never see each other again.",
        "Moreover, many things hadn’t happened back then. Before the deepening of their feelings began to interfere, “let him leave” was easy to say.",
        "On the screen, Xi Ze restored everything to its original state, moved back to the sofa from the wheelchair, and slowly calmed his breathing.",
        "He glanced towards the door a few times, unconsciously, as if waiting for it to open. ",
        "He really seemed to have taken on a somewhat domesticated appearance, obediently waiting for his owner to return home, even though Ye Er knew he was just a wild snow leopard temporarily staying in his house.",
        "A gust of cold wind swept by, startling the birds on the ground into flapping their wings.",
        "",
        "When the wind passed, some returned to the ground to continue resting, while others had already soared into the gray sky, flying high.",
        "A few feathers floated down from mid-air and landed on the terminal, covering the female zerg’s neck on the screen. ",
        "The metal ring encircled the neck, casting a dark, restraining light, like a chain that confined a beast, binding him firmly to the house.",
        "Xi Ze was still wearing the female slave neck collar that symbolized that he “exclusively belonged to him”.",
        "This thought was utterly despicable, yet it provided him with a sliver of oxygen in this suffocating situation.",
        "——————– ",
        "Ye Ye: Sesame glutinous rice ball, white, soft, and chewy, but black when cut open."
    ],
    "previous": "Chapter 32.1",
    "next": "Chapter 33.1"
}