{
    "title": "Chapter 15",
    "content": [
        "Translator: Deyonna",
        "A few hazy morning lights seeped through the cracks in the curtains, shining on the figure lying in bed. ",
        "Ye Er’s eyelashes trembled slightly as he opened his eyes with some difficulty.",
        "He stared blankly at the ceiling for a while before coming to his senses, his voice slightly raspy, “…What time is it?”\n",
        "",
        "The terminal placed by the pillow flickered with a blue light, speaking in a very clear pronunciation. “Good morning. It is exactly seven o’clock in the morning. Would you like to get up?”",
        "After staying up late, Ye Er’s temples throbbed slightly. He rubbed them with his fingertips to dispel the remaining drowsiness. ",
        "“Click—Bang!”\n\n",
        "There was a faint sound outside the door. His expression turned grave as he quickly threw off the covers and got out of bed.",
        "He strode to the living room and saw Xi Ze half-kneeling on the ground, his complexion pale, his forehead oozing with cold sweat. Standing next to him was 015 with a blank expression.",
        "“What’s happened?” Ye Er frowned, stepped forward, and held the arm of the female zerg, trying to pull him up from the ground.\n\n ",
        "“…It’s nothing. I was just about to take a shower, but 015 suddenly ran out of power and I fell.”",
        "Xi Ze held Ye Er’s forearm, and similar to his thin wrist, the feel of his arm was not hard and strong, contrasting starkly with the tough and thick-skinned female zergs, giving the impression that it could easily break.",
        "Thinking of the fragile skin of the male zerg that even a light touch would cause large bruises. He instinctively let go of his hand.\n\n",
        "However, the intense pain in his knee made his center of gravity unstable, causing the female zerg to fall heavily onto the sofa. ",
        "During the process, Ye Er was pulled off balance, losing his footing and taking a few stumbling steps forward in haste before eventually following and falling down—",
        "“Hold on…!”",
        "Watching as the back of the sofa came closer and closer, Ye Er somewhat closed his eyes in a panic.",
        "The next second, a strong arm embraced his waist, narrowly avoiding a collision before pulling him into an embrace. ",
        "“Be careful.”",
        "A deep voice resonated in his ear, vibrating in harmony with the chest pressed against his face, creating an echo-like sensation that brought a sudden heat to his ears.",
        "His face was buried in a soft and thick area, the abdominal muscles he had pressed for support in panic tensed and bulged. The sensation under his palm was distinct, but seemed to relax with great effort to allow his hand to press steadily.",
        "“…Are you okay?” ",
        "Xi Ze was also somewhat unaccustomed; the sensation in his embrace was soft and delicate. Compared to the thick skin and flesh of the female zergs, it appeared thin and frail, as delicate as if it could easily break.",
        "“I’m, I’m fine.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Ye Er’s blinking speed unnaturally increased as he realized that he was completely enveloped in the female zerg’s embrace, feeling his whole body engulfed in a scorching heat.",
        "He realized that the female zerg was protecting his head with one hand and his waist with the other, like a snow leopard biting onto a deer’s antler, effortlessly pulling it out of the sticky mud. ",
        "The military female zerg in front of him seemed to have long been accustomed to playing the role of a powerful protector. However, at the same time, he couldn’t even do the most basic things, like standing up—",
        "Down and out and badly damaged, he has no choice but to rely on the “weak” to breathe and survive.",
        "Ye Er felt a slight tremor, and for a moment, a strong crushing desire to confine the female zerg by his side, and hold it firmly in his hand arose, causing his Adam’s apple to roll.",
        "“Cough… Did I crush you?” ",
        "But he still had some sense of measure. He closed his eyes, regained his composure, propped himself up on the sofa, and stood up. When he fell just now, he collided head-on with the female zerg. He doesn’t know if it has aggravated the wound.",
        "“It’s okay, I’m not that fragile.” Xi Ze’s voice was hoarse from just waking up. He let go of his hand, following the male zerg’s movements.",
        "The female herg lay on the sofa in a somewhat awkward position, but his ezpression was calm and composed.",
        "Those unfocused eyes landed in mid-air, occasionally pausing on Te Sr’s face, still maintaining the good habit of making eye contact when speaking. ",
        "Since last night’s nightmare, something intangible seemed to have changed.",
        "Ye Er lowered his eyes and gazed at him.",
        "He did not find any difference in his calm expression but suddenly found that the female zerg in front of him was much fuller of flesh and blood than when he first picked him up.",
        "The withered and pale appearance, as if he could die at any moment, is no longer prominent, revealing his true temperament and character. ",
        "The female zerg’s thin face was thinner than before, but it did not lose its sharpness, and his originally stiff and straight back now had a slightly curved and relaxed arc.",
        "He was wrapped in a messy blanket and pajamas. Under the early morning sun, he appeared calm, gentle, and dignified, like a silent mountain range that had collapsed, nurturing new greenery in the passage of time.",
        "Ye Er only truly realized at this moment—",
        "He had rescued Xi Ze from that snowy night. ",
        "Away from death and violence, humiliation and pain, slowly and tenaciously growing new flesh and life.",
        "It was the life that went against the dead green plants that made his struggle and efforts bear visible fruit for the first time… and made the hopeless road ahead seem to have some foreseeable hope.",
        "",
        "A softer and gentler warm current permeated through his limbs and body, smoothing out the destructive desire that had just emerged.",
        "Ye Er curved his eyes slightly. “I’ll take you to bathe.” ",
        "The bathroom in this house is kept spotless, but it is still old and narrow, unable to accommodate a bathtub or shower stall. Normally, the female zerg bathes by sitting on a small stool.",
        "“In the future, when we change houses, we should choose a larger bathroom and install a bathtub for easier bathing.”",
        "Ye Er half-supported and half-carried Xi Ze with difficulty to sit down on the stool, and said without thinking deeply.",
        "But thinking about the meager savings left, he felt that this idea was simply a distant dream. ",
        "Shortly after, Ye Er was stunned. When did he start incorporating Xi Ze into his future plans as if it were natural?",
        "Another hand held his hand, bringing Ye Er back to his senses. The female zerg in his arms turned to him and softly said, “…This is already quite good.”",
        "The tips of Xi Ze’s ears hidden under his hair were slightly red, and his hands placed on his knees fidgeted, tightening and relaxing.",
        "Although he was usually seen naked when applying medicine, he was still not used to exposing his body in front of the male zerg. ",
        "It was unclear whether it was due to past experiences or the reserved and disciplined characteristics typical of military females.",
        "Ye Er took the showerhead down from the shelf but did not hand it to Xi Ze. He made a long “en” sound, inexplicably reluctant to leave. “Want me to help you wash?”",
        "Xi Ze glanced quickly at him, hesitated for a moment, and then nodded. “…Okay.”",
        "The hot water sprayed out with a “shaaa,” splashing onto the ground and wetting Ye Er’s pant legs. ",
        "He tested the temperature with his hand, turned off the water valve, and then bent down to lift up the piece of cloth.",
        "The female zerg folded the clothes neatly and placed them in the plastic basin on the side, just like the small wooden stool. Both were specially prepared for him.",
        "On the other side of the bathroom was not a wall, but milky white frosted glass. The hazy morning light, like milky white duck feathers, gently stuck to the female zerg’s body, blurring those beautiful lines.",
        "He appeared extremely gentle, retracting his thorns, luring the zerg who was confused by that honey color to come forward and gather all that softness full of life into the palm of his hand. ",
        "Ye Er felt a slight dryness in his mouth.",
        "“What’s wrong?”",
        "",
        "The male zerg behind him remained motionless for a long time. Xi Ze turned his face to the side and asked in confusion.",
        "Ye Er suddenly came to his senses and subconsciously turned on the hot water valve. Clear water droplets splashed out with a “shaaa,” drenching the female zerg’s head and face. ",
        "“Ah, I’m sorry, I’m sorry…!”",
        "He hastily moved the shower head away, only to see Xi Ze wiping the water off his face. He smiled good-naturedly. “It doesn’t matter… Let’s begin.”",
        "Not sure if it was an illusion, but the female zerg’s shoulders seemed to relax a bit, not as tense and stiff as before.",
        "Ye Er scuttled back and forth for a moment, feeling slightly tricky. ",
        "He thought solemnly for a moment and picked up the shampoo from the shelf. “Let’s start with washing your hair first?”",
        "The bathroom was filled slowly with hot steam as water cascaded, washing away white foam that gently fell to the floor, while the sweet scent of oranges permeated the air, nearly overwhelming the senses.",
        "Ye Er’s fingers weaved through the soft strands of hair, continuously squeezing out new foam.",
        "He is really well-behaved. ",
        "Ye Er absentmindedly thought to himself and squeezed the foam into two shaky pointed corners, resembling the ears of a cat standing upright.",
        "Then he lightly touched the bone protrusion at the back of the female zerg’s neck with his fingertips, rubbed it for a moment, and then moved downwards, pressing against the fragile, throbbing artery, causing the female zerg to shudder all over.",
        "“Mnn…”",
        "The voice of the female zerg was faint and hoarse, emitting a hint of soft and moist nasal sound. ",
        "Ye Er’s movements paused, feeling the voice penetrate his chest, lightly and skillfully scratching it, causing a faint numbing and tickling sensation in his heart.",
        "“What’s wrong? Did water get into your eyes?”",
        "He was about to stop the shower, but the female zerg shook his head. “It’s fine.”",
        "Ye Er didn’t notice that a hint of a strange fragrance had blended into the steam. ",
        "Like tea leaves that have been roasted until slightly scorched, unfurling their wrinkled edges in boiling water, gradually releasing a bitter top note. Initially subtle, but by the time he noticed, it had already filled the narrow space.",
        "Ye Er blinked slowly, feeling something wrong in the excessive heat. His expression changed slightly. “Is your estrus period coming again?”",
        "Please visit chrysanthemumgarden (dot) com",
        "A hidden gland under the skin at the back of the neck was faintly burning up, exuding a delicate sweet fragrance.",
        "Xi Ze had opened his eyes at some point and turned his face towards him. Ye Er covered the back of his neck and they looked at each other. ",
        "“Sorry…” Xi Ze’s voice was hoarse as he replied.",
        "Ye Er tried hard to ignore the restlessness in his body and put the shower head back on the shelf. “Wait, I’ll go get the inhibitor.”",
        "“Don’t…”",
        "A hand grabbed the hem of his sweater, and the next second, the scorching breath sprayed on the two depressions of his lower back through the thin fabric. The female zerg’s breathing became disordered as he whispered, “…Don’t go.” ",
        "The female zerg was unusually passionate, but after a few seconds of hesitation, Ye Er was tightly held around the waist by two arms. It felt like being entangled by a clingy humanoid big cat, leaving him completely unable to break free.",
        "“You calm down a bit.”",
        "Ye Er took a deep breath, struggling to turn around in the arms of the female zerg. “Xi Ze?”",
        "Xi Ze was not sitting on the stool but was directly half-kneeling on the ground. ",
        "Like a snow leopard tentatively stretching its body, if there was a tail on that beautiful tailbone, it would surely have already swayed from side to side or coiled around the male zerg’s calf.",
        "The droplets on the female zerg’s body rolled off, and the horizontal scar seemed to have been covered with a warm glaze, losing its terrifying feeling. It became more… fuller and softer, opening up gently towards him.",
        "He looked up at Ye Er, his brow slightly furrowed, but his cold, hard, and handsome contours softened a bit. His golden eyes slightly narrowed, and he let out a faint, somewhat dazed smile.",
        "Ye Er was at a loss as he was stunned. The female zerg… could actually show this kind of expression? ",
        "His heartbeat inexplicably sped up, his Adam’s apple bobbed, and he said stiffly, “Let go, I need to get the inhibitor.”",
        "“It’s not an estrus period disorder… it’s me who wants to do it.”",
        "Xi Ze’s voice was hoarse and muffled, his face and neck flushed red. The astringent and bitter tea fragrance became even richer, like a rushing torrent engulfing Ye Er.",
        "“What?” ",
        "Ye Er’s shock had not yet subsided. He placed his hand on the female zerg’s shoulder, clearly feeling the damp body tense up in his palm, but still tried hard to rub against it.",
        "“I want to be Your Excellency’s female zerg, a real one… Can Your Excellency treat me like how a female slave is treated? Is that possible?”",
        "Please support our translators at chrysanthemumgarden (dot) com",
        "Moist breath seeped into the hem of his shirt, and the rise and fall of the breath dyed his skin red, warming it up, bit by bit.",
        "Ye Er took a moment to react before understanding what he was saying. The words “won’t do” were already on the tip of his tongue, but before he could speak them out, he met the gaze of the female zerg. ",
        "“You’re not disgusted with me, right?”",
        "Xi Ze’s expression was relaxed and calm, no longer hinting at humiliation or desperation as before. All the anger and resentment were entirely and properly contained.",
        "He lifted his eyes. The gleam in them resembled a deep spring that shimmered with specks of gold, reflecting a small figure with a pair of glossy black eyes like lacquer.",
        "“Is it possible?” he asked softly. ",
        "In the blink of an eye, Ye Er understood the subtle difference.",
        "Previously, the female zerg was forced to propose a condition when pushed into a desperate situation. But now, for some unknown reason, he took the initiative to step back and willingly became his female slave, wanting to implement the connection between them.",
        "This wasn’t the scenario Ye Er wanted to see.",
        "Because this voluntary act is ultimately not truly voluntary, but a forced compromise without a better choice. Even his original resoluteness and coldness are sacrificed, and beneath the slightly bent spine lies deeper forbearance and pain. ",
        "Agree, disagree, agree, dis…",
        "Ye Er’s heart was wavering, feeling that no matter which option he chose, it would be wrong. However, he believed there was no better alternative than these two options.",
        "They cannot always be trapped in an awkward and indescribable atmosphere, erecting thick defenses against each other. But whether he can control this oppressive and deformed relationship, in the end, is still uncertain. He’s uncertain…",
        "He looked into the eyes of the female zerg through the water vapor that had not completely dissipated. ",
        "There lies buried a faint light that has never been extinguished, or perhaps it is the fervent ambition that may reignite from its ashes at an unknown time.",
        "“Okay.”",
        "In an instant, Ye Er decided to stop being overly cautious and indecisive. He took a deep breath and said, “Alright.”",
        "Upon hearing this, Xi Ze looked slightly stunned. Without much bargaining or fawning, the victory in the confrontation came so quickly that he was somewhat unable to react. ",
        "The address hanging on the tip of his tongue was downright unfamiliar. He moved his lips, tried silently several times, and finally spoke in a low, hoarse voice—",
        "“Male Lord.”",
        "Please visit chrysanthemumgarden (dot) com",
        "Ye Er stared blankly, his chest gently throbbing, yet it felt inexplicably tight and slightly painful.",
        "“…En.” ",
        "The author has something to say: It’s obviously is a huge, vigilant wild beast, but it started to try to lick its master’s fingers, hesitantly wagging its tail, clumsily using its nose to nuzzle and act cute, purring and whining.",
        "Ye Er: So I’m somewhat like a keeper (raising a wife) (heart pounding) (uncertain) (rubbing fingers)",
        "In total, there are about a hundred chapters, with the second half containing the content from the synopsis. However, this story does have that sticky-sweet tone, with the synopsis being the story itself, focusing on the mutual healing between the keeper and the dog. There’s no need for any other expectations, hahaha. (Amen)"
    ],
    "previous": "Chapter 14",
    "next": "Chapter 16"
}